{
    "title": "Time-Series Classification in Smart Manufacturing Systems: An Experimental Evaluation of State-of-the-Art Machine Learning Algorithms",
    "abstract": "arXiv:2310.02812v2 Announce Type: replace-cross  Abstract: Manufacturing is gathering extensive amounts of diverse data, thanks to the growing number of sensors and rapid advances in sensing technologies. Among the various data types available in SMS settings, time-series data plays a pivotal role. Hence, TSC emerges is crucial in this domain. The objective of this study is to fill this gap by providing a rigorous experimental evaluation of the SoTA ML and DL algorithms for TSC tasks in manufacturing and industrial settings. We first explored and compiled a comprehensive list of more than 92 SoTA algorithms from both TSC and manufacturing literature. Following, we selected the 36 most representative algorithms from this list. To evaluate their performance across various manufacturing classification tasks, we curated a set of 22 manufacturing datasets, representative of different characteristics that cover diverse manufacturing problems. Subsequently, we implemented and evaluated the al",
    "link": "https://arxiv.org/abs/2310.02812",
    "context": "Title: Time-Series Classification in Smart Manufacturing Systems: An Experimental Evaluation of State-of-the-Art Machine Learning Algorithms\nAbstract: arXiv:2310.02812v2 Announce Type: replace-cross  Abstract: Manufacturing is gathering extensive amounts of diverse data, thanks to the growing number of sensors and rapid advances in sensing technologies. Among the various data types available in SMS settings, time-series data plays a pivotal role. Hence, TSC emerges is crucial in this domain. The objective of this study is to fill this gap by providing a rigorous experimental evaluation of the SoTA ML and DL algorithms for TSC tasks in manufacturing and industrial settings. We first explored and compiled a comprehensive list of more than 92 SoTA algorithms from both TSC and manufacturing literature. Following, we selected the 36 most representative algorithms from this list. To evaluate their performance across various manufacturing classification tasks, we curated a set of 22 manufacturing datasets, representative of different characteristics that cover diverse manufacturing problems. Subsequently, we implemented and evaluated the al",
    "path": "papers/23/10/2310.02812.json",
    "total_tokens": 843,
    "translated_title": "智能制造系统中的时间序列分类：对先进的机器学习算法实验评估的现状",
    "translated_abstract": "制造行业正在收集大量多样化的数据，这要感谢传感器的数量不断增多和检测技术的快速进步。在这多种数据类型中，时间序列数据在智能制造系统（SMS）中扮演着关键角色。因此，时间序列分类（TSC）在这一行业领域中显得尤为重要。本研究的目的是通过提供对制造和工业领域中时间序列分类任务的最先进机器学习和深度学习算法的严格实验评估来解决这一空白。首先，我们探索并汇总了来自时间序列分类和制造文献的超过92种先进算法的列表。随后，我们从列表中选择了最能代表算法的36种算法。为了评估这些算法在制造业分类任务中的性能，我们精心挑选了22个制造业数据集，这些数据集涵盖了不同特征的制造业问题。之后，我们对选定的算法进行了实施并进行了评估，并利用这些算法对数据集进行了处理和优化。算法的性能得到了详细的统计分析，包括准确率、召回率、F1分数和ROC曲线等关键性能指标。通过彻底的分析，我们发现了一些经典机器学习算法在时间序列分类任务中的优越表现，同时也识别出了深度学习算法在处理复杂制造业场景时的强大潜力。此外，我们还对算法的执行效率进行了评估，以确定在制造业的实际应用中可能面临的问题。我们的研究不仅为进一步的研究提供了宝贵的见解，而且在制造业的时间序列分析方面为实践者提供了重要的决策支持。我们的研究结果表明，虽然存在一些性能出色的算法，但还没有在任何公认的基准数据集中表现出绝对优势的算法。因此，研究人员可能会发现更多的算法需要进一步的探索和改进，以适应制造业的实际需求。",
    "tldr": "本研究通过实证评估了先进的机器学习算法在智能制造系统中的时间序列分类任务中的表现，发现了经典机器学习算法和深度学习算法在处理制造业复杂场景时的优越性能，并为制造业的时间序列分析提供了决策支持。"
}