{
    "title": "Active Visual Localization for Multi-Agent Collaboration: A Data-Driven Approach",
    "abstract": "arXiv:2310.02650v3 Announce Type: replace  Abstract: Rather than having each newly deployed robot create its own map of its surroundings, the growing availability of SLAM-enabled devices provides the option of simply localizing in a map of another robot or device. In cases such as multi-robot or human-robot collaboration, localizing all agents in the same map is even necessary. However, localizing e.g. a ground robot in the map of a drone or head-mounted MR headset presents unique challenges due to viewpoint changes. This work investigates how active visual localization can be used to overcome such challenges of viewpoint changes. Specifically, we focus on the problem of selecting the optimal viewpoint at a given location. We compare existing approaches in the literature with additional proposed baselines and propose a novel data-driven approach. The result demonstrates the superior performance of the data-driven approach when compared to existing methods, both in controlled simulation",
    "link": "https://arxiv.org/abs/2310.02650",
    "context": "Title: Active Visual Localization for Multi-Agent Collaboration: A Data-Driven Approach\nAbstract: arXiv:2310.02650v3 Announce Type: replace  Abstract: Rather than having each newly deployed robot create its own map of its surroundings, the growing availability of SLAM-enabled devices provides the option of simply localizing in a map of another robot or device. In cases such as multi-robot or human-robot collaboration, localizing all agents in the same map is even necessary. However, localizing e.g. a ground robot in the map of a drone or head-mounted MR headset presents unique challenges due to viewpoint changes. This work investigates how active visual localization can be used to overcome such challenges of viewpoint changes. Specifically, we focus on the problem of selecting the optimal viewpoint at a given location. We compare existing approaches in the literature with additional proposed baselines and propose a novel data-driven approach. The result demonstrates the superior performance of the data-driven approach when compared to existing methods, both in controlled simulation",
    "path": "papers/23/10/2310.02650.json",
    "total_tokens": 352,
    "tldr": "该文章探讨了一种基于数据驱动的方法，用于在多Agent协作环境中解决由于视角变化造成的视觉定位问题。研究工作通过对比现有方法和提出的多个基线，提出了一种新颖的数据驱动策略，旨在选择在特定位置进行最佳的视角选择。实验结果表明，该策略在模拟环境中超越了现有方法的表现。"
}