{
    "title": "Reliable Academic Conference Question Answering: A Study Based on Large Language Model",
    "abstract": "arXiv:2310.13028v2 Announce Type: replace-cross  Abstract: As the development of academic conferences fosters global scholarly communication, researchers consistently need to obtain accurate and up-to-date information about academic conferences. Since the information is scattered, using an intelligent question-answering system to efficiently handle researchers' queries and ensure awareness of the latest advancements is necessary. Recently, Large Language Models (LLMs) have demonstrated impressive capabilities in question answering, and have been enhanced by retrieving external knowledge to deal with outdated knowledge. However, these methods fail to work due to the lack of the latest conference knowledge. To address this challenge, we develop the ConferenceQA dataset, consisting of seven diverse academic conferences. Specifically, for each conference, we first organize academic conference data in a tree-structured format through a semi-automated method. Then we annotate question-answer",
    "link": "https://arxiv.org/abs/2310.13028",
    "context": "Title: Reliable Academic Conference Question Answering: A Study Based on Large Language Model\nAbstract: arXiv:2310.13028v2 Announce Type: replace-cross  Abstract: As the development of academic conferences fosters global scholarly communication, researchers consistently need to obtain accurate and up-to-date information about academic conferences. Since the information is scattered, using an intelligent question-answering system to efficiently handle researchers' queries and ensure awareness of the latest advancements is necessary. Recently, Large Language Models (LLMs) have demonstrated impressive capabilities in question answering, and have been enhanced by retrieving external knowledge to deal with outdated knowledge. However, these methods fail to work due to the lack of the latest conference knowledge. To address this challenge, we develop the ConferenceQA dataset, consisting of seven diverse academic conferences. Specifically, for each conference, we first organize academic conference data in a tree-structured format through a semi-automated method. Then we annotate question-answer",
    "path": "papers/23/10/2310.13028.json",
    "total_tokens": 610,
    "translated_title": "可靠的学术会议问题解答：基于大型语言模型的研究",
    "translated_abstract": "arXiv:2310.13028v2 公告类型：替换-交叉  摘要：随着学术会议的发展，学者们不断需要获取关于学术会议的准确和及时的信息。由于信息分散，使用一个智能的问题解答系统来高效地处理研究者的查询，并确保对最新进展的意识是必要的。最近，大型语言模型（LLMs）在问题解答方面展示了出色的能力，并通过检索外部知识来处理过时知识得到了增强。然而，这些方法由于缺乏最新的会议信息而失败。为了解决这一挑战，我们开发了ConferenceQA数据集，它包括七个多样化的学术会议。具体来说，对于每个会议，我们首先通过半自动方法组织学术会议数据为树状格式。然后，我们对每个会议的问题-答案对进行标注。",
    "tldr": "该研究开发了一个ConferenceQA数据集，并通过组织学术会议数据和问题-答案对标注，提高了大型语言模型在学术问题解答方面的可靠性和时效性。",
    "en_tdlr": "This study developed the ConferenceQA dataset and improved the reliability and timeliness of large language models in academic question answering through organized conference data and question-answer pair annotation."
}