{
    "title": "Energy-Aware Routing Algorithm for Mobile Ground-to-Air Charging",
    "abstract": "arXiv:2310.07729v2 Announce Type: replace  Abstract: We investigate the problem of energy-constrained planning for a cooperative system of an Unmanned Ground Vehicles (UGV) and an Unmanned Aerial Vehicle (UAV). In scenarios where the UGV serves as a mobile base to ferry the UAV and as a charging station to recharge the UAV, we formulate a novel energy-constrained routing problem. To tackle this problem, we design an energy-aware routing algorithm, aiming to minimize the overall mission duration under the energy limitations of both vehicles. The algorithm first solves a Traveling Salesman Problem (TSP) to generate a guided tour. Then, it employs the Monte-Carlo Tree Search (MCTS) algorithm to refine the tour and generate paths for the two vehicles. We evaluate the performance of our algorithm through extensive simulations and a proof-of-concept experiment. The results show that our algorithm consistently achieves near-optimal mission time and maintains fast running time across a wide ra",
    "link": "https://arxiv.org/abs/2310.07729",
    "context": "Title: Energy-Aware Routing Algorithm for Mobile Ground-to-Air Charging\nAbstract: arXiv:2310.07729v2 Announce Type: replace  Abstract: We investigate the problem of energy-constrained planning for a cooperative system of an Unmanned Ground Vehicles (UGV) and an Unmanned Aerial Vehicle (UAV). In scenarios where the UGV serves as a mobile base to ferry the UAV and as a charging station to recharge the UAV, we formulate a novel energy-constrained routing problem. To tackle this problem, we design an energy-aware routing algorithm, aiming to minimize the overall mission duration under the energy limitations of both vehicles. The algorithm first solves a Traveling Salesman Problem (TSP) to generate a guided tour. Then, it employs the Monte-Carlo Tree Search (MCTS) algorithm to refine the tour and generate paths for the two vehicles. We evaluate the performance of our algorithm through extensive simulations and a proof-of-concept experiment. The results show that our algorithm consistently achieves near-optimal mission time and maintains fast running time across a wide ra",
    "path": "papers/23/10/2310.07729.json",
    "total_tokens": 392,
    "tldr": "该文章提出了一个针对移动地面至空中充电系统的能量感知路由算法，旨在在特定情况下优化无人机与无人地面车辆的合作规划。该算法通过解决旅行者销售商问题生成指导路径，并使用蒙特卡洛树搜索算法进一步优化路径，以减少整体任务执行时间并确保车辆能量限制下的运行。通过仿真和实际实验验证了算法的有效性，展示了其在多种场景下的优化能力。"
}