{
    "title": "Reliable Academic Conference Question Answering: A Study Based on Large Language Model",
    "abstract": "arXiv:2310.13028v2 Announce Type: replace-cross  Abstract: As the development of academic conferences fosters global scholarly communication, researchers consistently need to obtain accurate and up-to-date information about academic conferences. Since the information is scattered, using an intelligent question-answering system to efficiently handle researchers' queries and ensure awareness of the latest advancements is necessary. Recently, Large Language Models (LLMs) have demonstrated impressive capabilities in question answering, and have been enhanced by retrieving external knowledge to deal with outdated knowledge. However, these methods fail to work due to the lack of the latest conference knowledge. To address this challenge, we develop the ConferenceQA dataset, consisting of seven diverse academic conferences. Specifically, for each conference, we first organize academic conference data in a tree-structured format through a semi-automated method. Then we annotate question-answer",
    "link": "https://arxiv.org/abs/2310.13028",
    "context": "Title: Reliable Academic Conference Question Answering: A Study Based on Large Language Model\nAbstract: arXiv:2310.13028v2 Announce Type: replace-cross  Abstract: As the development of academic conferences fosters global scholarly communication, researchers consistently need to obtain accurate and up-to-date information about academic conferences. Since the information is scattered, using an intelligent question-answering system to efficiently handle researchers' queries and ensure awareness of the latest advancements is necessary. Recently, Large Language Models (LLMs) have demonstrated impressive capabilities in question answering, and have been enhanced by retrieving external knowledge to deal with outdated knowledge. However, these methods fail to work due to the lack of the latest conference knowledge. To address this challenge, we develop the ConferenceQA dataset, consisting of seven diverse academic conferences. Specifically, for each conference, we first organize academic conference data in a tree-structured format through a semi-automated method. Then we annotate question-answer",
    "path": "papers/23/10/2310.13028.json",
    "total_tokens": 336,
    "tldr": "该文章创造性地构建了一个名为ConferenceQA的专门用于学术会议问答的数据集，该数据集通过半自动化方法组织了七个不同学术会议的会议数据，并以树状结构形式呈现，同时标注了对应的问题和答案，旨在提高对学术会议信息的检索和问答系统的可靠性。"
}