{
    "title": "Semantic-guided modeling of spatial relation and object co-occurrence for indoor scene recognition",
    "abstract": "arXiv:2305.12661v4 Announce Type: replace  Abstract: Exploring the semantic context in scene images is essential for indoor scene recognition. However, due to the diverse intra-class spatial layouts and the coexisting inter-class objects, modeling contextual relationships to adapt various image characteristics is a great challenge. Existing contextual modeling methods for scene recognition exhibit two limitations: 1) They typically model only one type of spatial relationship (order or metric) among objects within scenes, with limited exploration of diverse spatial layouts. 2) They often overlook the differences in coexisting objects across different scenes, suppressing scene recognition performance. To overcome these limitations, we propose SpaCoNet, which simultaneously models Spatial relation and Co-occurrence of objects guided by semantic segmentation. Firstly, the Semantic Spatial Relation Module (SSRM) is constructed to model scene spatial features. With the help of semantic segme",
    "link": "https://arxiv.org/abs/2305.12661",
    "context": "Title: Semantic-guided modeling of spatial relation and object co-occurrence for indoor scene recognition\nAbstract: arXiv:2305.12661v4 Announce Type: replace  Abstract: Exploring the semantic context in scene images is essential for indoor scene recognition. However, due to the diverse intra-class spatial layouts and the coexisting inter-class objects, modeling contextual relationships to adapt various image characteristics is a great challenge. Existing contextual modeling methods for scene recognition exhibit two limitations: 1) They typically model only one type of spatial relationship (order or metric) among objects within scenes, with limited exploration of diverse spatial layouts. 2) They often overlook the differences in coexisting objects across different scenes, suppressing scene recognition performance. To overcome these limitations, we propose SpaCoNet, which simultaneously models Spatial relation and Co-occurrence of objects guided by semantic segmentation. Firstly, the Semantic Spatial Relation Module (SSRM) is constructed to model scene spatial features. With the help of semantic segme",
    "path": "papers/23/05/2305.12661.json",
    "total_tokens": 366,
    "tldr": "该文章提出了SpaCoNet，一个通过语义分割引导的空间关系和对象共现同时建模的模型，旨在解决室内场景识别中的多样性和共存对象的挑战，通过构建Semantic Spatial Relation Module（SSRM）来建模场景的空间特征，并利用语义分割帮助识别和处理场景中的空间布局和共存对象，从而提高场景识别的准确性。"
}