{
    "title": "Multi-Stage Monte Carlo Tree Search for Non-Monotone Object Rearrangement Planning in Narrow Confined Environments",
    "abstract": "arXiv:2305.17175v3 Announce Type: replace  Abstract: Non-monotone object rearrangement planning in confined spaces such as cabinets and shelves is a widely occurring but challenging problem in robotics. Both the robot motion and the available regions for object relocation are highly constrained because of the limited space. This work proposes a Multi-Stage Monte Carlo Tree Search (MS-MCTS) method to solve non-monotone object rearrangement planning problems in confined spaces. Our approach decouples the complex problem into simpler subproblems using an object stage topology. A subgoal-focused tree expansion algorithm that jointly considers the high-level planning and the low-level robot motion is designed to reduce the search space and better guide the search process. By fitting the task into the MCTS paradigm, our method produces optimistic solutions by balancing exploration and exploitation. The experiments demonstrate that our method outperforms the existing methods in terms of the p",
    "link": "https://arxiv.org/abs/2305.17175",
    "context": "Title: Multi-Stage Monte Carlo Tree Search for Non-Monotone Object Rearrangement Planning in Narrow Confined Environments\nAbstract: arXiv:2305.17175v3 Announce Type: replace  Abstract: Non-monotone object rearrangement planning in confined spaces such as cabinets and shelves is a widely occurring but challenging problem in robotics. Both the robot motion and the available regions for object relocation are highly constrained because of the limited space. This work proposes a Multi-Stage Monte Carlo Tree Search (MS-MCTS) method to solve non-monotone object rearrangement planning problems in confined spaces. Our approach decouples the complex problem into simpler subproblems using an object stage topology. A subgoal-focused tree expansion algorithm that jointly considers the high-level planning and the low-level robot motion is designed to reduce the search space and better guide the search process. By fitting the task into the MCTS paradigm, our method produces optimistic solutions by balancing exploration and exploitation. The experiments demonstrate that our method outperforms the existing methods in terms of the p",
    "path": "papers/23/05/2305.17175.json",
    "total_tokens": 402,
    "tldr": "该文章提出了一种多阶段蒙特卡洛树搜索（MS-MCTS）方法，解决了在狭窄受限环境中非单调物体重新排列规划的问题。该方法通过将复杂问题分解为子问题并设计了一种结合高阶规划和低阶机器人运动的树扩展算法，有效地减少了搜索空间并指导了搜索过程。通过在MCTS框架内实现任务优化，该方案平衡了探索和利用之间的关系，从而生成更具乐观性的解决方案。实验表明，该方案在多个标准上均优于现有方法。"
}