<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#25191;&#34892;&#29615;&#22659;&#30417;&#27979;&#20219;&#21153;&#30340;&#20154;&#31867;-&#32676;&#20307;&#31995;&#32479;&#20013;&#38598;&#20013;&#24335;&#19982;&#20998;&#25955;&#24335;&#25511;&#21046;&#31574;&#30053;&#30340;&#26435;&#34913;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#28151;&#21512;&#31995;&#32479;&#65292;&#20197;&#25552;&#39640;&#25928;&#29575;&#24182;&#20943;&#36731;&#20154;&#31867;&#25805;&#20316;&#21592;&#30340;&#25968;&#25454;&#20256;&#36755;&#36127;&#25285;&#12290;</title><link>https://arxiv.org/abs/2408.02605</link><description>&lt;p&gt;
&#20154;&#31867;-&#32676;&#20307;&#31995;&#32479;&#21160;&#24577;&#25511;&#21046;&#32467;&#26500;&#30340;&#26435;&#34913;
&lt;/p&gt;
&lt;p&gt;
Trade-offs of Dynamic Control Structure in Human-swarm Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#25191;&#34892;&#29615;&#22659;&#30417;&#27979;&#20219;&#21153;&#30340;&#20154;&#31867;-&#32676;&#20307;&#31995;&#32479;&#20013;&#38598;&#20013;&#24335;&#19982;&#20998;&#25955;&#24335;&#25511;&#21046;&#31574;&#30053;&#30340;&#26435;&#34913;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#28151;&#21512;&#31995;&#32479;&#65292;&#20197;&#25552;&#39640;&#25928;&#29575;&#24182;&#20943;&#36731;&#20154;&#31867;&#25805;&#20316;&#21592;&#30340;&#25968;&#25454;&#20256;&#36755;&#36127;&#25285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02605v1 &#20844;&#21578;&#31867;&#22411;: &#26032; Abstract: &#32676;&#20307;&#26426;&#22120;&#20154;&#30740;&#31350;&#30340;&#26159;&#20855;&#26377;&#22797;&#26434;&#34892;&#20026;&#30340;&#31616;&#21333;&#26426;&#22120;&#20154;&#65292;&#36825;&#20123;&#34892;&#20026;&#30340;&#23454;&#29616;&#20165;&#20381;&#36182;&#20110;&#19982;&#20854;&#23427;&#26426;&#22120;&#20154;&#21644;&#29615;&#22659;&#30340;&#23616;&#37096;&#20114;&#21160;&#12290;&#32676;&#20307;&#26426;&#22120;&#20154;&#30340;&#25511;&#21046;&#20027;&#35201;&#37319;&#29992;&#20998;&#24067;&#24335;&#31574;&#30053;&#65292;&#32780;&#20854;&#20182;&#26426;&#22120;&#20154;&#39046;&#22495;&#30340;&#25511;&#21046;&#21017;&#24191;&#27867;&#37319;&#29992;&#38598;&#20013;&#24335;&#31574;&#30053;&#12290;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#38598;&#20013;&#24335;&#21644;&#20998;&#25955;&#24335;&#25511;&#21046;&#31574;&#30053;&#37117;&#21508;&#33258;&#24102;&#26469;&#20102;&#19968;&#23450;&#25968;&#37327;&#30340;&#22909;&#22788;&#21644;&#24330;&#31471;&#12290;&#23613;&#31649;&#20998;&#25955;&#24335;&#31995;&#32479;&#22312;&#25193;&#23637;&#24615;&#21644;&#25239;&#25925;&#38556;&#26041;&#38754;&#26356;&#20855;&#20248;&#21183;&#65292;&#20294;&#23427;&#20204;&#30456;&#23545;&#20110;&#38598;&#20013;&#24335;&#31995;&#32479;&#32780;&#35328;&#25928;&#29575;&#36739;&#20302;&#65292;&#24182;&#19988;&#20250;&#23548;&#33268;&#23545;&#20154;&#31867;&#25805;&#20316;&#21592;&#30340;&#25968;&#25454;&#20256;&#36755;&#37327;&#36807;&#22810;&#65292;&#20174;&#32780;&#24341;&#36215;&#35748;&#30693;&#36807;&#36733;&#12290;&#25105;&#20204;&#23545;&#25191;&#34892;&#29615;&#22659;&#30417;&#27979;&#20219;&#21153;&#30340;&#22522;&#20110;&#20154;&#31867;-&#32676;&#20307;&#31995;&#32479;&#30340;&#19981;&#21516;&#25511;&#21046;&#26041;&#27861;&#36827;&#34892;&#20102;&#26435;&#34913;&#20998;&#26512;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#28151;&#21512;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#20998;&#23618;&#31995;&#32479;&#21644;&#20998;&#25955;&#24335;&#31995;&#32479;&#30340;&#20803;&#32032;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#22312;&#20154;&#31867;-&#32676;&#20307;&#31995;&#32479;&#20013;&#37319;&#29992;&#28789;&#27963;&#30340;&#28151;&#21512;&#31995;&#32479;&#21487;&#20197;&#36229;&#36234;&#38598;&#20013;&#24335;&#31995;&#32479;&#30340;&#24615;&#33021;&#65288;&#22312;&#25105;&#20204;&#36827;&#34892;&#30340;&#29615;&#22659;&#30417;&#27979;&#20219;&#21153;&#20013;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02605v1 Announce Type: new  Abstract: Swarm robotics is a study of simple robots that exhibit complex behaviour only by interacting locally with other robots and their environment. The control in swarm robotics is mainly distributed whereas centralised control is widely used in other fields of robotics. Centralised and decentralised control strategies both pose a unique set of benefits and drawbacks for the control of multi-robot systems. While decentralised systems are more scalable and resilient, they are less efficient compared to the centralised systems and they lead to excessive data transmissions to the human operators causing cognitive overload. We examine the trade-offs of each of these approaches in a human-swarm system to perform an environmental monitoring task and propose a flexible hybrid approach, which combines elements of hierarchical and decentralised systems. We find that a flexible hybrid system can outperform a centralised system (in our environmental mon
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21151;&#33021;&#24615;&#32908;&#32905;&#32593;&#32476;&#30340;&#25163;&#21183;&#24863;&#30693;&#27169;&#22411;&#65292;&#36890;&#36807;&#39640;&#25928;&#22320;&#25552;&#21462;&#26102;&#39057;&#29305;&#24449;&#21644;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#25216;&#26415;&#65292;&#26174;&#33879;&#25552;&#21319;&#20102;&#25163;&#21183;&#35782;&#21035;&#30340;&#20998;&#31867;&#24615;&#33021;&#65292;&#30456;&#23545;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#20855;&#26377;&#26356;&#20248;&#36234;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2408.02547</link><description>&lt;p&gt;
&#21151;&#33021;&#24615;&#32908;&#32905;&#32593;&#32476;&#22312;&#25552;&#21319;&#25163;&#21183;&#24863;&#30693;&#31934;&#24230;&#20013;&#30340;&#20316;&#29992;&#23545;&#20154;&#31867;&#26426;&#22120;&#30028;&#38754;
&lt;/p&gt;
&lt;p&gt;
The Role of Functional Muscle Networks in Improving Hand Gesture Perception for Human-Machine Interfaces
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02547
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21151;&#33021;&#24615;&#32908;&#32905;&#32593;&#32476;&#30340;&#25163;&#21183;&#24863;&#30693;&#27169;&#22411;&#65292;&#36890;&#36807;&#39640;&#25928;&#22320;&#25552;&#21462;&#26102;&#39057;&#29305;&#24449;&#21644;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#25216;&#26415;&#65292;&#26174;&#33879;&#25552;&#21319;&#20102;&#25163;&#21183;&#35782;&#21035;&#30340;&#20998;&#31867;&#24615;&#33021;&#65292;&#30456;&#23545;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#20855;&#26377;&#26356;&#20248;&#36234;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02547v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#20934;&#30830;&#30340;&#25163;&#21183;&#24863;&#30693;&#27169;&#22411;&#23545;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#24212;&#29992;&#30340;&#21457;&#23637;&#33267;&#20851;&#37325;&#35201;&#65292;&#23427;&#30452;&#25509;&#24433;&#21709;&#21040;&#31070;&#32463;&#26426;&#22120;&#20154;&#23398;&#21644;&#20114;&#21160;&#26426;&#22120;&#20154;&#30340;&#33021;&#21147;&#12290;&#26368;&#36817;&#65292;&#34920;&#38754;&#32908;&#30005;&#22270;&#65288;sEMG&#65289;&#22240;&#20854;&#20016;&#23500;&#30340;&#20449;&#24687;&#19978;&#19979;&#25991;&#21644;&#19982;&#20808;&#36827;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#21450;&#21487;&#31359;&#25140;&#31995;&#32479;&#30340;&#20860;&#23481;&#24615;&#32780;&#34987;&#25506;&#32034;&#65292;&#29992;&#20197;&#25552;&#39640;&#21508;&#31181;&#22522;&#20110;sEMG&#30340;&#31070;&#32463;&#26426;&#22120;&#20154;&#24863;&#30693;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#21516;&#26102;&#30830;&#20445;&#20854;&#23545;&#20110;&#20351;&#29992;sEMG&#30340;&#31070;&#32463;&#26426;&#22120;&#20154;&#30340;&#40065;&#26834;&#24615;&#12290;&#25991;&#29486;&#20013;&#25552;&#20986;&#20102;&#35768;&#22810;&#25552;&#39640;&#24615;&#33021;&#30340;&#26041;&#27861;&#65292;&#36825;&#20123;&#26041;&#27861;&#34429;&#28982;&#30830;&#20445;&#20102;&#27169;&#22411;&#30340;&#39640;&#25928;&#24615;&#65292;&#20294;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#24448;&#24448;&#38656;&#35201;&#36739;&#24378;&#30340;&#35745;&#31639;&#33021;&#21147;&#12289;&#22823;&#35268;&#27169;&#30340;&#25968;&#25454;&#38598;&#21644;&#21487;&#25193;&#23637;&#24615;&#36739;&#20302;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#20174;&#32908;&#32905;&#21516;&#27493;&#32780;&#38750;&#32908;&#32905;&#20010;&#20307;&#28608;&#27963;&#20013;&#35299;&#30721;&#20449;&#24687;&#30340;&#26041;&#27861;&#65292;&#26469;&#35299;&#20915;&#19978;&#36848;&#25361;&#25112;&#12290;&#25105;&#20204;&#23545;&#21151;&#33021;&#24615;&#32908;&#32905;&#32593;&#32476;&#32972;&#21518;&#30340;&#32908;&#32905;&#21516;&#27493;&#36827;&#34892;&#20102;&#19968;&#23450;&#31243;&#24230;&#30340;&#29702;&#35299;&#65292;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#19968;&#33268;&#24615;&#21151;&#33021;&#32908;&#32905;&#32593;&#32476;&#30340;&#25163;&#21183;&#24863;&#30693;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#32908;&#32905;&#38388;&#30340;&#21516;&#27493;&#21644;&#32908;&#32905;&#36830;&#25509;&#20114;&#32852;&#30340;&#22270;&#32593;&#32476;&#20316;&#20026;&#25163;&#37096;&#31070;&#32463;&#35299;&#30721;&#22120;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#21033;&#29992;&#39640;&#25928;&#30340;&#26102;&#39057;&#29305;&#24449;&#21644;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#25216;&#26415;&#65292;&#22312;&#20998;&#31867;&#24615;&#33021;&#26041;&#38754;&#23454;&#29616;&#20102;&#31361;&#26174;&#30340;&#25552;&#21319;&#12290;&#36890;&#36807;&#22312;&#22810;&#20010;&#25163;&#21183;&#35782;&#21035;&#20219;&#21153;&#19978;&#30340;&#23454;&#39564;&#39564;&#35777;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#30456;&#23545;&#29616;&#26377;&#26041;&#27861;&#26174;&#31034;&#20986;&#26356;&#20248;&#36234;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02547v1 Announce Type: new  Abstract: Developing accurate hand gesture perception models is critical for various robotic applications, enabling effective communication between humans and machines and directly impacting neurorobotics and interactive robots. Recently, surface electromyography (sEMG) has been explored for its rich informational context and accessibility when combined with advanced machine learning approaches and wearable systems. The literature presents numerous approaches to boost performance while ensuring robustness for neurorobots using sEMG, often resulting in models requiring high processing power, large datasets, and less scalable solutions. This paper addresses this challenge by proposing the decoding of muscle synchronization rather than individual muscle activation. We study coherence-based functional muscle networks as the core of our perception model, proposing that functional synchronization between muscles and the graph-based network of muscle con
&lt;/p&gt;</description></item><item><title>TGS&#31639;&#27861;&#36890;&#36807;&#32467;&#21512;CVAE&#27169;&#22411;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#30340;&#36923;&#36753;&#25512;&#29702;&#33021;&#21147;&#65292;&#22312;&#22797;&#26434;&#26080;&#22270;&#29615;&#22659;&#20013;&#23454;&#29616;&#20102;&#26356;&#26377;&#25928;&#30340;&#36712;&#36857;&#29983;&#25104;&#21644;&#36873;&#25321;&#65292;&#24110;&#21161;&#36718;&#24335;&#26426;&#22120;&#20154;&#26356;&#22909;&#22320;&#36991;&#24320;&#38556;&#30861;&#65292;&#36866;&#24212;&#22797;&#26434;&#22320;&#38754;&#12290;</title><link>https://arxiv.org/abs/2408.02454</link><description>&lt;p&gt;
TGS: &#20351;&#29992;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#22312;&#26080;&#22270;&#29615;&#22659;&#20013;&#30340;&#36712;&#36857;&#29983;&#25104;&#21644;&#36873;&#25321;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
TGS: Trajectory Generation and Selection using Vision Language Models in Mapless Outdoor Environments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02454
&lt;/p&gt;
&lt;p&gt;
TGS&#31639;&#27861;&#36890;&#36807;&#32467;&#21512;CVAE&#27169;&#22411;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#30340;&#36923;&#36753;&#25512;&#29702;&#33021;&#21147;&#65292;&#22312;&#22797;&#26434;&#26080;&#22270;&#29615;&#22659;&#20013;&#23454;&#29616;&#20102;&#26356;&#26377;&#25928;&#30340;&#36712;&#36857;&#29983;&#25104;&#21644;&#36873;&#25321;&#65292;&#24110;&#21161;&#36718;&#24335;&#26426;&#22120;&#20154;&#26356;&#22909;&#22320;&#36991;&#24320;&#38556;&#30861;&#65292;&#36866;&#24212;&#22797;&#26434;&#22320;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#27169;&#24577;&#36712;&#36857;&#29983;&#25104;&#21644;&#36873;&#25321;&#31639;&#27861;&#65292;&#29992;&#20110;&#22312;&#20855;&#26377;&#19981;&#35268;&#21017;&#25143;&#22806;&#29305;&#24449;&#30340;&#29616;&#23454;&#19990;&#30028;&#20013;&#36827;&#34892;&#26080;&#22270;&#23548;&#33322;&#65292;&#20363;&#22914;&#24314;&#31569;&#29289;&#12289;&#33609;&#22320;&#21644;&#36335;&#27839;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35745;&#31639;&#20986;&#28385;&#36275;&#29615;&#22659;&#29305;&#23450;&#21487;&#36890;&#34892;&#30340;&#32422;&#26463;&#19988;&#22312;&#34892;&#20154;&#27178;&#36947;&#12289;&#20154;&#34892;&#36947;&#31561;&#21306;&#22495;&#23548;&#33322;&#26102;&#34920;&#29616;&#20986;&#20154;&#31867;&#34892;&#20026;&#30340;&#36335;&#24452;&#12290;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#31639;&#27861;&#20351;&#29992;&#20102;&#19968;&#31181;&#21463;&#26465;&#20214;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;CVAE&#65289;&#21551;&#21457;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#36890;&#36807;&#36335;&#24452;&#30340;&#23616;&#37096;&#20381;&#23384;&#24615;&#26469;&#22686;&#24378;&#65292;&#33021;&#22815;&#29983;&#25104;&#22810;&#26465;&#20505;&#36873;&#36712;&#36857;&#20197;&#20379;&#20840;&#23616;&#23548;&#33322;&#12290;&#25105;&#20204;&#36824;&#20351;&#29992;&#35270;&#35273;&#25552;&#31034;&#21644;&#22522;&#20110;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#65288;VLMs&#65289;&#30340;&#38646;&#26679;&#26412;&#33021;&#21147;&#26469;&#36873;&#25321;&#26368;&#21512;&#36866;&#30340;&#36712;&#36857;&#65292;&#35813;&#27169;&#22411;&#33021;&#22815;&#29702;&#35299;&#35821;&#20041;&#36923;&#36753;&#25512;&#29702;&#65292;&#24182;&#33719;&#21462;&#26377;&#20851;&#20219;&#21153;&#30340;&#20851;&#38190;&#19978;&#19979;&#25991;&#20449;&#24687;&#12290;&#25105;&#20204;&#24050;&#22312;&#21508;&#31181;&#25143;&#22806;&#22330;&#26223;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#65292;&#24182;&#19982;&#20351;&#29992;&#20854;&#20182;&#20840;&#23616;&#23548;&#33322;&#31639;&#27861;&#30340;&#24615;&#33021;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#23545;&#33021;&#22815;&#35782;&#21035;&#21644;&#35268;&#36991;&#38556;&#30861;&#30340;&#36718;&#24335;&#26426;&#22120;&#20154;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#32467;&#26524;&#26174;&#31034;&#25105;&#20204;&#30340;&#31639;&#27861;&#22312;&#36712;&#36857;&#36873;&#25321;&#26041;&#38754;&#25317;&#26377;&#26356;&#24378;&#30340;&#36866;&#24212;&#33021;&#21147;&#21644;&#25191;&#34892;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02454v1 Announce Type: new  Abstract: We present a multi-modal trajectory generation and selection algorithm for real-world mapless outdoor navigation in challenging scenarios with unstructured off-road features like buildings, grass, and curbs. Our goal is to compute suitable trajectories that (1) satisfy the environment-specific traversability constraints and (2) match human-like paths while navigating in crosswalks, sidewalks, etc. Our formulation uses a Conditional Variational Autoencoder (CVAE) generative model enhanced with traversability constraints to generate multiple candidate trajectories for global navigation. We use VLMs and a visual prompting approach with their zero-shot ability of semantic understanding and logical reasoning to choose the best trajectory given the contextual information about the task. We evaluate our methods in various outdoor scenes with wheeled robots and compare the performance with other global navigation algorithms. In practice, we obse
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102; RIs-Calib&#65292;&#19968;&#20010;&#22810;3D&#38647;&#36798;&#21644;IMU&#30340;&#31354;&#38388;-&#26102;&#38388;&#26657;&#20934;&#22120;&#65292;&#22522;&#20110;&#36830;&#32493;&#26102;&#38388;&#20272;&#35745;&#65292;&#26080;&#38656;&#39069;&#22806;&#22522;&#30784;&#35774;&#26045;&#23601;&#33021;&#23454;&#29616;&#31934;&#30830;&#26657;&#20934;&#12290;&#26041;&#27861;&#25552;&#39640;&#20102;&#23454;&#26102;&#31995;&#32479;&#24615;&#33021;&#65292;&#36890;&#36807;&#20248;&#21270;&#20943;&#23569;&#35823;&#24046;&#20256;&#25773;&#65292;&#26377;&#25928;&#31649;&#29702;&#20102;&#31354;&#38388;&#28418;&#31227;&#65292;&#24182;&#22312;&#19981;&#21516;&#23610;&#24230;&#19978;&#25552;&#20379;&#20248;&#36234;&#23450;&#20301;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2408.02444</link><description>&lt;p&gt;
RIs-Calib: &#22810;3D&#38647;&#36798;&#21644;IMU&#30340;&#31354;&#38388;-&#26102;&#38388;&#26657;&#20934;&#22120;&#65292;&#22522;&#20110;&#36830;&#32493;&#26102;&#38388;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
RIs-Calib: An Open-Source Spatiotemporal Calibrator for Multiple 3D Radars and IMUs Based on Continuous-Time Estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02444
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102; RIs-Calib&#65292;&#19968;&#20010;&#22810;3D&#38647;&#36798;&#21644;IMU&#30340;&#31354;&#38388;-&#26102;&#38388;&#26657;&#20934;&#22120;&#65292;&#22522;&#20110;&#36830;&#32493;&#26102;&#38388;&#20272;&#35745;&#65292;&#26080;&#38656;&#39069;&#22806;&#22522;&#30784;&#35774;&#26045;&#23601;&#33021;&#23454;&#29616;&#31934;&#30830;&#26657;&#20934;&#12290;&#26041;&#27861;&#25552;&#39640;&#20102;&#23454;&#26102;&#31995;&#32479;&#24615;&#33021;&#65292;&#36890;&#36807;&#20248;&#21270;&#20943;&#23569;&#35823;&#24046;&#20256;&#25773;&#65292;&#26377;&#25928;&#31649;&#29702;&#20102;&#31354;&#38388;&#28418;&#31227;&#65292;&#24182;&#22312;&#19981;&#21516;&#23610;&#24230;&#19978;&#25552;&#20379;&#20248;&#36234;&#23450;&#20301;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02444v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#32763;&#35793;&#25688;&#35201;&#65306;&#36741;&#21161;&#24815;&#24615;&#23548;&#33322;&#31995;&#32479;&#65288;INS&#65289;&#65292;&#36890;&#24120;&#30001;&#19968;&#20010;&#24815;&#24615;&#27979;&#37327;&#21333;&#20803;&#65288;IMU&#65289;&#21644;&#22806;&#37096;&#20256;&#24863;&#22120;&#32452;&#25104;&#65292;&#24050;&#32463;&#34987;&#24191;&#27867;&#25509;&#21463;&#20026;&#23548;&#33322;&#30340; feasible &#35299;&#20915;&#26041;&#26696;&#12290;&#30456;&#27604;&#20110;&#22522;&#20110;&#35270;&#35273;&#21644;&#28608;&#20809;&#38647;&#36798;&#30340;INS&#65292;&#22522;&#20110;&#20302;&#39057;&#27979;&#37327;&#20449;&#21495;&#30340;&#38647;&#36798;&#65288;&#38647;&#36798;&#65289;&#22312;&#24694;&#21155;&#22825;&#27668;&#26465;&#20214;&#19979;&#34920;&#29616;&#26356;&#22909;&#65292;&#22240;&#20026;&#38647;&#36798;&#30340;&#20351;&#29992;&#21463;&#21040;&#22823;&#27668;&#27668;&#20307;&#21644;&#38632;&#27700;&#30340;&#36739;&#23567;&#34928;&#20943;&#24433;&#21709;&#12290;&#23545;&#20110;&#36825;&#26679;&#30340;&#38647;&#36798;&#36741;&#21161;INS&#65292;&#23454;&#29616;&#31934;&#30830;&#30340;&#31354;&#38388;&#26102;&#38388;&#36716;&#25442;&#26159;&#23454;&#29616;&#26368;&#20339;&#20449;&#24687;&#34701;&#21512;&#30340;&#21069;&#25552;&#12290;&#22312;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102; RIs-Calib&#65306;&#19968;&#31181;&#22522;&#20110;&#36830;&#32493;&#26102;&#38388;&#20272;&#35745;&#30340;&#22810;3D&#38647;&#36798;&#21644;IMU&#30340;&#31354;&#38388;&#26102;&#38388;&#26657;&#20934;&#22120;&#65292;&#26080;&#38656;&#20219;&#20309;&#39069;&#22806;&#30340;&#26550;&#26500;&#22522;&#30784;&#35774;&#26045;&#25110;&#20808;&#39564;&#30693;&#35782;&#21363;&#21487;&#23454;&#29616;&#31934;&#30830;&#30340;&#31354;&#38388;&#26102;&#38388;&#26657;&#20934;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24320;&#22987;&#20110;&#19968;&#20010;&#20005;&#26684;&#32780;&#21487;&#38752;&#30340;&#21021;&#22987;&#21270;&#29366;&#24577;&#36807;&#31243;&#65292;&#28982;&#21518;&#26159;&#23545;&#25209;&#37327;&#20248;&#21270;&#31574;&#30053;&#30340;&#25506;&#32034;&#65292;&#20197;&#36827;&#19968;&#27493;&#32531;&#35299;&#24182;&#23436;&#21892;&#31995;&#32479;&#20998;&#36776;&#29575;&#21644;&#34701;&#21512;&#24615;&#33021;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#23545;&#26657;&#20934;&#36807;&#31243;&#26368;&#22823;&#38480;&#24230;&#22320;&#20943;&#23569;&#20102;&#35823;&#24046;&#20256;&#25773;&#65292;&#24182;&#23545;&#23454;&#26102;&#31995;&#32479;&#24615;&#33021;&#25552;&#20379;&#20102;&#19968;&#20010;&#26174;&#33879;&#30340;&#25913;&#36827;&#65292;&#25552;&#39640;&#20102;IRS-i30&#25968;&#25454;&#34701;&#21512;&#25928;&#29575;&#65292;&#20351;&#24471;&#22312;&#22810;&#31181;&#23610;&#24230;&#19978;&#30340;&#29615;&#22659;&#20013;&#65292;&#33021;&#22815;&#25552;&#20379;&#20248;&#36234;&#30340;&#31354;&#38388;&#23450;&#20301;&#31934;&#24230;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23545;&#26102;&#38388;&#26080;&#20851;&#30340;&#25512;&#31639;&#21644;&#21327;&#23450;&#20301;&#26102;&#21051;&#36827;&#34892;&#20102;&#26657;&#27491;&#65292;&#23548;&#33268;&#20102;&#19968;&#20010;&#26356;&#21152;&#31283;&#23450;&#21644;&#40065;&#26834;&#30340;&#34701;&#21512;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#34920;&#26126;&#20102;&#23427;&#22312;&#31354;&#38388;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#19978;&#30340;&#31283;&#23450;&#24615;&#65292;&#21363;&#20351;&#22312;&#20132;&#21449;&#22810;&#20010;&#23610;&#24230;&#26102;&#20063;&#33021;&#20445;&#25345;&#12290; Our algorithm provides superior positioning accuracy not only on small scale but also on large scale, effectively managing spatial drift without relying on external or artificial constraints.
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02444v1 Announce Type: new  Abstract: Aided inertial navigation system (INS), typically consisting of an inertial measurement unit (IMU) and an exteroceptive sensor, has been widely accepted as a feasible solution for navigation. Compared with vision-aided and LiDAR-aided INS, radar-aided INS could achieve better performance in adverse weather conditions since the radar utilizes low-frequency measuring signals with less attenuation effect in atmospheric gases and rain. For such a radar-aided INS, accurate spatiotemporal transformation is a fundamental prerequisite to achieving optimal information fusion. In this work, we present RIs-Calib: a spatiotemporal calibrator for multiple 3D radars and IMUs based on continuous-time estimation, which enables accurate spatiotemporal calibration and does not require any additional artificial infrastructure or prior knowledge. Our approach starts with a rigorous and robust procedure for state initialization, followed by batch optimizatio
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#21021;&#22987;&#21270;&#30340;CMR-Agent&#65292;&#23427;&#21487;&#20197;&#23454;&#29616;&#36845;&#20195;&#22270;&#20687;&#21040;&#28857;&#20113;&#27880;&#20876;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#25552;&#20986;2D-3D&#28151;&#21512;&#29366;&#24577;&#34920;&#31034;&#26469;&#20805;&#20998;&#21033;&#29992;2D&#22270;&#20687;&#21644;3D&#28857;&#20113;&#30340;&#29305;&#24449;&#65292;&#26088;&#22312;&#25552;&#39640;&#27880;&#20876;&#31934;&#24230;&#21644;&#35299;&#37322;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2408.02394</link><description>&lt;p&gt;
CMR-Agent: &#19968;&#31181;&#29992;&#20110;&#36845;&#20195;&#22270;&#20687;&#21040;&#28857;&#20113;&#27880;&#20876;&#30340;&#36328;&#23186;&#20307;&#20195;&#29702;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
CMR-Agent: Learning a Cross-Modal Agent for Iterative Image-to-Point Cloud Registration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02394
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#21021;&#22987;&#21270;&#30340;CMR-Agent&#65292;&#23427;&#21487;&#20197;&#23454;&#29616;&#36845;&#20195;&#22270;&#20687;&#21040;&#28857;&#20113;&#27880;&#20876;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#25552;&#20986;2D-3D&#28151;&#21512;&#29366;&#24577;&#34920;&#31034;&#26469;&#20805;&#20998;&#21033;&#29992;2D&#22270;&#20687;&#21644;3D&#28857;&#20113;&#30340;&#29305;&#24449;&#65292;&#26088;&#22312;&#25552;&#39640;&#27880;&#20876;&#31934;&#24230;&#21644;&#35299;&#37322;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02394v1 &#20844;&#21578;&#31867;&#22411;: cross  &#25688;&#35201;: &#22270;&#20687;&#21040;&#28857;&#20113;&#27880;&#20876;&#26088;&#22312;&#30830;&#23450;RGB&#22270;&#20687;&#30456;&#23545;&#20110;&#28857;&#20113;&#30340;&#30456;&#23545;&#30456;&#26426;&#23039;&#24577;&#12290;&#23427;&#22312;&#39044;&#20808;&#26500;&#24314;&#30340;LiDAR&#22320;&#22270;&#20013;&#30340;&#30456;&#26426;&#23450;&#20301;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#23613;&#31649;&#23384;&#22312;&#23186;&#20307;&#31867;&#22411;&#24046;&#36317;&#65292;&#20294;&#22823;&#22810;&#25968;&#22522;&#20110;&#23398;&#20064;&#30340; methods &#26041;&#27861;&#22312;&#27809;&#26377;&#20219;&#20309;&#21453;&#39304;&#26426;&#21046;&#30340;&#24773;&#20917;&#19979;&#22312;&#29305;&#24449;&#31354;&#38388;&#20013;&#24314;&#31435;&#20108;&#32500;&#21040;&#19977;&#32500;&#28857;&#23545;&#65292;&#27809;&#26377;&#36827;&#34892;&#20219;&#20309;&#36845;&#20195;&#30340;&#20248;&#21270;&#65292;&#32467;&#26524;&#23548;&#33268;&#20102;&#20302;&#31934;&#24230;&#21644;&#24179;&#24248;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#23558;&#27880;&#20876;&#36807;&#31243;&#37325;&#26032;&#26684;&#24335;&#21270;&#20026;&#19968;&#20010;&#36845;&#20195;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#65292;&#20801;&#35768;&#26681;&#25454;&#27599;&#20010;&#20013;&#38388;&#29366;&#24577;&#36827;&#34892;&#28176;&#36827;&#30340;&#30456;&#26426;&#23039;&#21183;&#35843;&#25972;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23558;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#26469;&#21457;&#23637;&#19968;&#31181;&#36328;&#23186;&#20307;&#27880;&#20876;&#20195;&#29702;&#65288;CMR-Agent&#65289;&#65292;&#24182;&#20351;&#29992;&#27169;&#20223;&#23398;&#20064;&#26469;&#20026;&#23427;&#30340;&#27880;&#20876;&#31574;&#30053;&#21021;&#22987;&#21270;&#31283;&#23450;&#24615;&#65292;&#24182;&#20026;&#35757;&#32451;&#25552;&#20379;&#24555;&#36895;&#21551;&#21160;&#12290; &#26681;&#25454;&#20132;&#21449;&#23186;&#20307;&#30340;&#35266;&#23519;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;2D-3D&#28151;&#21512;&#29366;&#24577;&#34920;&#31034;&#65292;&#23427;&#20805;&#20998;&#21033;&#29992;&#20102;2D&#22270;&#20687;&#21644;3D&#28857;&#20113;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02394v1 Announce Type: cross  Abstract: Image-to-point cloud registration aims to determine the relative camera pose of an RGB image with respect to a point cloud. It plays an important role in camera localization within pre-built LiDAR maps. Despite the modality gaps, most learning-based methods establish 2D-3D point correspondences in feature space without any feedback mechanism for iterative optimization, resulting in poor accuracy and interpretability. In this paper, we propose to reformulate the registration procedure as an iterative Markov decision process, allowing for incremental adjustments to the camera pose based on each intermediate state. To achieve this, we employ reinforcement learning to develop a cross-modal registration agent (CMR-Agent), and use imitation learning to initialize its registration policy for stability and quick-start of the training. According to the cross-modal observations, we propose a 2D-3D hybrid state representation that fully exploits 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#27454;&#26032;&#30340;&#24231;&#26885;&#33050;&#25511;&#22120;&#65292;&#19987;&#20026;&#25511;&#21046;&#36828;&#31243;&#21576;&#29616;&#26426;&#22120;&#20154;&#21450;&#34394;&#25311;&#29616;&#23454;&#29615;&#22659;&#20013;&#30340;&#31227;&#21160;&#35774;&#35745;&#65292;&#37319;&#29992;3 DOF&#65292;&#21487;&#23454;&#29616;&#33050;&#37096;&#30340;&#21069;&#21518;&#24038;&#21491;&#31227;&#21160;&#65292;&#24182;&#33021;&#22260;&#32469;&#22402;&#30452;&#36724;&#26059;&#36716;&#12290;&#25511;&#21046;&#22120;&#20855;&#26377;&#33258;&#26657;&#20934;&#21151;&#33021;&#65292;&#20351;&#29992;HTC Vive&#36319;&#36394;&#22120;&#26469;&#36716;&#25442;&#26041;&#21521;&#21629;&#20196;&#12290;&#35813;&#25511;&#22120;&#22312;&#29305;&#23450;&#27604;&#36187;&#20013;&#21462;&#24471;&#25104;&#21151;&#65292;&#24182;&#20844;&#24320;&#20102;&#20854;3D&#25171;&#21360;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2408.02319</link><description>&lt;p&gt;
&#19977;&#39033;&#33258;&#30001;&#24230;&#33258;&#36866;&#24212;&#33050;&#37096;&#25511;&#21046;&#22120;&#29992;&#20110;&#26080;&#25163;&#36828;&#31243;&#25805;&#25511;&#34394;&#25311;&#29616;&#23454;&#21644;&#34394;&#25311;&#29616;&#23454;
&lt;/p&gt;
&lt;p&gt;
Self-centering 3-DOF feet controller for hands-free locomotion control in telepresence and virtual reality
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02319
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#27454;&#26032;&#30340;&#24231;&#26885;&#33050;&#25511;&#22120;&#65292;&#19987;&#20026;&#25511;&#21046;&#36828;&#31243;&#21576;&#29616;&#26426;&#22120;&#20154;&#21450;&#34394;&#25311;&#29616;&#23454;&#29615;&#22659;&#20013;&#30340;&#31227;&#21160;&#35774;&#35745;&#65292;&#37319;&#29992;3 DOF&#65292;&#21487;&#23454;&#29616;&#33050;&#37096;&#30340;&#21069;&#21518;&#24038;&#21491;&#31227;&#21160;&#65292;&#24182;&#33021;&#22260;&#32469;&#22402;&#30452;&#36724;&#26059;&#36716;&#12290;&#25511;&#21046;&#22120;&#20855;&#26377;&#33258;&#26657;&#20934;&#21151;&#33021;&#65292;&#20351;&#29992;HTC Vive&#36319;&#36394;&#22120;&#26469;&#36716;&#25442;&#26041;&#21521;&#21629;&#20196;&#12290;&#35813;&#25511;&#22120;&#22312;&#29305;&#23450;&#27604;&#36187;&#20013;&#21462;&#24471;&#25104;&#21151;&#65292;&#24182;&#20844;&#24320;&#20102;&#20854;3D&#25171;&#21360;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02319v1 &#20844;&#21578;&#31867;&#22411;: &#26032;&#20844;&#24067; &#25688;&#35201;: &#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#24231;&#20301;&#24335;&#33050;&#25511;&#21046;&#22120;&#65292;&#29992;&#20110;&#25511;&#21046;&#36828;&#31243;&#21576;&#29616;&#26426;&#22120;&#20154;&#21644;&#34394;&#25311;&#29616;&#23454;&#29615;&#22659;&#20013;&#30340;&#31227;&#21160;&#12290;&#22312;&#20004;&#20010;&#36724;&#19978;&#30340;&#20542;&#26012;&#33050;&#20135;&#29983;&#21069;&#36827;&#12289;&#21518;&#36864;&#21644;&#20391;&#21521;&#36816;&#21160;&#12290;&#27492;&#22806;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#22238;&#26059;&#20851;&#33410;&#20801;&#35768;&#22260;&#32469;&#22402;&#30452;&#36724;&#26059;&#36716;&#12290;&#25152;&#26377;&#20851;&#33410;&#19978;&#37117;&#23433;&#35013;&#20102;&#24377;&#31783;&#65292;&#20197;&#23454;&#29616;&#33258;&#21160;&#20013;&#24515;&#21270;&#30340;&#25511;&#21046;&#22120;&#12290;&#20351;&#29992;HTC Vive&#36319;&#36394;&#22120;&#26469;&#23558;&#36319;&#36394;&#22120;&#30340;&#26041;&#21521;&#36716;&#25442;&#25104;&#31227;&#21160;&#21629;&#20196;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#33258;&#36866;&#24212;&#33050;&#25511;&#21046;&#22120;&#22312;ANAvatar XPRIZE&#31454;&#36187;&#20013;&#24471;&#21040;&#20102;&#25104;&#21151;&#20351;&#29992;&#65292;&#22312;&#36825;&#20010;&#31454;&#36187;&#20013;&#65292;&#19968;&#20010;&#26080;&#30693;&#30340;&#25805;&#20316;&#21592;&#22312;&#36890;&#36807;&#38556;&#30861;&#29289;&#30340;&#21516;&#26102;&#35299;&#20915;&#21508;&#31181;&#20132;&#20114;&#21644;&#25805;&#20316;&#20219;&#21153;&#26102;&#65292;&#20351;&#26426;&#22120;&#20154;&#36890;&#36807;&#26356;&#36828;&#30340;&#36317;&#31163;&#12290;&#25105;&#20204;&#20844;&#24320;&#25552;&#20379;&#20102;&#22823;&#37096;&#20998;3D&#25171;&#21360;&#30340;&#33050;&#25511;&#21046;&#22120;&#27169;&#22411;&#65292;&#20197;&#20379;&#22797;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02319v1 Announce Type: new  Abstract: We present a novel seated foot controller for handling 3-DOF aimed to control locomotion for telepresence robotics and virtual reality environments. Tilting the feet on two axes yields in forward, backward and sideways motion. In addition, a separate rotary joint allows for rotation around the vertical axis. Attached springs on all joints self-center the controller. The HTC Vive tracker is used to translate the trackers' orientation into locomotion commands. The proposed self-centering foot controller was used successfully for the ANA Avatar XPRIZE competition, where a naive operator traversed the robot through a longer distance, surpassing obstacles while solving various interaction and manipulation tasks in between. We publicly provide the models of the mostly 3D-printed feet controller for reproduction.
&lt;/p&gt;</description></item><item><title>&#27492;&#30740;&#31350;&#36890;&#36807;&#26657;&#20934;&#24863;&#30693;&#27010;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#25913;&#36827;&#20102;&#36523;&#20307;&#20154;&#24037;&#26234;&#33021;&#30340;&#25628;&#32034;&#20219;&#21153;&#65292;&#29305;&#21035;&#26159;&#22312;&#19981;&#21516;&#31867;&#22411;&#30340;&#35821;&#20041;&#24863;&#30693;&#27169;&#22411;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;</title><link>https://arxiv.org/abs/2408.02297</link><description>&lt;p&gt;
&#24863;&#30693;&#33267;&#20851;&#37325;&#35201;&#65306;&#36890;&#36807;&#19981;&#30830;&#23450;&#24615;&#24863;&#30693;&#35821;&#20041;&#20998;&#21106;&#22686;&#24378;&#36523;&#20307;&#20154;&#24037;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Perception Matters: Enhancing Embodied AI with Uncertainty-Aware Semantic Segmentation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02297
&lt;/p&gt;
&lt;p&gt;
&#27492;&#30740;&#31350;&#36890;&#36807;&#26657;&#20934;&#24863;&#30693;&#27010;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#25913;&#36827;&#20102;&#36523;&#20307;&#20154;&#24037;&#26234;&#33021;&#30340;&#25628;&#32034;&#20219;&#21153;&#65292;&#29305;&#21035;&#26159;&#22312;&#19981;&#21516;&#31867;&#22411;&#30340;&#35821;&#20041;&#24863;&#30693;&#27169;&#22411;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02297v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#26032;&#30340;&#25688;&#35201;&#65306;&#36523;&#20307;&#20154;&#24037;&#26234;&#33021;&#22312;&#26410;&#30693;&#29615;&#22659;&#20013;&#25191;&#34892;&#20219;&#21153;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#22914;&#29289;&#20307;&#25628;&#32034;&#31561;&#20219;&#21153;&#20027;&#35201;&#20851;&#27880;&#26377;&#25928;&#31574;&#30053;&#30340;&#23398;&#20064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#35782;&#21035;&#20986;&#24403;&#21069;&#25628;&#32034;&#26041;&#27861;&#20013;&#30340;&#20960;&#20010;&#24046;&#36317;&#65306;&#23427;&#20204;&#20027;&#35201;&#38598;&#20013;&#22312;&#36807;&#26102;&#30340;&#24863;&#30693;&#27169;&#22411;&#19978;&#65292;&#24573;&#30053;&#20102;&#26102;&#38388;&#32858;&#21512;&#65292;&#24182;&#19988;&#20174;&#22320;&#38754;&#30495;&#23454;&#30452;&#25509;&#36716;&#31227;&#21040;&#27979;&#35797;&#26102;&#30340;&#22122;&#22768;&#24863;&#30693;&#65292;&#32780;&#19981;&#32771;&#34385;&#21040;&#24863;&#30693;&#29366;&#24577;&#30340;&#36807;&#24230;&#33258;&#20449;&#12290;&#36890;&#36807;&#26657;&#20934;&#30340;&#24863;&#30693;&#27010;&#29575;&#21644;&#19981;&#30830;&#23450;&#24615;&#20197;&#21450;&#32858;&#21512;&#21644;&#20915;&#31574;&#36807;&#31243;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#26469;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#20174;&#32780;&#23545;&#27169;&#22411;&#36827;&#34892;&#36866;&#24212;&#20197;&#22788;&#29702;&#24207;&#21015;&#20219;&#21153;&#12290;&#25152;&#24471;&#21040;&#30340;&#26041;&#27861;&#21487;&#20197;&#30452;&#25509;&#38598;&#25104;&#21040;&#19968;&#31995;&#21015;&#29616;&#26377;&#30340;&#25628;&#32034;&#26041;&#27861;&#20013;&#65292;&#19988;&#27809;&#26377;&#39069;&#22806;&#30340;&#35757;&#32451;&#25104;&#26412;&#12290;&#25105;&#20204;&#22312;&#19981;&#21516;&#31867;&#22411;&#30340;&#35821;&#20041;&#24863;&#30693;&#27169;&#22411;&#21644;&#31574;&#30053;&#19978;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#35780;&#20272;&#65292;&#30830;&#35748;&#20102;&#26657;&#20934;&#24863;&#30693;&#27010;&#29575;&#22312;&#32858;&#21512;&#26041;&#27861;&#21644;&#19981;&#21516;&#24863;&#30693;&#27169;&#22411;&#21644;&#31574;&#30053;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02297v1 Announce Type: new  Abstract: Embodied AI has made significant progress acting in unexplored environments. However, tasks such as object search have largely focused on efficient policy learning. In this work, we identify several gaps in current search methods: They largely focus on dated perception models, neglect temporal aggregation, and transfer from ground truth directly to noisy perception at test time, without accounting for the resulting overconfidence in the perceived state. We address the identified problems through calibrated perception probabilities and uncertainty across aggregation and found decisions, thereby adapting the models for sequential tasks. The resulting methods can be directly integrated with pretrained models across a wide family of existing search approaches at no additional training cost. We perform extensive evaluations of aggregation methods across both different semantic perception models and policies, confirming the importance of calib
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#19968;&#20010;&#21517;&#20026;OPENGRASP-LITE&#30340;&#24320;&#25918;&#28304;&#20195;&#30721;&#20154;&#24037;&#25163;&#39033;&#30446;&#65292;&#23427;&#20855;&#26377;&#36731;&#37327;&#32423;&#12289;&#39640;&#38598;&#25104;&#24230;&#12289;&#35302;&#35273;&#21151;&#33021;&#21644;&#22522;&#20110;&#21487;&#21464;&#24418;&#36830;&#26438;&#30340;&#25235;&#21462;&#33021;&#21147;&#65292;&#36866;&#29992;&#20110;&#35302;&#35273;&#20154;&#36896;&#25163;&#25216;&#26415;&#30340;&#36827;&#19968;&#27493;&#30740;&#31350;&#12290;</title><link>https://arxiv.org/abs/2408.02293</link><description>&lt;p&gt;
OPENGRASP-LITE &#29256;&#26412;1.0&#65306;&#24102;&#26377;&#21487;&#21464;&#24418;&#36830;&#26438;&#26426;&#21046;&#30340; Tactile &#20154;&#36896;&#25163;
&lt;/p&gt;
&lt;p&gt;
OPENGRASP-LITE Version 1.0: A Tactile Artificial Hand with a Compliant Linkage Mechanism
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02293
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#20010;&#21517;&#20026;OPENGRASP-LITE&#30340;&#24320;&#25918;&#28304;&#20195;&#30721;&#20154;&#24037;&#25163;&#39033;&#30446;&#65292;&#23427;&#20855;&#26377;&#36731;&#37327;&#32423;&#12289;&#39640;&#38598;&#25104;&#24230;&#12289;&#35302;&#35273;&#21151;&#33021;&#21644;&#22522;&#20110;&#21487;&#21464;&#24418;&#36830;&#26438;&#30340;&#25235;&#21462;&#33021;&#21147;&#65292;&#36866;&#29992;&#20110;&#35302;&#35273;&#20154;&#36896;&#25163;&#25216;&#26415;&#30340;&#36827;&#19968;&#27493;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02293v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#26032;  &#32763;&#35793;&#25688;&#35201;&#65306;&#22312;&#24320;&#21457;&#22522;&#20110;&#36830;&#26438;&#30340;&#20154;&#36896;&#25163;&#26041;&#38754;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;&#23613;&#31649;&#20043;&#21069;&#30340;&#35774;&#35745;&#20391;&#37325;&#20110;&#36866;&#24212;&#24615;&#25235;&#21462;&#12289;&#25216;&#24039;&#21644;&#27169;&#20223;&#29983;&#29289;&#30382;&#32932;&#65292;&#20294;&#21482;&#26377;&#23569;&#25968;&#31995;&#32479;&#25552;&#20986;&#20102;&#19968;&#31181;&#36731;&#37327;&#32423;&#12289;&#21487;&#35775;&#38382;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#38598;&#25104;&#20102;&#35302;&#35273;&#24863;&#27979;&#19982;&#22522;&#20110;&#21487;&#21464;&#24418;&#36830;&#26438;&#30340;&#26426;&#21046;&#12290;&#26412;&#25991;&#20171;&#32461; OPENGRASP-LITE&#65292;&#36825;&#26159;&#19968;&#20010;&#24320;&#25918;&#28304;&#20195;&#30721;&#30340;&#39640;&#38598;&#25104;&#24230;&#12289;&#35302;&#35273;&#21644;&#20154;&#36896;&#25163;&#12290;&#36890;&#36807;&#21033;&#29992;&#21487;&#21464;&#24418;&#36830;&#26438;&#31995;&#32479;&#21644;MEMS&#27668;&#21387;&#35745;&#35302;&#35273;&#20256;&#24863;&#25216;&#26415;&#65292;&#23427;&#25552;&#20379;&#20102;&#24102;&#26377;&#20845;&#20010;&#24230;&#33258;&#30001;&#24230;&#30340;&#22810;&#26679;&#21270;&#25235;&#21462;&#33021;&#21147;&#12290;&#36890;&#36807;&#25552;&#20379;&#35302;&#35273;&#20256;&#24863;&#22120;&#24182;&#19982;&#36719;&#25235;&#21462;&#33021;&#21147;&#30456;&#23481;&#65292;&#23427;&#20026;&#22312;&#20154;&#36896;&#35302;&#35273;&#25163;&#26041;&#38754;&#30340;&#36827;&#19968;&#27493;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#21487;&#35775;&#38382;&#30340;&#24179;&#21488;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02293v1 Announce Type: new  Abstract: Recent research has seen notable progress in the development of linkage-based artificial hands. While previous designs have focused on adaptive grasping, dexterity and biomimetic artificial skin, only a few systems have proposed a lightweight, accessible solution integrating tactile sensing with a compliant linkage-based mechanism. This paper introduces OPENGRASP LITE, an open-source, highly integrated, tactile, and lightweight artificial hand. Leveraging compliant linkage systems and MEMS barometer-based tactile sensing, it offers versatile grasping capabilities with six degrees of actuation. By providing tactile sensors and enabling soft grasping, it serves as an accessible platform for further research in tactile artificial hands.
&lt;/p&gt;</description></item><item><title>&#38646;&#25490;&#25918;&#28023;&#36816;&#36755;&#24037;&#20855;&#65288;ZEST&#65289;&#39033;&#30446;&#21033;&#29992;&#25968;&#23383;&#21452;&#32990;&#32974;&#27010;&#24565;&#21644;&#30707;&#39318;&#40060;&#27169;&#25311;&#22120;&#25512;&#36827;&#20102;&#20302;&#30899;&#25490;&#25918;&#30340;&#22810;&#29992;&#36884;&#21452;&#20307;&#33337;&#30340;&#24320;&#21457;&#65292;&#20197;&#25903;&#25345;&#21487;&#25345;&#32493;&#30340;&#28023;&#19978;&#36816;&#36755;&#21457;&#23637;&#12290;</title><link>https://arxiv.org/abs/2408.02277</link><description>&lt;p&gt;
&#38646;&#25490;&#25918;&#28023;&#36816;&#36755;&#24037;&#20855;&#65288;ZEST&#65289;&#39033;&#30446;&#37319;&#29992;&#30707;&#39318;&#40060;&#27169;&#25311;&#22120;&#25972;&#21512;&#25968;&#23383;&#21452;&#32990;&#32974;&#27010;&#24565;&#65292;&#20026;&#21487;&#25345;&#32493;&#30340;&#28023;&#19978;&#36816;&#36755;&#25552;&#20379;&#25903;&#25345;
&lt;/p&gt;
&lt;p&gt;
Integrating a Digital Twin Concept in the Zero Emission Sea Transporter (ZEST) Project for Sustainable Maritime Transport using Stonefish Simulator
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02277
&lt;/p&gt;
&lt;p&gt;
&#38646;&#25490;&#25918;&#28023;&#36816;&#36755;&#24037;&#20855;&#65288;ZEST&#65289;&#39033;&#30446;&#21033;&#29992;&#25968;&#23383;&#21452;&#32990;&#32974;&#27010;&#24565;&#21644;&#30707;&#39318;&#40060;&#27169;&#25311;&#22120;&#25512;&#36827;&#20102;&#20302;&#30899;&#25490;&#25918;&#30340;&#22810;&#29992;&#36884;&#21452;&#20307;&#33337;&#30340;&#24320;&#21457;&#65292;&#20197;&#25903;&#25345;&#21487;&#25345;&#32493;&#30340;&#28023;&#19978;&#36816;&#36755;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02277v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#26032; &#25688;&#35201;&#65306;&#20026;&#20102;&#21709;&#24212;&#22269;&#38469;&#28023;&#20107;&#32452;&#32455;&#65288;IMO&#65289;&#26045;&#21152;&#30340;&#20005;&#26684;&#25490;&#25918;&#20943;&#23569;&#30446;&#26631;&#20197;&#21450;&#27431;&#27954;&#32511;&#33394;&#21327;&#35758;&#30340;Fit for 55&#31435;&#27861;&#21253;&#65292;&#28023;&#19978;&#36816;&#36755;&#34892;&#19994;&#24050;&#32463;&#23558;&#27880;&#24847;&#21147;&#36716;&#21521;&#20102;&#33073;&#30899;&#21270;&#12290;&#23613;&#31649;&#23545;&#20110;&#36229;&#36807;5000&#20928;&#21544;&#65288;GT&#65289;&#30340;&#33337;&#33334;&#65292;&#24050;&#32463;&#32473;&#20104;&#20102;&#26497;&#22823;&#30340;&#20851;&#27880;&#65292;&#20294;&#22312;&#27431;&#30431;&#20869;&#37096;&#65292;&#27839;&#28023;&#21644;&#30701;&#36884;&#28023;&#36816;&#30340;&#25490;&#25918;&#37327;&#21344;&#25972;&#20010;&#28023;&#19978;&#36816;&#36755;&#30340;13%&#65292;&#19988;&#22312;&#27431;&#30431;&#20869;&#36798;&#21040;&#20102;15%&#65292;&#36825;&#37096;&#20998;&#25490;&#25918;&#37327;&#36824;&#27809;&#26377;&#24471;&#21040;&#36275;&#22815;&#30340;&#32771;&#34385;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#38646;&#25490;&#25918;&#28023;&#36816;&#36755;&#24037;&#20855;&#65288;ZEST&#65289;&#39033;&#30446;&#65292;&#35813;&#39033;&#30446;&#26088;&#22312;&#36890;&#36807;&#20026;&#30701;&#36884;&#28023;&#36816;&#36335;&#32447;&#24320;&#21457;&#19968;&#27454;&#38646;&#25490;&#25918;&#30340;&#22810;&#29992;&#36884;&#21452;&#20307;&#33337;&#26469;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02277v1 Announce Type: new  Abstract: In response to stringent emission reduction targets imposed by the International Maritime Organization (IMO) and the European Green Deal's Fit for 55 legislation package, the maritime industry has shifted its focus towards decarbonization. While significant attention has been placed on vessels exceeding 5,000 gross tons (GT), emissions from coastal and short sea shipping, amounting to approximately 13% of global shipping transportation and 15% within the European Union (EU), have not received adequate consideration. This abstract introduces the Zero Emission Sea Transporter (ZEST) project, designed to address this issue by developing a zero-emissions multi-purpose catamaran for short sea route
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;RoPotter&#30340;&#31649;&#36947;&#65292;&#29992;&#20110;&#24863;&#30693;&#21644;&#38518;&#33402;&#25216;&#33021;&#23398;&#20064;&#65292;&#36890;&#36807;&#24341;&#20837;&#38518;&#33402;&#36718;&#25345;&#32493;&#21464;&#24418;&#31896;&#22303;&#30340;&#26032;&#20219;&#21153;&#65292;&#23637;&#31034;&#20102;&#32467;&#26500;&#20808;&#39564;&#22312;&#26426;&#22120;&#20154;&#38518;&#33402;&#20013;&#30340;&#26377;&#25928;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2408.02184</link><description>&lt;p&gt;
&#32599;&#27874;&#29305;&#65306;&#22522;&#20110;&#32467;&#26500;&#20808;&#39564;&#30340;&#26426;&#22120;&#20154;&#38518;&#33402;&#21644;&#26580;&#24615;&#29289;&#20307;&#25805;&#20316;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with Structural Priors
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02184
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;RoPotter&#30340;&#31649;&#36947;&#65292;&#29992;&#20110;&#24863;&#30693;&#21644;&#38518;&#33402;&#25216;&#33021;&#23398;&#20064;&#65292;&#36890;&#36807;&#24341;&#20837;&#38518;&#33402;&#36718;&#25345;&#32493;&#21464;&#24418;&#31896;&#22303;&#30340;&#26032;&#20219;&#21153;&#65292;&#23637;&#31034;&#20102;&#32467;&#26500;&#20808;&#39564;&#22312;&#26426;&#22120;&#20154;&#38518;&#33402;&#20013;&#30340;&#26377;&#25928;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02184v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#25688;&#35201;&#65306;&#20154;&#31867;&#33021;&#22815;&#36830;&#32493;&#22320;&#25805;&#32437;&#21508;&#31181;&#21508;&#26679;&#30340;&#26580;&#24615;&#29289;&#20307;&#36827;&#20837;&#22797;&#26434;&#30340;&#24418;&#29366;&#12290;&#36825;&#35201;&#24402;&#21151;&#20110;&#25105;&#20204;&#23545;&#26448;&#26009;&#29305;&#24615;&#21644;&#29289;&#20307;&#26426;&#26800;&#24615;&#36136;&#30340;&#30452;&#35266;&#29702;&#35299;&#65292;&#21363;&#20351;&#29289;&#20307;&#34987;&#36974;&#25377;&#20063;&#33021;&#25512;&#29702;&#29289;&#20307;&#30340;&#29366;&#24577;&#12290;&#36825;&#20123;&#33021;&#21147;&#20351;&#25105;&#20204;&#33021;&#22815;&#25191;&#34892;&#20174;&#29992;&#38754;&#39135;&#28921;&#39274;&#21040;&#29992;&#38518;&#33402;&#34920;&#36798;&#33258;&#24049;&#30340;&#21508;&#31181;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#24320;&#21457;&#33021;&#22815;&#31283;&#20581;&#22320;&#36827;&#34892;&#31867;&#20284;&#20219;&#21153;&#30340;&#26426;&#22120;&#20154;&#31995;&#32479;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#24403;&#21069;&#30340;&#26041;&#27861;&#38590;&#20197;&#26377;&#25928;&#22320;&#24314;&#27169;&#20307;&#31215;&#24615;&#26580;&#24615;&#29289;&#20307;&#24182;&#23545;&#23427;&#20204;&#36890;&#24120;&#34920;&#29616;&#20986;&#30340;&#22797;&#26434;&#34892;&#20026;&#36827;&#34892;&#25512;&#29702;&#12290;&#20026;&#20102;&#30740;&#31350;&#33021;&#22815;&#21464;&#24418;&#20307;&#31215;&#24615;&#29289;&#20307;&#30340;&#26426;&#22120;&#20154;&#31995;&#32479;&#21644;&#31639;&#27861;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#20840;&#26032;&#30340;&#38518;&#33402;&#36718;&#36830;&#32493;&#21464;&#24418;&#31896;&#22303;&#30340;&#20219;&#21153;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24863;&#30693;&#21644;&#38518;&#33402;&#25216;&#33021;&#23398;&#20064;&#30340;&#31649;&#36947;&#65292;&#31216;&#20026;RoPotter&#65292;&#25105;&#20204;&#22312;&#20854;&#20013;&#23637;&#31034;&#20102;&#20855;&#26377;&#32467;&#26500;&#20808;&#39564;&#30340;&#31995;&#32479;&#33021;&#22815;&#26377;&#25928;&#22320;&#23398;&#20064;&#21644;&#25805;&#20316;&#38518;&#33402;&#12290;&#22312;&#36825;&#20010;&#31616;&#21333;&#30340;&#20219;&#21153;&#19978;&#65292;&#31070;&#32463;&#32593;&#32476;&#33021;&#22815;&#24555;&#36895;&#23398;&#20064;&#22914;&#20309;&#25805;&#32437;&#27877;&#24052;&#21644;&#36718;&#30424;&#30340;&#32452;&#21512;&#65292;&#36890;&#36807;&#35266;&#23519;&#26469;&#33258;&#36710;&#36718;&#30340;&#19981;&#21516;&#35282;&#24230;&#30340;&#35270;&#39057;&#25429;&#25417;&#26469;&#35266;&#23519;&#23427;&#30340;&#34892;&#20026;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20351;&#29992;&#21333;&#19968;&#35270;&#35273;&#21644;&#36712;&#36857;&#39044;&#27979;&#30340;&#32593;&#32476;&#26469;&#25351;&#23548;&#36718;&#30424;&#30340;&#36816;&#21160;&#20197;&#33719;&#24471;&#29702;&#24819;&#30340;&#25104;&#21697;&#65292;&#36825;&#26679;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#20943;&#23569;&#35270;&#35273;&#28183;&#36879;&#24102;&#26469;&#30340;&#38382;&#39064;&#12290;&#34429;&#28982;&#26412;&#30740;&#31350;&#20027;&#35201;&#20391;&#37325;&#20110;&#21333;&#32593;&#26684;&#24773;&#20917;&#19979;&#38518;&#33402;&#30340;&#36830;&#32493;&#29366;&#24577;&#35843;&#25972;&#65292;&#20294;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#26410;&#26469;&#30740;&#31350;&#22810;&#32593;&#26684;&#24773;&#24418;&#19979;&#30340;&#38518;&#33402;&#36830;&#32493;&#29366;&#24577;&#35843;&#25972;&#25552;&#20379;&#20102;&#19968;&#20010;&#24179;&#21488;&#65292;&#35813;&#24773;&#24418;&#19979;&#26426;&#22120;&#20154;&#21487;&#20197;&#22788;&#29702;&#26356;&#20026;&#22797;&#26434;&#24182;&#19988;&#20855;&#26377;&#23618;&#29366;&#21464;&#24615;&#30340;&#29289;&#20307;&#12290;&#36890;&#36807;&#22312;&#22522;&#30784;&#20219;&#21153;&#19978;&#30340;&#25345;&#32493;&#21162;&#21147;&#21644;&#20248;&#21270;&#36807;&#31243;&#65292;&#25105;&#20204;&#23545;&#23558;&#36825;&#31181;&#25216;&#26415;&#19982;&#36870;&#21521;&#28145;&#24230;&#24863;&#30693;&#20197;&#21450;&#22686;&#24378;&#23398;&#20064;&#38598;&#25104;&#20197;&#23454;&#29616;&#23436;&#20840;&#33258;&#20027;&#30340;&#26426;&#22120;&#20154;&#38518;&#33402;&#25345;&#20048;&#35266;&#24577;&#24230;&#12290;&#25105;&#20204;&#30340;&#22242;&#38431;&#26399;&#24453;&#30528;&#26410;&#26469;&#21487;&#20197;&#22312;&#26356;&#22797;&#26434;&#30340;&#29615;&#22659;&#20013;&#36827;&#19968;&#27493;&#24212;&#29992;&#36825;&#20123;&#26041;&#27861;&#65292;&#24182;&#22312;&#26426;&#22120;&#20154;&#22312;&#38518;&#33402;&#21644;&#26580;&#24615;&#29289;&#20307;&#25805;&#20316;&#26041;&#38754;&#21462;&#24471;&#36827;&#19968;&#27493;&#30340;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02184v1 Announce Type: new  Abstract: Humans are capable of continuously manipulating a wide variety of deformable objects into complex shapes. This is made possible by our intuitive understanding of material properties and mechanics of the object, for reasoning about object states even when visual perception is occluded. These capabilities allow us to perform diverse tasks ranging from cooking with dough to expressing ourselves with pottery-making. However, developing robotic systems to robustly perform similar tasks remains challenging, as current methods struggle to effectively model volumetric deformable objects and reason about the complex behavior they typically exhibit. To study the robotic systems and algorithms capable of deforming volumetric objects, we introduce a novel robotics task of continuously deforming clay on a pottery wheel. We propose a pipeline for perception and pottery skill-learning, called RoPotter, wherein we demonstrate that structural priors spec
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#26032;&#22411;&#33258;&#20027;&#24494;&#22609;&#26009;&#25910;&#38598;&#21322;&#28508;&#24335;&#24179;&#21488;&#30340;&#35774;&#35745;&#19982;&#23454;&#26045;&#65292;&#26088;&#22312;&#25552;&#39640;&#29616;&#26377;&#24494;&#22609;&#26009;&#25910;&#38598;&#26041;&#27861;&#30340;&#25928;&#29575;&#21644;&#21487;&#34892;&#24615;&#12290;</title><link>https://arxiv.org/abs/2408.02162</link><description>&lt;p&gt;
&#35770;&#25991;&#26631;&#39064;&#65306;&#19968;&#31181;&#26032;&#22411;&#33258;&#20027;&#24494;&#22609;&#26009;&#25910;&#38598;&#21322;&#28508;&#24335;&#24179;&#21488;&#25913;&#36827;&#19982;&#23454;&#35777;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Improvement and Empirical Testing of a Novel Autonomous Microplastics-Collecting Semisubmersible
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02162
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#26032;&#22411;&#33258;&#20027;&#24494;&#22609;&#26009;&#25910;&#38598;&#21322;&#28508;&#24335;&#24179;&#21488;&#30340;&#35774;&#35745;&#19982;&#23454;&#26045;&#65292;&#26088;&#22312;&#25552;&#39640;&#29616;&#26377;&#24494;&#22609;&#26009;&#25910;&#38598;&#26041;&#27861;&#30340;&#25928;&#29575;&#21644;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02162v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#33258;&#20154;&#31867;&#21457;&#26126;&#22609;&#26009;&#20197;&#26469;&#65292;&#36825;&#31181;&#26448;&#26009;&#22312;&#19990;&#30028;&#21508;&#22320;&#30340;&#29616;&#20195;&#31038;&#20250;&#20013;&#26080;&#22788;&#19981;&#22312;&#65292;&#20854;&#23545;&#29615;&#22659;&#30340;&#24433;&#21709;&#22312;&#36817;&#24180;&#24050;&#25104;&#20026;&#20247;&#25152;&#21608;&#30693;&#30340;&#29616;&#35937;&#12290;&#20154;&#31867;&#29983;&#20135;&#30340;&#22609;&#26009;&#20960;&#20046;&#21040;&#36798;&#20102;&#19990;&#30028;&#30340;&#27599;&#19968;&#20010;&#35282;&#33853;&#65292;&#24182;&#19988;&#22312;&#20854;&#25968;&#30334;&#24180;&#29978;&#33267;&#25968;&#21315;&#24180;&#30340;&#23551;&#21629;&#20013;&#65292;&#30001;&#20110;&#25152;&#21463;&#21040;&#30340;&#29289;&#29702;&#21387;&#21147;&#65292;&#22609;&#26009;&#19981;&#26029;&#20998;&#35299;&#25104;&#36234;&#26469;&#36234;&#23567;&#30340;&#39063;&#31890;&#12290;&#36825;&#31181;&#21387;&#21147;&#26368;&#32456;&#19981;&#21487;&#36991;&#20813;&#22320;&#23558;&#22609;&#26009;&#20998;&#35299;&#25104;&#24494;&#22609;&#26009;&#8212;&#8212;&#21487;&#20197;&#30001;&#20840;&#29699;&#21508;&#31181;&#27700;&#28304;&#20013;&#30340;&#29983;&#29289;&#20307;&#25668;&#20837;&#30340;&#23567;&#22609;&#26009;&#22359;&#12290;&#24494;&#22609;&#26009;&#33021;&#36731;&#26131;&#22320;&#36827;&#34892;&#29983;&#29289;&#31215;&#32047;&#65292;&#24050;&#34987;&#21457;&#29616;&#23384;&#22312;&#20110;&#20174;&#20116;&#22823;&#28246;&#21306;&#21040;&#20154;&#31867;&#30340;&#34880;&#28082;&#24490;&#29615;&#20013;&#12290;&#36825;&#20123;&#22609;&#26009;&#30340;&#24433;&#21709;&#23578;&#19981;&#28165;&#26970;&#65292;&#20294;&#23427;&#20204;&#24050;&#34987;&#19982;&#29983;&#32946;&#38382;&#39064;&#12289;&#29983;&#38271;&#20572;&#28382;&#21644;&#21508;&#31181;&#20854;&#20182;&#30142;&#30149;&#32852;&#31995;&#22312;&#19968;&#36215;&#12290;&#30446;&#21069;&#65292;&#24494;&#22609;&#26009;&#30340;&#21435;&#38500;&#20027;&#35201;&#22522;&#20110;&#26426;&#26800;&#36807;&#28388;&#21644;&#28023;&#19978;&#25628;&#38598;&#31561;&#31574;&#30053;&#65292;&#20294;&#36825;&#20123;&#26041;&#27861;&#26080;&#35770;&#22312;&#25104;&#26412;&#36824;&#26159;&#22312;&#26377;&#25928;&#24615;&#19978;&#37117;&#38754;&#20020;&#25361;&#25112;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#22522;&#20110;&#26032;&#22411;&#30005;&#23376;&#31995;&#32479;&#30340;&#33258;&#20027;&#24494;&#22609;&#26009;&#25910;&#38598;&#21322;&#28508;&#24335;&#24179;&#21488;&#30340;&#35774;&#35745;&#19982;&#23454;&#26045;&#65292;&#29992;&#20110;&#25552;&#39640;&#29616;&#26377;&#26041;&#27861;&#30340;&#25928;&#29575;&#21644;&#21487;&#34892;&#24615;&#12290;&#29420;&#31435;&#25805;&#20316;&#24182;&#37197;&#22791;&#20808;&#36827;&#20256;&#24863;&#22120;&#30340;&#21322;&#28508;&#24335;&#24179;&#21488;&#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23547;&#25214;&#21644;&#25910;&#38598;&#27700;&#20307;&#20013;&#30340;&#24494;&#22609;&#26009;&#65292;&#20174;&#32780;&#20943;&#23569;&#29983;&#24577;&#24433;&#21709;&#24182;&#25552;&#39640;&#22609;&#26009;&#24223;&#24323;&#29289;&#30340;&#20877;&#21033;&#29992;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02162v1 Announce Type: new  Abstract: Since their invention, plastics have become ubiquitous in modern societies all around the world, and their impact on the environment has, in recent years, become nearly as well-known. Plastics produced by humans have reached nearly every corner of the world, and throughout their centuries-long lifetimes, plastics continually break down into smaller and smaller particles due to the physical stresses which they are subjected to. These stresses eventually, inevitably, break these plastics down into microplastics -pieces of plastic small enough to be consumed by organisms in bodies of water throughout the globe. These microplastics can very easily bioaccumulate, and have been found everywhere from the Great Lakes to the bloodstreams of humans. The effects of these plastics are poorly understood, however, they have been linked to infertility, halted growth, and a host of other maladies in aquatic organisms. Currently, removal of these plastic
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30340;EqvAfford&#26694;&#26550;&#36890;&#36807;&#30830;&#20445;&#28857;&#32423;affordance&#23398;&#20064;&#30340;SE(3)&#31561;&#21464;&#24615;&#65292;&#20026;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#25552;&#20379;&#20248;&#24322;&#30340;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#26080;&#35770;&#29289;&#20307;&#23039;&#24577;&#22914;&#20309;&#12290;</title><link>https://arxiv.org/abs/2408.01953</link><description>&lt;p&gt;
EqvAfford: SE(3)&#31561;&#21464;&#24615;&#23545;&#28857;&#32423; affordance&#23398;&#20064;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
EqvAfford: SE(3) Equivariance for Point-Level Affordance Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01953
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30340;EqvAfford&#26694;&#26550;&#36890;&#36807;&#30830;&#20445;&#28857;&#32423;affordance&#23398;&#20064;&#30340;SE(3)&#31561;&#21464;&#24615;&#65292;&#20026;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#25552;&#20379;&#20248;&#24322;&#30340;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#26080;&#35770;&#29289;&#20307;&#23039;&#24577;&#22914;&#20309;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01953v1&#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#25688;&#35201;&#65306;&#20154;&#31867;&#22312;&#24863;&#30693;&#21644;&#19982;&#19990;&#30028;&#20114;&#21160;&#26102;&#20855;&#26377;&#31561;&#21464;&#24615;&#24847;&#35782;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#19981;&#21516;&#30340;&#29289;&#20307;&#23039;&#24577;&#19979;&#36827;&#34892;&#25805;&#20316;&#12290;&#23545;&#20110;&#26426;&#22120;&#20154;&#25805;&#20316;&#65292;&#31561;&#21464;&#24615;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#20063;&#26159;&#23384;&#22312;&#30340;&#12290;&#20363;&#22914;&#65292;&#26080;&#35770;&#25277;&#23625;&#30340;&#23039;&#24577;&#22914;&#20309;&#65288;&#24179;&#31227;&#12289;&#26059;&#36716;&#21644;&#20542;&#26012;&#65289;&#65292;&#25805;&#20316;&#31574;&#30053;&#37117;&#26159;&#19968;&#33268;&#30340;&#65288;&#25235;&#20303;&#25226;&#25163;&#24182;&#27839;&#30452;&#32447;&#25289;&#21160;&#65289;&#12290;&#23613;&#31649;&#20256;&#32479;&#27169;&#22411;&#36890;&#24120;&#19981;&#20855;&#26377;&#20026;&#26426;&#22120;&#20154;&#25805;&#20316;&#25552;&#20379;&#31561;&#21464;&#24615;&#30340;&#24847;&#35782;&#65292;&#36825;&#21487;&#33021;&#20250;&#23548;&#33268;&#35757;&#32451;&#25152;&#38656;&#30340;&#25968;&#25454;&#36807;&#22810;&#65292;&#24182;&#19988;&#22312;&#26032;&#30340;&#29289;&#20307;&#23039;&#24577;&#19979;&#34920;&#29616;&#19981;&#20339;&#65292;&#20294;&#25105;&#20204;&#25552;&#20986;&#25105;&#20204;&#30340;EqvAfford&#26694;&#26550;&#65292;&#20855;&#26377;&#26032;&#30340;&#35774;&#35745;&#26469;&#20445;&#35777;&#28857;&#32423;affordance&#23398;&#20064;&#20013;&#30340;&#31561;&#21464;&#24615;&#65292;&#23545;&#20110;&#19979;&#28216;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#65292;&#22312;&#20195;&#34920;&#24615;&#30340;&#29289;&#20307;&#19978;&#20855;&#26377;&#22312;&#22810;&#26679;&#23039;&#24577;&#19979;&#34920;&#29616;&#30340;&#20248;&#24322;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01953v1 Announce Type: new  Abstract: Humans perceive and interact with the world with the awareness of equivariance, facilitating us in manipulating different objects in diverse poses. For robotic manipulation, such equivariance also exists in many scenarios. For example, no matter what the pose of a drawer is (translation, rotation and tilt), the manipulation strategy is consistent (grasp the handle and pull in a line). While traditional models usually do not have the awareness of equivariance for robotic manipulation, which might result in more data for training and poor performance in novel object poses, we propose our EqvAfford framework, with novel designs to guarantee the equivariance in point-level affordance learning for downstream robotic manipulation, with great performance and generalization ability on representative tasks on objects in diverse poses.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;PnP&#27714;&#35299;&#22120;&#65292;&#25552;&#39640;&#20102;&#23545;&#22122;&#22768;&#25968;&#25454;&#30340;&#40065;&#26834;&#24615;&#65292;&#24182;&#22312;&#22810;&#31181;&#23039;&#21183;&#20272;&#35745;&#22330;&#26223;&#20013;&#25552;&#20379;&#20102;&#26356;&#20934;&#30830;&#30340;&#21442;&#25968;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2408.01945</link><description>&lt;p&gt;
&#20223;&#23556;n&#28857;&#38382;&#39064;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Generalized Maximum Likelihood Estimation for Perspective-n-Point Problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01945
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;PnP&#27714;&#35299;&#22120;&#65292;&#25552;&#39640;&#20102;&#23545;&#22122;&#22768;&#25968;&#25454;&#30340;&#40065;&#26834;&#24615;&#65292;&#24182;&#22312;&#22810;&#31181;&#23039;&#21183;&#20272;&#35745;&#22330;&#26223;&#20013;&#25552;&#20379;&#20102;&#26356;&#20934;&#30830;&#30340;&#21442;&#25968;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01945v1 &#20844;&#21578;&#31867;&#22411;: &#20132;&#21449; &#25688;&#35201;: &#35270;&#22270;n&#20010;&#28857;(PnP)&#38382;&#39064;&#22312;&#25991;&#29486;&#20013;&#24471;&#21040;&#20102;&#24191;&#27867;&#30340;&#30740;&#31350;&#65292;&#24182;&#22312;&#21508;&#31181;&#22522;&#20110;&#35270;&#35273;&#30340;&#23039;&#24577;&#20272;&#35745;&#22330;&#26223;&#20013;&#24471;&#21040;&#20102;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#26412;&#25991;&#22312;&#20960;&#20010;&#29616;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#38598;&#20013;&#23637;&#31034;&#20102;&#29616;&#26377;&#26041;&#27861;&#30340;&#19981;&#36275;&#20043;&#22788;&#65292;&#36825;&#20123;&#26041;&#27861;&#24573;&#30053;&#20102;&#35266;&#27979;&#25968;&#25454;&#30340;&#21508;&#21521;&#24322;&#24615;&#19981;&#30830;&#23450;&#24615;&#12290;&#36825;&#31181;&#24573;&#35270;&#21487;&#33021;&#23548;&#33268;&#22312;&#23384;&#22312;&#22122;&#22768;&#35266;&#27979;&#20540;&#30340;&#24773;&#20917;&#19979;&#24471;&#20986;&#27425;&#20248;&#21644;&#19981;&#20934;&#30830;&#30340;&#20272;&#35745;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;PnP&#27714;&#35299;&#22120;&#65292;&#21517;&#20026;GMLPnP&#65292;&#23427;&#36890;&#36807;&#36845;&#20195;GLS&#31243;&#24207;&#26469;&#21516;&#26102;&#20272;&#35745;&#23039;&#24577;&#21644;&#19981;&#30830;&#23450;&#24615;&#12290;&#27492;&#22806;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#19982;&#30456;&#26426;&#27169;&#22411;&#26080;&#20851;&#12290;&#21512;&#25104;&#21644;&#30495;&#23454;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#24120;&#35265;&#30340;&#23039;&#24577;&#20272;&#35745;&#24773;&#26223;&#20013;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#31934;&#24230;&#65292;&#19982;&#26368;&#20339;&#22522;&#20934;&#26041;&#27861;&#30456;&#27604;&#65292;GMLPnP&#22312;TUM-RGBD&#21644;KITTI-360&#25968;&#25454;&#38598;&#19978;&#30340;&#26059;&#36716;/&#24179;&#31227;&#31934;&#24230;&#20998;&#21035;&#25552;&#39640;&#20102;4.7%/2.0%&#21644;18.6%/18.4%&#12290;&#23427;&#23545;&#22122;&#22768;&#30340;&#40065;&#26834;&#24615;&#26356;&#22909;&#65292;&#23545;&#21442;&#25968;&#30340;&#20272;&#35745;&#20063;&#26356;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01945v1 Announce Type: cross  Abstract: The Perspective-n-Point (PnP) problem has been widely studied in the literature and applied in various vision-based pose estimation scenarios. However, existing methods ignore the anisotropy uncertainty of observations, as demonstrated in several real-world datasets in this paper. This oversight may lead to suboptimal and inaccurate estimation, particularly in the presence of noisy observations. To this end, we propose a generalized maximum likelihood PnP solver, named GMLPnP, that minimizes the determinant criterion by iterating the GLS procedure to estimate the pose and uncertainty simultaneously. Further, the proposed method is decoupled from the camera model. Results of synthetic and real experiments show that our method achieves better accuracy in common pose estimation scenarios, GMLPnP improves rotation/translation accuracy by 4.7%/2.0% on TUM-RGBD and 18.6%/18.4% on KITTI-360 dataset compared to the best baseline. It is more ac
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#30005;&#21050;&#28608;&#25216;&#26415;&#65292;&#30740;&#31350;&#22242;&#38431;&#24320;&#21457;&#20102;&#19968;&#31181;&#20154;&#24037;&#36171;&#33021;&#33258;&#28982;&#21160;&#29289;&#26234;&#33021;&#30340;&#36719;&#26426;&#22120;&#20154;&#65292;&#26377;&#26395;&#29992;&#20110;&#29615;&#22659;&#33258;&#20027;&#25506;&#32034;&#12289;&#23548;&#33322;&#20197;&#21450;&#23454;&#26102;&#34892;&#20026;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2408.01941</link><description>&lt;p&gt;
&#31456;&#40060;&#26234;&#33021;&#20307;&#65306;&#21033;&#29992;&#33258;&#28982;&#29983;&#21629;&#20307;&#26234;&#33021;&#36719;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
A Jellyfish Cyborg: Exploiting Natural Embodied Intelligence as Soft Robots
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01941
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#30005;&#21050;&#28608;&#25216;&#26415;&#65292;&#30740;&#31350;&#22242;&#38431;&#24320;&#21457;&#20102;&#19968;&#31181;&#20154;&#24037;&#36171;&#33021;&#33258;&#28982;&#21160;&#29289;&#26234;&#33021;&#30340;&#36719;&#26426;&#22120;&#20154;&#65292;&#26377;&#26395;&#29992;&#20110;&#29615;&#22659;&#33258;&#20027;&#25506;&#32034;&#12289;&#23548;&#33322;&#20197;&#21450;&#23454;&#26102;&#34892;&#20026;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#29983;&#29289;&#21551;&#21457;&#26426;&#22120;&#20154;&#39046;&#22495;&#20013;&#29983;&#29289;&#26426;&#22120;&#20154;&#30340;&#26032;&#20852;&#36235;&#21183;&#65292;&#29305;&#21035;&#26159;&#22914;&#20309;&#23558;&#24037;&#31243;&#25216;&#26415;&#19982;&#29983;&#29289;&#31995;&#32479;&#25104;&#21151;&#25972;&#21512;&#12290;&#30740;&#31350;&#22242;&#38431;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#23637;&#31034;&#20102;&#20154;&#24037;&#33021;&#22815;&#36171;&#33021;&#33258;&#28982;&#21160;&#29289;&#29983;&#21629;&#30340;&#26234;&#33021;&#65292;&#27604;&#22914;&#36890;&#36807;&#30005;&#20449;&#21495;&#20419;&#36827;&#28023;&#40863;&#36895;&#24230;&#65292;&#36827;&#19968;&#27493;&#24320;&#25299;&#20102;&#29983;&#21629;&#20307;&#26234;&#33021;&#22312;&#21508;&#31181;&#29615;&#22659;&#19979;&#30340;&#33258;&#20027;&#25506;&#32034;&#65292;&#23548;&#33322;&#25511;&#21046;&#19982;&#23454;&#26102;&#34892;&#20026;&#39044;&#27979;&#39046;&#22495;&#30340;&#24212;&#29992;&#12290;&#35770;&#25991;&#35814;&#32454;&#20171;&#32461;&#20102;&#30740;&#31350;&#22242;&#38431;&#24320;&#21457;&#30340;&#29983;&#29702;&#25968;&#25454;&#25910;&#38598;&#31995;&#32479;&#19982;&#21050;&#28608;&#28023;&#40863;&#30340;&#26080;&#23475;&#20154;&#24037;&#29615;&#22659;&#19982;&#26041;&#27861;&#12290;&#36890;&#36807;&#31934;&#32454;&#20998;&#26512;&#33258;&#28982;&#34892;&#20026;&#19982;&#36890;&#36807;&#21050;&#28608;&#26465;&#20214;&#35825;&#23548;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#25581;&#31034;&#20102;&#33258;&#28982;&#19982;&#20154;&#24037;&#34892;&#20026;&#27169;&#24335;&#20043;&#38388;&#24046;&#24322;&#12290;&#24212;&#29992;&#20102;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#20998;&#26512;&#27880;&#23556;&#21518;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#24182;&#23545;&#26410;&#26469;&#30340;&#28023;&#40863;&#26234;&#33021;&#20307;&#24212;&#29992;&#25552;&#20986;&#20102;&#23637;&#26395;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01941v1 Announce Type: new  Abstract: In the advanced field of bio-inspired robotics, the emergence of cyborgs represents the successful integration of engineering and biological systems. Building on previous research that showed how electrical stimuli could initiate and speed up a jellyfish's movement, this study presents a groundbreaking approach that explores how the natural embodied intelligence of the animal can be harnessed to address pivotal challenges such as spontaneous exploration, navigation in various environments, control of whole-body motion, and real-time predictions of behavior. We have developed a comprehensive data acquisition system and a unique setup for stimulating jellyfish, allowing for a detailed study of their movements. Through careful analysis of both spontaneous behaviors and behaviors induced by targeted stimulation, we have identified subtle differences between natural and induced motion patterns. By using a machine learning method called physic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21487;&#25193;&#23637;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;VFSTL&#65292;&#36890;&#36807;&#20248;&#21270;&#20215;&#20540;&#20989;&#25968;&#26469;&#25552;&#39640;&#20449;&#21495;&#26102;&#31354;&#36923;&#36753;&#65288;STL&#65289;&#35268;&#33539;&#30340;&#28385;&#36275;&#24230;&#65292;&#26080;&#38656;&#25163;&#21160;&#35859;&#35789;&#65292;&#24182;&#19988;&#33021;&#22815;&#22788;&#29702;&#22797;&#26434;&#20219;&#21153;&#30340;&#38271;&#26399;&#35268;&#21010;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2408.01923</link><description>&lt;p&gt;
&#22522;&#20110;&#20449;&#21495;&#26102;&#31354;&#36923;&#36753;&#30340;&#21487;&#25193;&#23637;&#24378;&#21270;&#23398;&#20064;&#33539;&#24335;&#65306;&#20215;&#20540;&#20989;&#25968;&#31354;&#38388;&#20248;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Scalable Signal Temporal Logic Guided Reinforcement Learning via Value Function Space Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01923
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21487;&#25193;&#23637;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;VFSTL&#65292;&#36890;&#36807;&#20248;&#21270;&#20215;&#20540;&#20989;&#25968;&#26469;&#25552;&#39640;&#20449;&#21495;&#26102;&#31354;&#36923;&#36753;&#65288;STL&#65289;&#35268;&#33539;&#30340;&#28385;&#36275;&#24230;&#65292;&#26080;&#38656;&#25163;&#21160;&#35859;&#35789;&#65292;&#24182;&#19988;&#33021;&#22815;&#22788;&#29702;&#22797;&#26434;&#20219;&#21153;&#30340;&#38271;&#26399;&#35268;&#21010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01923v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#21457;&#24067; &#25688;&#35201;&#65306;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#19982;&#24418;&#24335;&#26041;&#27861;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#24050;&#32463;&#26174;&#31034;&#20986;&#35299;&#20915;&#38271;&#26399;&#35745;&#21010;&#38382;&#39064;&#30340;&#26032;&#24605;&#36335;&#12290;&#20256;&#32479;&#30340;&#26041;&#27861;&#36890;&#24120;&#28041;&#21450;&#21040;&#29366;&#24577;&#21644;&#21160;&#20316;&#31354;&#38388;&#30340;&#25277;&#35937;&#20197;&#21450;&#25163;&#21160;&#21019;&#24314;&#30340;&#26631;&#27880;&#20989;&#25968;&#25110;&#35859;&#35789;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#20219;&#21153;&#21464;&#24471;&#36234;&#26469;&#36234;&#22797;&#26434;&#65292;&#36825;&#20123;&#26041;&#27861;&#30340;&#25928;&#29575;&#20250;&#19979;&#38477;&#65292;&#23548;&#33268;&#25152;&#38656;&#30340;&#25163;&#21160;&#35859;&#35789;&#25968;&#37327;&#21576;&#25351;&#25968;&#22686;&#38271;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#27169;&#22411;-&#22522;&#30784;RL&#26694;&#26550;&#65292;&#31216;&#20026;VFSTL&#65292;&#35813;&#26694;&#26550;&#33021;&#22815;&#26080;&#38656;&#20351;&#29992;&#25163;&#21160;&#21019;&#24314;&#30340;&#35859;&#35789;&#65292;&#36890;&#36807;&#35843;&#24230;&#39044;&#35757;&#32451;&#30340;&#25216;&#33021;&#26469;&#36981;&#24490;&#26410;&#30693;&#30340;STL&#35268;&#33539;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01923v1 Announce Type: new  Abstract: The integration of reinforcement learning (RL) and formal methods has emerged as a promising framework for solving long-horizon planning problems. Conventional approaches typically involve abstraction of the state and action spaces and manually created labeling functions or predicates. However, the efficiency of these approaches deteriorates as the tasks become increasingly complex, which results in exponential growth in the size of labeling functions or predicates. To address these issues, we propose a scalable model-based RL framework, called VFSTL, which schedules pre-trained skills to follow unseen STL specifications without using hand-crafted predicates. Given a set of value functions obtained by goal-conditioned RL, we formulate an optimization problem to maximize the robustness value of Signal Temporal Logic (STL) defined specifications, which is computed using value functions as predicates. To further reduce the computation burde
&lt;/p&gt;</description></item><item><title>BEVPlace++&#21033;&#29992;&#36731;&#37327;&#32423;CNNs&#20174;BEV&#22270;&#20687;&#20013;&#25552;&#21462;&#29305;&#24449;&#65292;&#36890;&#36807;&#20301;&#32622;&#35782;&#21035;&#21644;3-DoF&#23450;&#20301;&#20272;&#35745;&#23454;&#29616;&#20102;&#26080;&#20154;&#22320;&#38754;&#36710;&#36742;&#28608;&#20809;&#38647;&#36798;&#20840;&#23616;&#23450;&#20301;&#30340;&#24555;&#36895;&#12289;&#40065;&#26834;&#19988;&#31934;&#20934;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2408.01841</link><description>&lt;p&gt;
BEVPlace++:&#24555;&#36895;&#12289;&#40065;&#26834;&#19988;&#36731;&#37327;&#32423;&#30340;&#26080;&#20154;&#22320;&#38754;&#36710;&#36742;&#28608;&#20809;&#38647;&#36798;&#20840;&#23616;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
BEVPlace++: Fast, Robust, and Lightweight LiDAR Global Localization for Unmanned Ground Vehicles
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01841
&lt;/p&gt;
&lt;p&gt;
BEVPlace++&#21033;&#29992;&#36731;&#37327;&#32423;CNNs&#20174;BEV&#22270;&#20687;&#20013;&#25552;&#21462;&#29305;&#24449;&#65292;&#36890;&#36807;&#20301;&#32622;&#35782;&#21035;&#21644;3-DoF&#23450;&#20301;&#20272;&#35745;&#23454;&#29616;&#20102;&#26080;&#20154;&#22320;&#38754;&#36710;&#36742;&#28608;&#20809;&#38647;&#36798;&#20840;&#23616;&#23450;&#20301;&#30340;&#24555;&#36895;&#12289;&#40065;&#26834;&#19988;&#31934;&#20934;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;BEVPlace++&#30340;&#26032;&#22411;&#12289;&#24555;&#36895;&#19988;&#40065;&#26834;&#30340;&#28608;&#20809;&#38647;&#36798;&#20840;&#23616;&#23450;&#20301;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19987;&#20026;&#26080;&#20154;&#22320;&#38754;&#36710;&#36742;&#32780;&#35774;&#35745;&#12290;&#23427;&#20351;&#29992;&#36731;&#37327;&#32423;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNNs&#65289;&#23545;&#28608;&#20809;&#38647;&#36798;&#25968;&#25454;&#30340;&#40479;&#30640;&#22270;&#65288;BEV&#65289;&#22270;&#20687;&#34920;&#31034;&#24418;&#24335;&#36827;&#34892;&#22788;&#29702;&#65292;&#36890;&#36807;&#35782;&#21035;&#20840;&#23616;&#23450;&#20301;&#20013;&#30340;&#20301;&#32622;&#35782;&#21035;&#21644;&#21518;&#36319;&#30340;&#19977;&#36724;&#23450;&#20301;&#20272;&#35745;&#26469;&#23454;&#29616;&#20934;&#30830;&#30340;&#23450;&#20301;&#12290;&#25105;&#20204;&#30340;&#35814;&#32454;&#20998;&#26512;&#25581;&#31034;&#20102;&#19968;&#20010;&#26377;&#36259;&#30340;&#20107;&#23454;&#65292;&#21363;CNNs&#22312;&#20174;&#28608;&#20809;&#38647;&#36798;BEV&#22270;&#20687;&#20013;&#25552;&#21462;&#29305;&#24449;&#26041;&#38754;&#20855;&#26377;&#22266;&#26377;&#30340;&#26377;&#25928;&#24615;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#20351;&#29992;CNN&#25552;&#21462;&#30340;&#29305;&#24449;&#65292;&#20004;&#20010;BEV&#22270;&#20687;&#30340;&#20851;&#38190;&#28857;&#21487;&#20197;&#26377;&#25928;&#22320;&#21305;&#37197;&#65292;&#21363;&#20351;&#23427;&#20204;&#30340;&#36317;&#31163;&#36739;&#22823;&#12290;&#22522;&#20110;&#36825;&#20010;&#27934;&#23519;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#26059;&#36716;&#31561;&#21464;&#27169;&#22359;&#65288;REM&#65289;&#26469;&#25552;&#21462;&#20851;&#38190;&#30340;&#29305;&#24449;&#24182;&#22686;&#24378;&#26059;&#36716;&#21464;&#21270;&#26102;&#30340;&#40065;&#26834;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26059;&#36716;&#31561;&#21464;&#21644;&#31561;&#21464;&#32593;&#32476;&#65288;REIN&#65289;&#65292;&#23427;&#36890;&#36807;&#20018;&#32852;REM&#21644;&#25551;&#36848;&#31526;&#29983;&#25104;&#22120;NetVLAD&#26469;&#35774;&#35745;&#65292;&#20197;&#39034;&#24207;&#29983;&#25104;&#26059;&#36716;&#31561;&#21464;&#26412;&#22320;&#29305;&#24449;&#65292;&#24182;&#32467;&#21512;&#20840;&#23616;&#25935;&#24863;&#24615;&#32858;&#21512;&#21644;&#27880;&#24847;&#21147;&#26426;&#21046;&#65292;&#25552;&#39640;&#20840;&#23616;&#23450;&#20301;&#30340;&#20934;&#30830;&#24615;&#12290;&#26368;&#32456;&#23454;&#39564;&#35777;&#26126;&#65292;BEVPlace++&#22312;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26356;&#39640;&#30340;&#23450;&#20301;&#31934;&#24230;&#65292;&#19988;&#22312;&#22823;&#37096;&#20998;&#22330;&#26223;&#19979;&#36895;&#24230;&#27604;&#29616;&#26377;&#30340;&#26041;&#27861;&#24555;&#20102;3-5&#20493;&#65292;&#21516;&#26102;&#20855;&#26377;&#36739;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01841v1 Announce Type: new  Abstract: This article introduces BEVPlace++, a novel, fast, and robust LiDAR global localization method for unmanned ground vehicles. It uses lightweight convolutional neural networks (CNNs) on Bird's Eye View (BEV) image-like representations of LiDAR data to achieve accurate global localization through place recognition followed by 3-DoF pose estimation. Our detailed analyses reveal an interesting fact that CNNs are inherently effective at extracting distinctive features from LiDAR BEV images. Remarkably, keypoints of two BEV images with large translations can be effectively matched using CNN-extracted features. Building on this insight, we design a rotation equivariant module (REM) to obtain distinctive features while enhancing robustness to rotational changes. A Rotation Equivariant and Invariant Network (REIN) is then developed by cascading REM and a descriptor generator, NetVLAD, to sequentially generate rotation equivariant local features a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#30340;diS-Graph&#26041;&#27861;&#36890;&#36807;&#32467;&#21512;&#24314;&#31569;&#34013;&#22270;&#20449;&#24687;&#21644;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#25910;&#38598;&#30340;&#25968;&#25454;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#20559;&#24046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#33021;&#26377;&#25928;&#25552;&#39640;&#26426;&#22120;&#20154;&#30340;&#23450;&#20301;&#21644;&#22320;&#22270;&#26500;&#24314;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2408.01737</link><description>&lt;p&gt;
&#23454;&#26102;&#23450;&#20301;&#19982;&#22320;&#22270;&#26500;&#24314;&#22312;&#26377;&#21464;&#21160;&#30340;&#24314;&#31569;&#34013;&#22270;&#20013;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Real-time Localization and Mapping in Architectural Plans with Deviations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01737
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#30340;diS-Graph&#26041;&#27861;&#36890;&#36807;&#32467;&#21512;&#24314;&#31569;&#34013;&#22270;&#20449;&#24687;&#21644;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#25910;&#38598;&#30340;&#25968;&#25454;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#20559;&#24046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#33021;&#26377;&#25928;&#25552;&#39640;&#26426;&#22120;&#20154;&#30340;&#23450;&#20301;&#21644;&#22320;&#22270;&#26500;&#24314;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01737v1 &#36890;&#21578;&#31867;&#22411;&#65306;&#26032; Abstract: &#25317;&#26377;&#29615;&#22659;&#30340;&#20808;&#39564;&#30693;&#35782;&#33021;&#22815;&#25552;&#39640;&#26426;&#22120;&#20154;&#23450;&#20301;&#21644;&#22320;&#22270;&#26500;&#24314;&#30340;&#20934;&#30830;&#24615;&#12290;&#25991;&#29486;&#20013;&#24050;&#32463;&#25552;&#20986;&#20102;&#22810;&#20010;&#21033;&#29992;&#24314;&#31569;&#34013;&#22270;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#20960;&#20046;&#25152;&#26377;&#30340;&#26041;&#27861;&#37117;&#24573;&#30053;&#20102;&#23454;&#38469;&#30340;&#24314;&#31569;&#29615;&#22659;&#19982;&#39044;&#20808;&#35774;&#35745;&#30340;&#24314;&#31569;&#35774;&#35745;&#20043;&#38388;&#30340;&#20559;&#24046;&#65292;&#36825;&#23548;&#33268;&#20102;&#20272;&#35745;&#30340;&#20559;&#24046;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#23450;&#20301;&#21644;&#22320;&#22270;&#26500;&#24314;&#26041;&#27861;&#65292;&#31216;&#20043;&#20026;&#8220;&#24102;&#26377;&#20559;&#24046;&#20449;&#24687;&#30340;&#23616;&#21183;&#22270;&#8221;&#25110;&#8220;diS-Graph&#8221;&#65292;&#35813;&#26041;&#27861;&#21363;&#20351;&#22312;&#23384;&#22312;&#20559;&#24046;&#30340;&#24773;&#20917;&#19979;&#20063;&#33021;&#25972;&#21512;&#20174;&#24314;&#31569;&#34013;&#22270;&#33719;&#24471;&#30340;&#20808;&#39564;&#30693;&#35782;&#12290;&#23427;&#22522;&#20110;&#8220;&#23616;&#21183;&#22270;&#8221;(S-Graph)&#65292;&#36825;&#26159;&#19968;&#31181;&#23558;&#29615;&#22659;&#30340;&#20960;&#20309;&#27169;&#22411;&#19982;3D&#22330;&#26223;&#22270;&#21512;&#24182;&#21040;&#21487;&#20197;&#32852;&#21512;&#20248;&#21270;&#30340;&#22810;&#23618;&#27425;&#22240;&#23376;&#22270;&#20013;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;diS-Graph&#36890;&#36807;&#39318;&#20808;&#23558;&#24314;&#31569;&#34013;&#22270;&#24314;&#27169;&#20026;&#19968;&#20010;&#23618;&#27425;&#21270;&#30340;&#22240;&#23376;&#22270;&#65292;&#25105;&#20204;&#23558;&#31216;&#20043;&#20026;&#8220;&#24314;&#31569;&#22270;&#8221;(A-Graph)&#65292;&#26469;&#25552;&#21462;&#30456;&#20851;&#20449;&#24687;&#12290;&#32780;&#26426;&#22120;&#20154;&#25506;&#32034;&#23454;&#38469;&#29615;&#22659;&#26102;&#65292;diS-Graph&#33021;&#22815;&#26377;&#25928;&#32467;&#21512;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#21644;&#24314;&#31569;&#34013;&#22270;&#20449;&#24687;&#65292;&#20174;&#32780;&#25552;&#39640;&#23450;&#20301;&#21644;&#22320;&#22270;&#26500;&#24314;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;diS-Graph&#33021;&#22815;&#23454;&#26102;&#35843;&#25972;&#65292;&#36866;&#24212;&#31361;&#21457;&#29366;&#20917;&#21644;&#26410;&#30693;&#20559;&#24046;&#65292;&#30830;&#20445;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#20559;&#31163;&#39044;&#35774;&#35774;&#35745;&#30340;&#24773;&#20917;&#19979;&#20381;&#28982;&#33021;&#22815;&#36827;&#34892;&#20934;&#30830;&#30340;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01737v1 Announce Type: new  Abstract: Having prior knowledge of an environment boosts the localization and mapping accuracy of robots. Several approaches in the literature have utilized architectural plans in this regard. However, almost all of them overlook the deviations between actual as-built environments and as-planned architectural designs, introducing bias in the estimations. To address this issue, we present a novel localization and mapping method denoted as deviations-informed Situational Graphs or diS-Graphs that integrates prior knowledge from architectural plans even in the presence of deviations. It is based on Situational Graphs (S-Graphs) that merge geometric models of the environment with 3D scene graphs into a multi-layered jointly optimizable factor graph. Our diS-Graph extracts information from architectural plans by first modeling them as a hierarchical factor graph, which we will call an Architectural Graph (A-Graph). While the robot explores the real en
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#22810;&#31181;&#35270;&#35273;-&#24815;&#24615;SLAM&#31995;&#32479;&#36827;&#34892;&#20102;&#20892;&#19994;&#26426;&#22120;&#20154;&#22330;&#26223;&#19979;&#30340;&#24615;&#33021;&#35780;&#20272;&#65292;&#37325;&#28857;&#20998;&#26512;&#20102;&#38381;&#29615;&#38381;&#21512;&#23545;&#23450;&#20301;&#31934;&#24230;&#21644;&#35745;&#31639;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2408.01716</link><description>&lt;p&gt;
&#20892;&#19994;&#26426;&#22120;&#20154;&#35270;&#35273;-&#24815;&#24615;SLAM: &#29992;&#20110;&#22522;&#20934;&#27979;&#35797;&#38381;&#29615;&#38381;&#21512;&#30340;&#22909;&#22788;&#21644;&#35745;&#31639;&#25104;&#26412;&#30340;&#24615;&#33021;
&lt;/p&gt;
&lt;p&gt;
Visual-Inertial SLAM for Agricultural Robotics: Benchmarking the Benefits and Computational Costs of Loop Closing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01716
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#22810;&#31181;&#35270;&#35273;-&#24815;&#24615;SLAM&#31995;&#32479;&#36827;&#34892;&#20102;&#20892;&#19994;&#26426;&#22120;&#20154;&#22330;&#26223;&#19979;&#30340;&#24615;&#33021;&#35780;&#20272;&#65292;&#37325;&#28857;&#20998;&#26512;&#20102;&#38381;&#29615;&#38381;&#21512;&#23545;&#23450;&#20301;&#31934;&#24230;&#21644;&#35745;&#31639;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01716v1 &#20844;&#21578;&#31867;&#22411;: &#26032;  &#25688;&#35201;: &#21516;&#27493;&#23450;&#20301;&#19982;&#22320;&#22270;&#26500;&#24314;(SLAM)&#23545;&#20110;&#31227;&#21160;&#26426;&#22120;&#20154;&#33267;&#20851;&#37325;&#35201;&#65292;&#23427;&#22312;&#19981;&#20381;&#36182;&#20110;&#22806;&#37096;&#23450;&#20301;&#31995;&#32479;&#30340;&#24773;&#20917;&#19979;&#65292;&#20801;&#35768;&#22312;&#21160;&#24577;&#21644;&#38750;&#32467;&#26500;&#21270;&#30340;&#25143;&#22806;&#29615;&#22659;&#20013;&#36827;&#34892;&#33258;&#20027;&#23548;&#33322;&#12290;&#22312;&#20892;&#19994;&#24212;&#29992;&#20013;&#65292;&#30001;&#20110;&#29031;&#26126;&#25110;&#22825;&#27668;&#26465;&#20214;&#30340;&#21487;&#21464;&#24615;&#65292;&#35270;&#35273;-&#24815;&#24615;SLAM&#24050;&#25104;&#20026;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#23545;&#20960;&#31181;&#24320;&#28304;&#35270;&#35273;-&#24815;&#24615;SLAM&#31995;&#32479;&#36827;&#34892;&#20102;&#22522;&#20934;&#27979;&#35797;&#65292;&#21253;&#25324;ORB-SLAM3&#12289;VINS-Fusion&#12289;OpenVINS&#12289;Kimera&#21644;SVO Pro&#65292;&#20197;&#35780;&#20272;&#36825;&#20123;&#31995;&#32479;&#22312;&#20892;&#19994;&#29615;&#22659;&#20013;&#30340;&#34920;&#29616;&#12290;&#25105;&#20204;&#20391;&#37325;&#20110;&#38381;&#29615;&#38381;&#21512;&#23545;&#23450;&#20301;&#31934;&#24230;&#21644;&#35745;&#31639;&#38656;&#27714;&#30340;&#24433;&#21709;&#65292;&#25552;&#20379;&#20102;&#36825;&#20123;&#31995;&#32479;&#22312;&#23454;&#38469;&#24037;&#20316;&#29615;&#22659;&#20013;&#30340;&#26377;&#25928;&#24615;&#20998;&#26512;&#65292;&#23588;&#20854;&#26159;&#23427;&#20204;&#22312;&#20892;&#19994;&#26426;&#22120;&#20154;&#23884;&#20837;&#24335;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#36824;&#21253;&#25324;&#23545;&#24103;&#29575;&#21464;&#21270;&#23545;&#23450;&#20301;&#31934;&#24230;&#24433;&#21709;&#30340;&#35780;&#20272;&#65292;&#20197;&#21450;&#23545;&#19981;&#21516;&#31995;&#32479;&#22312;&#38451;&#20809;&#30452;&#23556;&#21644;&#36974;&#25377;&#19979;&#30340;&#24615;&#33021;&#27604;&#36739;&#65292;&#20197;&#21450;&#22312;&#39640;&#37325;&#22797;&#24615;&#22330;&#26223;&#20013;&#30340;&#34920;&#29616;&#35780;&#20272;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#20892;&#19994;&#26426;&#22120;&#20154;&#23548;&#33322;&#65292;&#38381;&#29615;&#38381;&#21512;&#26174;&#33879;&#25552;&#39640;&#20102;&#23450;&#20301;&#31934;&#24230;&#65292;&#20294;&#21516;&#26102;&#20063;&#22686;&#21152;&#20102;&#35745;&#31639;&#25104;&#26412;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#19981;&#21516;&#31995;&#32479;&#22312;&#33021;&#37327;&#28040;&#32791;&#26041;&#38754;&#30340;&#34920;&#29616;&#65292;&#20026;&#23884;&#20837;&#24335;&#31995;&#32479;&#20013;&#28508;&#22312;&#30340;&#33021;&#28304;&#20248;&#21270;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#23558;&#20026;&#20892;&#19994;&#26426;&#22120;&#20154;&#20013;&#30340;&#35270;&#35273;-&#24815;&#24615;SLAM&#30340;&#36873;&#22411;&#25552;&#20379;&#37325;&#35201;&#21442;&#32771;&#65292;&#24182;&#20026;&#26410;&#26469;&#30740;&#31350;&#25351;&#26126;&#20102;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01716v1 Announce Type: new  Abstract: Simultaneous Localization and Mapping (SLAM) is essential for mobile robotics, enabling autonomous navigation in dynamic, unstructured outdoor environments without relying on external positioning systems. In agricultural applications, where environmental conditions can be particularly challenging due to variable lighting or weather conditions, Visual-Inertial SLAM has emerged as a potential solution. This paper benchmarks several open-source Visual-Inertial SLAM systems, including ORB-SLAM3, VINS-Fusion, OpenVINS, Kimera, and SVO Pro, to evaluate their performance in agricultural settings. We focus on the impact of loop closing on localization accuracy and computational demands, providing a comprehensive analysis of these systems' effectiveness in real-world environments and especially their application to embedded systems in agricultural robotics. Our contributions further include an assessment of varying frame rates on localization acc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#27454;&#22810;&#26059;&#32764;&#26080;&#20154;&#26426;&#21407;&#22411;&#65292;&#21363;&#20351;&#22312;&#26059;&#32764;&#21457;&#29983;&#25925;&#38556;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#33021;&#36827;&#34892;&#31934;&#30830;&#30528;&#38470;&#65292;&#24182;&#36890;&#36807;&#20809;&#23398;&#23548;&#33322;&#31995;&#32479;&#30830;&#20445;&#20102;&#36895;&#24230;&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;</title><link>https://arxiv.org/abs/2408.01676</link><description>&lt;p&gt;
&#36718;&#24335;&#26080;&#20154;&#26426;&#30340;&#31934;&#30830;&#38477;&#33853;&#21407;&#22411;&#35774;&#35745;&#65292;&#21363;&#20351;&#21457;&#29983;&#26059;&#32764;&#25925;&#38556;&#20063;&#33021;&#36816;&#20316;
&lt;/p&gt;
&lt;p&gt;
Prototyping of a multirotor UAV for precision landing under rotor failures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01676
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#27454;&#22810;&#26059;&#32764;&#26080;&#20154;&#26426;&#21407;&#22411;&#65292;&#21363;&#20351;&#22312;&#26059;&#32764;&#21457;&#29983;&#25925;&#38556;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#33021;&#36827;&#34892;&#31934;&#30830;&#30528;&#38470;&#65292;&#24182;&#36890;&#36807;&#20809;&#23398;&#23548;&#33322;&#31995;&#32479;&#30830;&#20445;&#20102;&#36895;&#24230;&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#26059;&#32764;&#26080;&#20154;&#39134;&#34892;&#22120;&#21407;&#22411;&#35774;&#35745;&#65292;&#33021;&#22815;&#22312;&#26059;&#32764;&#25925;&#38556;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616;&#31934;&#30830;&#38477;&#33853;&#12290;&#35770;&#25991;&#20013;&#38416;&#36848;&#20102;&#25925;&#38556;&#23481;&#38169;&#25216;&#26415;&#12289;&#26426;&#26800;&#35774;&#35745;&#21644;&#24517;&#19981;&#21487;&#23569;&#30340;&#20809;&#23398;&#23548;&#33322;&#31995;&#32479;&#65292;&#20197;&#30830;&#20445;&#31934;&#30830;&#30340;&#33258;&#23450;&#20041;&#30528;&#38470;&#12290;&#23454;&#39564;&#21021;&#27493;&#25104;&#26524;&#23558;&#34987;&#23637;&#31034;&#65292;&#29992;&#20197;&#39564;&#35777;&#25925;&#38556;&#23481;&#38169;&#25511;&#21046;&#36710;&#36742;&#30340;&#24615;&#33021;&#20197;&#21450;&#33258;&#20027;&#38477;&#33853;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#36824;&#23558;&#23637;&#31034;&#19968;&#20010;&#22810;&#26059;&#32764;&#26080;&#20154;&#39134;&#34892;&#22120;&#21407;&#22411;&#35774;&#35745;&#65292;&#23427;&#20855;&#22791;&#22312;&#25925;&#38556;&#24773;&#20917;&#19979;&#23454;&#29616;&#31934;&#30830;&#33258;&#20027;&#20219;&#21153;&#30340;&#33021;&#21147;&#65292;&#24182;&#23558;&#29992;&#20110;&#26410;&#26469;&#30340;&#23454;&#39564;&#27979;&#35797;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01676v1 Announce Type: new  Abstract: This work presents a prototype of a multirotor aerial vehicle capable of precision landing, even under the effects of rotor failures. The manuscript presents the fault-tolerant techniques and mechanical designs to achieve a fault-tolerant multirotor, and a vision-based navigation system required to achieve a precision landing. Preliminary experimental results will be shown, to validate on one hand the fault-tolerant control vehicle and, on the other hand, the autonomous landing algorithm. Also, a prototype of the fault-tolerant UAV is presented, capable of precise autonomous landing, which will be used in future experiments.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#28040;&#36153;&#22411;&#36710;&#36742;&#19978;&#30340;GNSS&#25968;&#25454;&#21644;&#25668;&#20687;&#22836;&#22270;&#20687;&#36827;&#34892;&#36947;&#36335;&#22270;&#33258;&#21160;&#21019;&#24314;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#20165;&#25552;&#39640;&#20102;&#21019;&#24314;&#36947;&#36335;&#22270;&#30340;&#20934;&#30830;&#24615;&#65292;&#36824;&#22823;&#22823;&#20943;&#23569;&#20102;&#25152;&#38656;&#30340;&#24037;&#20316;&#37327;&#21644;&#25104;&#26412;&#12290;</title><link>https://arxiv.org/abs/2408.01640</link><description>&lt;p&gt;
&#21033;&#29992;&#28040;&#36153;&#22411;&#36710;&#36742;&#19978;GNSS&#21644;&#22270;&#20687;&#25968;&#25454;&#36827;&#34892;&#36947;&#36335;&#32593;&#32476;&#20272;&#35745;&#30340;&#21019;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Leveraging GNSS and Onboard Visual Data from Consumer Vehicles for Robust Road Network Estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01640
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#28040;&#36153;&#22411;&#36710;&#36742;&#19978;&#30340;GNSS&#25968;&#25454;&#21644;&#25668;&#20687;&#22836;&#22270;&#20687;&#36827;&#34892;&#36947;&#36335;&#22270;&#33258;&#21160;&#21019;&#24314;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#20165;&#25552;&#39640;&#20102;&#21019;&#24314;&#36947;&#36335;&#22270;&#30340;&#20934;&#30830;&#24615;&#65292;&#36824;&#22823;&#22823;&#20943;&#23569;&#20102;&#25152;&#38656;&#30340;&#24037;&#20316;&#37327;&#21644;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01640v1 &#20844;&#21578;&#31867;&#22411;: &#20132;&#21449; &#25688;&#35201;: &#22320;&#22270;&#23545;&#20110;&#35832;&#22914;&#36710;&#36742;&#23548;&#33322;&#21644;&#33258;&#21160;&#39550;&#39542;&#26426;&#22120;&#20154;&#31561;&#20247;&#22810;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#36825;&#20123;&#24212;&#29992;&#37117;&#38656;&#35201;&#26377;&#25928;&#30340;&#36335;&#32447;&#35268;&#21010;&#21644;&#23450;&#20301;&#31354;&#38388;&#27169;&#22411;&#12290;&#26412;&#25991;&#35299;&#20915;&#20102;&#20026;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#26500;&#24314;&#36947;&#36335;&#22270;&#30340;&#25361;&#25112;&#12290;&#23613;&#31649;&#26368;&#36817;&#21462;&#24471;&#20102;&#36827;&#27493;&#65292;&#20294;&#21019;&#24314;&#19968;&#20010;&#20934;&#30830;&#30340;&#36947;&#36335;&#22270;&#20173;&#28982;&#38656;&#35201;&#22823;&#37327;&#30340;&#24037;&#20316;&#65292;&#24182;&#19988;&#36824;&#27809;&#26377;&#23454;&#29616;&#23436;&#20840;&#30340;&#33258;&#21160;&#21270;&#12290;&#26412;&#25991;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#20351;&#29992;&#20840;&#29699;&#23548;&#33322;&#21355;&#26143;&#31995;&#32479;&#65288;GNSS&#65289;&#36712;&#36857;&#21644;&#20174;&#29616;&#20195;&#36710;&#36742;&#19978;&#26631;&#20934;&#20256;&#24863;&#22120;&#33719;&#21462;&#30340;&#22522;&#26412;&#22270;&#20687;&#25968;&#25454;&#33258;&#21160;&#19988;&#20934;&#30830;&#22320;&#29983;&#25104;&#27492;&#31867;&#22270;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#38382;&#39064;&#26694;&#26550;&#20026;&#20351;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#30340;&#35821;&#20041;&#20998;&#21106;&#20219;&#21153;&#26469;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#24182;&#21033;&#29992;&#25968;&#25454;&#20013;&#30340;&#31354;&#38388;&#20449;&#24687;&#12290;&#25105;&#20204;&#36824;&#21033;&#29992;&#25968;&#25454;&#20013;&#30340;&#26102;&#38388;&#20449;&#24687;&#26469;&#35299;&#20915;&#20986;&#29616;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#36890;&#36807;&#39044;&#22788;&#29702;&#21644;&#21518;&#22788;&#29702;&#27493;&#39588;&#26469;&#25552;&#39640;&#25968;&#25454;&#30340;&#36136;&#37327;&#12290;&#27492;&#22806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#23427;&#33021;&#22815;&#20174;&#23569;&#37327;&#26631;&#27880;&#25968;&#25454;&#20013;&#23398;&#20064;&#65292;&#24182;&#21435;&#22122;&#25968;&#25454;&#20197;&#20943;&#23569;&#19981;&#30456;&#20851;&#30340;&#36793;&#32536;&#21644;&#22122;&#28857;&#12290;&#22312;&#36710;&#36742;&#25910;&#38598;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;&#24182;&#36890;&#36807;&#19982;&#29616;&#26377;&#26041;&#27861;&#30340;&#23545;&#27604;&#65292;&#35828;&#26126;&#20102;&#20351;&#29992;&#24314;&#35758;&#30340;&#26041;&#27861;&#21487;&#20197;&#22823;&#24133;&#24230;&#20943;&#23569;&#25968;&#25454;&#25910;&#38598;&#21644;&#33258;&#21160;&#21270;&#36947;&#36335;&#22270;&#21019;&#24314;&#36807;&#31243;&#20013;&#30340;&#21162;&#21147;&#21644;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01640v1 Announce Type: cross  Abstract: Maps are essential for diverse applications, such as vehicle navigation and autonomous robotics. Both require spatial models for effective route planning and localization. This paper addresses the challenge of road graph construction for autonomous vehicles. Despite recent advances, creating a road graph remains labor-intensive and has yet to achieve full automation. The goal of this paper is to generate such graphs automatically and accurately. Modern cars are equipped with onboard sensors used for today's advanced driver assistance systems like lane keeping. We propose using global navigation satellite system (GNSS) traces and basic image data acquired from these standard sensors in consumer vehicles to estimate road-level maps with minimal effort. We exploit the spatial information in the data by framing the problem as a road centerline semantic segmentation task using a convolutional neural network. We also utilize the data's time 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;PUCL&#30340;&#26032;&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#19987;&#23478;&#28436;&#31034;&#20013;&#25512;&#26029;&#26410;&#30693;&#36830;&#32493;&#32422;&#26463;&#20989;&#25968;&#65292;&#26080;&#38656;&#20107;&#20808;&#20102;&#35299;&#32422;&#26463;&#21442;&#25968;&#21270;&#21644;&#29615;&#22659;&#27169;&#22411;&#12290;&#31639;&#27861;&#36890;&#36807;&#35757;&#32451;&#31574;&#30053;&#20174;&#21487;&#34892;&#21644;&#19981;&#21487;&#34892;&#36335;&#24452;&#20013;&#25552;&#21462;&#20449;&#24687;&#65292;&#36880;&#27493;&#20248;&#21270;&#32422;&#26463;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2408.01622</link><description>&lt;p&gt;
&#22522;&#20110;&#19987;&#23478;&#28436;&#31034;&#30340;&#38750;&#32447;&#24615;&#36830;&#32493;&#32422;&#26463;&#23398;&#20064;&#31639;&#27861; (PUCL)
&lt;/p&gt;
&lt;p&gt;
Positive-Unlabeled Constraint Learning (PUCL) for Inferring Nonlinear Continuous Constraints Functions from Expert Demonstrations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01622
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;PUCL&#30340;&#26032;&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#19987;&#23478;&#28436;&#31034;&#20013;&#25512;&#26029;&#26410;&#30693;&#36830;&#32493;&#32422;&#26463;&#20989;&#25968;&#65292;&#26080;&#38656;&#20107;&#20808;&#20102;&#35299;&#32422;&#26463;&#21442;&#25968;&#21270;&#21644;&#29615;&#22659;&#27169;&#22411;&#12290;&#31639;&#27861;&#36890;&#36807;&#35757;&#32451;&#31574;&#30053;&#20174;&#21487;&#34892;&#21644;&#19981;&#21487;&#34892;&#36335;&#24452;&#20013;&#25552;&#21462;&#20449;&#24687;&#65292;&#36880;&#27493;&#20248;&#21270;&#32422;&#26463;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#8220;&#27491;&#36127;&#26410;&#26631;&#27880;&#32422;&#26463;&#23398;&#20064;&#8221;(PUCL)&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#19987;&#23478;&#28436;&#31034;&#20013;&#25512;&#26029;&#38750;&#32447;&#24615;&#36830;&#32493;&#32422;&#26463;&#20989;&#25968;&#65292;&#32780;&#19981;&#38656;&#35201;&#39044;&#20808;&#30693;&#36947;&#30495;&#23454;&#30340;&#32422;&#26463;&#21442;&#25968;&#21270;&#25110;&#32773;&#29615;&#22659;&#27169;&#22411;&#12290;&#22312;&#25105;&#20204;&#30340;&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#25226;&#25152;&#26377;&#30340;&#28436;&#31034;&#25968;&#25454;&#37117;&#35270;&#20026;&#27491;&#26679;&#20363;&#65288;&#21487;&#34892;&#30340;&#65289;&#25968;&#25454;&#65292;&#24182;&#19988;&#22312;&#23398;&#20064;&#31574;&#30053;&#26102;&#21019;&#36896;&#28508;&#22312;&#30340;&#19981;&#21487;&#34892;&#36712;&#36857;&#20316;&#20026;&#26410;&#26631;&#27880;&#30340;&#25968;&#25454;&#12290;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#65292;&#39318;&#20808;&#26356;&#26032;&#31574;&#30053;&#65292;&#28982;&#21518;&#24212;&#29992;&#19968;&#20010;&#20004;&#27493;&#30340;&#27491;&#36127;&#26410;&#26631;&#27880;&#23398;&#20064;&#36807;&#31243;&#65292;&#20854;&#20013;&#39318;&#20808;&#20351;&#29992;&#36317;&#31163;&#24230;&#37327;&#26469;&#30830;&#23450;&#21487;&#38752;&#30340;&#19981;&#21487;&#34892;&#25968;&#25454;&#65292;&#38543;&#21518;&#20351;&#29992;&#27491;&#36127;&#26410;&#26631;&#27880;&#25968;&#25454;&#23398;&#20064;&#19968;&#20010;&#30830;&#23450;&#24615;&#32422;&#26463;&#20989;&#25968;&#65292;&#23427;&#20195;&#34920;&#20102;&#19968;&#20010;&#26377;&#30028;&#38598;&#19978;&#30340;&#36817;&#20284;&#65292;&#24182;&#19988;&#22312;&#21487;&#34892;&#22495;&#30340;&#30456;&#37051;&#21306;&#22495;&#20869;&#12290;&#36890;&#36807;&#36825;&#26679;&#30340;&#36845;&#20195;&#36807;&#31243;&#65292;&#25105;&#20204;&#21487;&#20197;&#20248;&#21270;&#31574;&#30053;&#20197;&#25552;&#39640;&#25968;&#25454;&#38598;&#30340;&#36136;&#37327;&#24182;&#20943;&#24369;&#31574;&#30053;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#26368;&#32456;&#23398;&#20064;&#21040;&#26356;&#31934;&#30830;&#30340;&#32422;&#26463;&#20989;&#25968;&#12290;&#26412;&#31639;&#27861;&#22312;&#26426;&#22120;&#20154;&#20219;&#21153;&#30340;&#35268;&#21010;&#21644;&#22797;&#26434;&#29615;&#22659;&#20013;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#65292;&#37027;&#37324;&#23436;&#25972;&#30340;&#32422;&#26463;&#21487;&#33021;&#26082;&#26410;&#30693;&#20063;&#19981;&#26131;&#20934;&#30830;&#34920;&#36798;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01622v1 Announce Type: new  Abstract: Planning for a wide range of real-world robotic tasks necessitates to know and write all constraints. However, instances exist where these constraints are either unknown or challenging to specify accurately. A possible solution is to infer the unknown constraints from expert demonstration. This paper presents a novel Positive-Unlabeled Constraint Learning (PUCL) algorithm to infer a continuous arbitrary constraint function from demonstration, without requiring prior knowledge of the true constraint parameterization or environmental model as existing works. Within our framework, we treat all data in demonstrations as positive (feasible) data, and learn a control policy to generate potentially infeasible trajectories, which serve as unlabeled data. In each iteration, we first update the policy and then a two-step positive-unlabeled learning procedure is applied, where it first identifies reliable infeasible data using a distance metric, an
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21452;&#30446;&#31435;&#20307;&#35270;&#35273;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37325;&#24314;&#27627;&#31859;&#32423;NTCR&#30340;&#19981;&#23545;&#31216;&#24418;&#24577;&#65292;&#21363;&#20351;&#22312;&#20302;&#36136;&#37327;&#28857;&#20113;&#25910;&#38598;&#20063;&#23384;&#22312;&#38590;&#24230;&#30340;&#24773;&#20917;&#19979;&#12290;</title><link>https://arxiv.org/abs/2408.01615</link><description>&lt;p&gt;
&#22522;&#20110;&#21452;&#30446;&#31435;&#20307;&#35270;&#35273;&#30340;&#19977;&#32500;&#24418;&#24577;&#37325;&#24314;&#27627;&#31859;&#32423;&#36719;&#20307;&#36830;&#32493;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
Three-dimensional Morphological Reconstruction of Millimeter-Scale Soft Continuum Robots based on Dual Stereo Vision
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21452;&#30446;&#31435;&#20307;&#35270;&#35273;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37325;&#24314;&#27627;&#31859;&#32423;NTCR&#30340;&#19981;&#23545;&#31216;&#24418;&#24577;&#65292;&#21363;&#20351;&#22312;&#20302;&#36136;&#37327;&#28857;&#20113;&#25910;&#38598;&#20063;&#23384;&#22312;&#38590;&#24230;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01615v1 &#20844;&#21578;&#31867;&#22411;: &#26032;  &#25688;&#35201;: &#36830;&#32493;&#26426;&#22120;&#20154;&#21487;&#20197;&#32553;&#23567;&#21040;&#20165;&#20960;&#27627;&#31859;&#30452;&#24452;&#12290;&#22312;&#36825;&#20123;&#26426;&#22120;&#20154;&#20013;&#65292;&#20855;&#26377;&#20999;&#27133;&#30340;&#31649;&#29366;&#36830;&#32493;&#26426;&#22120;&#20154;(NTCR)&#22312;&#35768;&#22810;&#31934;&#32454;&#25805;&#20316;&#26041;&#38754;&#26174;&#31034;&#20986;&#24040;&#22823;&#30340;&#28508;&#21147;&#12290;&#29616;&#26377;&#30340;&#26426;&#22120;&#20154;&#24314;&#27169;&#24037;&#20316;&#38598;&#20013;&#22312;&#21160;&#21147;&#23398;&#21644;&#21160;&#21147;&#23398;&#19978;&#65292;&#20294;&#20173;&#28982;&#38754;&#20020;&#30528;&#20877;&#29616;&#26426;&#22120;&#20154;&#24418;&#24577;&#30340;&#25361;&#25112;&#8212;&#8212;&#36825;&#26159;&#19968;&#20010;&#21487;&#20197;&#22312;&#36830;&#32493;&#26426;&#22120;&#20154;&#65292;&#23588;&#20854;&#26159;&#37027;&#20123;&#20855;&#26377;&#19981;&#23545;&#31216;&#36830;&#32493;&#32467;&#26500;&#30340;&#30740;&#31350;&#39046;&#22495;&#20013;&#25193;&#23637;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21452;&#30446;&#31435;&#20307;&#35270;&#35273;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37325;&#24314;&#27627;&#31859;&#32423;NTCR&#30340;&#19977;&#32500;&#24418;&#24577;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;&#20004;&#21488;&#30456;&#23545;&#22266;&#23450;&#30340;&#21452;&#30446;&#25668;&#20687;&#22836;&#25429;&#33719;NTCR&#30340;&#28857;&#20113;&#65292;&#28982;&#21518;&#21033;&#29992;&#39044;&#23450;&#20041;&#20960;&#20309;&#20316;&#20026;KD&#26641;&#26041;&#27861;&#30340;&#37325;&#23450;&#20301;&#21442;&#32771;&#65292;&#21363;&#20351;&#20302;&#36136;&#37327;&#30340;&#21407;&#22987;&#28857;&#20113;&#25910;&#38598;&#22312;&#26080;&#33021;&#20026;&#21147;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#23548;&#33268;&#20102;&#19968;&#20010;&#24418;&#24577;&#27491;&#30830;&#30340;NTCR&#12290;&#35813;&#26041;&#27861;&#24050;&#32463;&#35777;&#26126;&#23545;&#20110;&#19968;&#20010;&#20855;&#26377;&#19981;&#23545;&#31216;&#24418;&#24577;&#30340;NTCR&#26469;&#35828;&#26159;&#21487;&#20197;&#23454;&#26045;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01615v1 Announce Type: new  Abstract: Continuum robots can be miniaturized to just a few millimeters in diameter. Among these, notched tubular continuum robots (NTCR) show great potential in many delicate applications. Existing works in robotic modeling focus on kinematics and dynamics but still face challenges in reproducing the robot's morphology -- a significant factor that can expand the research landscape of continuum robots, especially for those with asymmetric continuum structures. This paper proposes a dual stereo vision-based method for the three-dimensional morphological reconstruction of millimeter-scale NTCRs. The method employs two oppositely located stationary binocular cameras to capture the point cloud of the NTCR, then utilizes predefined geometry as a reference for the KD tree method to relocate the capture point clouds, resulting in a morphologically correct NTCR despite the low-quality raw point cloud collection. The method has been proved feasible for an
&lt;/p&gt;</description></item><item><title>&#35774;&#35745;&#20102;&#19968;&#31181;&#21551;&#21457;&#24335;&#25628;&#32034;&#26041;&#27861;&#65292;&#21487;&#22312;&#19981;&#20381;&#36182;&#23436;&#20840;&#21487;&#35270;&#21270;&#30340;&#24773;&#20917;&#19979;&#24555;&#36895;&#23450;&#20301;&#22303;&#22756;&#21306;&#22495;&#20013;&#24515;&#65292;&#26174;&#33879;&#25552;&#39640;&#25628;&#32034;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2408.01589</link><description>&lt;p&gt;
&#37096;&#20998;&#21487;&#35266;&#27979;&#29615;&#22659;&#20013;&#30340;&#22303;&#22756;&#26679;&#26412;&#25628;&#32034;
&lt;/p&gt;
&lt;p&gt;
Soil Sample Search in Partially Observable Environments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01589
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#31181;&#21551;&#21457;&#24335;&#25628;&#32034;&#26041;&#27861;&#65292;&#21487;&#22312;&#19981;&#20381;&#36182;&#23436;&#20840;&#21487;&#35270;&#21270;&#30340;&#24773;&#20917;&#19979;&#24555;&#36895;&#23450;&#20301;&#22303;&#22756;&#21306;&#22495;&#20013;&#24515;&#65292;&#26174;&#33879;&#25552;&#39640;&#25628;&#32034;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01589v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032; &#25688;&#35201;&#65306;&#20026;&#20102;&#22312;&#26410;&#30693;&#25143;&#22806;&#29615;&#22659;&#20013;&#24037;&#20316;&#65292;&#33258;&#20027;&#37319;&#26679;&#26426;&#26800;&#38656;&#35201;&#33021;&#22815;&#22312;&#26377;&#38480;&#30340;&#21487;&#35265;&#24230;&#21644;&#26426;&#26800;&#33218;&#21487;&#36798;&#36317;&#31163;&#20869;&#23450;&#20301;&#26679;&#26412;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#21551;&#21457;&#24335;&#24341;&#23548;&#25628;&#32034;&#26041;&#27861;&#65292;&#20197;&#21152;&#24555;&#25628;&#32034;&#36807;&#31243;&#24182;&#26356;&#26377;&#25928;&#22320;&#23450;&#20301;&#22303;&#22756;&#21306;&#22495;&#30340;&#36817;&#20284;&#20013;&#24515;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#35813;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#21457;&#29616;&#22312;&#36895;&#24230;&#12289;&#34892;&#39542;&#36317;&#31163;&#21644;&#25104;&#21151;&#29575;&#26041;&#38754;&#65292;&#19982;&#31616;&#21333;&#22522;&#20934;&#30456;&#27604;&#65292;&#35813;&#31639;&#27861;&#20855;&#26377;&#20248;&#36234;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01589v1 Announce Type: new  Abstract: To work in unknown outdoor environments, autonomous sampling machines need the ability to target samples despite limited visibility and robotic arm reach distance. We design a heuristic guided search method to speed up the search process and more efficiently localize the approximate center of soil regions. Through simulation experiments, we assess the effectiveness of the proposed algorithm and discover superior performance in terms of speed, distance traveled, and success rate compared to naive baselines.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20351;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#25216;&#26415;&#30340;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#21487;&#33258;&#21160;&#20351;&#29992;&#26700;&#38754;&#23454;&#39564;&#23460;&#35774;&#22791;&#65292;&#22914;&#31163;&#24515;&#26426;&#12290;</title><link>https://arxiv.org/abs/2408.01576</link><description>&lt;p&gt;
&#33258;&#21160;&#38598;&#25104;&#26700;&#38754;&#28287;&#23454;&#39564;&#23460;&#35774;&#22791;&#30340;&#23454;&#39564;&#23460;&#33258;&#21160;&#21270;
&lt;/p&gt;
&lt;p&gt;
Autonomous Integration of Bench-Top Wet Lab Equipment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01576
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20351;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#25216;&#26415;&#30340;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#21487;&#33258;&#21160;&#20351;&#29992;&#26700;&#38754;&#23454;&#39564;&#23460;&#35774;&#22791;&#65292;&#22914;&#31163;&#24515;&#26426;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01576v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340; &#25688;&#35201;&#65306;&#23567;&#22411;&#23454;&#39564;&#23460;&#30340;&#23454;&#39564;&#23460;&#33258;&#21160;&#21270;&#26159;&#19968;&#20010;&#20195;&#20215;&#39640;&#26114;&#19988;&#22797;&#26434;&#30340;&#36807;&#31243;&#65292;&#21487;&#20379;&#36873;&#25321;&#30340;&#28789;&#27963;&#24615;&#26377;&#38480;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#21407;&#22411;&#31995;&#32479;&#65292;&#20351;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#26041;&#27861;&#36827;&#34892;&#39068;&#33394;&#26816;&#27979;&#21644;&#22278;Hough&#21464;&#25442;&#26469;&#26816;&#27979;&#21644;&#23450;&#20301;&#31163;&#24515;&#26426;&#26742;&#12290;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#21407;&#22411;&#35774;&#22791;&#33021;&#22815;&#33258;&#21160;&#21270;&#24120;&#35268;&#26700;&#38754;&#23454;&#39564;&#23460;&#35774;&#22791;&#30340;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01576v1 Announce Type: new  Abstract: Laboratory automation is an expensive and complicated endeavor with limited inflexible options for small-scale labs. We develop a prototype system for tending to a bench-top centrifuge using computer vision methods for color detection and circular Hough Transforms to detect and localize centrifuge buckets. Initial results show that the prototype is capable of automating the usage of regular bench-top lab equipment.
&lt;/p&gt;</description></item><item><title>TURTLMap &#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#19987;&#27880;&#20110;&#36890;&#36807;&#23454;&#26102;&#23450;&#20301;&#21644;&#26144;&#23556;&#26041;&#27861;&#35299;&#20915;&#20302;&#32441;&#29702;&#27700;&#19979;&#29615;&#22659;&#30340;&#25361;&#25112;&#65292;&#25104;&#26412;&#20302;&#24265;&#65292;&#33021;&#22815;&#20934;&#30830;&#36319;&#36394;&#26426;&#22120;&#20154;&#65292;&#22312;&#20302;&#32441;&#29702;&#29615;&#22659;&#20013;&#23454;&#26102;&#26500;&#24314;&#23494;&#38598;&#22320;&#22270;&#12290;</title><link>https://arxiv.org/abs/2408.01569</link><description>&lt;p&gt;
TURTLMap: &#23454;&#26102;&#23450;&#20301;&#21644;&#20302;&#32441;&#29702;&#27700;&#19979;&#29615;&#22659;&#30340;&#23494;&#38598;&#26144;&#23556;&#65292;&#20351;&#29992;&#20302;&#25104;&#26412;&#26080;&#20154;&#27700;&#19979;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
TURTLMap: Real-time Localization and Dense Mapping of Low-texture Underwater Environments with a Low-cost Unmanned Underwater Vehicle
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01569
&lt;/p&gt;
&lt;p&gt;
TURTLMap &#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#19987;&#27880;&#20110;&#36890;&#36807;&#23454;&#26102;&#23450;&#20301;&#21644;&#26144;&#23556;&#26041;&#27861;&#35299;&#20915;&#20302;&#32441;&#29702;&#27700;&#19979;&#29615;&#22659;&#30340;&#25361;&#25112;&#65292;&#25104;&#26412;&#20302;&#24265;&#65292;&#33021;&#22815;&#20934;&#30830;&#36319;&#36394;&#26426;&#22120;&#20154;&#65292;&#22312;&#20302;&#32441;&#29702;&#29615;&#22659;&#20013;&#23454;&#26102;&#26500;&#24314;&#23494;&#38598;&#22320;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01569v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#25688;&#35201;&#65306;&#22312;&#25512;&#36827;&#27700;&#19979;&#29615;&#22659;&#23450;&#20301;&#21644;&#26144;&#23556;&#26041;&#38754;&#24050;&#32463;&#21462;&#24471;&#20102;&#26174;&#33879;&#25104;&#26524;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#29616;&#26377;&#25216;&#26415;&#20173;&#28982;&#38754;&#20020;&#20302;&#32441;&#29702;&#29615;&#22659;&#30340;&#25361;&#25112;&#65292;&#32780;&#22312;&#27700;&#19979;&#29615;&#22659;&#20013;&#65292;&#20302;&#32441;&#29702;&#29615;&#22659;&#26159;&#24120;&#35265;&#30340;&#12290;&#36825;&#20351;&#24471;&#22312;&#23454;&#38469;&#19990;&#30028;&#20013;&#20351;&#29992;&#29616;&#26377;&#25216;&#26415;&#21464;&#24471;&#22256;&#38590;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102; TURTLMap&#65292;&#36825;&#26159;&#19968;&#31181;&#19987;&#27880;&#20110;&#36890;&#36807;&#23454;&#26102;&#23450;&#20301;&#21644;&#26144;&#23556;&#26041;&#27861;&#35299;&#20915;&#20302;&#32441;&#29702;&#27700;&#19979;&#29615;&#22659;&#30340;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#25104;&#26412;&#20302;&#24265;&#65292;&#24182;&#19988;&#33021;&#22815;&#20934;&#30830;&#36319;&#36394;&#26426;&#22120;&#20154;&#65292;&#22312;&#27492;&#21516;&#26102;&#65292;&#22312;&#20302;&#32441;&#29702;&#29615;&#22659;&#20013;&#23454;&#26102;&#26500;&#24314;&#23494;&#38598;&#30340;&#22320;&#22270;&#12290;&#25105;&#20204;&#20351;&#29992;&#22312;&#20855;&#26377;&#36816;&#21160;&#25429;&#25417;&#31995;&#32479;&#30340;&#23460;&#20869;&#27700;&#27744;&#20013;&#25910;&#38598;&#30340;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#21644;&#30495;&#23454;&#21442;&#32771;&#22320;&#22270;&#23545;&#25552;&#20986;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#23450;&#24615;&#21644;&#23450;&#37327;&#30340;&#32467;&#26524;&#39564;&#35777;&#20102;&#25152;&#25552;&#20986;&#30340;&#31995;&#32479;&#21363;&#20351;&#22312;&#27874;&#28010;&#26465;&#20214;&#19979;&#20063;&#33021;&#23454;&#29616;&#20934;&#30830;&#30340;&#23454;&#26102;&#23450;&#20301;&#21644;&#31934;&#30830;&#23494;&#38598;&#22320;&#22270;&#26500;&#24314;&#12290;&#39033;&#30446;&#30340;&#39029;&#38754;&#21487;&#20197;&#20174;&#25552;&#20379;&#30340;&#25968;&#25454;&#21644;&#36719;&#20214;&#20013;&#35775;&#38382;&#65292;&#36825;&#23545;&#20110;&#30740;&#31350;&#21644;&#25945;&#32946;&#30446;&#30340;&#23558;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01569v1 Announce Type: new  Abstract: Significant work has been done on advancing localization and mapping in underwater environments. Still, state-of-the-art methods are challenged by low-texture environments, which is common for underwater settings. This makes it difficult to use existing methods in diverse, real-world scenes. In this paper, we present TURTLMap, a novel solution that focuses on textureless underwater environments through a real-time localization and mapping method. We show that this method is low-cost, and capable of tracking the robot accurately, while constructing a dense map of a low-textured environment in real-time. We evaluate the proposed method using real-world data collected in an indoor water tank with a motion capture system and ground truth reference map. Qualitative and quantitative results validate the proposed system achieves accurate and robust localization and precise dense mapping, even when subject to wave conditions. The project page fo
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#22810;&#20195;&#29702;&#21327;&#21516;&#25805;&#32437;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#21147;&#20998;&#35299;&#30340;&#26041;&#27861;&#65292;&#20351;&#24471;&#21508;&#20010;&#20195;&#29702;&#33021;&#22815;&#29420;&#31435;&#20110;&#22806;&#37096;&#30340;&#20449;&#24687;&#36827;&#34892;&#22797;&#26434;&#30340;&#20219;&#21153;&#25191;&#34892;&#12290;</title><link>https://arxiv.org/abs/2408.01543</link><description>&lt;p&gt;
&#22810;&#20195;&#29702;&#21327;&#21516;&#25805;&#32437;&#21147;&#20998;&#35299;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Decomposition of Interaction Force for Multi-Agent Co-Manipulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01543
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#22810;&#20195;&#29702;&#21327;&#21516;&#25805;&#32437;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#21147;&#20998;&#35299;&#30340;&#26041;&#27861;&#65292;&#20351;&#24471;&#21508;&#20010;&#20195;&#29702;&#33021;&#22815;&#29420;&#31435;&#20110;&#22806;&#37096;&#30340;&#20449;&#24687;&#36827;&#34892;&#22797;&#26434;&#30340;&#20219;&#21153;&#25191;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01543v1 &#20844;&#21578;&#31867;&#22411;: &#26032; Abstract: &#22810;&#20195;&#29702;&#20154;&#31867;-&#26426;&#22120;&#20154;&#21327;&#21516;&#25805;&#32437;&#26159;&#19968;&#20010;&#20855;&#26377;&#35768;&#22810;&#36755;&#20837;&#22240;&#32032;&#30340;&#36807;&#31243;&#65292;&#36825;&#20123;&#22240;&#32032;&#21487;&#33021;&#20250;&#24433;&#21709;&#20195;&#29702;&#30340;&#34892;&#20026;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#20010;&#21517;&#20026;&#30456;&#20114;&#20316;&#29992;&#21147;&#30340;&#36755;&#20837;&#22240;&#32032;&#12290;&#22312;&#21327;&#21516;&#25805;&#32437;&#20013;&#65292;&#30456;&#20114;&#20316;&#29992;&#21147;&#21487;&#33021;&#26159;&#20195;&#29702;&#20154;&#20043;&#38388;&#36890;&#20449;&#30340;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#32780;&#65292;&#22312;&#25991;&#29486;&#20013;&#23384;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#30456;&#20114;&#20316;&#29992;&#21147;&#30340;&#35266;&#28857;&#21644;&#23450;&#20041;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#30456;&#20114;&#20316;&#29992;&#21147;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20026;&#22810;&#20195;&#29702;&#21327;&#21516;&#25805;&#32437;&#25552;&#20379;&#20102;&#19968;&#31181;&#30830;&#23450;&#20195;&#29702;&#30456;&#23545;&#20110;&#32676;&#20307;&#30340;&#29366;&#24577;&#30340;&#26041;&#27861;&#12290;&#35813;&#25552;&#35758;&#30340;&#26041;&#27861;&#25193;&#23637;&#20102;&#25991;&#29486;&#20013;&#29616;&#26377;&#30340;&#23450;&#20041;&#65292;&#20174;&#19968;&#32500;&#25193;&#23637;&#21040;&#20102;&#22235;&#32500;&#33258;&#30001;&#24230;&#65292;&#19981;&#38656;&#35201;&#39044;&#23450;&#20041;&#30340;&#29289;&#20307;&#36335;&#24452;&#65292;&#20063;&#19981;&#20381;&#36182;&#20110;&#31995;&#32479;&#20013;&#30340;&#20195;&#29702;&#25968;&#37327;&#12289;&#20301;&#32622;&#20197;&#21450;&#36755;&#20837;&#21147;&#30697;&#65288;&#21147;&#21644;&#25197;&#30697;&#65289;&#12290;&#27492;&#22806;&#65292;&#25152;&#26377;&#24517;&#35201;&#30340;&#27979;&#37327;&#26041;&#27861;&#21487;&#20197;&#30001;&#19968;&#20010;&#33258;&#25105;&#21253;&#21547;&#30340;&#26426;&#22120;&#20154;&#31995;&#32479;&#33719;&#24471;&#65292;&#20174;&#32780;&#20801;&#35768;&#22810;&#20195;&#29702;&#21327;&#21516;&#25805;&#32437;&#23454;&#26045;&#19981;&#20381;&#36182;&#20110;&#22806;&#37096;&#20449;&#24687;&#30340;&#22797;&#26434;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01543v1 Announce Type: new  Abstract: Multi-agent human-robot co-manipulation is a poorly understood process with many inputs that potentially affect agent behavior. This paper explores one such input known as interaction force. Interaction force is potentially a primary component in communication that occurs during co-manipulation. There are, however, many different perspectives and definitions of interaction force in the literature. Therefore, a decomposition of interaction force is proposed that provides a consistent way of ascertaining the state of an agent relative to the group for multi-agent co-manipulation. This proposed method extends a current definition from one to four degrees of freedom, does not rely on a predefined object path, and is independent of the number of agents acting on the system and their locations and input wrenches (forces and torques). In addition, all of the necessary measures can be obtained by a self-contained robotic system, allowing for a m
&lt;/p&gt;</description></item><item><title>SceneMotion&#27169;&#22411;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#26032;&#30340;&#28508;&#22312;&#19978;&#19979;&#25991;&#27169;&#22359;&#23558;&#23616;&#37096;agent-centric&#23884;&#20837;&#36716;&#25442;&#20026;&#20840;&#26223;&#32423;&#39044;&#27979;&#65292;&#22312;Waymo Open Interaction Prediction Challenge&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;</title><link>https://arxiv.org/abs/2408.01537</link><description>&lt;p&gt;
SceneMotion: &#20174;Agent-Centric&#23884;&#20837;&#21040;&#22330;&#26223;&#32423;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
SceneMotion: From Agent-Centric Embeddings to Scene-Wide Forecasts
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01537
&lt;/p&gt;
&lt;p&gt;
SceneMotion&#27169;&#22411;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#26032;&#30340;&#28508;&#22312;&#19978;&#19979;&#25991;&#27169;&#22359;&#23558;&#23616;&#37096;agent-centric&#23884;&#20837;&#36716;&#25442;&#20026;&#20840;&#26223;&#32423;&#39044;&#27979;&#65292;&#22312;Waymo Open Interaction Prediction Challenge&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01537v1 &#20844;&#21578;&#31867;&#22411;: cross
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01537v1 Announce Type: cross  Abstract: Self-driving vehicles rely on multimodal motion forecasts to effectively interact with their environment and plan safe maneuvers. We introduce SceneMotion, an attention-based model for forecasting scene-wide motion modes of multiple traffic agents. Our model transforms local agent-centric embeddings into scene-wide forecasts using a novel latent context module. This module learns a scene-wide latent space from multiple agent-centric embeddings, enabling joint forecasting and interaction modeling. The competitive performance in the Waymo Open Interaction Prediction Challenge demonstrates the effectiveness of our approach. Moreover, we cluster future waypoints in time and space to quantify the interaction between agents. We merge all modes and analyze each mode independently to determine which clusters are resolved through interaction or result in conflict. Our implementation is available at: https://github.com/kit-mrt/future-motion
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30340;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#21046;&#22270;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#21033;&#29992;&#23454;&#26102;&#22320;&#26631;&#25968;&#25454;&#21644;&#26631;&#20934;&#23450;&#20041;&#22320;&#22270;&#65292;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#22312;&#32447;&#39640;&#28165;&#22320;&#22270;&#29983;&#25104;&#12290;</title><link>https://arxiv.org/abs/2408.01471</link><description>&lt;p&gt;
&#35770;&#25991;&#26631;&#39064;&#65306;&#22686;&#24378;&#22312;&#32447;&#36947;&#36335;&#32593;&#32476;&#24863;&#30693;&#19982;&#25512;&#29702;&#30340;&#26631;&#20934;&#23450;&#20041;&#22270;&#35889;
&lt;/p&gt;
&lt;p&gt;
Enhancing Online Road Network Perception and Reasoning with Standard Definition Maps
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01471
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30340;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#21046;&#22270;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#21033;&#29992;&#23454;&#26102;&#22320;&#26631;&#25968;&#25454;&#21644;&#26631;&#20934;&#23450;&#20041;&#22320;&#22270;&#65292;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#22312;&#32447;&#39640;&#28165;&#22320;&#22270;&#29983;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25688;&#35201;&#65306;&#33258;&#21160;&#39550;&#39542;&#23545;&#20110;&#22478;&#24066;&#21644;&#39640;&#36895;&#20844;&#36335;&#39550;&#39542;&#36890;&#24120;&#38656;&#35201;&#39640;&#28165;&#22320;&#22270;&#65288;HD&#65289;&#26469;&#29983;&#25104;&#23548;&#33322;&#35745;&#21010;&#12290;&#28982;&#32780;&#65292;&#22312;&#25104;&#35268;&#27169;&#29983;&#25104;&#21644;&#32500;&#25252;HD&#22320;&#22270;&#26102;&#65292;&#23384;&#22312;&#21508;&#31181;&#25361;&#25112;&#12290;&#23613;&#31649;&#22312;&#32447;&#21046;&#22270;&#26041;&#27861;&#24050;&#32463;&#24320;&#22987;&#20986;&#29616;&#65292;&#20294;&#23427;&#20204;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#23545;&#20110;&#38271;&#36317;&#31163;&#30340;&#24847;&#20041;&#19978;&#65292;&#20854;&#24615;&#33021;&#21463;&#21040;&#20102;&#37325;&#24433;&#36974;&#25377;&#30340;&#38480;&#21046;&#12290;&#22522;&#20110;&#36825;&#20123;&#32771;&#34385;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#38598;&#20013;&#20110;&#22312;&#24320;&#21457;&#22312;&#32447;&#30690;&#37327;&#21270;HD&#22320;&#22270;&#34920;&#31034;&#26102;&#65292;&#21033;&#29992;&#36731;&#37327;&#32423;&#21487;&#25193;&#23637;&#30340;&#20808;&#39564;&#8212;&#8212;&#26631;&#20934;&#23450;&#20041;&#65288;SD&#65289;&#22320;&#22270;&#12290;&#25105;&#20204;&#39318;&#20808;&#26816;&#26597;&#23558;&#36718;&#24275;&#21270;&#30340;SD&#22320;&#22270;&#34920;&#31034;&#38598;&#25104;&#21040;&#21508;&#31181;&#22312;&#32447;&#21046;&#22270;&#26550;&#26500;&#20013;&#30340;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#35782;&#21035;&#36731;&#37327;&#32423;&#30340;&#31574;&#30053;&#65292;&#25105;&#20204;&#23558;OpenLane-V2&#25968;&#25454;&#38598;&#19982;OpenStreetMaps&#25193;&#23637;&#65292;&#24182;&#35780;&#20272;&#22270;&#24418;&#21270;SD&#22320;&#22270;&#34920;&#31034;&#30340;&#22909;&#22788;&#12290;&#35774;&#35745;SD&#22320;&#22270;&#38598;&#25104;&#32452;&#20214;&#30340;&#20851;&#38190;&#21457;&#29616;&#26159;&#65292;SD&#22320;&#22270;&#32534;&#30721;&#33021;&#22815;&#25552;&#39640;&#22312;&#32447;&#36947;&#36335;&#32593;&#32476;&#24863;&#30693;&#21644;&#25512;&#29702;&#30340;&#25928;&#33021;&#12290;&#30001;&#20110;&#30456;&#20851;&#25216;&#26415;&#30340;&#36827;&#27493;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#21046;&#22270;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#21033;&#29992;&#23454;&#26102;&#22320;&#26631;&#25968;&#25454;&#21644;&#26631;&#20934;&#23450;&#20041;&#22320;&#22270;&#65292;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#22312;&#32447;&#39640;&#28165;&#22320;&#22270;&#29983;&#25104;&#12290;&#35813;&#26694;&#26550;&#22312;&#24320;&#25918;&#36947;&#36335;&#29615;&#22659;&#20013;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#30340;&#23454;&#39564;&#39564;&#35777;&#65292;&#34920;&#26126;&#20102;&#20854;&#23545;&#20110;&#39640;&#28165;&#22320;&#22270;&#30340;&#23454;&#26102;&#22312;&#32447;&#26356;&#26032;&#20855;&#26377;&#26174;&#33879;&#30340;&#20248;&#21183;&#12290;&#26410;&#26469;&#30340;&#30740;&#31350;&#23558;&#36827;&#19968;&#27493;&#39564;&#35777;&#36825;&#20123;&#32467;&#26524;&#65292;&#24182;&#25506;&#32034;&#22914;&#20309;&#23558;&#20854;&#24212;&#29992;&#21040;&#26356;&#24191;&#27867;&#30340;&#36947;&#36335;&#22330;&#26223;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01471v1 Announce Type: cross  Abstract: Autonomous driving for urban and highway driving applications often requires High Definition (HD) maps to generate a navigation plan. Nevertheless, various challenges arise when generating and maintaining HD maps at scale. While recent online mapping methods have started to emerge, their performance especially for longer ranges is limited by heavy occlusion in dynamic environments. With these considerations in mind, our work focuses on leveraging lightweight and scalable priors-Standard Definition (SD) maps-in the development of online vectorized HD map representations. We first examine the integration of prototypical rasterized SD map representations into various online mapping architectures. Furthermore, to identify lightweight strategies, we extend the OpenLane-V2 dataset with OpenStreetMaps and evaluate the benefits of graphical SD map representations. A key finding from designing SD map integration components is that SD map encode
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32858;&#31867;&#30340;&#20004;&#27493;&#35745;&#31639;&#26041;&#27861;&#65292;&#20351;&#29992;&#35889;&#32858;&#31867;&#12289;&#23616;&#37096;&#28508;&#22312;&#22330;&#26041;&#27861;&#21644;&#36229;&#36951;&#20256;&#31639;&#27861;&#26469;&#20026;&#26080;&#20154;&#26426;&#24314;&#31569;&#26816;&#26597;&#25214;&#21040;&#36817;&#20284;&#26368;&#20248;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2408.01435</link><description>&lt;p&gt;
&#22522;&#20110;&#32858;&#31867;&#30340;&#26032;&#24314;&#31569;&#26816;&#26597;&#26080;&#20154;&#26426;&#35270;&#35282;&#35268;&#21010;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A New Clustering-based View Planning Method for Building Inspection with Drone
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01435
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32858;&#31867;&#30340;&#20004;&#27493;&#35745;&#31639;&#26041;&#27861;&#65292;&#20351;&#29992;&#35889;&#32858;&#31867;&#12289;&#23616;&#37096;&#28508;&#22312;&#22330;&#26041;&#27861;&#21644;&#36229;&#36951;&#20256;&#31639;&#27861;&#26469;&#20026;&#26080;&#20154;&#26426;&#24314;&#31569;&#26816;&#26597;&#25214;&#21040;&#36817;&#20284;&#26368;&#20248;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01435v1 &#20844;&#21578;&#31867;&#22411;: &#20132;&#21449; &#19978;&#32447;&#30340;&#25688;&#35201;: &#38543;&#30528;&#26080;&#20154;&#26426;&#25216;&#26415;&#30340;&#36805;&#36895;&#21457;&#23637;&#65292;&#37197;&#22791;&#35270;&#35273;&#20256;&#24863;&#22120;&#30340;&#26080;&#20154;&#26426;&#22312;&#24314;&#31569;&#26816;&#26597;&#21644;&#30417;&#25511;&#26041;&#38754;&#30340;&#24212;&#29992;&#24341;&#36215;&#20102;&#35768;&#22810;&#20851;&#27880;&#12290;&#35270;&#35282;&#35268;&#21010;&#26088;&#22312;&#20026;&#22522;&#20110;&#35270;&#32447;&#30340;&#20219;&#21153;&#25214;&#21040;&#19968;&#32452;&#36817;&#20284;&#26368;&#20248;&#30340;&#35270;&#35282;&#65292;&#20197;&#23454;&#29616;&#35270;&#37326;&#35206;&#30422;&#30446;&#26631;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#32858;&#31867;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#35889;&#32858;&#31867;&#12289;&#23616;&#37096;&#28508;&#22312;&#22330;&#26041;&#27861;&#21644;&#36229;&#36951;&#20256;&#31639;&#27861;&#26469;&#25214;&#21040;&#35206;&#30422;&#30446;&#26631;&#24314;&#31569;&#34920;&#38754;&#30340;&#36817;&#20284;&#26368;&#20248;&#35270;&#35282;&#12290;&#22312;&#31532;&#19968;&#27493;&#65292;&#35813;&#25552;&#35758;&#30340;&#26041;&#27861;&#22522;&#20110;&#35889;&#32858;&#31867;&#29983;&#25104;&#20505;&#36873;&#35270;&#35282;&#65292;&#24182;&#22522;&#20110;&#25105;&#20204;&#25552;&#20986;&#30340;&#26032;&#22411;&#23616;&#37096;&#28508;&#22312;&#22330;&#26041;&#27861;&#32416;&#27491;&#20505;&#36873;&#35270;&#35282;&#30340;&#20301;&#32622;&#12290;&#22312;&#31532;&#20108;&#37096;&#65292;&#25105;&#20204;&#23558;&#20248;&#21270;&#38382;&#39064;&#36716;&#25442;&#20026;Set Covering Problem (SCP)&#65292;&#24182;&#20351;&#29992;&#25105;&#20204;&#25552;&#20986;&#30340;&#36229;&#36951;&#20256;&#31639;&#27861;&#26469;&#35299;&#20915;&#26368;&#20339;&#35270;&#35282;&#23376;&#38598;&#30340;&#38382;&#39064;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#20943;&#23569;&#35268;&#21010;&#27493;&#39588;&#30340;&#25968;&#37327;&#24182;&#25552;&#39640;&#25928;&#29575;&#30340;&#26032;&#26041;&#27861;&#65292;&#22312;&#24314;&#31569;&#26816;&#26597;&#20219;&#21153;&#20013;&#20855;&#26377;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01435v1 Announce Type: cross  Abstract: With the rapid development of drone technology, the application of drones equipped with visual sensors for building inspection and surveillance has attracted much attention. View planning aims to find a set of near-optimal viewpoints for vision-related tasks to achieve the vision coverage goal. This paper proposes a new clustering-based two-step computational method using spectral clustering, local potential field method, and hyper-heuristic algorithm to find near-optimal views to cover the target building surface. In the first step, the proposed method generates candidate viewpoints based on spectral clustering and corrects the positions of candidate viewpoints based on our newly proposed local potential field method. In the second step, the optimization problem is converted into a Set Covering Problem (SCP), and the optimal viewpoint subset is solved using our proposed hyper-heuristic algorithm. Experimental results show that the pro
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#20581;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#30456;&#26426;&#23039;&#24577;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#65292;&#35813;&#26041;&#27861;&#26088;&#22312;&#35782;&#21035;&#21644;&#32416;&#27491;&#23039;&#24577;&#20272;&#35745;&#20013;&#30340;&#35823;&#24046;&#65292;&#36890;&#36807;&#26500;&#24314;&#19968;&#20010;&#21487;&#38752;&#30340;&#35780;&#20272;&#26694;&#26550;&#65292;&#24110;&#21161;&#25552;&#39640;&#22270;&#20687;&#24207;&#21015;&#20013;&#30456;&#26426;&#20301;&#32622;&#21644;&#26041;&#21521;&#30340;&#31934;&#30830;&#24230;&#12290;</title><link>https://arxiv.org/abs/2407.20391</link><description>&lt;p&gt;
&#22810;&#35270;&#22270;&#23039;&#24577;&#31934;&#24230;&#35780;&#20215;&#30340;&#31283;&#20581;&#24230;&#37327;&#20998;&#25968;
&lt;/p&gt;
&lt;p&gt;
Alignment Scores: Robust Metrics for Multiview Pose Accuracy Evaluation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.20391
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#20581;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#30456;&#26426;&#23039;&#24577;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#65292;&#35813;&#26041;&#27861;&#26088;&#22312;&#35782;&#21035;&#21644;&#32416;&#27491;&#23039;&#24577;&#20272;&#35745;&#20013;&#30340;&#35823;&#24046;&#65292;&#36890;&#36807;&#26500;&#24314;&#19968;&#20010;&#21487;&#38752;&#30340;&#35780;&#20272;&#26694;&#26550;&#65292;&#24110;&#21161;&#25552;&#39640;&#22270;&#20687;&#24207;&#21015;&#20013;&#30456;&#26426;&#20301;&#32622;&#21644;&#26041;&#21521;&#30340;&#31934;&#30830;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#19977;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#32473;&#23450;&#22320;&#38754;&#30495;&#20540;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#30456;&#26426;&#23039;&#24577;&#38598;&#30340;&#20934;&#30830;&#24615;&#12290;&#36825;&#19977;&#31181;&#24230;&#37327;&#26041;&#27861;&#26159;&#32763;&#35793;&#23545;&#40784;&#20998;&#25968;&#65288;TAS&#65289;&#12289;&#26059;&#36716;&#23545;&#40784;&#20998;&#25968;&#65288;RAS&#65289;&#21644;&#23039;&#24577;&#23545;&#40784;&#20998;&#25968;&#65288;PAS&#65289;&#12290;TAS&#29420;&#31435;&#35780;&#20272;&#32763;&#35793;&#30340;&#20934;&#30830;&#24615;&#65292;&#32780;RAS&#29420;&#31435;&#35780;&#20272;&#26059;&#36716;&#30340;&#20934;&#30830;&#24615;&#65292;PAS&#21017;&#26159;&#20004;&#32773;&#20998;&#25968;&#30340;&#24179;&#22343;&#20540;&#65292;&#29992;&#20110;&#35780;&#20272;&#32763;&#35793;&#21644;&#26059;&#36716;&#30340;&#25972;&#20307;&#20934;&#30830;&#24615;&#12290;TAS&#30340;&#35745;&#31639;&#27493;&#39588;&#22914;&#19979;&#65306;&#65288;1&#65289;&#25214;&#21040;&#26368;&#36817;&#23545;&#36317;&#31163;&#30340;&#19978;&#22235;&#20998;&#20301;&#25968;&#65292;d&#12290;&#65288;2&#65289;&#20351;&#29992;&#31283;&#20581;&#27880;&#20876;&#26041;&#27861;&#23545;&#20272;&#35745;&#30340;&#36712;&#36857;&#36827;&#34892;&#23545;&#40784;&#65292;&#20351;&#20854;&#19982;&#22320;&#38754;&#30495;&#20540;&#23545;&#40784;&#12290;&#65288;3&#65289;&#25910;&#38598;&#25152;&#26377;&#36317;&#31163;&#35823;&#24046;&#65292;&#24182;&#33719;&#21462;&#20174;0.01d&#21040;d&#30340;&#22810;&#20010;&#38408;&#20540;&#33539;&#22260;&#20869;&#30340;&#32047;&#31215;&#39057;&#25968;&#65292;&#20998;&#36776;&#29575;&#26159;0.01d&#12290;&#65288;4&#65289;&#23558;&#36825;&#20123;&#32047;&#31215;&#39057;&#25968;&#30456;&#21152;&#24182;&#23545;&#20854;&#36827;&#34892;&#24402;&#19968;&#21270;&#22788;&#29702;&#65292;&#30830;&#20445;&#29702;&#35770;&#19978;&#30340;&#26368;&#22823;&#20540;&#26159;1&#12290;TAS&#22312;&#23454;&#36341;&#20013;&#20855;&#26377;&#24456;&#39640;&#30340;&#31283;&#20581;&#24615;&#21644;&#21487;&#38752;&#24615;&#65292;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#23545;&#30456;&#26426;&#23039;&#24577;&#20272;&#35745;&#30340;&#32467;&#26524;&#36827;&#34892;&#26356;&#23458;&#35266;&#30340;&#35780;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.20391v2 Announce Type: replace-cross  Abstract: We propose three novel metrics for evaluating the accuracy of a set of estimated camera poses given the ground truth: Translation Alignment Score (TAS), Rotation Alignment Score (RAS), and Pose Alignment Score (PAS). The TAS evaluates the translation accuracy independently of the rotations, and the RAS evaluates the rotation accuracy independently of the translations. The PAS is the average of the two scores, evaluating the combined accuracy of both translations and rotations. The TAS is computed in four steps: (1) Find the upper quartile of the closest-pair-distances, $d$. (2) Align the estimated trajectory to the ground truth using a robust registration method. (3) Collect all distance errors and obtain the cumulative frequencies for multiple thresholds ranging from $0.01d$ to $d$ with a resolution $0.01d$. (4) Add up these cumulative frequencies and normalize them such that the theoretical maximum is 1. The TAS has practical
&lt;/p&gt;</description></item><item><title>&#35813;&#26041;&#27861;&#36890;&#36807;&#32467;&#21512;&#27169;&#20223;&#23398;&#20064;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65292;&#25552;&#39640;&#20010;&#24615;&#21270;&#39550;&#39542;&#35268;&#21010;&#30340;&#24615;&#33021;&#65292;&#23588;&#20854;&#26159;&#22312;&#22823;&#37327;&#25968;&#25454;&#25903;&#25345;&#21644;&#27867;&#21270;&#33021;&#21147;&#26041;&#38754;&#12290;</title><link>https://arxiv.org/abs/2407.18569</link><description>&lt;p&gt;
PP-TIL&#65306;&#22522;&#20110;&#23454;&#20363;&#36716;&#31227;&#27169;&#20223;&#23398;&#20064;&#30340;&#33258;&#20027;&#39550;&#39542;&#20010;&#24615;&#21270;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
PP-TIL: Personalized Planning for Autonomous Driving with Instance-based Transfer Imitation Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.18569
&lt;/p&gt;
&lt;p&gt;
&#35813;&#26041;&#27861;&#36890;&#36807;&#32467;&#21512;&#27169;&#20223;&#23398;&#20064;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65292;&#25552;&#39640;&#20010;&#24615;&#21270;&#39550;&#39542;&#35268;&#21010;&#30340;&#24615;&#33021;&#65292;&#23588;&#20854;&#26159;&#22312;&#22823;&#37327;&#25968;&#25454;&#25903;&#25345;&#21644;&#27867;&#21270;&#33021;&#21147;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2407.18569v3 &#39044;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;  &#25688;&#35201;&#65306;&#22312;&#22478;&#24066;&#33258;&#21160;&#21270;&#39550;&#39542;&#20013;&#65292;&#20010;&#24615;&#21270;&#36816;&#21160;&#35268;&#21010;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#23427;&#33021;&#22815;&#28385;&#36275;&#20010;&#20307;&#29992;&#25143;&#30340;&#29420;&#29305;&#38656;&#27714;&#12290;&#28982;&#32780;&#65292;&#20197;&#24448;&#30340;&#21162;&#21147;&#32463;&#24120;&#22312;&#21516;&#26102;&#35299;&#20915;&#20004;&#20010;&#20851;&#38190;&#26041;&#38754;&#26102;&#36935;&#21040;&#22256;&#38590;&#65306;&#22312;&#22797;&#26434;&#30340;&#37117;&#24066;&#29615;&#22659;&#20013;&#36827;&#34892;&#20010;&#24615;&#21270;&#30340;&#35268;&#21010;&#65292;&#20197;&#21450;&#36890;&#36807;&#25968;&#25454;&#21033;&#29992;&#26469;&#25552;&#39640;&#35268;&#21010;&#24615;&#33021;&#12290;&#38382;&#39064;&#30340;&#26681;&#28304;&#22312;&#20110;&#29992;&#25143;&#25968;&#25454;&#30340;&#26114;&#36149;&#21644;&#26377;&#38480;&#24615;&#65292;&#20197;&#21450;&#22330;&#26223;&#29366;&#24577;&#31354;&#38388;&#36235;&#21521;&#26080;&#31351;&#22823;&#30340;&#22240;&#32032;&#65292;&#36825;&#20123;&#22240;&#32032;&#23548;&#33268;&#27169;&#22411;&#35757;&#32451;&#26102;&#20986;&#29616;&#36807;&#25311;&#21512;&#21644;&#27867;&#21270;&#33021;&#21147;&#24046;&#30340;&#38382;&#39064;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#23454;&#20363;&#30340;&#36716;&#31227;&#27169;&#20223;&#23398;&#20064;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;&#20174;&#24191;&#27867;&#30340;&#19987;&#23478;&#39046;&#22495;&#25968;&#25454;&#21521;&#29992;&#25143;&#39046;&#22495;&#36827;&#34892;&#30693;&#35782;&#36716;&#31227;&#65292;&#20174;&#26681;&#26412;&#19978;&#35299;&#20915;&#20102;&#36825;&#20123;&#38382;&#39064;&#12290;&#25105;&#20204;&#39318;&#20808;&#20351;&#29992;&#22823;&#35268;&#27169;&#30340;&#19987;&#23478;&#25968;&#25454;&#23545;&#39044;&#35757;&#32451;&#27169;&#22411;&#36827;&#34892;&#35757;&#32451;&#12290;&#28982;&#21518;&#65292;&#22312;&#29992;&#25143;&#25968;&#25454;&#19978;&#36827;&#34892;&#31934;&#32454;&#35843;&#25972;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32467;&#21512;&#20102;&#27169;&#20223;&#23398;&#20064;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#36890;&#36807;&#23454;&#20363;&#32423;&#21305;&#37197;&#21644;&#31574;&#30053;&#36861;&#36394;&#26469;&#25552;&#39640;&#24615;&#33021;&#12290;&#22312;&#22810;&#20010;&#24066;&#20869;&#39550;&#39542;&#20223;&#30495;&#29615;&#22659;&#20013;&#36827;&#34892;&#35814;&#32454;&#35780;&#20272;&#21518;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340; PP-TIL &#26041;&#27861;&#22312;&#25552;&#39640;&#35268;&#21010;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#65292;&#21516;&#26102;&#22312;&#22823;&#35268;&#27169;&#22810;&#29992;&#25143;&#25968;&#25454;&#38598;&#19978;&#26174;&#31034;&#20986;&#33391;&#22909;&#30340;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.18569v3 Announce Type: replace  Abstract: Personalized motion planning holds significant importance within urban automated driving, catering to the unique requirements of individual users. Nevertheless, prior endeavors have frequently encountered difficulties in simultaneously addressing two crucial aspects: personalized planning within intricate urban settings and enhancing planning performance through data utilization. The challenge arises from the expensive and limited nature of user data, coupled with the scene state space tending towards infinity. These factors contribute to overfitting and poor generalization problems during model training. Henceforth, we propose an instance-based transfer imitation learning approach. This method facilitates knowledge transfer from extensive expert domain data to the user domain, presenting a fundamental resolution to these issues. We initially train a pre-trained model using large-scale expert data. Subsequently, during the fine-tunin
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#24212;&#29992;&#22312;VR&#29615;&#22659;&#20013;&#26469;&#25552;&#21319;&#29992;&#25143;&#20132;&#20114;&#21644;&#20219;&#21153;&#25928;&#29575;&#30340;&#21019;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;unity&#24341;&#25806;&#21644;&#33258;&#30740;&#30340;VLM&#65292;&#23454;&#29616;&#20102;&#26080;&#38656;&#35270;&#35273;&#25991;&#26412;&#25351;&#20196;&#30340;&#23454;&#26102;&#12289;&#30452;&#35266;&#29992;&#25143;&#20132;&#20114;&#12290;&#20351;&#29992;&#35821;&#38899;&#35782;&#21035;&#21644;&#25991;&#26412;&#36716;&#35821;&#38899;&#25216;&#26415;&#65292;&#26377;&#25928;&#25552;&#21319;&#20102;&#29992;&#25143;&#23436;&#25104;&#22797;&#26434;&#20219;&#21153;&#30340;&#25928;&#29575;&#21644;&#33298;&#36866;&#24230;&#12290;</title><link>https://arxiv.org/abs/2405.11537</link><description>&lt;p&gt;
VR-GPT&#65306;&#29992;&#20110;&#26234;&#33021;&#34394;&#25311;&#29616;&#23454;&#24212;&#29992;&#30340;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
VR-GPT: Visual Language Model for Intelligent Virtual Reality Applications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2405.11537
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#24212;&#29992;&#22312;VR&#29615;&#22659;&#20013;&#26469;&#25552;&#21319;&#29992;&#25143;&#20132;&#20114;&#21644;&#20219;&#21153;&#25928;&#29575;&#30340;&#21019;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;unity&#24341;&#25806;&#21644;&#33258;&#30740;&#30340;VLM&#65292;&#23454;&#29616;&#20102;&#26080;&#38656;&#35270;&#35273;&#25991;&#26412;&#25351;&#20196;&#30340;&#23454;&#26102;&#12289;&#30452;&#35266;&#29992;&#25143;&#20132;&#20114;&#12290;&#20351;&#29992;&#35821;&#38899;&#35782;&#21035;&#21644;&#25991;&#26412;&#36716;&#35821;&#38899;&#25216;&#26415;&#65292;&#26377;&#25928;&#25552;&#21319;&#20102;&#29992;&#25143;&#23436;&#25104;&#22797;&#26434;&#20219;&#21153;&#30340;&#25928;&#29575;&#21644;&#33298;&#36866;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2405.11537v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;
&lt;/p&gt;
&lt;p&gt;
arXiv:2405.11537v3 Announce Type: replace  Abstract: The advent of immersive Virtual Reality applications has transformed various domains, yet their integration with advanced artificial intelligence technologies like Visual Language Models remains underexplored. This study introduces a pioneering approach utilizing VLMs within VR environments to enhance user interaction and task efficiency. Leveraging the Unity engine and a custom-developed VLM, our system facilitates real-time, intuitive user interactions through natural language processing, without relying on visual text instructions. The incorporation of speech-to-text and text-to-speech technologies allows for seamless communication between the user and the VLM, enabling the system to guide users through complex tasks effectively. Preliminary experimental results indicate that utilizing VLMs not only reduces task completion times but also improves user comfort and task engagement compared to traditional VR interaction methods.
&lt;/p&gt;</description></item><item><title>EVE &#26159;&#19968;&#20010; iOS &#24212;&#29992;&#31243;&#24207;&#65292;&#23427;&#20351;&#29992;&#30452;&#35266;&#30340;&#22686;&#24378;&#29616;&#23454;&#35270;&#35273;&#25928;&#26524;&#28040;&#38500;&#20102;&#21482;&#26377;&#37027;&#20123;&#33021;&#22815;&#35775;&#38382;&#29289;&#29702;&#26426;&#22120;&#20154;&#30340;&#20154;&#25165;&#33021;&#22815;&#23545;&#26426;&#22120;&#20154;&#36827;&#34892;&#22521;&#35757;&#30340;&#38480;&#21046;&#12290;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#25351;&#23450;&#25163;&#37096;&#31227;&#21160;&#30340;&#36335;&#24452;&#28857;&#12289;&#21487;&#35270;&#21270;&#26816;&#26597;&#29615;&#22659;&#20013;&#30340;&#38556;&#30861;&#29289;&#12289;&#20462;&#25913;&#29616;&#26377;&#30340;&#36335;&#24452;&#28857;&#20197;&#21450;&#39564;&#35777;&#25910;&#38598;&#30340;&#36712;&#36857;&#26469;&#35757;&#32451;&#26426;&#22120;&#20154;&#12290;&#22312;&#21253;&#21547;&#19977;&#20010;&#24120;&#35265;&#26700;&#38754;&#20219;&#21153;&#30340;&#29992;&#25143;&#30740;&#31350;&#20013;&#65288;N=14&#65292;D=30&#65289;&#65292;EVE &#22312;&#25104;&#21151;&#29575;&#21644;&#29289;&#29702;&#31227;&#21160;&#25945;&#20064;&#25216;&#26415;&#30456;&#27604;&#30340;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;</title><link>https://arxiv.org/abs/2404.06089</link><description>&lt;p&gt;
EVE: &#21033;&#29992;&#22686;&#24378;&#29616;&#23454;&#20351;&#20219;&#20309;&#20154;&#37117;&#33021;&#35757;&#32451;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
EVE: Enabling Anyone to Train Robots using Augmented Reality
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.06089
&lt;/p&gt;
&lt;p&gt;
EVE &#26159;&#19968;&#20010; iOS &#24212;&#29992;&#31243;&#24207;&#65292;&#23427;&#20351;&#29992;&#30452;&#35266;&#30340;&#22686;&#24378;&#29616;&#23454;&#35270;&#35273;&#25928;&#26524;&#28040;&#38500;&#20102;&#21482;&#26377;&#37027;&#20123;&#33021;&#22815;&#35775;&#38382;&#29289;&#29702;&#26426;&#22120;&#20154;&#30340;&#20154;&#25165;&#33021;&#22815;&#23545;&#26426;&#22120;&#20154;&#36827;&#34892;&#22521;&#35757;&#30340;&#38480;&#21046;&#12290;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#25351;&#23450;&#25163;&#37096;&#31227;&#21160;&#30340;&#36335;&#24452;&#28857;&#12289;&#21487;&#35270;&#21270;&#26816;&#26597;&#29615;&#22659;&#20013;&#30340;&#38556;&#30861;&#29289;&#12289;&#20462;&#25913;&#29616;&#26377;&#30340;&#36335;&#24452;&#28857;&#20197;&#21450;&#39564;&#35777;&#25910;&#38598;&#30340;&#36712;&#36857;&#26469;&#35757;&#32451;&#26426;&#22120;&#20154;&#12290;&#22312;&#21253;&#21547;&#19977;&#20010;&#24120;&#35265;&#26700;&#38754;&#20219;&#21153;&#30340;&#29992;&#25143;&#30740;&#31350;&#20013;&#65288;N=14&#65292;D=30&#65289;&#65292;EVE &#22312;&#25104;&#21151;&#29575;&#21644;&#29289;&#29702;&#31227;&#21160;&#25945;&#20064;&#25216;&#26415;&#30456;&#27604;&#30340;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.06089v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.06089v3 Announce Type: replace-cross  Abstract: The increasing affordability of robot hardware is accelerating the integration of robots into everyday activities. However, training a robot to automate a task requires expensive trajectory data where a trained human annotator moves a physical robot to train it. Consequently, only those with access to robots produce demonstrations to train robots. In this work, we remove this restriction with EVE, an iOS app that enables everyday users to train robots using intuitive augmented reality visualizations, without needing a physical robot. With EVE, users can collect demonstrations by specifying waypoints with their hands, visually inspecting the environment for obstacles, modifying existing waypoints, and verifying collected trajectories. In a user study (N=14, D=30) consisting of three common tabletop tasks, EVE outperformed three state-of-the-art interfaces in success rate and was comparable to kinesthetic teaching-physically movi
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#21512;&#25104;&#23545;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#21464;&#21270;&#33021;&#22815;&#36866;&#24212;&#30340;&#40065;&#26834;&#31070;&#32463;&#25511;&#21046;&#22120;&#21644;&#35777;&#20070;&#12290;&#36890;&#36807;&#30830;&#20445;Lyapunov&#23548;&#25968;&#30340;&#36882;&#20943;&#24615;&#26469;&#20445;&#35777;&#20102;&#38381;&#29615;&#31995;&#32479;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#36890;&#36807;Lyapunov&#21453;&#21521;&#20256;&#25773;&#31639;&#27861;&#35299;&#20915;&#20102;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#20223;&#30495;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.03017</link><description>&lt;p&gt;
&#20998;&#24067;&#24335;&#40065;&#26834;&#31574;&#30053;&#21644;Lyapunov&#35777;&#20070;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Distributionally Robust Policy and Lyapunov-Certificate Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.03017
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#21512;&#25104;&#23545;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#21464;&#21270;&#33021;&#22815;&#36866;&#24212;&#30340;&#40065;&#26834;&#31070;&#32463;&#25511;&#21046;&#22120;&#21644;&#35777;&#20070;&#12290;&#36890;&#36807;&#30830;&#20445;Lyapunov&#23548;&#25968;&#30340;&#36882;&#20943;&#24615;&#26469;&#20445;&#35777;&#20102;&#38381;&#29615;&#31995;&#32479;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#36890;&#36807;Lyapunov&#21453;&#21521;&#20256;&#25773;&#31639;&#27861;&#35299;&#20915;&#20102;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#20223;&#30495;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#22871;&#26032;&#22411;&#26041;&#27861;&#65292;&#29992;&#20110;&#21512;&#25104;&#20855;&#26377;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#22312;&#32447;&#37096;&#32626;&#26399;&#38388;&#33021;&#22815;&#20934;&#30830;&#30830;&#23450;&#21644;&#36866;&#24212;&#27169;&#22411;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#30340;&#40065;&#26834;&#31283;&#23450;&#31070;&#32463;&#25511;&#21046;&#22120;&#21644;&#25511;&#21046;&#31995;&#32479;&#30340;&#31283;&#23450;&#24615;&#35777;&#20070;&#12290;&#22312;&#35774;&#35745;&#20855;&#26377;&#31283;&#23450;&#24615;&#20445;&#35777;&#30340;&#19981;&#30830;&#23450;&#24615;&#31995;&#32479;&#30340;&#25511;&#21046;&#22120;&#26102;&#65292;&#19968;&#20010;&#20851;&#38190;&#25361;&#25112;&#26159;&#22914;&#20309;&#20934;&#30830;&#22320;&#30830;&#23450;&#22312;&#32447;&#37096;&#32626;&#26399;&#38388;&#27169;&#22411;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#30340;&#21464;&#21270;&#24182;&#23545;&#36825;&#20123;&#21464;&#21270;&#20316;&#20986;&#36866;&#24212;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#39062;&#30340;Lyapunov&#23548;&#25968;&#26426;&#20250;&#32422;&#26463;&#30340;&#20998;&#24067;&#40065;&#26834;&#24418;&#24335;&#26469;&#24212;&#23545;&#36825;&#19968;&#25361;&#25112;&#65292;&#35813;&#24418;&#24335;&#30830;&#20445;Lyapunov&#35777;&#20070;&#30340;&#36882;&#20943;&#24615;&#12290;&#20026;&#20102;&#36991;&#20813;&#22788;&#29702;&#27010;&#29575;&#24230;&#37327;&#31354;&#38388;&#30340;&#39640;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#25105;&#20204;&#35782;&#21035;&#20986;&#19968;&#31181;&#36275;&#22815;&#26465;&#20214;&#65292;&#24418;&#24335;&#20026;&#30830;&#23450;&#24615;&#20984;&#32422;&#26463;&#65292;&#21487;&#20197;&#30830;&#20445;Lyapunov&#23548;&#25968;&#32422;&#26463;&#30340;&#28385;&#36275;&#12290;&#25105;&#20204;&#23558;&#36825;&#19968;&#26465;&#20214;&#38598;&#25104;&#21040;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#25511;&#21046;&#22120;&#30340;&#19968;&#20010;&#25439;&#22833;&#20989;&#25968;&#20013;&#65292;&#24182;&#23637;&#31034;&#20102;&#23545;&#20110;&#30001;&#27492;&#24471;&#21040;&#30340;&#38381;&#29615;&#31995;&#32479;&#65292;Lyapunov&#23548;&#25968;&#26159;&#22312;&#38381;&#29615;&#31995;&#32479;&#20013;&#28385;&#36275;&#30340;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;Lyapunov&#21453;&#21521;&#20256;&#25773;&#30340;&#26032;&#20248;&#21270;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#22312;&#19981;&#30830;&#23450;&#24615;&#21442;&#25968;&#38598;&#19978;&#36941;&#21382;&#12290;&#36890;&#36807;&#20223;&#30495;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#31181;&#25353;&#38656;&#35774;&#35745;&#30340;&#20998;&#24067;&#24335;&#40065;&#26834;&#31070;&#32463;&#25511;&#21046;&#22120;&#33021;&#22815;&#23545;&#31995;&#32479;&#36827;&#34892;&#26377;&#25928;&#30340;&#25511;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.03017v2 Announce Type: replace-cross  Abstract: This article presents novel methods for synthesizing distributionally robust stabilizing neural controllers and certificates for control systems under model uncertainty. A key challenge in designing controllers with stability guarantees for uncertain systems is the accurate determination of and adaptation to shifts in model parametric uncertainty during online deployment. We tackle this with a novel distributionally robust formulation of the Lyapunov derivative chance constraint ensuring a monotonic decrease of the Lyapunov certificate. To avoid the computational complexity involved in dealing with the space of probability measures, we identify a sufficient condition in the form of deterministic convex constraints that ensures the Lyapunov derivative constraint is satisfied. We integrate this condition into a loss function for training a neural network-based controller and show that, for the resulting closed-loop system, the gl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026; SSAP&#65288;Shape-Sensitive Adversarial Patch&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#26088;&#22312;&#22312;&#33258;&#20027;&#23548;&#33322;&#24212;&#29992;&#31243;&#24207;&#20013;&#20840;&#38754;&#30772;&#22351;&#21333;&#30446;Depth&#20272;&#35745;&#65288;MDE&#65289;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#35774;&#35745;&#20855;&#26377;&#24418;&#29366;&#24863;&#30693;&#29305;&#24615;&#30340;&#23545;&#25239;&#24615;&#34917;&#19969;&#65292;&#25925;&#24847;&#35823;&#23548; MDE &#31995;&#32479;&#65292;&#20351;&#20854;&#22312;&#22122;&#22768;&#21644;&#19981;&#30830;&#23450;&#24615;&#20013;&#20173;&#28982;&#26377;&#25928;&#12290;&#23454;&#39564;&#34920;&#26126; SSAP &#33021;&#22815;&#35825;&#23548;&#28145;&#24230;&#20272;&#35745;&#38169;&#35823;&#21644;&#34892;&#20026;&#20915;&#31574;&#20559;&#24046;&#12290;</title><link>https://arxiv.org/abs/2403.11515</link><description>&lt;p&gt;
SSAP&#65306;&#38754;&#21521;&#33258;&#20027;&#23548;&#33322;&#24212;&#29992;&#30340;&#24418;&#29366;&#25935;&#24863;&#23545;&#25239;&#24615;&#34917;&#19969;&#20840;&#38754;&#30772;&#22351;&#21333;&#30446; Depth &#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
SSAP: A Shape-Sensitive Adversarial Patch for Comprehensive Disruption of Monocular Depth Estimation in Autonomous Navigation Applications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11515
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026; SSAP&#65288;Shape-Sensitive Adversarial Patch&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#26088;&#22312;&#22312;&#33258;&#20027;&#23548;&#33322;&#24212;&#29992;&#31243;&#24207;&#20013;&#20840;&#38754;&#30772;&#22351;&#21333;&#30446;Depth&#20272;&#35745;&#65288;MDE&#65289;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#35774;&#35745;&#20855;&#26377;&#24418;&#29366;&#24863;&#30693;&#29305;&#24615;&#30340;&#23545;&#25239;&#24615;&#34917;&#19969;&#65292;&#25925;&#24847;&#35823;&#23548; MDE &#31995;&#32479;&#65292;&#20351;&#20854;&#22312;&#22122;&#22768;&#21644;&#19981;&#30830;&#23450;&#24615;&#20013;&#20173;&#28982;&#26377;&#25928;&#12290;&#23454;&#39564;&#34920;&#26126; SSAP &#33021;&#22815;&#35825;&#23548;&#28145;&#24230;&#20272;&#35745;&#38169;&#35823;&#21644;&#34892;&#20026;&#20915;&#31574;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11515v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449; &#25688;&#35201;&#65306;&#21333;&#30446;&#28145;&#24230;&#20272;&#35745;&#65288;MDE&#65289;&#24050;&#32463;&#36890;&#36807;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNNs&#65289;&#30340;&#25972;&#21512;&#20197;&#21450;&#26368;&#36817;&#65292;Transformer &#30340;&#20351;&#29992;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#36827;&#23637;&#12290;&#20294;&#26159;&#65292;&#23545;&#20110;&#23427;&#20204;&#22312;&#21253;&#25324;&#33258;&#21160;&#39550;&#39542;&#21644;&#26426;&#22120;&#20154;&#23548;&#33322;&#31561;&#23433;&#20840;&#20851;&#38190;&#39046;&#22495;&#23545;&#23545;&#25239;&#24615;&#25915;&#20987;&#30340;&#26131;&#24863;&#24615;&#30340;&#25285;&#24551;&#24050;&#32463;&#20986;&#29616;&#12290;&#35780;&#20272;&#22522;&#20110; CNN &#30340;&#28145;&#24230;&#39044;&#27979;&#26041;&#27861;&#30340;&#29616;&#26377;&#26041;&#27861;&#22312;&#35825;&#23548;&#23545;&#35270;&#35273;&#31995;&#32479;&#30340;&#20840;&#38754;&#30772;&#22351;&#26041;&#38754;&#24050;&#32463;&#19981;&#36275;&#65292;&#24448;&#24448;&#38480;&#20110;&#29305;&#23450;&#21306;&#22495;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026; SSAP&#65288;Shape-Sensitive Adversarial Patch&#65289;&#30340;&#26032;&#22411;&#26041;&#27861;&#65292;&#26088;&#22312;&#22312;&#33258;&#20027;&#23548;&#33322;&#24212;&#29992;&#31243;&#24207;&#20013;&#20840;&#38754;&#30772;&#22351;&#21333;&#30446;&#28145;&#24230;&#20272;&#35745;&#65288;MDE&#65289;&#12290;&#25105;&#20204;&#30340;&#34917;&#19969;&#34987;&#31934;&#24515;&#35774;&#35745;&#25104;&#20197;&#20004;&#31181;&#19981;&#21516;&#30340;&#26041;&#24335;&#26469;&#30772;&#22351; MDE&#65306;&#36890;&#36807;&#25197;&#26354;&#20272;&#35745;&#30340;&#36317;&#31163;&#25110;&#36890;&#36807;&#22312;&#31995;&#32479;&#35270;&#35282;&#20013;&#21019;&#24314;&#29289;&#20307;&#28040;&#22833;&#30340;&#38169;&#35273;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#34917;&#19969;&#20855;&#26377;&#24418;&#29366;&#24863;&#30693;&#29305;&#24322;&#24615;&#65292;&#24847;&#21619;&#30528;&#23427;&#21487;&#20197;&#36873;&#25321;&#24615;&#22320;&#24433;&#21709; MDE&#65292;&#21363;&#20351;&#22312;&#28145;&#24230;&#20272;&#35745;&#20013;&#30340;&#22122;&#22768;&#21644;&#19981;&#30830;&#23450;&#24615;&#20013;&#20063;&#20445;&#25345;&#26377;&#25928;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;SSAP &#33021;&#22815;&#26377;&#25928;&#22320;&#22312;&#22810;&#20010;&#27169;&#22411;&#21644;&#22330;&#26223;&#20013;&#35825;&#23548;&#28145;&#24230;&#20272;&#35745;&#30340;&#38169;&#35823;&#21644;&#34892;&#20026;&#20915;&#31574;&#30340;&#20559;&#24046;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20026;&#29702;&#35299;&#28145;&#24230;&#20272;&#35745;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#25552;&#20379;&#28145;&#21051;&#30340;&#27934;&#35265;&#65292;&#24182;&#20026;&#35774;&#35745;&#21644;&#24320;&#21457;&#26356;&#24378;&#22823;&#30340;&#38450;&#24481;&#31574;&#30053;&#25552;&#20379;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11515v2 Announce Type: replace-cross  Abstract: Monocular depth estimation (MDE) has advanced significantly, primarily through the integration of convolutional neural networks (CNNs) and more recently, Transformers. However, concerns about their susceptibility to adversarial attacks have emerged, especially in safety-critical domains like autonomous driving and robotic navigation. Existing approaches for assessing CNN-based depth prediction methods have fallen short in inducing comprehensive disruptions to the vision system, often limited to specific local areas. In this paper, we introduce SSAP (Shape-Sensitive Adversarial Patch), a novel approach designed to comprehensively disrupt monocular depth estimation (MDE) in autonomous navigation applications. Our patch is crafted to selectively undermine MDE in two distinct ways: by distorting estimated distances or by creating the illusion of an object disappearing from the system's perspective. Notably, our patch is shape-sensi
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30340;&#24037;&#20316;&#25552;&#20379;&#20102;&#19968;&#31181;&#24555;&#36895;&#31639;&#27861;&#65292;&#36890;&#36807;&#20960;&#20309;&#21464;&#25442;&#21644;&#20984;&#20248;&#21270;&#31639;&#27861;&#25214;&#21040;&#26368;&#23567;&#21253;&#22260;&#30340;geodesic&#29699;&#65292;&#20174;&#32780;&#31934;&#30830;&#20869;&#36817;&#20284;&#20102;6D&#23039;&#21183;&#19981;&#30830;&#23450;&#24615;&#38598;&#30340;minium enclosing geodesic ball&#12290;</title><link>https://arxiv.org/abs/2403.09990</link><description>&lt;p&gt;
CLOSURE: &#24555;&#36895;&#23450;&#20301;&#19981;&#30830;&#23450;&#24615;&#38598;&#30340;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
CLOSURE: Fast Quantification of Pose Uncertainty Sets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09990
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30340;&#24037;&#20316;&#25552;&#20379;&#20102;&#19968;&#31181;&#24555;&#36895;&#31639;&#27861;&#65292;&#36890;&#36807;&#20960;&#20309;&#21464;&#25442;&#21644;&#20984;&#20248;&#21270;&#31639;&#27861;&#25214;&#21040;&#26368;&#23567;&#21253;&#22260;&#30340;geodesic&#29699;&#65292;&#20174;&#32780;&#31934;&#30830;&#20869;&#36817;&#20284;&#20102;6D&#23039;&#21183;&#19981;&#30830;&#23450;&#24615;&#38598;&#30340;minium enclosing geodesic ball&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09990v3 &#20844;&#21578;&#31867;&#22411;: &#26367;&#25442; &#25688;&#35201;&#65306;&#25105;&#20204;&#30740;&#31350;&#20102;&#20174;&#23398;&#20064;&#30340;&#26377;&#22122;&#22768;&#27979;&#37327;&#65288;&#20363;&#22914;&#20851;&#38190;&#28857;&#21644;&#23039;&#21183;&#20551;&#35774;&#65289;&#20013;&#23450;&#20301;6D&#23039;&#21183;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#20551;&#35774;&#27979;&#37327;&#22122;&#22768;&#26159;&#26410;&#30693;&#30340;&#20294;&#26377;&#38480;&#30340;&#65292;&#20301;&#32622;&#19981;&#30830;&#23450;&#24615;&#38598;&#65288;PURSE&#65289;&#26159;SE(3)&#30340;&#19968;&#20010;&#23376;&#38598;&#65292;&#21253;&#21547;&#19982;&#27979;&#37327;&#20860;&#23481;&#30340;&#25152;&#26377;&#21487;&#33021;6D&#23039;&#24577;&#12290;&#23613;&#31649;&#24418;&#24335;&#21270;&#31616;&#21333;&#65292;&#32780;&#19988;&#33021;&#22815;&#23884;&#20837;&#19981;&#30830;&#23450;&#24615;&#65292;&#20294;&#30001;&#20110;&#25277;&#35937;&#30340;&#38750;&#20984;&#22810;&#39033;&#24335;&#32422;&#26463;&#65292;PURSE&#24456;&#38590;&#36827;&#34892;&#22788;&#29702;&#21644;&#35299;&#37322;&#12290;PURSE&#30340;&#19968;&#20010;&#21560;&#24341;&#20154;&#30340;&#31616;&#21270;&#26159;&#25214;&#21040;&#20854;&#26368;&#23567;&#21253;&#22260; geodesic &#29699;&#65288;MEGB&#65289;&#65292;&#21363;&#25317;&#26377;&#26368;&#23567;&#36828;&#26399;&#35823;&#24046;&#36793;&#30028;&#30340;&#28857;&#29366;&#23039;&#24577;&#20272;&#35745;&#12290;&#25105;&#20204;&#36129;&#29486;&#20102;&#65288;i&#65289;&#38750;&#20984;PURSE&#30340;&#20960;&#20309;&#35299;&#37322;&#65292;&#20197;&#21450;&#65288;ii&#65289;&#19968;&#20010;&#24555;&#36895;&#31639;&#27861;&#26469;&#20869;&#36817;&#20284;MEGB&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;PURSE&#23545;&#24212;&#20110;&#32422;&#26463;&#21160;&#24577;&#31995;&#32479;&#30340;&#21487;&#34892;&#38598;&#25110;&#32773;&#22810;&#20010;geodesic&#29699;&#30340;&#20132;&#38598;&#65292;&#36825;&#31181;&#35270;&#35282;&#20801;&#35768;&#25105;&#20204;&#36890;&#36807;&#20960;&#20309;&#21464;&#25442;&#21644;&#20984;&#20248;&#21270;&#31639;&#27861;&#25214;&#21040;MEGB&#30340;&#31934;&#30830;&#20869;&#36817;&#20284;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#23545;&#20110;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#21644;&#24555;&#36895;&#23039;&#24577;&#19981;&#30830;&#23450;&#24615;&#35780;&#20272;&#20855;&#26377;&#23454;&#38469;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09990v3 Announce Type: replace  Abstract: We investigate uncertainty quantification of 6D pose estimation from learned noisy measurements (e.g. keypoints and pose hypotheses). Assuming unknown-but-bounded measurement noises, a pose uncertainty set (PURSE) is a subset of SE(3) that contains all possible 6D poses compatible with the measurements. Despite being simple to formulate and its ability to embed uncertainty, the PURSE is difficult to manipulate and interpret due to the many abstract nonconvex polynomial constraints. An appealing simplification of PURSE is to find its minimum enclosing geodesic ball (MEGB), i.e., a point pose estimation with minimum worst-case error bound. We contribute (i) a geometric interpretation of the nonconvex PURSE, and (ii) a fast algorithm to inner approximate the MEGB. Particularly, we show the PURSE corresponds to the feasible set of a constrained dynamical system or the intersection of multiple geodesic balls, and this perspective allows u
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#22810;&#23398;&#31185;&#26041;&#27861;&#65292;&#32467;&#21512;&#22810;&#31181;&#27169;&#22411;&#21644;&#25216;&#26415;&#24320;&#21457;&#26356;&#39640;&#25928;&#12289;&#29992;&#25143;&#20307;&#39564;&#26356;&#20248;&#30340;&#31038;&#20250;&#32463;&#27982;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#12290;</title><link>https://arxiv.org/abs/2402.18294</link><description>&lt;p&gt;
&#36825;&#26159;&#19968;&#20010;&#20851;&#20110;&#36328;&#23398;&#31185;&#30340;&#20154;&#31867;&#31038;&#20250;&#32463;&#27982;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#24320;&#21457;&#30340;&#35770;&#25991;&#12290;
&lt;/p&gt;
&lt;p&gt;
Whole-body Humanoid Robot Locomotion with Human Reference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18294
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#22810;&#23398;&#31185;&#26041;&#27861;&#65292;&#32467;&#21512;&#22810;&#31181;&#27169;&#22411;&#21644;&#25216;&#26415;&#24320;&#21457;&#26356;&#39640;&#25928;&#12289;&#29992;&#25143;&#20307;&#39564;&#26356;&#20248;&#30340;&#31038;&#20250;&#32463;&#27982;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#36328;&#23398;&#31185;&#30340;&#20808;&#36827;&#27169;&#22411;&#65292;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#30340;&#31038;&#20250;&#32463;&#27982;&#20915;&#31574;&#36807;&#31243;&#12290;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#21512;&#22810;&#23398;&#31185;&#26041;&#27861;&#30340;&#26694;&#26550;&#65292;&#20197;&#25552;&#39640;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65288;DSS&#65289;&#30340;&#25928;&#29575;&#21644;&#29992;&#25143;&#20307;&#39564;&#12290;&#36890;&#36807;&#26696;&#20363;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#22312;&#22797;&#26434;&#30340;&#31038;&#20250;&#32463;&#27982;&#29615;&#22659;&#20013;&#24212;&#29992;&#35813;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18294v3 Announce Type: replace  Abstract: Recently, humanoid robots have made significant advances in their ability to perform challenging tasks due to the deployment of Reinforcement Learning (RL), however, the inherent complexity of humanoid robots, including the difficulty of designing complicated reward functions and training entire sophisticated systems, still poses a notable challenge. To conquer these challenges, after many iterations and in-depth investigations, we have meticulously developed a full-size humanoid robot, "Adam", whose innovative structural design greatly improves the efficiency and effectiveness of the imitation learning process. In addition, we have developed a novel imitation learning framework based on an adversarial motion prior, which applies not only to Adam but also to humanoid robots in general. Using the framework, Adam can exhibit unprecedented human-like characteristics in locomotion tasks. Our experimental results demonstrate that the prop
&lt;/p&gt;</description></item><item><title>&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#29983;&#29289;&#36965;&#25511;&#31574;&#30053;&#65292;&#20351;&#29992;&#33258;&#36866;&#24212;&#24041;&#33180;&#21147;&#25511;&#21046;&#65292;&#26088;&#22312;&#26368;&#23567;&#21270;&#24041;&#33180;&#25509;&#35302;&#21147;&#65292;&#30830;&#20445;&#35270;&#32593;&#33180;&#38745;&#33033;&#31359;&#21050;&#25163;&#26415;&#30340;&#23433;&#20840;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.18088</link><description>&lt;p&gt;
&#21452;&#33218;&#31283;&#23450;&#30524;&#22806;&#31185;&#26426;&#22120;&#20154;&#31283;&#24577;&#30524;&#20869;&#26426;&#22120;&#20154;&#19982;&#33258;&#36866;&#24212;&#24041;&#33180;&#21147;&#25511;&#21046;&#65306;&#21512;&#20316;vs. &#36965;&#25511;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Bimanual Manipulation of Steady Hand Eye Robots with Adaptive Sclera Force Control: Cooperative vs. Teleoperation Strategies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18088
&lt;/p&gt;
&lt;p&gt;
&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#29983;&#29289;&#36965;&#25511;&#31574;&#30053;&#65292;&#20351;&#29992;&#33258;&#36866;&#24212;&#24041;&#33180;&#21147;&#25511;&#21046;&#65292;&#26088;&#22312;&#26368;&#23567;&#21270;&#24041;&#33180;&#25509;&#35302;&#21147;&#65292;&#30830;&#20445;&#35270;&#32593;&#33180;&#38745;&#33033;&#31359;&#21050;&#25163;&#26415;&#30340;&#23433;&#20840;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18088v2 Announce Type: &#26367;&#20195;&#25277;&#35937;&#65306;&#22312;&#27809;&#26377;&#25163;&#26415;&#26426;&#22120;&#20154;&#31995;&#32479;&#36741;&#21161;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#35270;&#32593;&#33180;&#38745;&#33033;&#31359;&#21050;&#65288;RVC&#65289;&#27835;&#30103;&#35270;&#32593;&#33180;&#38745;&#33033;&#38381;&#22622;&#65288;RVO&#65289;&#38750;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#20854;&#20027;&#35201;&#38480;&#21046;&#26159;&#22806;&#31185;&#21307;&#29983;&#29983;&#29702;&#19978;&#30340;&#25163;&#39076;&#25238;&#12290;&#20351;&#29992;&#25163;&#26415;&#26426;&#22120;&#20154;&#25216;&#26415;&#21487;&#33021;&#20250;&#35299;&#20915;&#25163;&#39076;&#25238;&#21644;&#30130;&#21171;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#39640;RVC&#30340;&#23433;&#20840;&#24615;&#21644;&#31934;&#24230;&#12290;&#31283;&#24577;&#30524;&#20869;&#26426;&#22120;&#20154;&#65288;SHER&#65289;&#26159;&#19968;&#31181;&#22522;&#20110;&#25509;&#32435;&#30340;&#26426;&#22120;&#20154;&#31995;&#32479;&#65292;&#21487;&#20197;&#28388;&#38500;&#25163;&#39076;&#25238;&#65292;&#24182;&#20801;&#35768;&#30524;&#31185;&#21307;&#29983;&#22312;&#37319;&#21462;&#21512;&#20316;&#27169;&#24335;&#19979;&#25805;&#32437;&#25163;&#26415;&#22120;&#26800;&#36827;&#20837;&#30524;&#30555;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;&#25509;&#32435;&#30340;&#21512;&#20316;&#25511;&#21046;&#27169;&#24335;&#24182;&#19981;&#33021;&#23433;&#20840;&#22320;&#20943;&#23569;&#25163;&#26415;&#22120;&#26800;&#21644;&#24041;&#33180;&#20043;&#38388;&#30340;&#25509;&#35302;&#21147;&#65292;&#20197;&#30830;&#20445;&#19981;&#20250;&#36896;&#25104;&#32452;&#32455;&#25439;&#20260;&#12290;&#27492;&#22806;&#65292;&#22914;&#35302;&#35273;&#21453;&#39304;&#25110;&#25163;&#37096;&#36816;&#21160;&#32553;&#25918;&#31561;&#29305;&#24615;&#65292;&#36825;&#20123;&#29305;&#24615;&#21487;&#20197;&#25552;&#39640;&#25163;&#26415;&#30340;&#23433;&#20840;&#24615;&#21644;&#31934;&#24230;&#65292;&#23427;&#20204;&#38656;&#35201;&#19968;&#20010;&#36965;&#25511;&#25511;&#21046;&#26550;&#26500;&#12290;&#26412;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33258;&#36866;&#24212;&#24041;&#33180;&#21147;&#25511;&#21046;&#30340;&#29983;&#29289;&#36965;&#25511;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#21487;&#20197;&#23558;&#24041;&#33180;&#30340;&#25509;&#35302;&#21147;&#38477;&#21040;&#26368;&#20302;&#65292;&#30830;&#20445;&#25163;&#26415;&#36807;&#31243;&#20013;&#30340;&#23433;&#20840;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18088v2 Announce Type: replace  Abstract: Performing retinal vein cannulation (RVC) as a potential treatment for retinal vein occlusion (RVO) without the assistance of a surgical robotic system is very challenging to do safely. The main limitation is the physiological hand tremor of surgeons. Robot-assisted eye surgery technology may resolve the problems of hand tremors and fatigue and improve the safety and precision of RVC. The Steady-Hand Eye Robot (SHER) is an admittance-based robotic system that can filter out hand tremors and enables ophthalmologists to manipulate a surgical instrument inside the eye cooperatively. However, the admittance-based cooperative control mode does not safely minimize the contact force between the surgical instrument and the sclera to prevent tissue damage. Additionally, features like haptic feedback or hand motion scaling, which can improve the safety and precision of surgery, require a teleoperation control framework. This work presents a bi
&lt;/p&gt;</description></item><item><title>&#35813;&#26041;&#27861;&#36890;&#36807;&#25913;&#36827;&#30340;&#19977;&#28857;&#37319;&#26679;&#21644;&#25490;&#24207;&#26426;&#21046;&#22312;99%&#30340;&#24322;&#24120;&#20540;&#27604;&#20363;&#19979;&#23454;&#29616;&#20102;&#28857;&#20113;&#27880;&#20876;&#30340;&#39640;&#25928;&#24615;&#21644;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.16598</link><description>&lt;p&gt;
PCR-99: &#19968;&#31181;&#36866;&#29992;&#20110;99%&#24322;&#24120;&#20540;&#28857;&#20113;&#27880;&#20876;&#30340;&#23454;&#29992;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
PCR-99: A Practical Method for Point Cloud Registration with 99 Percent Outliers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16598
&lt;/p&gt;
&lt;p&gt;
&#35813;&#26041;&#27861;&#36890;&#36807;&#25913;&#36827;&#30340;&#19977;&#28857;&#37319;&#26679;&#21644;&#25490;&#24207;&#26426;&#21046;&#22312;99%&#30340;&#24322;&#24120;&#20540;&#27604;&#20363;&#19979;&#23454;&#29616;&#20102;&#28857;&#20113;&#27880;&#20876;&#30340;&#39640;&#25928;&#24615;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#22788;&#29702;&#28857;&#20113;&#27880;&#20876;&#38382;&#39064;&#65292;&#33021;&#22815;&#22788;&#29702;&#26410;&#30693;&#27604;&#20363;&#23610;&#21644;&#26497;&#39640;&#30340;&#24322;&#24120;&#20540;&#27604;&#20363;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;PCR-99&#65292;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#19977;&#28857;&#37319;&#26679;&#26041;&#27861;&#30340;&#30830;&#23450;&#24615;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#26159;&#20004;&#32773;&#30340;&#21019;&#26032;&#26426;&#21046;&#65306;&#65288;1&#65289;&#22522;&#20110;&#25104;&#23545;&#27604;&#20363;&#23610;&#19968;&#33268;&#24615;&#30340;&#26679;&#26412;&#25490;&#24207;&#65292;&#20248;&#20808;&#32771;&#34385;&#26356;&#26377;&#21487;&#33021;&#25104;&#20026;&#20869;&#28857;&#30340;&#28857;&#23545;&#24212;&#20851;&#31995;&#65307;&#20197;&#21450;&#65288;2&#65289;&#22522;&#20110;&#19977;&#20803;&#32452;&#27604;&#20363;&#23610;&#19968;&#33268;&#24615;&#30340;&#39640;&#25928;&#24322;&#24120;&#20540;&#25298;&#32477;&#26041;&#26696;&#65292;&#39044;&#20808;&#31579;&#36873;&#19981;&#33391;&#26679;&#26412;&#65292;&#20943;&#23569;&#38656;&#35201;&#34987;&#27979;&#35797;&#30340;&#20551;&#35774;&#25968;&#37327;&#12290;&#25105;&#20204;&#30340;&#35780;&#20272;&#26174;&#31034;&#65292;&#22312;98%&#24322;&#24120;&#20540;&#27604;&#20363;&#26102;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#19982;&#29616;&#26377;&#25216;&#26415;&#30456;&#24403;&#12290;&#28982;&#32780;&#65292;&#22312;99%&#24322;&#24120;&#20540;&#27604;&#20363;&#26102;&#65292;&#23427;&#22312;&#24050;&#30693;&#27604;&#20363;&#23610;&#21644;&#26410;&#30693;&#27604;&#20363;&#23610;&#38382;&#39064;&#26041;&#38754;&#37117;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#25216;&#26415;&#12290;&#23588;&#20854;&#26159;&#22312;&#21518;&#32773;&#26041;&#38754;&#65292;&#25105;&#20204;&#22312;&#40065;&#26834;&#24615;&#21644;&#36895;&#24230;&#19978;&#35266;&#23519;&#21040;&#26126;&#26174;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16598v5 Announce Type: replace-cross  Abstract: We propose a robust method for point cloud registration that can handle both unknown scales and extreme outlier ratios. Our method, dubbed PCR-99, uses a deterministic 3-point sampling approach with two novel mechanisms that significantly boost the speed: (1) an improved ordering of the samples based on pairwise scale consistency, prioritizing the point correspondences that are more likely to be inliers, and (2) an efficient outlier rejection scheme based on triplet scale consistency, prescreening bad samples and reducing the number of hypotheses to be tested. Our evaluation shows that, up to 98% outlier ratio, the proposed method achieves comparable performance to the state of the art. At 99% outlier ratio, however, it outperforms the state of the art for both known-scale and unknown-scale problems. Especially for the latter, we observe a clear superiority in terms of robustness and speed.
&lt;/p&gt;</description></item></channel></rss>