<rss version="2.0"><channel><title>Chat Arxiv nlin</title><link>https://github.com/chrunx/cn-chat-arxiv</link><description>This is arxiv RSS feed for nlin</description><item><title>PDMs, we carry out experiments on the temporal evolution of vortices in the velocity field and show that the coarsest PDMs capture these vortices much better than POD/PCA. Additionally, our method allows for a fast creation of trajectory-based descriptors in the large parameter space, aiding in a comprehensive understanding of the mechanisms behind the transition to turbulence and suggesting a potential route to control these fluid flows.</title><link>https://arxiv.org/abs/2408.02630</link><description>&lt;p&gt;
Learning the Latent dynamics of Fluid flows from High-Fidelity Numerical Simulations using Parsimonious Diffusion Maps
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02630
&lt;/p&gt;
&lt;p&gt;
PDMs, we carry out experiments on the temporal evolution of vortices in the velocity field and show that the coarsest PDMs capture these vortices much better than POD/PCA. Additionally, our method allows for a fast creation of trajectory-based descriptors in the large parameter space, aiding in a comprehensive understanding of the mechanisms behind the transition to turbulence and suggesting a potential route to control these fluid flows.
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02630v1 Announce Type: cross  Abstract: We use parsimonious diffusion maps (PDMs) to discover the latent dynamics of high-fidelity Navier-Stokes simulations with a focus on the 2D fluidic pinball problem. By varying the Reynolds number, different flow regimes emerge, ranging from steady symmetric flows to quasi-periodic asymmetric and turbulence. We show, that the proposed non-linear manifold learning scheme, identifies in a crisp manner the expected intrinsic dimension of the underlying emerging dynamics over the parameter space. In particular, PDMs, estimate that the emergent dynamics in the oscillatory regime can be captured by just two variables, while in the chaotic regime, the dominant modes are three as anticipated by the normal form theory. On the other hand, proper orthogonal decomposition (POD)/PCA, most commonly used for dimensionality reduction in fluid mechanics, does not provide such a crisp separation between the dominant modes. To validate the performance of 
&lt;/p&gt;</description></item><item><title>Title: &#25968;&#23383;&#21453;&#36716;&#25805;&#20316;&#24341;&#21457;&#20016;&#23500;&#30340;&#21160;&#21147;&#23398;&#34892;&#20026;
&#25688;&#35201;&#65306;arXiv:2408.02527v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#25688;&#35201;&#65306;&#21487;&#20197;&#23558;&#19968;&#20010;&#23558;&#19968;&#20010;&#33258;&#28982;&#25968;&#26144;&#23556;&#21040;&#21478;&#19968;&#20010;&#33258;&#28982;&#25968;&#30340;&#25805;&#20316;&#35270;&#20026;&#22312; $\mathbb{N}^+$ &#19978;&#30340;&#21160;&#21147;&#31995;&#32479;&#12290;&#20363;&#22914;&#65292;Collatz &#25552;&#20986;&#30340;&#25152;&#35859;&#30340; 3x+1 &#38382;&#39064;&#20013;&#30340;&#26144;&#23556;&#34987;&#29468;&#27979;&#26377;&#19968;&#20010;&#21333;&#19968;&#30340;&#20840;&#23616;&#21560;&#24341;&#23376;&#65292;&#32780;&#20854;&#20182;&#31995;&#32479;&#65292;&#22914;&#32447;&#24615;&#21516;&#20313;&#26041;&#31243;&#65292;&#21487;&#33021;&#26159; ergodic&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#22522;&#20110;&#25968;&#23383;&#21453;&#36716;&#30340;&#25805;&#20316;&#20855;&#26377;&#19968;&#31995;&#21015;&#21160;&#21147;&#23398;&#34892;&#20026;&#65292;&#21253;&#25324; 2 &#24490;&#29615;&#12289;12 &#24490;&#29615;&#12289;&#20854;&#20182;&#24490;&#29615;&#38271;&#24230;&#30340;&#21608;&#26399;&#21560;&#24341;&#23376;&#20197;&#21450;&#36867;&#36920;&#21040;&#26080;&#31351;&#22823;&#30340;&#26497;&#38480;&#21160;&#24577;&#12290;&#36825;&#20010;&#21160;&#21147;&#31995;&#32479;&#26377;&#26080;&#38480;&#25968;&#37327;&#30340;&#21608;&#26399;&#21560;&#24341;&#23376;&#65292;&#21487;&#33021;&#36824;&#26377;&#26080;&#38480;&#25968;&#37327;&#30340;&#24490;&#29615;&#38271;&#24230;&#12290;&#23427;&#20063;&#26377;&#21487;&#33021;&#26080;&#38480;&#25968;&#37327;&#30340;&#36867;&#36920;&#36712;&#36857;&#65292;&#20854;&#37325;&#22797;&#27169;&#24335;&#27599;&#20843;&#27493;&#37325;&#22797;&#19968;&#27425;&#12290;&#23613;&#31649;&#22312;&#21040;&#36798;&#26497;&#38480;&#21160;&#24577;&#20043;&#21069;&#30340;&#26102;&#38388;&#30456;&#23545;&#30701;&#26242;&#65292;&#25105;&#20204;&#25512;&#27979;&#26102;&#38388;&#38271;&#24230;&#21487;&#33021;&#27809;&#26377;&#19978;&#38480;&#12290;</title><link>https://arxiv.org/abs/2408.02527</link><description>&lt;p&gt;
Rich dynamical behaviors from a digital reversal operation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02527
&lt;/p&gt;
&lt;p&gt;
Title: &#25968;&#23383;&#21453;&#36716;&#25805;&#20316;&#24341;&#21457;&#20016;&#23500;&#30340;&#21160;&#21147;&#23398;&#34892;&#20026;
&#25688;&#35201;&#65306;arXiv:2408.02527v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;  &#25688;&#35201;&#65306;&#21487;&#20197;&#23558;&#19968;&#20010;&#23558;&#19968;&#20010;&#33258;&#28982;&#25968;&#26144;&#23556;&#21040;&#21478;&#19968;&#20010;&#33258;&#28982;&#25968;&#30340;&#25805;&#20316;&#35270;&#20026;&#22312; $\mathbb{N}^+$ &#19978;&#30340;&#21160;&#21147;&#31995;&#32479;&#12290;&#20363;&#22914;&#65292;Collatz &#25552;&#20986;&#30340;&#25152;&#35859;&#30340; 3x+1 &#38382;&#39064;&#20013;&#30340;&#26144;&#23556;&#34987;&#29468;&#27979;&#26377;&#19968;&#20010;&#21333;&#19968;&#30340;&#20840;&#23616;&#21560;&#24341;&#23376;&#65292;&#32780;&#20854;&#20182;&#31995;&#32479;&#65292;&#22914;&#32447;&#24615;&#21516;&#20313;&#26041;&#31243;&#65292;&#21487;&#33021;&#26159; ergodic&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#22522;&#20110;&#25968;&#23383;&#21453;&#36716;&#30340;&#25805;&#20316;&#20855;&#26377;&#19968;&#31995;&#21015;&#21160;&#21147;&#23398;&#34892;&#20026;&#65292;&#21253;&#25324; 2 &#24490;&#29615;&#12289;12 &#24490;&#29615;&#12289;&#20854;&#20182;&#24490;&#29615;&#38271;&#24230;&#30340;&#21608;&#26399;&#21560;&#24341;&#23376;&#20197;&#21450;&#36867;&#36920;&#21040;&#26080;&#31351;&#22823;&#30340;&#26497;&#38480;&#21160;&#24577;&#12290;&#36825;&#20010;&#21160;&#21147;&#31995;&#32479;&#26377;&#26080;&#38480;&#25968;&#37327;&#30340;&#21608;&#26399;&#21560;&#24341;&#23376;&#65292;&#21487;&#33021;&#36824;&#26377;&#26080;&#38480;&#25968;&#37327;&#30340;&#24490;&#29615;&#38271;&#24230;&#12290;&#23427;&#20063;&#26377;&#21487;&#33021;&#26080;&#38480;&#25968;&#37327;&#30340;&#36867;&#36920;&#36712;&#36857;&#65292;&#20854;&#37325;&#22797;&#27169;&#24335;&#27599;&#20843;&#27493;&#37325;&#22797;&#19968;&#27425;&#12290;&#23613;&#31649;&#22312;&#21040;&#36798;&#26497;&#38480;&#21160;&#24577;&#20043;&#21069;&#30340;&#26102;&#38388;&#30456;&#23545;&#30701;&#26242;&#65292;&#25105;&#20204;&#25512;&#27979;&#26102;&#38388;&#38271;&#24230;&#21487;&#33021;&#27809;&#26377;&#19978;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02527v1 Announce Type: new  Abstract: An operation that maps one natural number to another can be considered as a dynamical system in $\mathbb{N}^+$. Some of such systems, e.g. the mapping in the so-called 3x+1 problem proposed by Collatz, is conjectured to have a single global attractor, whereas other systems, e.g. linear congruence, could be ergodic. Here we demonstrate that an operation that is based on digital reversal, has a spectrum of dynamical behaviors, including 2-cycle, 12-cycle, periodic attractors with other cycle lengths, and diverging limiting dynamics that escape to infinity. This dynamical system has infinite number of cyclic attractors, and may have unlimited number of cycle lengths. It also has potentially infinite number of diverging trajectories with a recurrent pattern repeating every 8 steps. Although the transient time before settling on a limiting dynamics is relatively short, we speculate that transient times may not have an upper bound.
&lt;/p&gt;</description></item><item><title>&#26631;&#39064;&#65306;&#20855;&#26377;&#25193;&#25955;&#30456;&#20114;&#20316;&#29992;&#30340;&#25670;&#32593;
&#25688;&#35201;&#65306;arXiv:2408.02352v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449; &#25688;&#35201;&#65306;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20855;&#26377;&#25193;&#25955;&#30456;&#20114;&#20316;&#29992;&#30340;&#32806;&#21512;&#25670;&#31995;&#32479;&#65292;&#36825;&#31181;&#30456;&#20114;&#20316;&#29992;&#21487;&#33021;&#21516;&#26102;&#21462;&#20915;&#20110;&#20301;&#32622;&#21644;&#21160;&#37327;&#12290;&#32806;&#21512;&#32467;&#26500;&#30001;&#26080;&#21521;&#32593;&#32476;&#23450;&#20041;&#65292;&#21160;&#24577;&#26041;&#31243;&#26159;&#20174;Hamilton&#31639;&#23376;&#23548;&#20986;&#30340;&#65307;&#22240;&#27492;&#65292;&#33021;&#37327;&#26159;&#23432;&#24658;&#30340;&#12290;&#25105;&#20204;&#20026;&#26377;&#38480;&#30340;&#36816;&#21160;&#25552;&#20379;&#20102;&#20851;&#20110;&#33021;&#37327;&#20805;&#36275;&#26465;&#20214;&#65292;&#35782;&#21035;&#20102;&#25391;&#33633;&#21306;&#22495;&#12290;&#25105;&#20204;&#36824;&#25551;&#36848;&#20102;&#21516;&#27493;&#29366;&#24577;&#30340;&#20998;&#24418;&#65292;&#36890;&#36807;&#19982;&#32593;&#32476;&#32467;&#26500;&#30456;&#20851;&#30340;&#37327;&#26469;&#21033;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#29305;&#23450;&#20110;&#27169;&#22411;&#30340;&#21453;&#21516;&#27493;&#27169;&#24335;&#12290;&#36825;&#26679;&#30340;&#27169;&#24335;&#21487;&#20197;&#36890;&#36807;&#26597;&#30475;&#36136;&#24515;&#36816;&#21160;&#30340;&#36712;&#36857;&#26469;&#32852;&#31995;&#21040;&#31995;&#32479;&#30340;&#20840;&#23616;&#29305;&#24615;&#12290;&#28982;&#32780;&#65292;&#21453;&#21516;&#27493;&#27169;&#24335;&#22312;&#20998;&#24418;&#20998;&#26512;&#20013;&#20063;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#23545;&#20110;&#26377;&#24456;&#22810;&#33410;&#28857;&#30340;&#22270;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#20998;&#24418;&#21457;&#29983;&#30340;&#21442;&#25968;&#33539;&#22260;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#35745;&#31639;&#21644;&#22270;&#24418;&#20998;&#26512;&#26469;&#22686;&#24378;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2408.02352</link><description>&lt;p&gt;
Networks of Pendula with Diffusive Interactions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02352
&lt;/p&gt;
&lt;p&gt;
&#26631;&#39064;&#65306;&#20855;&#26377;&#25193;&#25955;&#30456;&#20114;&#20316;&#29992;&#30340;&#25670;&#32593;
&#25688;&#35201;&#65306;arXiv:2408.02352v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449; &#25688;&#35201;&#65306;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20855;&#26377;&#25193;&#25955;&#30456;&#20114;&#20316;&#29992;&#30340;&#32806;&#21512;&#25670;&#31995;&#32479;&#65292;&#36825;&#31181;&#30456;&#20114;&#20316;&#29992;&#21487;&#33021;&#21516;&#26102;&#21462;&#20915;&#20110;&#20301;&#32622;&#21644;&#21160;&#37327;&#12290;&#32806;&#21512;&#32467;&#26500;&#30001;&#26080;&#21521;&#32593;&#32476;&#23450;&#20041;&#65292;&#21160;&#24577;&#26041;&#31243;&#26159;&#20174;Hamilton&#31639;&#23376;&#23548;&#20986;&#30340;&#65307;&#22240;&#27492;&#65292;&#33021;&#37327;&#26159;&#23432;&#24658;&#30340;&#12290;&#25105;&#20204;&#20026;&#26377;&#38480;&#30340;&#36816;&#21160;&#25552;&#20379;&#20102;&#20851;&#20110;&#33021;&#37327;&#20805;&#36275;&#26465;&#20214;&#65292;&#35782;&#21035;&#20102;&#25391;&#33633;&#21306;&#22495;&#12290;&#25105;&#20204;&#36824;&#25551;&#36848;&#20102;&#21516;&#27493;&#29366;&#24577;&#30340;&#20998;&#24418;&#65292;&#36890;&#36807;&#19982;&#32593;&#32476;&#32467;&#26500;&#30456;&#20851;&#30340;&#37327;&#26469;&#21033;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#29305;&#23450;&#20110;&#27169;&#22411;&#30340;&#21453;&#21516;&#27493;&#27169;&#24335;&#12290;&#36825;&#26679;&#30340;&#27169;&#24335;&#21487;&#20197;&#36890;&#36807;&#26597;&#30475;&#36136;&#24515;&#36816;&#21160;&#30340;&#36712;&#36857;&#26469;&#32852;&#31995;&#21040;&#31995;&#32479;&#30340;&#20840;&#23616;&#29305;&#24615;&#12290;&#28982;&#32780;&#65292;&#21453;&#21516;&#27493;&#27169;&#24335;&#22312;&#20998;&#24418;&#20998;&#26512;&#20013;&#20063;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#23545;&#20110;&#26377;&#24456;&#22810;&#33410;&#28857;&#30340;&#22270;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#20998;&#24418;&#21457;&#29983;&#30340;&#21442;&#25968;&#33539;&#22260;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#35745;&#31639;&#21644;&#22270;&#24418;&#20998;&#26512;&#26469;&#22686;&#24378;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02352v1 Announce Type: cross  Abstract: We study a system of coupled pendula with diffusive interactions, which could depend both on positions and on momenta. The coupling structure is defined by an undirected network, while the dynamic equations are derived from a Hamiltonian; as such, the energy is conserved. We provide sufficient conditions on the energy for bounded motion, identifying the oscillatory regime. We also describe the bifurcations of synchronised states, exploiting the quantities related to the network structure. Moreover, we consider patterns of anti-synchrony arising from the specific properties of the model. Such patterns can be linked to global properties of the system by looking at motion of the centre of mass. Nonetheless, the anti-synchrony patterns play also a relevant role in the bifurcation analysis. For the case of graphs with a large number of nodes, we characterise the parameter range in which the bifurcations occur. We complement the analysis wit
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22312;&#24367;&#26354;&#32479;&#35745; manifold &#19978;&#20351;&#29992;&#26368;&#22823;&#21270;&#29109;&#21407;&#29702;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#26354;&#38754;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#19968;&#31867;&#30740;&#31350;&#26356;&#39640;&#38454;&#29616;&#35937;&#30340;&#21407;&#22411;&#27169;&#22411;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#20123;&#26354;&#38754;&#31070;&#32463;&#32593;&#32476;&#33021;&#22815;&#23454;&#29616;&#33258;&#25105;&#35843;&#33410;&#36864;&#28779;&#36807;&#31243;&#65292;&#20174;&#32780;&#21152;&#36895;&#35760;&#24518;&#26816;&#32034;&#65292;&#23548;&#33268;&#20855;&#26377;&#22810;&#37325;&#31283;&#23450;&#24615;&#21644;&#28382;&#21518;&#25928;&#24212;&#30340;&#22810;&#30456;&#21464;&#29190;&#28856;&#34892;&#20026;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#20351;&#29992;&#37325;&#36148;&#25216;&#24039;&#20998;&#26512;&#20854;&#20020;&#30028;&#38468;&#36817;&#30340;&#35760;&#24518;&#23481;&#37327;&#65292;&#26412;&#25991;&#36824;&#21457;&#29616;&#36825;&#20123;&#32593;&#32476;&#27604;&#32463;&#20856;&#20851;&#32852;&#35760;&#24518;&#32593;&#32476;&#20855;&#26377;&#26356;&#39640;&#30340;&#35760;&#24518;&#23481;&#37327;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#26412;&#25991;&#25552;&#20986;&#30340;&#26694;&#26550;&#20026;&#31616;&#32422;&#27169;&#22411;&#30340;&#30740;&#31350;&#21644;&#26356;&#39640;&#25928;&#35760;&#24518;&#26816;&#32034;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2408.02326</link><description>&lt;p&gt;
Explosive neural networks via higher-order interactions in curved statistical manifolds
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02326
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#24367;&#26354;&#32479;&#35745; manifold &#19978;&#20351;&#29992;&#26368;&#22823;&#21270;&#29109;&#21407;&#29702;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#26354;&#38754;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#19968;&#31867;&#30740;&#31350;&#26356;&#39640;&#38454;&#29616;&#35937;&#30340;&#21407;&#22411;&#27169;&#22411;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#20123;&#26354;&#38754;&#31070;&#32463;&#32593;&#32476;&#33021;&#22815;&#23454;&#29616;&#33258;&#25105;&#35843;&#33410;&#36864;&#28779;&#36807;&#31243;&#65292;&#20174;&#32780;&#21152;&#36895;&#35760;&#24518;&#26816;&#32034;&#65292;&#23548;&#33268;&#20855;&#26377;&#22810;&#37325;&#31283;&#23450;&#24615;&#21644;&#28382;&#21518;&#25928;&#24212;&#30340;&#22810;&#30456;&#21464;&#29190;&#28856;&#34892;&#20026;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#20351;&#29992;&#37325;&#36148;&#25216;&#24039;&#20998;&#26512;&#20854;&#20020;&#30028;&#38468;&#36817;&#30340;&#35760;&#24518;&#23481;&#37327;&#65292;&#26412;&#25991;&#36824;&#21457;&#29616;&#36825;&#20123;&#32593;&#32476;&#27604;&#32463;&#20856;&#20851;&#32852;&#35760;&#24518;&#32593;&#32476;&#20855;&#26377;&#26356;&#39640;&#30340;&#35760;&#24518;&#23481;&#37327;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#26412;&#25991;&#25552;&#20986;&#30340;&#26694;&#26550;&#20026;&#31616;&#32422;&#27169;&#22411;&#30340;&#30740;&#31350;&#21644;&#26356;&#39640;&#25928;&#35760;&#24518;&#26816;&#32034;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02326v1 Announce Type: cross  Abstract: Higher-order interactions underlie complex phenomena in systems such as biological and artificial neural networks, but their study is challenging due to the lack of tractable standard models. By leveraging the maximum entropy principle in curved statistical manifolds, here we introduce curved neural networks as a class of prototypical models for studying higher-order phenomena. Through exact mean-field descriptions, we show that these curved neural networks implement a self-regulating annealing process that can accelerate memory retrieval, leading to explosive order-disorder phase transitions with multi-stability and hysteresis effects. Moreover, by analytically exploring their memory capacity using the replica trick near ferromagnetic and spin-glass phase boundaries, we demonstrate that these networks enhance memory capacity over the classical associative-memory networks. Overall, the proposed framework provides parsimonious models am
&lt;/p&gt;</description></item><item><title>Title: &#22833;&#23545;&#31216;&#24378;&#36843;&#25171;&#30772;&#21160;&#24577;&#32593;&#32476;&#20013;&#19981;&#21464;&#29615;&#38754;&#30340;&#28044;&#29616;
&#25688;&#35201;&#65306;arXiv:2408.02119v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#27719; &#25688;&#35201;&#65306;&#25105;&#20204;&#32771;&#34385;&#32806;&#21512;&#30456;&#20301;&#25391;&#33633;&#22120;&#32593;&#32476;&#20013;&#30340;&#21516;&#27493;&#27169;&#24335;&#65292;&#36825;&#20123;&#27169;&#24335;&#23545;&#24212;&#20110;&#19981;&#21464;&#29615;&#38754;&#12290;&#23545;&#20110;&#38750;&#19968;&#33324;&#24615;&#30340;&#32806;&#21512;&#24773;&#20917;&#65292;&#36825;&#20123;&#29615;&#38754;&#26159;&#23545;&#26576;&#20010;&#36830;&#32493;&#23545;&#31216;&#25805;&#20316;&#30340;&#24179;&#34913;&#28857;&#12290;&#25105;&#20204;&#23545;&#22914;&#20309;&#22312;&#19981;&#23436;&#20840;&#23545;&#31216;&#25171;&#30772;&#65288;forced symmetry breaking&#65289;&#19979;&#35745;&#31639;&#19981;&#21464;&#29615;&#38754;&#30340;&#21464;&#24418;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#20316;&#20026;&#26222;&#36941;&#32593;&#32476;&#20132;&#20114;&#39033;&#30340;&#24341;&#20837;&#65292;&#29615;&#38754;&#20250;&#21464;&#24418;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#65292;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#30456;&#23545;&#20110;&#24179;&#34913;&#28857;&#30340;&#29615;&#38754;&#21487;&#20197;&#36890;&#36807;&#21442;&#25968;&#21270;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#65307;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24471;&#21040;&#29615;&#38754;&#30340;&#23884;&#20837;&#65292;&#20197;&#21450;&#29615;&#38754;&#19978;&#30340;&#23616;&#37096;&#21160;&#21147;&#23398;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#36825;&#19968;&#25104;&#26524;&#24212;&#29992;&#20110;&#32806;&#21512;&#25391;&#33633;&#22120;&#32593;&#32476;&#65292;&#24182;&#22312;&#36793;&#30028;&#20540;&#38382;&#39064;&#35774;&#32622;&#20013;&#36890;&#36807;&#23547;&#25214;&#21608;&#26399;&#36712;&#36947;&#30340;&#20998;&#25903;&#26469;&#30740;&#31350;&#29615;&#38754;&#19978;&#30340;&#21160;&#21147;&#23398;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#26032;&#30340;&#31283;&#23450;&#21516;&#27493;&#27169;&#24335;&#65292;&#36825;&#20123;&#27169;&#24335;&#21487;&#20197;&#26500;&#25104;&#26356;&#22797;&#26434;&#30340;&#20840;&#29699;&#32467;&#26500;&#65292;&#22914;&#32437;&#26029;&#27969;&#36890;&#36335;&#24490;&#29615;&#12290;</title><link>https://arxiv.org/abs/2408.02119</link><description>&lt;p&gt;
Dynamics on invariant tori emerging through forced symmetry breaking in phase oscillator networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02119
&lt;/p&gt;
&lt;p&gt;
Title: &#22833;&#23545;&#31216;&#24378;&#36843;&#25171;&#30772;&#21160;&#24577;&#32593;&#32476;&#20013;&#19981;&#21464;&#29615;&#38754;&#30340;&#28044;&#29616;
&#25688;&#35201;&#65306;arXiv:2408.02119v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#27719; &#25688;&#35201;&#65306;&#25105;&#20204;&#32771;&#34385;&#32806;&#21512;&#30456;&#20301;&#25391;&#33633;&#22120;&#32593;&#32476;&#20013;&#30340;&#21516;&#27493;&#27169;&#24335;&#65292;&#36825;&#20123;&#27169;&#24335;&#23545;&#24212;&#20110;&#19981;&#21464;&#29615;&#38754;&#12290;&#23545;&#20110;&#38750;&#19968;&#33324;&#24615;&#30340;&#32806;&#21512;&#24773;&#20917;&#65292;&#36825;&#20123;&#29615;&#38754;&#26159;&#23545;&#26576;&#20010;&#36830;&#32493;&#23545;&#31216;&#25805;&#20316;&#30340;&#24179;&#34913;&#28857;&#12290;&#25105;&#20204;&#23545;&#22914;&#20309;&#22312;&#19981;&#23436;&#20840;&#23545;&#31216;&#25171;&#30772;&#65288;forced symmetry breaking&#65289;&#19979;&#35745;&#31639;&#19981;&#21464;&#29615;&#38754;&#30340;&#21464;&#24418;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#20316;&#20026;&#26222;&#36941;&#32593;&#32476;&#20132;&#20114;&#39033;&#30340;&#24341;&#20837;&#65292;&#29615;&#38754;&#20250;&#21464;&#24418;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#65292;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#30456;&#23545;&#20110;&#24179;&#34913;&#28857;&#30340;&#29615;&#38754;&#21487;&#20197;&#36890;&#36807;&#21442;&#25968;&#21270;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#65307;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24471;&#21040;&#29615;&#38754;&#30340;&#23884;&#20837;&#65292;&#20197;&#21450;&#29615;&#38754;&#19978;&#30340;&#23616;&#37096;&#21160;&#21147;&#23398;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#36825;&#19968;&#25104;&#26524;&#24212;&#29992;&#20110;&#32806;&#21512;&#25391;&#33633;&#22120;&#32593;&#32476;&#65292;&#24182;&#22312;&#36793;&#30028;&#20540;&#38382;&#39064;&#35774;&#32622;&#20013;&#36890;&#36807;&#23547;&#25214;&#21608;&#26399;&#36712;&#36947;&#30340;&#20998;&#25903;&#26469;&#30740;&#31350;&#29615;&#38754;&#19978;&#30340;&#21160;&#21147;&#23398;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#26032;&#30340;&#31283;&#23450;&#21516;&#27493;&#27169;&#24335;&#65292;&#36825;&#20123;&#27169;&#24335;&#21487;&#20197;&#26500;&#25104;&#26356;&#22797;&#26434;&#30340;&#20840;&#29699;&#32467;&#26500;&#65292;&#22914;&#32437;&#26029;&#27969;&#36890;&#36335;&#24490;&#29615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02119v1 Announce Type: cross  Abstract: We consider synchrony patterns in coupled phase oscillator networks that correspond to invariant tori. For specific nongeneric coupling, these tori are equilibria relative to a continuous symmetry action. We analyze how the invariant tori deform under forced symmetry breaking as more general network interaction terms are introduced. We first show in general that perturbed tori that are relative equilibria can be computed using a parametrization method; this yields an asymptotic expansion of an embedding of the perturbed torus, as well as the local dynamics on the torus. We then apply this result to a coupled oscillator network, and we numerically study the dynamics on the persisting tori in the network by looking for bifurcations of their periodic orbits in a boundary-value-problem setup. This way we find new bifurcating stable synchrony patterns that can be the building blocks of larger global structures such as heteroclinic cycles.
&lt;/p&gt;</description></item><item><title>&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#25581;&#31034;&#22797;&#26434;&#24615;&#65306;&#23545;&#28151;&#27788;&#21160;&#21147;&#31995;&#32479;&#30340;&#26032;&#35265;&#35299;

&#25688;&#35201;&#65306;&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#29992;&#20110;&#20998;&#26512;&#28151;&#27788;&#21160;&#21147;&#31995;&#32479;&#12290;&#30740;&#31350;&#30340;&#20027;&#35201;&#30446;&#26631;&#21253;&#25324;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#12289;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20165;&#20351;&#29992;&#20004;&#20010;&#36712;&#36857;&#25968;&#25454;&#28857;&#35745;&#31639;&#26446;&#38597;&#26222;&#35834;&#22827;&#25351;&#25968;&#65292;&#36825;&#19982;&#20256;&#32479;&#26041;&#27861;&#19981;&#21516;&#65292;&#20256;&#32479;&#26041;&#27861;&#38656;&#35201;&#19968;&#20010;&#24179;&#22343;&#36807;&#31243;&#12290;&#21516;&#26102;&#25506;&#32034;&#20174;&#35268;&#21017;&#21608;&#26399;&#21040;&#28151;&#27788;&#21160;&#24577;&#30340;&#30456;&#21464;&#22270;&#65292;&#20197;&#35782;&#21035;&#8220;&#20960;&#20046;&#21487;&#31215;&#8221;&#30340;&#36712;&#36857;&#65292;&#22312;&#36825;&#20123;&#36712;&#36857;&#20013;&#65292;&#23432;&#24658;&#37327;&#30340;&#20559;&#31163;&#19981;&#20877;&#26159;&#25972;&#25968;&#65292;&#24182;&#35782;&#21035;&#28151;&#27788;&#36712;&#36857;&#20869;&#30340;&#8220;&#21487;&#31215;&#20998;&#21306;&#22495;&#8221;&#12290;&#36825;&#20123;&#26041;&#27861;&#34987;&#24212;&#29992;&#20110;&#24182;&#27979;&#35797;&#20110;&#20004;&#20010;&#21160;&#21147;&#31995;&#32479;&#65306;&#8220;&#20004;&#20010;&#29289;&#20307;&#22312;&#26834;&#19978;&#30340;&#36816;&#21160;&#8221;&#21644;&#8220;Henon-Heiles&#8221;&#31995;&#32479;&#12290;</title><link>https://arxiv.org/abs/2408.02005</link><description>&lt;p&gt;
Deciphering Complexity: Machine Learning Insights into Chaotic Dynamical Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02005
&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#25581;&#31034;&#22797;&#26434;&#24615;&#65306;&#23545;&#28151;&#27788;&#21160;&#21147;&#31995;&#32479;&#30340;&#26032;&#35265;&#35299;

&#25688;&#35201;&#65306;&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#29992;&#20110;&#20998;&#26512;&#28151;&#27788;&#21160;&#21147;&#31995;&#32479;&#12290;&#30740;&#31350;&#30340;&#20027;&#35201;&#30446;&#26631;&#21253;&#25324;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#12289;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20165;&#20351;&#29992;&#20004;&#20010;&#36712;&#36857;&#25968;&#25454;&#28857;&#35745;&#31639;&#26446;&#38597;&#26222;&#35834;&#22827;&#25351;&#25968;&#65292;&#36825;&#19982;&#20256;&#32479;&#26041;&#27861;&#19981;&#21516;&#65292;&#20256;&#32479;&#26041;&#27861;&#38656;&#35201;&#19968;&#20010;&#24179;&#22343;&#36807;&#31243;&#12290;&#21516;&#26102;&#25506;&#32034;&#20174;&#35268;&#21017;&#21608;&#26399;&#21040;&#28151;&#27788;&#21160;&#24577;&#30340;&#30456;&#21464;&#22270;&#65292;&#20197;&#35782;&#21035;&#8220;&#20960;&#20046;&#21487;&#31215;&#8221;&#30340;&#36712;&#36857;&#65292;&#22312;&#36825;&#20123;&#36712;&#36857;&#20013;&#65292;&#23432;&#24658;&#37327;&#30340;&#20559;&#31163;&#19981;&#20877;&#26159;&#25972;&#25968;&#65292;&#24182;&#35782;&#21035;&#28151;&#27788;&#36712;&#36857;&#20869;&#30340;&#8220;&#21487;&#31215;&#20998;&#21306;&#22495;&#8221;&#12290;&#36825;&#20123;&#26041;&#27861;&#34987;&#24212;&#29992;&#20110;&#24182;&#27979;&#35797;&#20110;&#20004;&#20010;&#21160;&#21147;&#31995;&#32479;&#65306;&#8220;&#20004;&#20010;&#29289;&#20307;&#22312;&#26834;&#19978;&#30340;&#36816;&#21160;&#8221;&#21644;&#8220;Henon-Heiles&#8221;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02005v1 Announce Type: new  Abstract: We introduce new machine-learning techniques for analyzing chaotic dynamical systems. The primary objectives of the study include the development of a new and simple method for calculating the Lyapunov exponent using only two trajectory data points unlike traditional methods that require an averaging procedure, the exploration of phase transition graphs from regular periodic to chaotic dynamics to identify "almost integrable" trajectories where conserved quantities deviate from whole numbers, and the identification of "integrable regions" within chaotic trajectories. These methods are applied and tested on two dynamical systems: "Two objects moving on a rod" and the "Henon-Heiles" systems.
&lt;/p&gt;</description></item><item><title>The paper focuses on the efficient coding and computation in cortical circuits, connecting theoretical neuroscience with statistical physics. It discusses the mutual benefits of studying neural networks for understanding complex systems, nonequilibrium dynamics, and disordered systems in physics, and vice versa. The discussed work starts from the chaos in random neural networks and progresses to the efficient coding and the partial suppression of chaotic fluctuations. Key concepts from statistical physics, including phase transitions and critical phenomena, are highlighted for explaining the computational capabilities of neural networks.</title><link>https://arxiv.org/abs/2408.01949</link><description>&lt;p&gt;
Efficient coding with chaotic neural networks: A journey from neuroscience to physics and back
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01949
&lt;/p&gt;
&lt;p&gt;
The paper focuses on the efficient coding and computation in cortical circuits, connecting theoretical neuroscience with statistical physics. It discusses the mutual benefits of studying neural networks for understanding complex systems, nonequilibrium dynamics, and disordered systems in physics, and vice versa. The discussed work starts from the chaos in random neural networks and progresses to the efficient coding and the partial suppression of chaotic fluctuations. Key concepts from statistical physics, including phase transitions and critical phenomena, are highlighted for explaining the computational capabilities of neural networks.
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01949v1 Announce Type: cross  Abstract: This essay, derived from a lecture at "The Physics Modeling of Thought" workshop in Berlin in winter 2023, explores the mutually beneficial relationship between theoretical neuroscience and statistical physics through the lens of efficient coding and computation in cortical circuits. It highlights how the study of neural networks has enhanced our understanding of complex, nonequilibrium, and disordered systems, while also demonstrating how neuroscientific challenges have spurred novel developments in physics. The paper traces the evolution of ideas from seminal work on chaos in random neural networks to recent developments in efficient coding and the partial suppression of chaotic fluctuations. It emphasizes how concepts from statistical physics, such as phase transitions and critical phenomena, have been instrumental in elucidating the computational capabilities of neural networks.   By examining the interplay between order and disord
&lt;/p&gt;</description></item><item><title>Title: &#21160;&#24577;&#34892;&#20026;&#30740;&#31350;&#65306;&#25240;&#32440;&#32467;&#26500;&#30340;&#35745;&#31639;&#21644;&#23454;&#39564;&#20998;&#26512;
&#25688;&#35201;&#65306;arXiv:2408.01889v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#20132;&#21449;

&#25688;&#35201;&#65306;&#25240;&#32440;&#32467;&#26500;&#22240;&#20026;&#20854;&#29420;&#29305;&#30340;&#29305;&#24615;&#65292;&#22914;&#21487;&#23637;&#24320;&#24615;&#12289;&#22810;&#31283;&#24577;&#12289;&#36127;&#21018;&#24230;&#31561;&#65292;&#24050;&#32463;&#24341;&#36215;&#20102;&#24037;&#31243;&#21644;&#31185;&#23398;&#30740;&#31350;&#32773;&#30340;&#26497;&#22823;&#20851;&#27880;&#12290;&#28982;&#32780;&#65292;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#29305;&#24615;&#30001;&#20110;&#32570;&#20047;&#39564;&#35777;&#30340;&#21160;&#24577;&#24314;&#27169;&#26041;&#27861;&#32780;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#30340;&#30740;&#31350;&#12290;&#37492;&#20110;&#25240;&#32440;&#32467;&#26500;&#28508;&#22312;&#30340;&#24191;&#27867;&#24212;&#29992;&#21644;&#26377;&#36259;&#29305;&#24615;&#65292;&#30740;&#31350;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#34892;&#20026;&#38750;&#24120;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#24314;&#27169;&#26041;&#27861;&#65292;&#32771;&#34385;&#20998;&#24067;&#36136;&#37327;&#24314;&#27169;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#30340;&#28508;&#21147;&#12290;&#22312;&#25552;&#35758;&#30340;&#26041;&#27861;&#20013;&#65292;&#21018;&#24230;&#37319;&#29992;&#26438;&#21644;&#38128;&#24314;&#27169;&#26041;&#27861;&#36827;&#34892;&#24314;&#27169;&#65292;&#32780;&#36136;&#37327;&#21017;&#37319;&#29992;&#36136;&#37327;&#20998;&#24067;&#26041;&#27861;&#36827;&#34892;&#24314;&#27169;&#12290;&#36890;&#36807;&#19982;&#26377;&#38480;&#20803;&#26041;&#27861;&#30340;&#32467;&#26524;&#36827;&#34892;&#27604;&#36739;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#20505;&#36873;&#36136;&#37327;&#20998;&#24067;&#26041;&#27861;&#30340;&#21709;&#24212;&#12290;</title><link>https://arxiv.org/abs/2408.01889</link><description>&lt;p&gt;
Dynamic Behavior of Origami Structures: Computational and Experimental Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01889
&lt;/p&gt;
&lt;p&gt;
Title: &#21160;&#24577;&#34892;&#20026;&#30740;&#31350;&#65306;&#25240;&#32440;&#32467;&#26500;&#30340;&#35745;&#31639;&#21644;&#23454;&#39564;&#20998;&#26512;
&#25688;&#35201;&#65306;arXiv:2408.01889v1 &#23459;&#24067;&#31867;&#22411;&#65306;&#20132;&#21449;

&#25688;&#35201;&#65306;&#25240;&#32440;&#32467;&#26500;&#22240;&#20026;&#20854;&#29420;&#29305;&#30340;&#29305;&#24615;&#65292;&#22914;&#21487;&#23637;&#24320;&#24615;&#12289;&#22810;&#31283;&#24577;&#12289;&#36127;&#21018;&#24230;&#31561;&#65292;&#24050;&#32463;&#24341;&#36215;&#20102;&#24037;&#31243;&#21644;&#31185;&#23398;&#30740;&#31350;&#32773;&#30340;&#26497;&#22823;&#20851;&#27880;&#12290;&#28982;&#32780;&#65292;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#29305;&#24615;&#30001;&#20110;&#32570;&#20047;&#39564;&#35777;&#30340;&#21160;&#24577;&#24314;&#27169;&#26041;&#27861;&#32780;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#30340;&#30740;&#31350;&#12290;&#37492;&#20110;&#25240;&#32440;&#32467;&#26500;&#28508;&#22312;&#30340;&#24191;&#27867;&#24212;&#29992;&#21644;&#26377;&#36259;&#29305;&#24615;&#65292;&#30740;&#31350;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#34892;&#20026;&#38750;&#24120;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#25240;&#32440;&#32467;&#26500;&#30340;&#21160;&#24577;&#24314;&#27169;&#26041;&#27861;&#65292;&#32771;&#34385;&#20998;&#24067;&#36136;&#37327;&#24314;&#27169;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#30340;&#28508;&#21147;&#12290;&#22312;&#25552;&#35758;&#30340;&#26041;&#27861;&#20013;&#65292;&#21018;&#24230;&#37319;&#29992;&#26438;&#21644;&#38128;&#24314;&#27169;&#26041;&#27861;&#36827;&#34892;&#24314;&#27169;&#65292;&#32780;&#36136;&#37327;&#21017;&#37319;&#29992;&#36136;&#37327;&#20998;&#24067;&#26041;&#27861;&#36827;&#34892;&#24314;&#27169;&#12290;&#36890;&#36807;&#19982;&#26377;&#38480;&#20803;&#26041;&#27861;&#30340;&#32467;&#26524;&#36827;&#34892;&#27604;&#36739;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#20505;&#36873;&#36136;&#37327;&#20998;&#24067;&#26041;&#27861;&#30340;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01889v1 Announce Type: cross  Abstract: Origami structures have been receiving a lot of attention from engineering and scientific researchers owing to their unique properties such as deployability, multi-stability, negative stiffness, etc. However, dynamic properties of origami structures have not been explored much due to a lack of validated analytical dynamic modeling approaches. Given the range of interesting properties and applications of origami structures, it is important to study the dynamic behavior of origami structures. In this study, a dynamic modeling approach for origami structures is presented considering distributed mass modeling, which has the potential to be a generalizable approach. In the proposed approach, stiffness is modeled using the bar and hinge modeling approach while the mass is modeled using the mass distribution approach. Various candidate mass distribution approaches were investigated by comparing their responses to the finite element method res
&lt;/p&gt;</description></item><item><title>Title: &#22522;&#20110;&#38598;&#21512;&#32622;&#20449;&#24230;&#30340;&#35266;&#28857;&#21160;&#24577;&#28436;&#21270;&#65306;&#25910;&#25947;&#20934;&#21017;&#21644;&#21608;&#26399;&#35299;
&#25688;&#35201;&#65306;arXiv:2408.01753v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449;  &#25688;&#35201;&#65306;&#26412;&#25991;&#24341;&#20837;&#20102;&#36203;&#27901;&#23572;&#26364;-&#20811;&#21171;&#27901;&#65288;Hegselmann-Krause&#65292;HK&#65289;&#35266;&#28857;&#21160;&#24577;&#27169;&#22411;&#30340;&#19968;&#20010;&#26032;&#30340;&#22810;&#32500;&#25193;&#23637;&#29256;&#26412;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#35266;&#28857;&#30340;&#25509;&#36817;&#24615;&#19981;&#26159;&#30001;&#19968;&#20010;&#35268;&#33539;&#25110;&#24230;&#37327;&#30830;&#23450;&#30340;&#12290;&#30456;&#21453;&#65292;&#27599;&#20010;&#20195;&#29702;&#26041;&#20449;&#20219;&#30340;&#26159;&#38389;&#21487;&#22827;&#26031;&#22522;&#21644;$\xi+\mathcal{O}$&#20013;&#30340;&#35266;&#28857;&#65292;&#20854;&#20013;$\xi$&#26159;&#20195;&#29702;&#26041;&#30446;&#21069;&#30340;&#35266;&#28857;&#65292;$\mathcal{O}$&#26159;&#23450;&#20041;&#21487;&#25509;&#21463;&#20559;&#24046;&#30340;&#32622;&#20449;&#38598;&#12290;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#65292;&#20195;&#29702;&#26041;&#21516;&#26102;&#26356;&#26032;&#20182;&#20204;&#30340;&#35266;&#28857;&#65292;&#36890;&#24120;&#36890;&#36807;&#21516;&#26102;&#24179;&#22343;&#21487;&#20449;&#20219;&#30340;&#35266;&#28857;&#12290;&#19982;&#20256;&#32479;&#30340;HK&#31995;&#32479;&#19981;&#21516;&#65292;&#22312;&#20256;&#32479;&#30340;HK&#31995;&#32479;&#20013;&#65292;$\mathcal{O}$&#26159;&#19968;&#20010;&#22312;&#26576;&#20123;&#35268;&#33539;&#19979;&#30340;&#29699;&#20307;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#32622;&#20449;&#38598;&#26159;&#38750;&#20984;&#30340;&#65292;&#29978;&#33267;&#21487;&#20197;&#26159;&#26080;&#38480;&#30340;&#12290;

&#25105;&#20204;&#23637;&#31034;&#20102;&#26032;&#30340;&#27169;&#22411;&#65292;&#31216;&#20026;SCOD&#65288;Set-based Confidence Opinion Dynamics&#65289;&#65292;&#21487;&#33021;&#20250;&#34920;&#29616;&#20986;&#20256;&#32479;HK&#27169;&#22411;&#20013;&#19981;&#23384;&#22312;&#30340;&#19968;&#20123;&#29305;&#24615;&#12290;&#19968;&#20123;&#35299;&#21487;&#33021;&#20250;&#22312;&#29366;&#24577;&#31354;&#38388;&#20013;&#25910;&#25947;&#21040;&#38750;&#22343;&#34913;&#28857;&#65292;&#32780;&#20854;&#20182;&#35299;&#21017;&#20250;&#21608;&#26399;&#24615;&#22320;&#25391;&#33633;&#12290;&#22914;&#26524;&#32622;&#20449;&#38598;$\mathcal{O}$&#26159;&#23545;&#31216;&#30340;&#65292;&#36825;&#20123;&#8220;&#30149;&#24577;&#8221;&#23601;&#20250;&#28040;&#22833;&#12290;</title><link>https://arxiv.org/abs/2408.01753</link><description>&lt;p&gt;
Opinion Dynamics with Set-Based Confidence: Convergence Criteria and Periodic Solutions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01753
&lt;/p&gt;
&lt;p&gt;
Title: &#22522;&#20110;&#38598;&#21512;&#32622;&#20449;&#24230;&#30340;&#35266;&#28857;&#21160;&#24577;&#28436;&#21270;&#65306;&#25910;&#25947;&#20934;&#21017;&#21644;&#21608;&#26399;&#35299;
&#25688;&#35201;&#65306;arXiv:2408.01753v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449;  &#25688;&#35201;&#65306;&#26412;&#25991;&#24341;&#20837;&#20102;&#36203;&#27901;&#23572;&#26364;-&#20811;&#21171;&#27901;&#65288;Hegselmann-Krause&#65292;HK&#65289;&#35266;&#28857;&#21160;&#24577;&#27169;&#22411;&#30340;&#19968;&#20010;&#26032;&#30340;&#22810;&#32500;&#25193;&#23637;&#29256;&#26412;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#35266;&#28857;&#30340;&#25509;&#36817;&#24615;&#19981;&#26159;&#30001;&#19968;&#20010;&#35268;&#33539;&#25110;&#24230;&#37327;&#30830;&#23450;&#30340;&#12290;&#30456;&#21453;&#65292;&#27599;&#20010;&#20195;&#29702;&#26041;&#20449;&#20219;&#30340;&#26159;&#38389;&#21487;&#22827;&#26031;&#22522;&#21644;$\xi+\mathcal{O}$&#20013;&#30340;&#35266;&#28857;&#65292;&#20854;&#20013;$\xi$&#26159;&#20195;&#29702;&#26041;&#30446;&#21069;&#30340;&#35266;&#28857;&#65292;$\mathcal{O}$&#26159;&#23450;&#20041;&#21487;&#25509;&#21463;&#20559;&#24046;&#30340;&#32622;&#20449;&#38598;&#12290;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#65292;&#20195;&#29702;&#26041;&#21516;&#26102;&#26356;&#26032;&#20182;&#20204;&#30340;&#35266;&#28857;&#65292;&#36890;&#24120;&#36890;&#36807;&#21516;&#26102;&#24179;&#22343;&#21487;&#20449;&#20219;&#30340;&#35266;&#28857;&#12290;&#19982;&#20256;&#32479;&#30340;HK&#31995;&#32479;&#19981;&#21516;&#65292;&#22312;&#20256;&#32479;&#30340;HK&#31995;&#32479;&#20013;&#65292;$\mathcal{O}$&#26159;&#19968;&#20010;&#22312;&#26576;&#20123;&#35268;&#33539;&#19979;&#30340;&#29699;&#20307;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#32622;&#20449;&#38598;&#26159;&#38750;&#20984;&#30340;&#65292;&#29978;&#33267;&#21487;&#20197;&#26159;&#26080;&#38480;&#30340;&#12290;

&#25105;&#20204;&#23637;&#31034;&#20102;&#26032;&#30340;&#27169;&#22411;&#65292;&#31216;&#20026;SCOD&#65288;Set-based Confidence Opinion Dynamics&#65289;&#65292;&#21487;&#33021;&#20250;&#34920;&#29616;&#20986;&#20256;&#32479;HK&#27169;&#22411;&#20013;&#19981;&#23384;&#22312;&#30340;&#19968;&#20123;&#29305;&#24615;&#12290;&#19968;&#20123;&#35299;&#21487;&#33021;&#20250;&#22312;&#29366;&#24577;&#31354;&#38388;&#20013;&#25910;&#25947;&#21040;&#38750;&#22343;&#34913;&#28857;&#65292;&#32780;&#20854;&#20182;&#35299;&#21017;&#20250;&#21608;&#26399;&#24615;&#22320;&#25391;&#33633;&#12290;&#22914;&#26524;&#32622;&#20449;&#38598;$\mathcal{O}$&#26159;&#23545;&#31216;&#30340;&#65292;&#36825;&#20123;&#8220;&#30149;&#24577;&#8221;&#23601;&#20250;&#28040;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01753v1 Announce Type: cross  Abstract: This paper introduces a new multidimensional extension of the Hegselmann-Krause (HK) opinion dynamics model, where opinion proximity is not determined by a norm or metric. Instead, each agent trusts opinions within the Minkowski sum $\xi+\mathcal{O}$, where $\xi$ is the agent's current opinion and $\mathcal{O}$ is the confidence set defining acceptable deviations. During each iteration, agents update their opinions by simultaneously averaging the trusted opinions. Unlike traditional HK systems, where $\mathcal{O}$ is a ball in some norm, our model allows the confidence set to be non-convex and even unbounded.   We demonstrate that the new model, referred to as SCOD (Set-based Confidence Opinion Dynamics), can exhibit properties absent in the conventional HK model. Some solutions may converge to non-equilibrium points in the state space, while others oscillate periodically. These ``pathologies'' disappear if the set $\mathcal{O}$ is sym
&lt;/p&gt;</description></item><item><title>Title: &#38750;&#32447;&#24615;&#20256;&#36755;&#32447;&#20013;&#30340;&#20914;&#20987;&#27874;
&#25688;&#35201;&#65306;arXiv:2408.01463v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340;  &#25688;&#35201;&#65306;&#25105;&#20204;&#32771;&#34385;&#21547;&#26377;&#38750;&#32447;&#24615;&#30005;&#23481;&#22120;&#21644;&#30005;&#24863;&#22120;&#30340;&#20256;&#36755;&#32447;&#20013;&#65292;&#23567;&#25391;&#24133;&#20256;&#25773;&#27874;&#65288;&#8220;&#22768;&#27874;&#8221;&#65289;&#19982;&#20914;&#20987;&#27874;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#25105;&#20204;&#35745;&#31639;&#8220;&#22768;&#27874;&#8221;&#30340;&#21453;&#23556;&#31995;&#25968;&#65288;&#36890;&#36807;&#20914;&#20987;&#27874;&#30340;&#20256;&#36755;&#31995;&#25968;&#65289;&#12290;&#36825;&#20123;&#31995;&#25968;&#26159;&#20197;&#27874;&#36895;&#21644;&#27874;&#38459;&#25239;&#30340;&#24418;&#24335;&#34920;&#36798;&#30340;&#12290;&#24403;&#21482;&#26377;&#30005;&#23481;&#22120;&#25110;&#21482;&#26377;&#30005;&#24863;&#22120;&#26159;&#38750;&#32447;&#24615;&#26102;&#65292;&#31995;&#25968;&#26159;&#20197;&#27874;&#36895;&#30452;&#25509;&#34920;&#36798;&#30340;&#12290;&#25105;&#20204;&#26126;&#30830;&#22320;&#23558;&#20914;&#20987;&#27874;&#30340;&#32791;&#25955;&#32771;&#34385;&#22312;&#20869;&#65292;&#36890;&#36807;&#24182;&#32852;&#30005;&#24863;&#22120;&#21644;&#20018;&#32852;&#30005;&#23481;&#22120;&#30340;&#27431;&#22982;&#30005;&#38459;&#26469;&#24341;&#20837;&#32791;&#25955;&#12290;&#36825;&#20801;&#35768;&#25105;&#20204;&#23545;&#20914;&#20987;&#27874;&#36827;&#34892;&#23454;&#38469;&#23485;&#24230;&#30340;&#25551;&#36848;&#65292;&#24182;&#30740;&#31350;&#23427;&#20204;&#30340;&#36718;&#24275;&#12290;&#22312;&#26576;&#20123;&#29305;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#20914;&#20987;&#27874;&#30340;&#36718;&#24275;&#21487;&#20197;&#29992;&#22522;&#26412;&#20989;&#25968;&#34920;&#31034;&#20986;&#26469;&#12290;</title><link>https://arxiv.org/abs/2408.01463</link><description>&lt;p&gt;
Shock waves in nonlinear transmission lines
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01463
&lt;/p&gt;
&lt;p&gt;
Title: &#38750;&#32447;&#24615;&#20256;&#36755;&#32447;&#20013;&#30340;&#20914;&#20987;&#27874;
&#25688;&#35201;&#65306;arXiv:2408.01463v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340;  &#25688;&#35201;&#65306;&#25105;&#20204;&#32771;&#34385;&#21547;&#26377;&#38750;&#32447;&#24615;&#30005;&#23481;&#22120;&#21644;&#30005;&#24863;&#22120;&#30340;&#20256;&#36755;&#32447;&#20013;&#65292;&#23567;&#25391;&#24133;&#20256;&#25773;&#27874;&#65288;&#8220;&#22768;&#27874;&#8221;&#65289;&#19982;&#20914;&#20987;&#27874;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#25105;&#20204;&#35745;&#31639;&#8220;&#22768;&#27874;&#8221;&#30340;&#21453;&#23556;&#31995;&#25968;&#65288;&#36890;&#36807;&#20914;&#20987;&#27874;&#30340;&#20256;&#36755;&#31995;&#25968;&#65289;&#12290;&#36825;&#20123;&#31995;&#25968;&#26159;&#20197;&#27874;&#36895;&#21644;&#27874;&#38459;&#25239;&#30340;&#24418;&#24335;&#34920;&#36798;&#30340;&#12290;&#24403;&#21482;&#26377;&#30005;&#23481;&#22120;&#25110;&#21482;&#26377;&#30005;&#24863;&#22120;&#26159;&#38750;&#32447;&#24615;&#26102;&#65292;&#31995;&#25968;&#26159;&#20197;&#27874;&#36895;&#30452;&#25509;&#34920;&#36798;&#30340;&#12290;&#25105;&#20204;&#26126;&#30830;&#22320;&#23558;&#20914;&#20987;&#27874;&#30340;&#32791;&#25955;&#32771;&#34385;&#22312;&#20869;&#65292;&#36890;&#36807;&#24182;&#32852;&#30005;&#24863;&#22120;&#21644;&#20018;&#32852;&#30005;&#23481;&#22120;&#30340;&#27431;&#22982;&#30005;&#38459;&#26469;&#24341;&#20837;&#32791;&#25955;&#12290;&#36825;&#20801;&#35768;&#25105;&#20204;&#23545;&#20914;&#20987;&#27874;&#36827;&#34892;&#23454;&#38469;&#23485;&#24230;&#30340;&#25551;&#36848;&#65292;&#24182;&#30740;&#31350;&#23427;&#20204;&#30340;&#36718;&#24275;&#12290;&#22312;&#26576;&#20123;&#29305;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#20914;&#20987;&#27874;&#30340;&#36718;&#24275;&#21487;&#20197;&#29992;&#22522;&#26412;&#20989;&#25968;&#34920;&#31034;&#20986;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01463v1 Announce Type: new  Abstract: We consider interaction between the small amplitude travelling waves ("sound") and the shock waves in the transmission line containing both nonlinear capacitors and nonlinear inductors. We calculate for the "sound" wave the coefficient of reflection from (the coefficient of transmission through) the shock wave. These coefficients are expressed in terms of the wave speeds and the wave impedances. When only the capacitors or only the inductors are nonlinear, the coefficients are expressed in terms of the wave speeds only. We explicitly include into consideration of the shocks the dissipation, introducing ohmic resistors shunting the inductors and also in series with the capacitors. This allows us to describe the shocks as physical objects of finite width and study their profiles. In some particular cases the profiles were obtained in terms of elementary functions.
&lt;/p&gt;</description></item><item><title>Title: &#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#24335;&#38145;&#23450;&#20809;&#32420;&#28608;&#20809;&#22120;&#20013;&#30340;&#30690;&#37327;&#23396;&#31435;&#23376;&#33033;&#20914;&#21160;&#24577;&#24314;&#27169;&#21644;&#32534;&#30721;&#20449;&#24687;&#23384;&#20648;
&#25688;&#35201;&#65306;arXiv:2407.18725v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;
&#25688;&#35201;&#65306;&#23396;&#31435;&#23376;&#33033;&#20914;&#26159;&#27169;&#24335;&#38145;&#23450;&#28608;&#20809;&#22120;&#31561;&#35768;&#22810;&#29289;&#29702;&#31995;&#32479;&#20013;&#38750;&#31283;&#24577;&#23396;&#31435;&#23376;&#21160;&#24577;&#30340;&#24120;&#35265;&#29305;&#24449;&#12290;&#20026;&#20102;&#20811;&#26381;&#20256;&#32479;&#25968;&#20540;&#26041;&#27861;&#22312;&#27169;&#25311;&#38750;&#31283;&#24577;&#23396;&#31435;&#23376;&#28436;&#21270;&#26102;&#38754;&#20020;&#30340;&#24040;&#22823;&#35745;&#31639;&#38656;&#27714;&#21644;&#20302;&#25928;&#29575;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21452;&#24182;&#34892;&#21452;&#21521;&#38271;&#30701;&#26399;&#35760;&#24518; recurrent neural network&#65288;LSTM&#65289;&#65292;&#26088;&#22312;&#39044;&#27979;&#22312;&#21508;&#31181;&#22797;&#26434;&#29366;&#24577;&#19979;&#30690;&#37327;&#23396;&#31435;&#23376;&#33033;&#20914;&#30340;&#21160;&#24577;&#65292;&#36825;&#20123;&#21160;&#24577;&#24050;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#35777;&#23454;&#12290;&#27492;&#22806;&#65292;&#36824;&#23454;&#29616;&#20102;&#22522;&#20110; TP-Bi_LSTM RNN &#30340;&#32534;&#30721;&#20449;&#24687;&#23384;&#20648;&#26041;&#26696;&#65292;&#23427;&#20351;&#29992;&#30340;&#26159;&#23454;&#38469;&#33033;&#20914;&#20449;&#21495;&#26367;&#20195;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20026;&#36229;&#24555;&#20809;&#23398;&#21644;&#20449;&#24687;&#23384;&#20648;&#24102;&#26469;&#20102;&#28145;&#24230;&#23398;&#20064;&#30340;&#26032;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2407.18725</link><description>&lt;p&gt;
Deep learning for dynamic modeling and coded information storage of vector-soliton pulsations in mode-locked fiber lasers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.18725
&lt;/p&gt;
&lt;p&gt;
Title: &#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#24335;&#38145;&#23450;&#20809;&#32420;&#28608;&#20809;&#22120;&#20013;&#30340;&#30690;&#37327;&#23396;&#31435;&#23376;&#33033;&#20914;&#21160;&#24577;&#24314;&#27169;&#21644;&#32534;&#30721;&#20449;&#24687;&#23384;&#20648;
&#25688;&#35201;&#65306;arXiv:2407.18725v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;
&#25688;&#35201;&#65306;&#23396;&#31435;&#23376;&#33033;&#20914;&#26159;&#27169;&#24335;&#38145;&#23450;&#28608;&#20809;&#22120;&#31561;&#35768;&#22810;&#29289;&#29702;&#31995;&#32479;&#20013;&#38750;&#31283;&#24577;&#23396;&#31435;&#23376;&#21160;&#24577;&#30340;&#24120;&#35265;&#29305;&#24449;&#12290;&#20026;&#20102;&#20811;&#26381;&#20256;&#32479;&#25968;&#20540;&#26041;&#27861;&#22312;&#27169;&#25311;&#38750;&#31283;&#24577;&#23396;&#31435;&#23376;&#28436;&#21270;&#26102;&#38754;&#20020;&#30340;&#24040;&#22823;&#35745;&#31639;&#38656;&#27714;&#21644;&#20302;&#25928;&#29575;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21452;&#24182;&#34892;&#21452;&#21521;&#38271;&#30701;&#26399;&#35760;&#24518; recurrent neural network&#65288;LSTM&#65289;&#65292;&#26088;&#22312;&#39044;&#27979;&#22312;&#21508;&#31181;&#22797;&#26434;&#29366;&#24577;&#19979;&#30690;&#37327;&#23396;&#31435;&#23376;&#33033;&#20914;&#30340;&#21160;&#24577;&#65292;&#36825;&#20123;&#21160;&#24577;&#24050;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#35777;&#23454;&#12290;&#27492;&#22806;&#65292;&#36824;&#23454;&#29616;&#20102;&#22522;&#20110; TP-Bi_LSTM RNN &#30340;&#32534;&#30721;&#20449;&#24687;&#23384;&#20648;&#26041;&#26696;&#65292;&#23427;&#20351;&#29992;&#30340;&#26159;&#23454;&#38469;&#33033;&#20914;&#20449;&#21495;&#26367;&#20195;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20026;&#36229;&#24555;&#20809;&#23398;&#21644;&#20449;&#24687;&#23384;&#20648;&#24102;&#26469;&#20102;&#28145;&#24230;&#23398;&#20064;&#30340;&#26032;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.18725v2 Announce Type: replace-cross  Abstract: Soliton pulsations are ubiquitous feature of non-stationary soliton dynamics in mode-locked lasers and many other physical systems. To overcome difficulties related to huge amount of necessary computations and low efficiency of traditional numerical methods in modeling the evolution of non-stationary solitons, we propose a two-parallel bidirectional long short-term memory recurrent neural network, with the main objective to predict dynamics of vector-soliton pulsations in various complex states, whose real-time dynamics is verified by experiments. Besides, the scheme of coded information storage based on the TP-Bi_LSTM RNN, instead of actual pulse signals, is realized too. The findings offer new applications of deep learning to ultrafast optics and information storage.
&lt;/p&gt;</description></item><item><title>Title: &#22522;&#20110;&#25968;&#25454;&#30340;&#21160;&#24577;&#31995;&#32479;&#32447;&#24615;&#21270;
&#25688;&#35201;&#65306;arXiv:2407.08177v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;&#25688;&#35201;&#65306;&#21160;&#24577;&#27169;&#24335;&#20998;&#35299;&#65288;DMD&#65289;&#21450;&#20854;&#21464;&#31181;&#65292;&#22914;&#25193;&#23637;&#30340;DMD&#65288;EDMD&#65289;&#65292;&#36890;&#24120;&#29992;&#20110;&#26681;&#25454;&#21487;&#35266;&#23519;&#25968;&#25454;&#25311;&#21512;&#31616;&#21333;&#32447;&#24615;&#27169;&#22411;&#12290;&#34429;&#28982;DMD&#26041;&#27861;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#34920;&#29616;&#33391;&#22909;&#65292;&#20294;&#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#34920;&#29616;&#19981;&#20339;&#65292;&#22240;&#27492;&#28548;&#28165;DMD&#36866;&#29992;&#30340;&#20551;&#35774;&#26159;&#24517;&#35201;&#30340;&#12290;&#26356;&#20180;&#32454;&#22320;&#26816;&#26597;&#21518;&#65292;&#22522;&#20110;&#31185;&#23572;&#26364;&#31639;&#23376;&#23545;DMD&#26041;&#27861;&#30340;&#35299;&#37322;&#19981;&#22815;&#28385;&#24847;&#65306;&#23427;&#20204;&#21482;&#22312;&#39640;&#27010;&#29575;&#38646;&#27010;&#29575;&#20107;&#20214;&#19979;&#30340;&#20551;&#35774;&#19979;&#23545;DMD&#36827;&#34892;&#20102;&#36777;&#25252;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#22312;&#21407;&#21017;&#19978;&#20026;&#32447;&#24615;&#21270;&#21464;&#25442;&#32534;&#30340;DMD&#26041;&#27861;&#65292;&#23427;&#25552;&#20379;&#20102;&#23545;&#20027;&#23548;&#31995;&#32479;&#21160;&#24577;&#30340;&#23616;&#37096;&#12289;&#20027;&#23548;&#32423;&#31616;&#21270;&#27169;&#22411;&#65292;&#36825;&#20123;&#26465;&#20214;&#22312;&#39640;&#27010;&#29575;&#27010;&#29575;&#19979;&#36866;&#29992;&#20110;&#20856;&#22411;&#35266;&#27979;&#25968;&#25454;&#21644;&#38750;&#22855;&#24322;&#35266;&#27979;&#25968;&#25454;&#65292;&#36866;&#29992;&#20110;&#26377;&#38480;&#32500;&#25110;&#26080;&#38480;&#32500;&#33258;&#27835;&#31995;&#32479;&#21644;&#21608;&#26399;&#24615;&#39537;&#21160;&#31995;&#32479;&#12290;&#36890;&#36807;&#20026;&#23427;&#20204;&#30340;&#21021;&#22987;&#25968;&#25454;&#26500;&#36896;&#32447;&#24615;&#21270;&#21464;&#25442;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#21160;&#24577;&#27169;&#24335;&#30340;&#20998;&#35299;&#65292;&#21363;&#20351;&#22312;&#36825;&#20123;&#24773;&#20917;&#19979;&#65292;&#21407;&#22987;&#25968;&#25454;&#26080;&#27861;&#30452;&#25509;&#20351;&#29992;DMD&#26041;&#27861;&#12290;&#36825;&#26159;&#36890;&#36807;&#26500;&#36896;&#23616;&#37096;&#12289;&#20027;&#23548;&#32423;&#32447;&#24615;&#21270;&#26469;&#23454;&#29616;&#30340;&#65292;&#35813;&#32447;&#24615;&#21270;&#22312;&#26377;&#30028;&#26465;&#20214;&#19979;&#23545;&#21160;&#24577;&#27169;&#24335;&#36827;&#34892;&#26377;&#25928;&#25311;&#21512;&#65292;&#24182;&#19988;&#32771;&#34385;&#20102;&#25968;&#25454;&#30340;&#26159;&#25351;&#25968;&#22686;&#38271;&#30340;&#12290;&#36825;&#31181;&#26041;&#27861;&#20026;DMD&#21644;EDMD&#25552;&#20379;&#20102;&#26356;&#20026;&#20005;&#35880;&#30340;&#35299;&#37322;&#65292;&#24182;&#19988;&#21313;&#20998;&#36866;&#21512;&#20110;&#20943;&#38454;&#21644;&#39044;&#27979;&#21160;&#24577;&#31995;&#32479;&#30340;&#34892;&#20026;&#12290;</title><link>https://arxiv.org/abs/2407.08177</link><description>&lt;p&gt;
Data-Driven Linearization of Dynamical Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.08177
&lt;/p&gt;
&lt;p&gt;
Title: &#22522;&#20110;&#25968;&#25454;&#30340;&#21160;&#24577;&#31995;&#32479;&#32447;&#24615;&#21270;
&#25688;&#35201;&#65306;arXiv:2407.08177v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;&#25688;&#35201;&#65306;&#21160;&#24577;&#27169;&#24335;&#20998;&#35299;&#65288;DMD&#65289;&#21450;&#20854;&#21464;&#31181;&#65292;&#22914;&#25193;&#23637;&#30340;DMD&#65288;EDMD&#65289;&#65292;&#36890;&#24120;&#29992;&#20110;&#26681;&#25454;&#21487;&#35266;&#23519;&#25968;&#25454;&#25311;&#21512;&#31616;&#21333;&#32447;&#24615;&#27169;&#22411;&#12290;&#34429;&#28982;DMD&#26041;&#27861;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#34920;&#29616;&#33391;&#22909;&#65292;&#20294;&#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#34920;&#29616;&#19981;&#20339;&#65292;&#22240;&#27492;&#28548;&#28165;DMD&#36866;&#29992;&#30340;&#20551;&#35774;&#26159;&#24517;&#35201;&#30340;&#12290;&#26356;&#20180;&#32454;&#22320;&#26816;&#26597;&#21518;&#65292;&#22522;&#20110;&#31185;&#23572;&#26364;&#31639;&#23376;&#23545;DMD&#26041;&#27861;&#30340;&#35299;&#37322;&#19981;&#22815;&#28385;&#24847;&#65306;&#23427;&#20204;&#21482;&#22312;&#39640;&#27010;&#29575;&#38646;&#27010;&#29575;&#20107;&#20214;&#19979;&#30340;&#20551;&#35774;&#19979;&#23545;DMD&#36827;&#34892;&#20102;&#36777;&#25252;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#22312;&#21407;&#21017;&#19978;&#20026;&#32447;&#24615;&#21270;&#21464;&#25442;&#32534;&#30340;DMD&#26041;&#27861;&#65292;&#23427;&#25552;&#20379;&#20102;&#23545;&#20027;&#23548;&#31995;&#32479;&#21160;&#24577;&#30340;&#23616;&#37096;&#12289;&#20027;&#23548;&#32423;&#31616;&#21270;&#27169;&#22411;&#65292;&#36825;&#20123;&#26465;&#20214;&#22312;&#39640;&#27010;&#29575;&#27010;&#29575;&#19979;&#36866;&#29992;&#20110;&#20856;&#22411;&#35266;&#27979;&#25968;&#25454;&#21644;&#38750;&#22855;&#24322;&#35266;&#27979;&#25968;&#25454;&#65292;&#36866;&#29992;&#20110;&#26377;&#38480;&#32500;&#25110;&#26080;&#38480;&#32500;&#33258;&#27835;&#31995;&#32479;&#21644;&#21608;&#26399;&#24615;&#39537;&#21160;&#31995;&#32479;&#12290;&#36890;&#36807;&#20026;&#23427;&#20204;&#30340;&#21021;&#22987;&#25968;&#25454;&#26500;&#36896;&#32447;&#24615;&#21270;&#21464;&#25442;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#21160;&#24577;&#27169;&#24335;&#30340;&#20998;&#35299;&#65292;&#21363;&#20351;&#22312;&#36825;&#20123;&#24773;&#20917;&#19979;&#65292;&#21407;&#22987;&#25968;&#25454;&#26080;&#27861;&#30452;&#25509;&#20351;&#29992;DMD&#26041;&#27861;&#12290;&#36825;&#26159;&#36890;&#36807;&#26500;&#36896;&#23616;&#37096;&#12289;&#20027;&#23548;&#32423;&#32447;&#24615;&#21270;&#26469;&#23454;&#29616;&#30340;&#65292;&#35813;&#32447;&#24615;&#21270;&#22312;&#26377;&#30028;&#26465;&#20214;&#19979;&#23545;&#21160;&#24577;&#27169;&#24335;&#36827;&#34892;&#26377;&#25928;&#25311;&#21512;&#65292;&#24182;&#19988;&#32771;&#34385;&#20102;&#25968;&#25454;&#30340;&#26159;&#25351;&#25968;&#22686;&#38271;&#30340;&#12290;&#36825;&#31181;&#26041;&#27861;&#20026;DMD&#21644;EDMD&#25552;&#20379;&#20102;&#26356;&#20026;&#20005;&#35880;&#30340;&#35299;&#37322;&#65292;&#24182;&#19988;&#21313;&#20998;&#36866;&#21512;&#20110;&#20943;&#38454;&#21644;&#39044;&#27979;&#21160;&#24577;&#31995;&#32479;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.08177v2 Announce Type: replace-cross  Abstract: Dynamic Mode Decomposition (DMD) and its variants, such as extended DMD (EDMD), are broadly used to fit simple linear models to dynamical systems known from observable data. As DMD methods work well in several situations but perform poorly in others, a clarification of the assumptions under which DMD is applicable is desirable. Upon closer inspection, existing interpretations of DMD methods based on the Koopman operator are not quite satisfactory: they justify DMD under assumptions that hold only with probability zero for generic observables. Here, we give a justification for DMD as a local, leading-order reduced model for the dominant system dynamics under conditions that hold with probability one for generic observables and non-degenerate observational data. We achieve this for autonomous and for periodically forced systems of finite or infinite dimensions by constructing linearizing transformations for their dominant dynamic
&lt;/p&gt;</description></item><item><title>Title: &#26059;&#36716; Bose-&#22467;&#26684;&#26031;&#29305;&#23450;&#20957;&#32858;&#29289;&#21160;&#24577;&#19981;&#31283;&#23450;&#24615;&#21644;&#28237;&#27969;&#30740;&#31350;
&#25688;&#35201;&#65306;arXiv:2402.18474v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;&#38142;&#25509;
&#25688;&#35201;&#65306;&#26412;&#25991;&#25253;&#21578;&#20102;&#20004;&#32500;&#20013;&#30456;&#20114;&#38752;&#36817;&#30340;&#26059;&#36716; Bose-&#22467;&#26684;&#26031;&#29305;&#23450;&#20957;&#32858;&#20307;&#30340;&#27169;&#25311;&#32467;&#26524;&#12290;&#36890;&#36807;&#23558;&#26059;&#36716;&#36724;&#23450;&#20301;&#22312;&#38519;&#38449;&#30340;&#26497;&#23567;&#28857;&#65292;&#24182;&#21516;&#26102;&#35753;&#20004;&#20010;&#20957;&#32858;&#20307;&#21521;&#24444;&#27492;&#31227;&#21160;&#65292;&#24182;&#22312;&#32531;&#24930;&#22686;&#21152;&#26059;&#36716;&#39057;&#29575;&#30340;&#21516;&#26102;&#31227;&#21160;&#65292;&#26469;&#35302;&#21457;&#20957;&#32858;&#20307;&#30340;&#21512;&#24182;&#12290;&#25105;&#20204;&#36890;&#36807;&#35753;&#23427;&#20204;&#22312;&#21333;&#20010;&#35856;&#25391; trap &#20013;&#28436;&#21270;&#26469;&#20998;&#26512;&#21512;&#24182;&#21518;&#20957;&#32858;&#20307;&#30340;&#21160;&#24577;&#12290;&#25105;&#20204;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#22312;&#26368;&#32456;&#32479;&#19968;&#30340;&#20957;&#32858;&#20307;&#20013;&#24418;&#25104;&#30340; soliton &#21644;&#28065;&#26059;&#32467;&#26500;&#65292;&#32771;&#34385;&#20102;&#26080;&#26059;&#36716;&#21644;&#26059;&#36716;&#21021;&#22987;&#24577;&#20004;&#31181;&#24773;&#20917;&#12290;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#21512;&#24182;&#37117;&#23548;&#33268;&#24418;&#25104;&#20102; solitons&#65292;&#23427;&#20204;&#36890;&#36807;&#34503;&#24418;&#19981;&#31283;&#23450;&#24615;&#34928;&#21464;&#25104;&#28065;&#26059;&#23545;&#65292;&#36825;&#20123;&#23545;&#38543;&#21518;&#30456;&#20114;&#25269;&#28040;&#12290;soliton &#30340;&#24418;&#25104;&#21644;&#34928;&#21464;&#24341;&#36215;&#30340;&#30456;&#20301;&#28608;&#21457;&#20135;&#29983;&#22768;&#27874;&#65292;&#24403;&#21512;&#24182;&#26102;&#38388;&#36739;&#30701;&#26102;&#65292;&#22768;&#27874;&#26356;&#20026;&#26174;&#33879;&#12290;&#24403;&#21512;&#24182;&#26102;&#38388;&#36739;&#38271;&#19988;&#36275;&#20197;&#23548;&#33268;&#20957;&#32858;&#20307;&#38236;&#38754;&#23545;&#40784;&#26102;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#31283;&#23450;&#30340;&#22810;&#28065;&#26059;&#27169;&#24335;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#20957;&#32858;&#20307;&#20869;&#21160;&#24577;&#19981;&#31283;&#23450;&#24615;&#21644;&#28237;&#27969;&#29616;&#35937;&#30340;&#21464;&#21270;&#36807;&#31243;&#65292;&#20197;&#21450;&#21512;&#24182;&#36807;&#31243;&#20013;&#30340;&#33021;&#37327;&#21644;&#21160;&#21147;&#23398;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2402.18474</link><description>&lt;p&gt;
Dynamic instabilities and turbulence of merged rotating Bose-Einstein condensates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18474
&lt;/p&gt;
&lt;p&gt;
Title: &#26059;&#36716; Bose-&#22467;&#26684;&#26031;&#29305;&#23450;&#20957;&#32858;&#29289;&#21160;&#24577;&#19981;&#31283;&#23450;&#24615;&#21644;&#28237;&#27969;&#30740;&#31350;
&#25688;&#35201;&#65306;arXiv:2402.18474v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;&#20132;&#21449;&#38142;&#25509;
&#25688;&#35201;&#65306;&#26412;&#25991;&#25253;&#21578;&#20102;&#20004;&#32500;&#20013;&#30456;&#20114;&#38752;&#36817;&#30340;&#26059;&#36716; Bose-&#22467;&#26684;&#26031;&#29305;&#23450;&#20957;&#32858;&#20307;&#30340;&#27169;&#25311;&#32467;&#26524;&#12290;&#36890;&#36807;&#23558;&#26059;&#36716;&#36724;&#23450;&#20301;&#22312;&#38519;&#38449;&#30340;&#26497;&#23567;&#28857;&#65292;&#24182;&#21516;&#26102;&#35753;&#20004;&#20010;&#20957;&#32858;&#20307;&#21521;&#24444;&#27492;&#31227;&#21160;&#65292;&#24182;&#22312;&#32531;&#24930;&#22686;&#21152;&#26059;&#36716;&#39057;&#29575;&#30340;&#21516;&#26102;&#31227;&#21160;&#65292;&#26469;&#35302;&#21457;&#20957;&#32858;&#20307;&#30340;&#21512;&#24182;&#12290;&#25105;&#20204;&#36890;&#36807;&#35753;&#23427;&#20204;&#22312;&#21333;&#20010;&#35856;&#25391; trap &#20013;&#28436;&#21270;&#26469;&#20998;&#26512;&#21512;&#24182;&#21518;&#20957;&#32858;&#20307;&#30340;&#21160;&#24577;&#12290;&#25105;&#20204;&#31995;&#32479;&#22320;&#30740;&#31350;&#20102;&#22312;&#26368;&#32456;&#32479;&#19968;&#30340;&#20957;&#32858;&#20307;&#20013;&#24418;&#25104;&#30340; soliton &#21644;&#28065;&#26059;&#32467;&#26500;&#65292;&#32771;&#34385;&#20102;&#26080;&#26059;&#36716;&#21644;&#26059;&#36716;&#21021;&#22987;&#24577;&#20004;&#31181;&#24773;&#20917;&#12290;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#21512;&#24182;&#37117;&#23548;&#33268;&#24418;&#25104;&#20102; solitons&#65292;&#23427;&#20204;&#36890;&#36807;&#34503;&#24418;&#19981;&#31283;&#23450;&#24615;&#34928;&#21464;&#25104;&#28065;&#26059;&#23545;&#65292;&#36825;&#20123;&#23545;&#38543;&#21518;&#30456;&#20114;&#25269;&#28040;&#12290;soliton &#30340;&#24418;&#25104;&#21644;&#34928;&#21464;&#24341;&#36215;&#30340;&#30456;&#20301;&#28608;&#21457;&#20135;&#29983;&#22768;&#27874;&#65292;&#24403;&#21512;&#24182;&#26102;&#38388;&#36739;&#30701;&#26102;&#65292;&#22768;&#27874;&#26356;&#20026;&#26174;&#33879;&#12290;&#24403;&#21512;&#24182;&#26102;&#38388;&#36739;&#38271;&#19988;&#36275;&#20197;&#23548;&#33268;&#20957;&#32858;&#20307;&#38236;&#38754;&#23545;&#40784;&#26102;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#31283;&#23450;&#30340;&#22810;&#28065;&#26059;&#27169;&#24335;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#20957;&#32858;&#20307;&#20869;&#21160;&#24577;&#19981;&#31283;&#23450;&#24615;&#21644;&#28237;&#27969;&#29616;&#35937;&#30340;&#21464;&#21270;&#36807;&#31243;&#65292;&#20197;&#21450;&#21512;&#24182;&#36807;&#31243;&#20013;&#30340;&#33021;&#37327;&#21644;&#21160;&#21147;&#23398;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18474v2 Announce Type: replace-cross  Abstract: We present the simulation results of merging harmonically confined rotating Bose-Einstein condensates in two dimensions. Merging of the condensate is triggered by positioning the rotation axis at the trap minima and moving both condensates towards each other while slowly ramping their rotation frequency. We analyze the dynamics of the merged condensate by letting them evolve under a single harmonic trap. We systematically investigate the formation of solitonic and vortex structures in the final, unified condensate, considering both non-rotating and rotating initial states. In both cases, merging leads to the formation of solitons that decay into vortex pairs through snake instability, and subsequently, these pairs annihilate. Soliton formation and decay-induced phase excitations generate sound waves, more pronounced when the merging time is short. We witness no sound wave generation at sufficiently longer merging times that fin
&lt;/p&gt;</description></item><item><title>&#26631;&#39064;&#65306;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869; billiards &#30340;&#28151;&#27788;&#29305;&#24615;
&#25688;&#35201;&#65306;arXiv:2309.09892v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#26412;&#25991;&#30740;&#31350;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869;&#24418;&#25104;&#30340;&#23553;&#38381;$C^1$&#20005;&#26684;&#20984;&#26354;&#32447;&#8212;&#8212;&#26377;&#38480;&#20010;&#22278;&#24359;&#38381;&#21512;&#30340;&#22810;&#36793;&#24418;&#12290;&#25105;&#20204;&#23545;&#36825;&#20123;&#36793;&#30028;&#38468;&#36817;&#30340;&#25509;&#36817;&#36793;&#30028;&#30340;&#22810;&#36793;&#24418;&#22495;&#30340;&#28369;&#21160;&#36712;&#36857;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#21457;&#29616;&#20854;&#22312;&#30456;&#31354;&#38388;&#20013;&#30340;&#22238;&#24402;billiard&#21160;&#21147;&#23398;&#19982;&#19968;&#20010;&#20855;&#26377;&#26080;&#38480;&#31526;&#21495;&#30340;subshift&#23384;&#22312; semiconjugate&#20851;&#31995;&#65292;&#35813;subshift&#21253;&#21547;&#20102;&#20316;&#20026;&#20854;&#25299;&#25169;&#22240;&#23376;&#20043;&#19968;&#30340;full $N$-shift&#65292;&#23545;&#20110;&#20219;&#20309;&#33258;&#28982;&#25968;$N$&#12290;&#36825;&#31181;&#21160;&#21147;&#31995;&#32479;&#20855;&#26377;&#26080;&#38480;&#30340;&#25299;&#25169;&#29109;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23384;&#22312;&#26080;&#31351;&#22810;&#20010;&#38543;&#36793;&#30028;&#36235;&#36817;&#30340;&#28176;&#36817;&#36866;&#29992;&#28369;&#21160;&#36712;&#36857;&#65292;&#20855;&#26377;&#26368;&#20248;&#21270;&#30340;&#22343;&#21248;&#32447;&#24615;&#36895;&#24230;&#65292;&#32473;&#20986;&#20102;&#21608;&#26399;&#36712;&#36857;&#25968;&#37327;&#30340;&#19979;&#38480;&#65292;&#35813;&#19979;&#38480;&#38543;&#21608;&#26399;$q$&#22686;&#22823;&#21576;&#25351;&#25968;&#22686;&#38271;&#65292;&#24182;&#25552;&#20986;&#20102;&#38271;&#24230;&#35889;&#30340;&#19968;&#20010;&#19981;&#23547;&#24120;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#37117;&#26159;&#20998;&#26512;&#24615;&#30340;&#12290;

&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#25991;&#25581;&#31034;&#20102;&#22312;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869;billiards&#30340;&#28151;&#27788;&#34892;&#20026;&#65292;&#35777;&#26126;&#20102;&#23384;&#22312;&#26080;&#38480;&#31526;&#21495;&#30340;subshift&#19982;&#22238;&#24402;billiard&#21160;&#21147;&#31995;&#32479;&#23384;&#22312;&#21322;&#21516;&#32986;&#20851;&#31995;&#65292;&#24182;&#32473;&#20986;&#20102;&#21608;&#26399;&#36712;&#36857;&#25968;&#37327;&#30340;&#19979;&#38480;&#65292;&#20197;&#21450;&#19982;&#38271;&#24230;&#35889;&#30456;&#20851;&#30340;&#33509;&#24178;&#19981;&#23547;&#24120;&#23646;&#24615;&#12290;</title><link>https://arxiv.org/abs/2309.09892</link><description>&lt;p&gt;
Chaotic properties for billiards in circular polygons
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2309.09892
&lt;/p&gt;
&lt;p&gt;
&#26631;&#39064;&#65306;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869; billiards &#30340;&#28151;&#27788;&#29305;&#24615;
&#25688;&#35201;&#65306;arXiv:2309.09892v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#26412;&#25991;&#30740;&#31350;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869;&#24418;&#25104;&#30340;&#23553;&#38381;$C^1$&#20005;&#26684;&#20984;&#26354;&#32447;&#8212;&#8212;&#26377;&#38480;&#20010;&#22278;&#24359;&#38381;&#21512;&#30340;&#22810;&#36793;&#24418;&#12290;&#25105;&#20204;&#23545;&#36825;&#20123;&#36793;&#30028;&#38468;&#36817;&#30340;&#25509;&#36817;&#36793;&#30028;&#30340;&#22810;&#36793;&#24418;&#22495;&#30340;&#28369;&#21160;&#36712;&#36857;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#21457;&#29616;&#20854;&#22312;&#30456;&#31354;&#38388;&#20013;&#30340;&#22238;&#24402;billiard&#21160;&#21147;&#23398;&#19982;&#19968;&#20010;&#20855;&#26377;&#26080;&#38480;&#31526;&#21495;&#30340;subshift&#23384;&#22312; semiconjugate&#20851;&#31995;&#65292;&#35813;subshift&#21253;&#21547;&#20102;&#20316;&#20026;&#20854;&#25299;&#25169;&#22240;&#23376;&#20043;&#19968;&#30340;full $N$-shift&#65292;&#23545;&#20110;&#20219;&#20309;&#33258;&#28982;&#25968;$N$&#12290;&#36825;&#31181;&#21160;&#21147;&#31995;&#32479;&#20855;&#26377;&#26080;&#38480;&#30340;&#25299;&#25169;&#29109;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23384;&#22312;&#26080;&#31351;&#22810;&#20010;&#38543;&#36793;&#30028;&#36235;&#36817;&#30340;&#28176;&#36817;&#36866;&#29992;&#28369;&#21160;&#36712;&#36857;&#65292;&#20855;&#26377;&#26368;&#20248;&#21270;&#30340;&#22343;&#21248;&#32447;&#24615;&#36895;&#24230;&#65292;&#32473;&#20986;&#20102;&#21608;&#26399;&#36712;&#36857;&#25968;&#37327;&#30340;&#19979;&#38480;&#65292;&#35813;&#19979;&#38480;&#38543;&#21608;&#26399;$q$&#22686;&#22823;&#21576;&#25351;&#25968;&#22686;&#38271;&#65292;&#24182;&#25552;&#20986;&#20102;&#38271;&#24230;&#35889;&#30340;&#19968;&#20010;&#19981;&#23547;&#24120;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#37117;&#26159;&#20998;&#26512;&#24615;&#30340;&#12290;

&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#25991;&#25581;&#31034;&#20102;&#22312;&#22278;&#24418;&#22810;&#36793;&#24418;&#21306;&#22495;&#20869;billiards&#30340;&#28151;&#27788;&#34892;&#20026;&#65292;&#35777;&#26126;&#20102;&#23384;&#22312;&#26080;&#38480;&#31526;&#21495;&#30340;subshift&#19982;&#22238;&#24402;billiard&#21160;&#21147;&#31995;&#32479;&#23384;&#22312;&#21322;&#21516;&#32986;&#20851;&#31995;&#65292;&#24182;&#32473;&#20986;&#20102;&#21608;&#26399;&#36712;&#36857;&#25968;&#37327;&#30340;&#19979;&#38480;&#65292;&#20197;&#21450;&#19982;&#38271;&#24230;&#35889;&#30456;&#20851;&#30340;&#33509;&#24178;&#19981;&#23547;&#24120;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2309.09892v2 Announce Type: replace-cross  Abstract: We study billiards in domains enclosed by circular polygons. These are closed $C^1$ strictly convex curves formed by finitely many circular arcs. We prove the existence of a set in phase space, corresponding to generic sliding trajectories close enough to the boundary of the domain, in which the return billiard dynamics is semiconjugate to a transitive subshift on infinitely many symbols that contains the full $N$-shift as a topological factor for any $N \in \mathbb{N}$, so it has infinite topological entropy. We prove the existence of uncountably many asymptotic generic sliding trajectories approaching the boundary with optimal uniform linear speed, give an explicit exponentially big (in $q$) lower bound on the number of $q$-periodic trajectories as $q \to \infty$, and present an unusual property of the length spectrum. Our proofs are entirely analytical.
&lt;/p&gt;</description></item><item><title>&#26631;&#39064;&#65306;&#36866;&#24212;&#31995;&#32479;&#21160;&#21147;&#29702;&#35770;
&#25688;&#35201;&#65306;arXiv:2306.01403v5 &#23459;&#24067;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#30740;&#31350;&#21253;&#21547;&#20004;&#31181;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#21464;&#21270;&#30340;&#36866;&#24212;&#21160;&#24577;&#23398;&#65292;&#19968;&#31181;&#26159;&#29366;&#24577;&#21464;&#37327;&#30340;&#24555;&#36895;&#21464;&#21270;&#65292;&#21478;&#19968;&#31181;&#26159;&#25511;&#21046;&#21069;&#32773;&#30340;&#21442;&#25968;&#30340;&#32531;&#24930;&#36866;&#24212;&#24615;&#65292;&#23545;&#20110;&#29702;&#35299;&#39537;&#21160;&#36827;&#21270;&#21644;&#23398;&#20064;&#21453;&#39304;&#26426;&#21046;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#39532;&#19969;-&#35199;&#21152;&#20122;-&#32599;&#26031;-&#24503;&#22810;&#37324;&#23433;&#33576;-&#25196;&#26862;&#65288;MSRDJ&#65289;&#30340;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#65292;&#26469;&#20998;&#26512;&#27492;&#31867;&#21160;&#24577;&#31995;&#32479;&#20013;&#38750;&#24179;&#34913;&#30456;&#21464;&#12290;&#20316;&#20026;&#23454;&#20363;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#21160;&#24577;&#22522;&#22240;-&#34920;&#22411;&#22320;&#22270;&#19979;&#30340;&#22522;&#22240;&#35843;&#25511;&#32593;&#32476;&#36866;&#24212;&#24615;&#65306;&#34920;&#22411;&#21464;&#21270;&#30001;&#24555;&#36895;&#38543;&#26426;&#22522;&#22240;&#34920;&#36798;&#21160;&#24577;&#20915;&#23450;&#65292;&#24182;&#19982;&#36951;&#20256;&#22411;&#30340;&#20998;&#24067;&#32531;&#24930;&#28436;&#21270;&#30456;&#20851;&#32852;&#65292;&#27599;&#20010;&#36951;&#20256;&#22411;&#30001;&#32593;&#32476;&#32467;&#26500;&#32534;&#30721;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#35813;&#22320;&#22270;&#19979;&#65292;&#20114;&#24800;&#21453;&#39304;&#22238;&#36335;&#32593;&#32476;&#30340;&#22522;&#22240;&#22411;&#22312;&#29615;&#22659;&#24212;&#31572;&#38408;&#20540;&#38468;&#36817;&#34987;&#36873;&#25321;&#12290;</title><link>https://arxiv.org/abs/2306.01403</link><description>&lt;p&gt;
Dynamical Theory for Adaptive Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2306.01403
&lt;/p&gt;
&lt;p&gt;
&#26631;&#39064;&#65306;&#36866;&#24212;&#31995;&#32479;&#21160;&#21147;&#29702;&#35770;
&#25688;&#35201;&#65306;arXiv:2306.01403v5 &#23459;&#24067;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#30740;&#31350;&#21253;&#21547;&#20004;&#31181;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#21464;&#21270;&#30340;&#36866;&#24212;&#21160;&#24577;&#23398;&#65292;&#19968;&#31181;&#26159;&#29366;&#24577;&#21464;&#37327;&#30340;&#24555;&#36895;&#21464;&#21270;&#65292;&#21478;&#19968;&#31181;&#26159;&#25511;&#21046;&#21069;&#32773;&#30340;&#21442;&#25968;&#30340;&#32531;&#24930;&#36866;&#24212;&#24615;&#65292;&#23545;&#20110;&#29702;&#35299;&#39537;&#21160;&#36827;&#21270;&#21644;&#23398;&#20064;&#21453;&#39304;&#26426;&#21046;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#39532;&#19969;-&#35199;&#21152;&#20122;-&#32599;&#26031;-&#24503;&#22810;&#37324;&#23433;&#33576;-&#25196;&#26862;&#65288;MSRDJ&#65289;&#30340;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#65292;&#26469;&#20998;&#26512;&#27492;&#31867;&#21160;&#24577;&#31995;&#32479;&#20013;&#38750;&#24179;&#34913;&#30456;&#21464;&#12290;&#20316;&#20026;&#23454;&#20363;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#21160;&#24577;&#22522;&#22240;-&#34920;&#22411;&#22320;&#22270;&#19979;&#30340;&#22522;&#22240;&#35843;&#25511;&#32593;&#32476;&#36866;&#24212;&#24615;&#65306;&#34920;&#22411;&#21464;&#21270;&#30001;&#24555;&#36895;&#38543;&#26426;&#22522;&#22240;&#34920;&#36798;&#21160;&#24577;&#20915;&#23450;&#65292;&#24182;&#19982;&#36951;&#20256;&#22411;&#30340;&#20998;&#24067;&#32531;&#24930;&#28436;&#21270;&#30456;&#20851;&#32852;&#65292;&#27599;&#20010;&#36951;&#20256;&#22411;&#30001;&#32593;&#32476;&#32467;&#26500;&#32534;&#30721;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#35813;&#22320;&#22270;&#19979;&#65292;&#20114;&#24800;&#21453;&#39304;&#22238;&#36335;&#32593;&#32476;&#30340;&#22522;&#22240;&#22411;&#22312;&#29615;&#22659;&#24212;&#31572;&#38408;&#20540;&#38468;&#36817;&#34987;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2306.01403v5 Announce Type: replace-cross  Abstract: The study of adaptive dynamics, involving many degrees of freedom on two separated timescales, one for fast changes of state variables and another for the slow adaptation of parameters controlling the former's dynamics is crucial for understanding feedback mechanisms underlying evolution and learning. We present a path-integral approach \`a la Martin-Siggia-Rose-De Dominicis-Janssen (MSRDJ) to analyse nonequilibrium phase transitions in such dynamical systems. As an illustration, we apply our framework to the adaptation of gene-regulatory networks under a dynamic genotype-phenotype map: phenotypic variations are shaped by the fast stochastic gene-expression dynamics and are coupled to the slowly evolving distribution of genotypes, each encoded by a network structure. We establish that under this map, genotypes corresponding to reciprocal networks of coherent feedback loops are selected within an intermediate range of environmen
&lt;/p&gt;</description></item><item><title>Title: &#20851;&#20110; $q$-Painlev\'e VI &#21644; Segre &#26354;&#38754;&#20960;&#20309;
&#25688;&#35201;&#65306;arXiv:2305.17912v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442; &#25688;&#35201;&#65306;&#22312;&#20855;&#26377;&#19968;&#33324;&#21442;&#25968;&#20540;&#30340; $q$-Painlev\'e VI &#32972;&#26223;&#19979;&#65292;&#37324;&#22855;-&#24076;&#23572;&#20271;&#29305;&#23545;&#24212;&#20851;&#31995;&#28608;&#21457;&#20102;&#19968;&#20010;&#38750;&#32447;&#24615;&#26041;&#31243;&#30340;&#35299;&#19982;&#19968;&#20010;&#20223;&#23556;Segre &#26354;&#38754;&#19978;&#30340;&#19968;&#20010;&#28857;&#30340;&#19968;&#19968;&#23545;&#24212;&#12290;&#22312;&#26354;&#38754;&#19978;&#30340;&#19968;&#20010;&#19968;&#33324;&#28857;&#34987;&#22266;&#23450;&#20043;&#21518;&#65292;&#25105;&#20204;&#22312;&#20020;&#36817;&#20020;&#30028;&#28857;&#30340;&#22320;&#26041;&#32473;&#20986;&#20102;&#23545;&#24212;&#30340;&#35299;&#30340;&#20989;&#25968;&#20540;&#30340;&#20844;&#24335;&#65292;&#24418;&#24335;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#12289;&#25910;&#25947;&#30340;&#12289;&#28176;&#36817;&#23637;&#24320;&#12290;&#36825;&#20123;&#23637;&#24320;&#24335;&#29305;&#21035;&#23548;&#33268;&#20102; $q$-Painlev\'e VI &#36890;&#35299;&#30340;&#38750;&#32447;&#24615;&#36830;&#25509;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#65292;&#24403;&#26354;&#38754;&#19978;&#30340;&#28857;&#31227;&#21160;&#21040;&#26354;&#38754;&#19978;&#30340;16&#26465;&#32447;&#20043;&#19968;&#26102;&#65292;&#22312;&#20020;&#30028;&#28857;&#38468;&#36817;&#30340;&#28176;&#36817;&#23637;&#24320;&#20043;&#19968;&#20250;&#31616;&#21270;&#65292;&#22312;&#28385;&#36275;&#26576;&#20123;&#21442;&#25968;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#12290;&#22312;&#26354;&#38754;&#32447;&#30340;&#20132;&#28857;&#22788;&#65292;&#36825;&#20250;&#36827;&#19968;&#27493;&#23548;&#33268;&#22312;&#20020;&#30028;&#28857;&#20043;&#19968;&#22788;&#30340;&#21452;&#31616;&#28176;&#36817;&#23637;&#24320;&#65292;&#25110;&#32773;&#21516;&#26102;&#22312;&#20004;&#20010;&#20020;&#30028;&#28857;&#22788;&#21516;&#26102;&#31616;&#21270;&#12290;</title><link>https://arxiv.org/abs/2305.17912</link><description>&lt;p&gt;
On $q$-Painlev\'e VI and the geometry of Segre surfaces
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2305.17912
&lt;/p&gt;
&lt;p&gt;
Title: &#20851;&#20110; $q$-Painlev\'e VI &#21644; Segre &#26354;&#38754;&#20960;&#20309;
&#25688;&#35201;&#65306;arXiv:2305.17912v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442; &#25688;&#35201;&#65306;&#22312;&#20855;&#26377;&#19968;&#33324;&#21442;&#25968;&#20540;&#30340; $q$-Painlev\'e VI &#32972;&#26223;&#19979;&#65292;&#37324;&#22855;-&#24076;&#23572;&#20271;&#29305;&#23545;&#24212;&#20851;&#31995;&#28608;&#21457;&#20102;&#19968;&#20010;&#38750;&#32447;&#24615;&#26041;&#31243;&#30340;&#35299;&#19982;&#19968;&#20010;&#20223;&#23556;Segre &#26354;&#38754;&#19978;&#30340;&#19968;&#20010;&#28857;&#30340;&#19968;&#19968;&#23545;&#24212;&#12290;&#22312;&#26354;&#38754;&#19978;&#30340;&#19968;&#20010;&#19968;&#33324;&#28857;&#34987;&#22266;&#23450;&#20043;&#21518;&#65292;&#25105;&#20204;&#22312;&#20020;&#36817;&#20020;&#30028;&#28857;&#30340;&#22320;&#26041;&#32473;&#20986;&#20102;&#23545;&#24212;&#30340;&#35299;&#30340;&#20989;&#25968;&#20540;&#30340;&#20844;&#24335;&#65292;&#24418;&#24335;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#12289;&#25910;&#25947;&#30340;&#12289;&#28176;&#36817;&#23637;&#24320;&#12290;&#36825;&#20123;&#23637;&#24320;&#24335;&#29305;&#21035;&#23548;&#33268;&#20102; $q$-Painlev\'e VI &#36890;&#35299;&#30340;&#38750;&#32447;&#24615;&#36830;&#25509;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#65292;&#24403;&#26354;&#38754;&#19978;&#30340;&#28857;&#31227;&#21160;&#21040;&#26354;&#38754;&#19978;&#30340;16&#26465;&#32447;&#20043;&#19968;&#26102;&#65292;&#22312;&#20020;&#30028;&#28857;&#38468;&#36817;&#30340;&#28176;&#36817;&#23637;&#24320;&#20043;&#19968;&#20250;&#31616;&#21270;&#65292;&#22312;&#28385;&#36275;&#26576;&#20123;&#21442;&#25968;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#12290;&#22312;&#26354;&#38754;&#32447;&#30340;&#20132;&#28857;&#22788;&#65292;&#36825;&#20250;&#36827;&#19968;&#27493;&#23548;&#33268;&#22312;&#20020;&#30028;&#28857;&#20043;&#19968;&#22788;&#30340;&#21452;&#31616;&#28176;&#36817;&#23637;&#24320;&#65292;&#25110;&#32773;&#21516;&#26102;&#22312;&#20004;&#20010;&#20020;&#30028;&#28857;&#22788;&#21516;&#26102;&#31616;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2305.17912v3 Announce Type: replace  Abstract: In the context of $q$-Painlev\'e VI with generic parameter values, the Riemann-Hilbert correspondence induces a one-to-one mapping between solutions of the nonlinear equation and points on an affine Segre surface. Upon fixing a generic point on the surface, we give formulae for the function values of the corresponding solution near the critical points, in the form of complete, convergent, asymptotic expansions. These lead in particular to the solution of the nonlinear connection problem for the general solution of $q$-Painlev\'e VI. We further show that, when the point on the Segre surface is moved to one of the sixteen lines on the surface, one of the asymptotic expansions near the critical points truncates, under suitable parameter assumptions. At intersection points of lines, this then yields doubly truncated asymptotics at one of the critical points or simultaneous truncation at both.
&lt;/p&gt;</description></item><item><title>Title: &#20851;&#20110;&#26576;&#20123;&#21516;&#35843;&#23432;&#24658;tau&#20989;&#25968;&#30340;&#21704;&#23494;&#39039;&#24615;&#36136;
&#25688;&#35201;&#65306;arXiv:1803.04212v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;&#25688;&#35201;&#65306;&#25105;&#20204;&#22312;&#26368;&#36817;&#30340;&#21457;&#23637;&#20013;&#35752;&#35770;&#20102;&#19968;&#20123;&#21513;&#22982;&#21338;-&#23467;&#23614;-&#23431;&#37326;tau&#20989;&#25968;&#29702;&#35770;&#30340;&#26032;&#26041;&#38754;&#12290;&#25105;&#20204;&#21457;&#29616;Painlev&#233;&#26041;&#31243;&#30456;&#20851;tau&#20989;&#25968;&#30340;&#32423;&#27604;&#23548;&#25968;&#19982;&#32463;&#20856;&#21160;&#21147;&#23398;&#34892;&#21160;&#24494;&#20998;&#30456;&#21516;&#12290;&#36825;&#19968;&#20107;&#23454;&#26497;&#22823;&#22320;&#31616;&#21270;&#20102;Painlev&#233;&#26041;&#31243;tau&#20989;&#25968;&#28176;&#36817;&#34892;&#20026;&#20013;&#24120;&#25968;&#22240;&#23376;&#35780;&#20215;&#30340;&#38382;&#39064;&#65292;&#36825;&#26159;&#28176;&#36817;&#29702;&#35770;Painlev&#233;&#26041;&#31243;&#20013;&#30340;&#19968;&#20010;&#38271;&#26399;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30456;&#20449;&#36825;&#19968;&#35266;&#23519;&#26159;L. D. Faddeev&#23545;&#21487;&#31215;&#31995;&#32479;&#29702;&#35770;&#20013;&#21704;&#23494;&#39039;&#24615;&#36136;&#37325;&#35201;&#24615;&#30340;&#21448;&#19968;&#20307;&#29616;&#12290;&#36825;&#31687;&#25991;&#31456;&#23558;&#20986;&#29616;&#22312;&#32426;&#24565;Ludwig Faddeev&#30340;WSPC&#32426;&#24565;&#25991;&#38598;&#20013;&#12290;</title><link>https://arxiv.org/abs/1803.04212</link><description>&lt;p&gt;
On some Hamiltonian properties of the isomonodromic tau functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1803.04212
&lt;/p&gt;
&lt;p&gt;
Title: &#20851;&#20110;&#26576;&#20123;&#21516;&#35843;&#23432;&#24658;tau&#20989;&#25968;&#30340;&#21704;&#23494;&#39039;&#24615;&#36136;
&#25688;&#35201;&#65306;arXiv:1803.04212v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;&#25688;&#35201;&#65306;&#25105;&#20204;&#22312;&#26368;&#36817;&#30340;&#21457;&#23637;&#20013;&#35752;&#35770;&#20102;&#19968;&#20123;&#21513;&#22982;&#21338;-&#23467;&#23614;-&#23431;&#37326;tau&#20989;&#25968;&#29702;&#35770;&#30340;&#26032;&#26041;&#38754;&#12290;&#25105;&#20204;&#21457;&#29616;Painlev&#233;&#26041;&#31243;&#30456;&#20851;tau&#20989;&#25968;&#30340;&#32423;&#27604;&#23548;&#25968;&#19982;&#32463;&#20856;&#21160;&#21147;&#23398;&#34892;&#21160;&#24494;&#20998;&#30456;&#21516;&#12290;&#36825;&#19968;&#20107;&#23454;&#26497;&#22823;&#22320;&#31616;&#21270;&#20102;Painlev&#233;&#26041;&#31243;tau&#20989;&#25968;&#28176;&#36817;&#34892;&#20026;&#20013;&#24120;&#25968;&#22240;&#23376;&#35780;&#20215;&#30340;&#38382;&#39064;&#65292;&#36825;&#26159;&#28176;&#36817;&#29702;&#35770;Painlev&#233;&#26041;&#31243;&#20013;&#30340;&#19968;&#20010;&#38271;&#26399;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30456;&#20449;&#36825;&#19968;&#35266;&#23519;&#26159;L. D. Faddeev&#23545;&#21487;&#31215;&#31995;&#32479;&#29702;&#35770;&#20013;&#21704;&#23494;&#39039;&#24615;&#36136;&#37325;&#35201;&#24615;&#30340;&#21448;&#19968;&#20307;&#29616;&#12290;&#36825;&#31687;&#25991;&#31456;&#23558;&#20986;&#29616;&#22312;&#32426;&#24565;Ludwig Faddeev&#30340;WSPC&#32426;&#24565;&#25991;&#38598;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1803.04212v3 Announce Type: replace-cross  Abstract: We discuss some new aspects of the theory of the Jimbo-Miwa-Ueno tau function which have come to light within the recent developments in the global asymptotic analysis of the tau functions related to the Painlev\'e equations. Specifically, we show that up to the total differentials the logarithmic derivatives of the Painlev\'e tau functions coincide with the corresponding classical action differential. This fact simplifies considerably the evaluation of the constant factors in the asymptotics of tau-functions, which has been a long-standing problem of the asymptotic theory of Painlev\'e equations. Furthermore, we believe that this observation is yet another manifestation of L. D. Faddeev's emphasis of the key role which the Hamiltonian aspects play in the theory of integrable system.   This article will appear in the WSPC memorial volume dedicated to Ludwig Faddeev.
&lt;/p&gt;</description></item></channel></rss>