<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/chrunx/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20026;&#29289;&#29702;&#23398;&#23478;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#30701;&#30340;&#20171;&#32461;&#24615;&#25945;&#31243;&#65292;&#30446;&#30340;&#26159;&#26222;&#21450;&#29983;&#29289;&#23398;&#39046;&#22495;&#30340;&#36827;&#21270;&#29702;&#35770;&#65292;&#23588;&#20854;&#26159;&#23545;&#36827;&#21270;&#29702;&#35770;&#30693;&#20043;&#29978;&#23569;&#25110;&#24863;&#20852;&#36259;&#30340;&#29289;&#29702;&#23398;&#23478;&#12290;&#23427;&#31616;&#21270;&#20102;&#29983;&#29289;&#23398;&#32972;&#26223;&#30693;&#35782;&#65292;&#20351;&#24471;&#29289;&#29702;&#23398;&#23478;&#33021;&#22815;&#26356;&#23481;&#26131;&#22320;&#36827;&#20837;&#36825;&#19968;&#39046;&#22495;&#65292;&#20943;&#23569;&#20102;&#29289;&#29702;&#23398;&#23478;&#25506;&#32034;&#29983;&#29289;&#23398;&#36827;&#21270;&#29702;&#35770;&#26102;&#36935;&#21040;&#30340;&#38556;&#30861;&#12290;</title><link>https://arxiv.org/abs/2408.02650</link><description>&lt;p&gt;
Population genetics: an introduction for physicists
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02650
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20026;&#29289;&#29702;&#23398;&#23478;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#30701;&#30340;&#20171;&#32461;&#24615;&#25945;&#31243;&#65292;&#30446;&#30340;&#26159;&#26222;&#21450;&#29983;&#29289;&#23398;&#39046;&#22495;&#30340;&#36827;&#21270;&#29702;&#35770;&#65292;&#23588;&#20854;&#26159;&#23545;&#36827;&#21270;&#29702;&#35770;&#30693;&#20043;&#29978;&#23569;&#25110;&#24863;&#20852;&#36259;&#30340;&#29289;&#29702;&#23398;&#23478;&#12290;&#23427;&#31616;&#21270;&#20102;&#29983;&#29289;&#23398;&#32972;&#26223;&#30693;&#35782;&#65292;&#20351;&#24471;&#29289;&#29702;&#23398;&#23478;&#33021;&#22815;&#26356;&#23481;&#26131;&#22320;&#36827;&#20837;&#36825;&#19968;&#39046;&#22495;&#65292;&#20943;&#23569;&#20102;&#29289;&#29702;&#23398;&#23478;&#25506;&#32034;&#29983;&#29289;&#23398;&#36827;&#21270;&#29702;&#35770;&#26102;&#36935;&#21040;&#30340;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02650v1 Announce Type: new  Abstract: Population genetics lies at the heart of evolutionary theory. This topic forms part of many biological science curricula but is rarely taught to physics students. Since physicists are becoming increasingly interested in biological evolution, we aim to provide a brief introduction to population genetics, written for physicists. We start with two background chapters: chapter 1 provides a brief historical introduction to the topic, while chapter 2 provides some essential biological background. We begin our main content with chapter 3 which discusses the key concepts behind Darwinian natural selection and Mendelian inheritance. Chapter 4 covers the basics of how variation is maintained in populations, while chapter 5 discusses mutation and selection. In chapter 6 we discuss stochastic effects in population genetics using the Wright-Fisher model as our example, and finally we offer concluding thoughts and references to excellent textbooks in 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#35299;&#26500;&#22823;&#33041;&#32593;&#32476;&#32452;&#32455;&#21407;&#21017;&#21644;&#21151;&#33021;&#30340;&#26032;&#26041;&#27861;&#65292;&#20026;&#35299;&#26512;&#20154;&#31867;&#21644;&#21160;&#29289;&#34892;&#20026;&#12289;&#27835;&#30103;&#31934;&#31070;&#30142;&#30149;&#20197;&#21450;&#21457;&#23637;&#20154;&#24037;&#26234;&#33021;&#25552;&#20379;&#20102;&#20851;&#38190;&#35265;&#35299;&#12290;</title><link>https://arxiv.org/abs/2408.02640</link><description>&lt;p&gt;
Towards principles of brain network organization and function
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02640
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#35299;&#26500;&#22823;&#33041;&#32593;&#32476;&#32452;&#32455;&#21407;&#21017;&#21644;&#21151;&#33021;&#30340;&#26032;&#26041;&#27861;&#65292;&#20026;&#35299;&#26512;&#20154;&#31867;&#21644;&#21160;&#29289;&#34892;&#20026;&#12289;&#27835;&#30103;&#31934;&#31070;&#30142;&#30149;&#20197;&#21450;&#21457;&#23637;&#20154;&#24037;&#26234;&#33021;&#25552;&#20379;&#20102;&#20851;&#38190;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02640v1 Announce Type: new  Abstract: The brain is immensely complex, with diverse components and dynamic interactions building upon one another to orchestrate a wide range of functions and behaviors. Understanding patterns of these complex interactions and how they are coordinated to support collective neural activity and function is critical for parsing human and animal behavior, treating mental illness, and developing artificial intelligence. Rapid experimental advances in imaging, recording, and perturbing neural systems across various species now provide opportunities and challenges to distill underlying principles of brain organization and function. Here, we take stock of recent progresses and review methods used in the statistical analysis of brain networks, drawing from fields of statistical physics, network theory and information theory. Our discussion is organized by scale, starting with models of individual neurons and extending to large-scale networks mapped acro
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#36890;&#36807;&#23545;&#32593;&#32476;&#20013;&#33410;&#28857;&#65288;&#31070;&#32463;&#20803;&#65289;&#21644;&#36793;&#65288;&#31361;&#35302;&#65289;&#30340;&#38543;&#26426;&#21024;&#38500;&#26469;&#27169;&#25311;&#36873;&#25321;&#24615;&#20462;&#21098;&#21644;&#31070;&#32463;&#27515;&#20129;&#36807;&#31243;&#65292;&#20174;&#32780;&#20135;&#29983;&#20855;&#26377;&#20559;&#24577;&#32593;&#32476;&#36830;&#25509;&#24230;&#30340;&#32593;&#32476;&#12290;&#36825;&#31181;&#27169;&#22411;&#30340;&#21019;&#26032;&#36129;&#29486;&#22312;&#20110;&#20854;&#33021;&#22815;&#26377;&#25928;&#22320;&#25551;&#36848;&#31070;&#32463;&#32593;&#32476;&#30340;&#21457;&#23637;&#36807;&#31243;&#20013;&#33410;&#28857;&#21644;&#36793;&#25968;&#37327;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38750;&#38543;&#26426;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#31070;&#32463;&#32593;&#32476;&#22797;&#26434;&#24230;&#21644;&#25928;&#29575;&#20043;&#38388;&#30340;&#21487;&#33021;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2408.02625</link><description>&lt;p&gt;
Selective pruning and neuronal death generate heavy-tail network connectivity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02625
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#36890;&#36807;&#23545;&#32593;&#32476;&#20013;&#33410;&#28857;&#65288;&#31070;&#32463;&#20803;&#65289;&#21644;&#36793;&#65288;&#31361;&#35302;&#65289;&#30340;&#38543;&#26426;&#21024;&#38500;&#26469;&#27169;&#25311;&#36873;&#25321;&#24615;&#20462;&#21098;&#21644;&#31070;&#32463;&#27515;&#20129;&#36807;&#31243;&#65292;&#20174;&#32780;&#20135;&#29983;&#20855;&#26377;&#20559;&#24577;&#32593;&#32476;&#36830;&#25509;&#24230;&#30340;&#32593;&#32476;&#12290;&#36825;&#31181;&#27169;&#22411;&#30340;&#21019;&#26032;&#36129;&#29486;&#22312;&#20110;&#20854;&#33021;&#22815;&#26377;&#25928;&#22320;&#25551;&#36848;&#31070;&#32463;&#32593;&#32476;&#30340;&#21457;&#23637;&#36807;&#31243;&#20013;&#33410;&#28857;&#21644;&#36793;&#25968;&#37327;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38750;&#38543;&#26426;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#31070;&#32463;&#32593;&#32476;&#22797;&#26434;&#24230;&#21644;&#25928;&#29575;&#20043;&#38388;&#30340;&#21487;&#33021;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02625v1 Announce Type: new  Abstract: From the proliferative mechanisms generating neurons from progenitor cells to neuron migration and synaptic connection formation, several vicissitudes culminate in the mature brain. Both component loss and gain remain ubiquitous during brain development. For example, rodent brains lose over half of their initial neurons and synapses during healthy development. The role of deleterious steps in network ontogeny remains unclear, yet it is unlikely these costly processes are random. Like neurogenesis and synaptogenesis, synaptic pruning and neuron death likely evolved to support complex, efficient computations. In order to incorporate both component loss and gain in describing neuronal networks, we propose an algorithm where a directed network evolves through the selective deletion of less-connected nodes (neurons) and edges (synapses). Resulting in networks that display scale-invariant degree distributions, provided the network is predomina
&lt;/p&gt;</description></item><item><title>&#29992;&#25143;&#36755;&#20837;&#30340;&#20869;&#23481;&#25552;&#21040;&#30340;&#19968;&#39033;&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#26159;&#23545;&#29616;&#26377;&#29983;&#24577;&#23398;&#32479;&#35745;&#20998;&#26512;&#26041;&#27861;&#30340;&#25913;&#36827;&#65292;&#36890;&#36807;&#25972;&#21512;&#27169;&#22411;&#26500;&#24314;&#21644;&#27979;&#35797;&#65292;&#20197;&#21450;&#23545;&#25968;&#25454;&#20013;&#29983;&#24577;&#29702;&#35770;&#30340;&#26356;&#28145;&#20837;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25552;&#39640;&#27169;&#22411;&#30340;&#31283;&#20581;&#24615;&#21644;&#29702;&#35770;&#25351;&#23548;&#19979;&#30340;&#29983;&#24577;&#27934;&#23519;&#21147;&#12290;</title><link>https://arxiv.org/abs/2408.02603</link><description>&lt;p&gt;
A four-step Bayesian workflow for improving ecological science
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02603
&lt;/p&gt;
&lt;p&gt;
&#29992;&#25143;&#36755;&#20837;&#30340;&#20869;&#23481;&#25552;&#21040;&#30340;&#19968;&#39033;&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#26159;&#23545;&#29616;&#26377;&#29983;&#24577;&#23398;&#32479;&#35745;&#20998;&#26512;&#26041;&#27861;&#30340;&#25913;&#36827;&#65292;&#36890;&#36807;&#25972;&#21512;&#27169;&#22411;&#26500;&#24314;&#21644;&#27979;&#35797;&#65292;&#20197;&#21450;&#23545;&#25968;&#25454;&#20013;&#29983;&#24577;&#29702;&#35770;&#30340;&#26356;&#28145;&#20837;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25552;&#39640;&#27169;&#22411;&#30340;&#31283;&#20581;&#24615;&#21644;&#29702;&#35770;&#25351;&#23548;&#19979;&#30340;&#29983;&#24577;&#27934;&#23519;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02603v1 Announce Type: new  Abstract: Growing anthropogenic pressures have increased the need for robust predictive models. Meeting this demand requires approaches that can handle bigger data to yield forecasts that capture the variability and underlying uncertainty of ecological systems. Bayesian models are especially adept at this and are growing in use in ecology. Yet many ecologists today are not trained to take advantage of the bigger ecological data needed to generate more flexible robust models. Here we describe a broadly generalizable workflow for statistical analyses and show how it can enhance training in ecology. Building on the increasingly computational toolkit of many ecologists, this approach leverages simulation to integrate model building and testing for empirical data more fully with ecological theory. In turn this workflow can fit models that are more robust and well-suited to provide new ecological insights -- allowing us to refine where to put resources 
&lt;/p&gt;</description></item><item><title>&#21019;&#26032;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20248;&#21270;&#35269;&#39135;&#27169;&#22411;&#19982;&#29983;&#21629;&#20307;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20998;&#26512;&#20102;&#20010;&#20307;&#35269;&#39135;&#20915;&#31574;&#23545;&#31181;&#32676;&#35268;&#27169;&#22686;&#38271;&#21160;&#24577;&#30340;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#20010;&#20307;&#20869;&#22312;&#21160;&#26426;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#30340;&#34892;&#20026;&#21709;&#24212;&#22914;&#20309;&#24433;&#21709;&#20102;&#31181;&#32676;&#22686;&#38271;&#27169;&#22411;&#20013;&#30340;&#8220;&#23481;&#32435;&#37327;&#8221;&#27010;&#24565;&#65292;&#23588;&#20854;&#26159;&#31181;&#32676;&#23494;&#24230;&#22914;&#20309;&#24433;&#21709;&#20010;&#20307;&#30340;&#35269;&#39135;&#26102;&#38388;&#36873;&#25321;&#12290;&#36825;&#31181;&#32806;&#21512;&#27169;&#22411;&#20026;&#29702;&#35299;&#31181;&#32676;&#22312;&#25509;&#36817;&#29615;&#22659;&#26497;&#38480;&#26465;&#20214;&#19979;&#30340;&#30495;&#23454;&#34892;&#20026;&#25552;&#20379;&#20102;&#26032;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2408.02552</link><description>&lt;p&gt;
Interplay between Foraging Choices and Population Growth Dynamics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02552
&lt;/p&gt;
&lt;p&gt;
&#21019;&#26032;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20248;&#21270;&#35269;&#39135;&#27169;&#22411;&#19982;&#29983;&#21629;&#20307;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20998;&#26512;&#20102;&#20010;&#20307;&#35269;&#39135;&#20915;&#31574;&#23545;&#31181;&#32676;&#35268;&#27169;&#22686;&#38271;&#21160;&#24577;&#30340;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#20010;&#20307;&#20869;&#22312;&#21160;&#26426;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#30340;&#34892;&#20026;&#21709;&#24212;&#22914;&#20309;&#24433;&#21709;&#20102;&#31181;&#32676;&#22686;&#38271;&#27169;&#22411;&#20013;&#30340;&#8220;&#23481;&#32435;&#37327;&#8221;&#27010;&#24565;&#65292;&#23588;&#20854;&#26159;&#31181;&#32676;&#23494;&#24230;&#22914;&#20309;&#24433;&#21709;&#20010;&#20307;&#30340;&#35269;&#39135;&#26102;&#38388;&#36873;&#25321;&#12290;&#36825;&#31181;&#32806;&#21512;&#27169;&#22411;&#20026;&#29702;&#35299;&#31181;&#32676;&#22312;&#25509;&#36817;&#29615;&#22659;&#26497;&#38480;&#26465;&#20214;&#19979;&#30340;&#30495;&#23454;&#34892;&#20026;&#25552;&#20379;&#20102;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02552v1 Announce Type: new  Abstract: In this study, we couple a population dynamics model with a model for optimal foraging to study the interdependence between individual-level cost-benefits and population-scale dynamics. Specifically, we study the logistic growth model, which provides insights into population dynamics under resource limitations. Unlike exponential growth, the logistic model incorporates the concept of carrying capacity, thus offering a more realistic depiction of biological populations as they near environmental limits. We aim to study the impact of individual-level incentives driving behavioral responses in a dynamic environment. Specifically, explore the coupled dynamics between population density and individuals' foraging times. Our results yield insights into the effects of population size on individuals' optimal foraging efforts, which impacts the population's size.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#39318;&#27425;&#25552;&#20986;&#20102;&#33258;&#21160;&#35780;&#32423;&#19981;&#23436;&#20840;&#28023;&#39532;&#21453;&#36716;&#65288;IHI&#65289;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#39044;&#27979;&#22235;&#20010;&#35299;&#21078;&#23398;&#26631;&#20934;&#24182;&#23558;&#23427;&#20204;&#30456;&#21152;&#33719;&#24471;&#32508;&#21512;&#35780;&#20998;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30740;&#31350;&#20013;&#30340;&#25361;&#25112;&#26159;&#22914;&#20309;&#20811;&#26381;&#27169;&#22411;&#23545;&#19981;&#21516;&#38431;&#21015;&#20013;&#29305;&#24449;&#31354;&#38388;&#30340;&#24046;&#24322;&#30340;&#25935;&#24863;&#24615;&#12290;&#20026;&#27492;&#65292;&#20316;&#32773;&#25552;&#20986;&#20102;&#23558;&#19981;&#21516;&#38431;&#21015;&#30340;&#25968;&#25454;&#32479;&#19968;&#21518;&#36827;&#34892;&#35757;&#32451;&#65292;&#24182;&#22312;&#21333;&#29420;&#30340;&#38431;&#21015;&#19978;&#36827;&#34892;&#39564;&#35777;&#21644;&#27979;&#35797;&#30340;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#22312;&#20445;&#25345;&#36739;&#39640;&#35780;&#20998;&#20934;&#30830;&#24615;&#30340;&#21516;&#26102;&#65292;&#20063;&#21152;&#24555;&#20102;&#35780;&#20272;&#30340;&#36895;&#24230;&#21644;&#21487;&#34892;&#24615;&#65292;&#23545;&#20110;&#22823;&#35268;&#27169;&#30740;&#31350;&#21644;&#20020;&#24202;&#24212;&#29992;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>https://arxiv.org/abs/2408.02496</link><description>&lt;p&gt;
Automatic rating of incomplete hippocampal inversions evaluated across multiple cohorts
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02496
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#39318;&#27425;&#25552;&#20986;&#20102;&#33258;&#21160;&#35780;&#32423;&#19981;&#23436;&#20840;&#28023;&#39532;&#21453;&#36716;&#65288;IHI&#65289;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#39044;&#27979;&#22235;&#20010;&#35299;&#21078;&#23398;&#26631;&#20934;&#24182;&#23558;&#23427;&#20204;&#30456;&#21152;&#33719;&#24471;&#32508;&#21512;&#35780;&#20998;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30740;&#31350;&#20013;&#30340;&#25361;&#25112;&#26159;&#22914;&#20309;&#20811;&#26381;&#27169;&#22411;&#23545;&#19981;&#21516;&#38431;&#21015;&#20013;&#29305;&#24449;&#31354;&#38388;&#30340;&#24046;&#24322;&#30340;&#25935;&#24863;&#24615;&#12290;&#20026;&#27492;&#65292;&#20316;&#32773;&#25552;&#20986;&#20102;&#23558;&#19981;&#21516;&#38431;&#21015;&#30340;&#25968;&#25454;&#32479;&#19968;&#21518;&#36827;&#34892;&#35757;&#32451;&#65292;&#24182;&#22312;&#21333;&#29420;&#30340;&#38431;&#21015;&#19978;&#36827;&#34892;&#39564;&#35777;&#21644;&#27979;&#35797;&#30340;&#31574;&#30053;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#22312;&#20445;&#25345;&#36739;&#39640;&#35780;&#20998;&#20934;&#30830;&#24615;&#30340;&#21516;&#26102;&#65292;&#20063;&#21152;&#24555;&#20102;&#35780;&#20272;&#30340;&#36895;&#24230;&#21644;&#21487;&#34892;&#24615;&#65292;&#23545;&#20110;&#22823;&#35268;&#27169;&#30740;&#31350;&#21644;&#20020;&#24202;&#24212;&#29992;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02496v1 Announce Type: cross  Abstract: Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal malrotation, is an atypical anatomical pattern of the hippocampus found in about 20% of the general population. IHI can be visually assessed on coronal slices of T1 weighted MR images, using a composite score that combines four anatomical criteria. IHI has been associated with several brain disorders (epilepsy, schizophrenia). However, these studies were based on small samples. Furthermore, the factors (genetic or environmental) that contribute to the genesis of IHI are largely unknown. Large-scale studies are thus needed to further understand IHI and their potential relationships to neurological and psychiatric disorders. However, visual evaluation is long and tedious, justifying the need for an automatic method. In this paper, we propose, for the first time, to automatically rate IHI. We proceed by predicting four anatomical criteria, which are then summed up to for
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#24352;&#37327;&#27169;&#26495;&#21305;&#37197;&#31639;&#27861;&#22823;&#24133;&#25552;&#21319;&#20102;&#22312;&#19977;&#32500;&#22270;&#20687;&#20013;&#26816;&#27979;&#26059;&#36716;&#29289;&#20307;&#30340;&#36895;&#24230;&#21644;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2408.02398</link><description>&lt;p&gt;
Tensorial template matching for fast cross-correlation with rotations and its application for tomography
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02398
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24352;&#37327;&#27169;&#26495;&#21305;&#37197;&#31639;&#27861;&#22823;&#24133;&#25552;&#21319;&#20102;&#22312;&#19977;&#32500;&#22270;&#20687;&#20013;&#26816;&#27979;&#26059;&#36716;&#29289;&#20307;&#30340;&#36895;&#24230;&#21644;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02398v1 Announce Type: new  Abstract: Object detection is a main task in computer vision. Template matching is the reference method for detecting objects with arbitrary templates. However, template matching computational complexity depends on the rotation accuracy, being a limiting factor for large 3D images (tomograms). Here, we implement a new algorithm called tensorial template matching, based on a mathematical framework that represents all rotations of a template with a tensor field. Contrary to standard template matching, the computational complexity of the presented algorithm is independent of the rotation accuracy. Using both, synthetic and real data from tomography, we demonstrate that tensorial template matching is much faster than template matching and has the potential to improve its accuracy
&lt;/p&gt;</description></item><item><title>&#29992;&#25143;&#36755;&#20837;&#30340;&#20869;&#23481;&#20013;&#65292;&#26368;&#37325;&#35201;&#30340;&#21019;&#26032;&#21644;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#32452;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#33021;&#22815;&#39640;&#25928;&#22320;&#35299;&#20915;&#35774;&#35745;&#23454;&#39564;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#36873;&#25321;&#29992;&#20110;&#23454;&#39564;&#27979;&#35797;&#30340;&#32858;&#21512;&#29289;&#23376;&#38598;&#26102;&#65292;&#20197;&#30830;&#20445;&#23545;&#32858;&#21512;&#29289;&#35774;&#35745;&#35268;&#21017;&#30340;&#23398;&#20064;&#26159;&#26368;&#20339;&#30340;&#12290;&#36825;&#20123;&#31639;&#27861;&#29305;&#21035;&#36866;&#29992;&#20110;&#38656;&#35201;&#22312;&#21512;&#25104;&#21270;&#23398;&#22810;&#26679;&#24615;&#30340;&#38480;&#21046;&#25110;&#23454;&#39564;&#27979;&#37327;&#30340;&#21487;&#34892;&#24615;&#38480;&#21046;&#19979;&#36873;&#25321;&#32858;&#21512;&#29289;&#30340;&#24773;&#20917;&#65292;&#22914;&#22312;&#26680; acids&#30103;&#27861;&#24037;&#31243;&#20013;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#25214;&#21040;&#19968;&#32452;&#26368;&#20248;&#23454;&#39564;&#35774;&#35745;&#26041;&#38754;&#23454;&#29616;&#20102;&#31361;&#30772;&#65292;&#36825;&#19981;&#21516;&#20110;&#20256;&#32479;&#30340;&#35774;&#35745;&#23454;&#39564;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2408.02166</link><description>&lt;p&gt;
Efficient Approximate Methods for Design of Experiments for Copolymer Engineering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.02166
&lt;/p&gt;
&lt;p&gt;
&#29992;&#25143;&#36755;&#20837;&#30340;&#20869;&#23481;&#20013;&#65292;&#26368;&#37325;&#35201;&#30340;&#21019;&#26032;&#21644;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#32452;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#33021;&#22815;&#39640;&#25928;&#22320;&#35299;&#20915;&#35774;&#35745;&#23454;&#39564;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#36873;&#25321;&#29992;&#20110;&#23454;&#39564;&#27979;&#35797;&#30340;&#32858;&#21512;&#29289;&#23376;&#38598;&#26102;&#65292;&#20197;&#30830;&#20445;&#23545;&#32858;&#21512;&#29289;&#35774;&#35745;&#35268;&#21017;&#30340;&#23398;&#20064;&#26159;&#26368;&#20339;&#30340;&#12290;&#36825;&#20123;&#31639;&#27861;&#29305;&#21035;&#36866;&#29992;&#20110;&#38656;&#35201;&#22312;&#21512;&#25104;&#21270;&#23398;&#22810;&#26679;&#24615;&#30340;&#38480;&#21046;&#25110;&#23454;&#39564;&#27979;&#37327;&#30340;&#21487;&#34892;&#24615;&#38480;&#21046;&#19979;&#36873;&#25321;&#32858;&#21512;&#29289;&#30340;&#24773;&#20917;&#65292;&#22914;&#22312;&#26680; acids&#30103;&#27861;&#24037;&#31243;&#20013;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#25214;&#21040;&#19968;&#32452;&#26368;&#20248;&#23454;&#39564;&#35774;&#35745;&#26041;&#38754;&#23454;&#29616;&#20102;&#31361;&#30772;&#65292;&#36825;&#19981;&#21516;&#20110;&#20256;&#32479;&#30340;&#35774;&#35745;&#23454;&#39564;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.02166v1 Announce Type: new  Abstract: We develop a set of algorithms to solve a broad class of Design of Experiment (DoE) problems efficiently. Specifically, we consider problems in which one must choose a subset of polymers to test in experiments such that the learning of the polymeric design rules is optimal. This subset must be selected from a larger set of polymers permissible under arbitrary experimental design constraints. We demonstrate the performance of our algorithms by solving several pragmatic nucleic acid therapeutics engineering scenarios, where limitations in synthesis of chemically diverse nucleic acids or feasibility of measurements in experimental setups appear as constraints. Our approach focuses on identifying optimal experimental designs from a given set of experiments, which is in contrast to traditional, generative DoE methods like BIBD. Finally, we discuss how these algorithms are broadly applicable to well-established optimal DoE criteria like D-opti
&lt;/p&gt;</description></item><item><title>The paper focuses on the efficient coding and computation in cortical circuits, connecting theoretical neuroscience with statistical physics. It discusses the mutual benefits of studying neural networks for understanding complex systems, nonequilibrium dynamics, and disordered systems in physics, and vice versa. The discussed work starts from the chaos in random neural networks and progresses to the efficient coding and the partial suppression of chaotic fluctuations. Key concepts from statistical physics, including phase transitions and critical phenomena, are highlighted for explaining the computational capabilities of neural networks.</title><link>https://arxiv.org/abs/2408.01949</link><description>&lt;p&gt;
Efficient coding with chaotic neural networks: A journey from neuroscience to physics and back
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01949
&lt;/p&gt;
&lt;p&gt;
The paper focuses on the efficient coding and computation in cortical circuits, connecting theoretical neuroscience with statistical physics. It discusses the mutual benefits of studying neural networks for understanding complex systems, nonequilibrium dynamics, and disordered systems in physics, and vice versa. The discussed work starts from the chaos in random neural networks and progresses to the efficient coding and the partial suppression of chaotic fluctuations. Key concepts from statistical physics, including phase transitions and critical phenomena, are highlighted for explaining the computational capabilities of neural networks.
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01949v1 Announce Type: cross  Abstract: This essay, derived from a lecture at "The Physics Modeling of Thought" workshop in Berlin in winter 2023, explores the mutually beneficial relationship between theoretical neuroscience and statistical physics through the lens of efficient coding and computation in cortical circuits. It highlights how the study of neural networks has enhanced our understanding of complex, nonequilibrium, and disordered systems, while also demonstrating how neuroscientific challenges have spurred novel developments in physics. The paper traces the evolution of ideas from seminal work on chaos in random neural networks to recent developments in efficient coding and the partial suppression of chaotic fluctuations. It emphasizes how concepts from statistical physics, such as phase transitions and critical phenomena, have been instrumental in elucidating the computational capabilities of neural networks.   By examining the interplay between order and disord
&lt;/p&gt;</description></item><item><title>MALADE&#31995;&#32479;&#20351;&#29992;&#22686;&#24378;&#26816;&#32034;&#30340;&#29983;&#25104;&#26041;&#27861;&#65292;&#32467;&#21512;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#22810;&#20195;&#29702;&#21327;&#20316;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#33647;&#29289;&#26631;&#31614;&#25991;&#26412;&#20013;&#26377;&#25928;&#25552;&#21462;&#21644;&#24635;&#32467;&#19981;&#33391;&#33647;&#29289;&#20107;&#20214;&#12290;</title><link>https://arxiv.org/abs/2408.01869</link><description>&lt;p&gt;
MALADE: Orchestration of LLM-powered Agents with Retrieval Augmented Generation for Pharmacovigilance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01869
&lt;/p&gt;
&lt;p&gt;
MALADE&#31995;&#32479;&#20351;&#29992;&#22686;&#24378;&#26816;&#32034;&#30340;&#29983;&#25104;&#26041;&#27861;&#65292;&#32467;&#21512;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#22810;&#20195;&#29702;&#21327;&#20316;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#33647;&#29289;&#26631;&#31614;&#25991;&#26412;&#20013;&#26377;&#25928;&#25552;&#21462;&#21644;&#24635;&#32467;&#19981;&#33391;&#33647;&#29289;&#20107;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01869v1 Announce Type: cross  Abstract: In the era of Large Language Models (LLMs), given their remarkable text understanding and generation abilities, there is an unprecedented opportunity to develop new, LLM-based methods for trustworthy medical knowledge synthesis, extraction and summarization. This paper focuses on the problem of Pharmacovigilance (PhV), where the significance and challenges lie in identifying Adverse Drug Events (ADEs) from diverse text sources, such as medical literature, clinical notes, and drug labels. Unfortunately, this task is hindered by factors including variations in the terminologies of drugs and outcomes, and ADE descriptions often being buried in large amounts of narrative text. We present MALADE, the first effective collaborative multi-agent system powered by LLM with Retrieval Augmented Generation for ADE extraction from drug label data. This technique involves augmenting a query to an LLM with relevant information extracted from text reso
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29366;&#24577;&#20381;&#36182;&#30340;&#29615;&#27169;&#22411;&#28388;&#27874;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;1-D&#29615;&#32593;&#32476;&#20013;&#26041;&#21521;&#36873;&#25321;&#24615;&#31070;&#32463;&#20803;&#30340;&#21709;&#24212;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#29983;&#29289;&#29289;&#29702;&#31070;&#32463;&#32593;&#32476;&#22312;&#35270;&#35273;&#31995;&#32479;&#20013;&#30340;&#40065;&#26834;&#24615;&#26426;&#21046;&#65292;&#24182;&#21457;&#29616;&#31070;&#32463;&#20803;&#30340;&#28608;&#27963;&#29366;&#24577;&#32780;&#38750;&#23427;&#20204;&#30340;&#21457;&#25918;&#29575;&#20915;&#23450;&#20102;&#32593;&#32476;&#23545;&#25200;&#21160;&#30340;&#21709;&#24212;&#65292;&#20174;&#32780;&#20026;&#29702;&#35299;&#29983;&#29289;&#31070;&#32463;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2408.01817</link><description>&lt;p&gt;
State-dependent Filtering of the Ring Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01817
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29366;&#24577;&#20381;&#36182;&#30340;&#29615;&#27169;&#22411;&#28388;&#27874;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;1-D&#29615;&#32593;&#32476;&#20013;&#26041;&#21521;&#36873;&#25321;&#24615;&#31070;&#32463;&#20803;&#30340;&#21709;&#24212;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#29983;&#29289;&#29289;&#29702;&#31070;&#32463;&#32593;&#32476;&#22312;&#35270;&#35273;&#31995;&#32479;&#20013;&#30340;&#40065;&#26834;&#24615;&#26426;&#21046;&#65292;&#24182;&#21457;&#29616;&#31070;&#32463;&#20803;&#30340;&#28608;&#27963;&#29366;&#24577;&#32780;&#38750;&#23427;&#20204;&#30340;&#21457;&#25918;&#29575;&#20915;&#23450;&#20102;&#32593;&#32476;&#23545;&#25200;&#21160;&#30340;&#21709;&#24212;&#65292;&#20174;&#32780;&#20026;&#29702;&#35299;&#29983;&#29289;&#31070;&#32463;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01817v1 Announce Type: new  Abstract: Robustness is a measure of functional reliability of a system against perturbations. To achieve a good and robust performance, a system must filter out external perturbations by its internal priors. These priors are usually distilled in the structure and the states of the system. Biophysical neural network are known to be robust but the exact mechanisms are still elusive. In this paper, we probe how orientation-selective neurons organized on a 1-D ring network respond to perturbations in the hope of gaining some insights on the robustness of visual system in brain. We analyze the steady-state of the rate-based network and prove that the activation state of neurons, rather than their firing rates, determines how the model respond to perturbations. We then identify specific perturbation patterns that induce the largest responses for different configurations of activation states, and find them to be sinusoidal or sinusoidal-like while other
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21019;&#26032;&#24615;&#22320;&#21033;&#29992;&#27010;&#29575;&#27169;&#22411;&#20998;&#26512;&#20102; zebrafish &#22312;&#31038;&#20250;&#20114;&#21160;&#20013;&#30340;&#21327;&#35843;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;&#36825;&#31181;&#34892;&#20026;&#30340;&#22810;&#27169;&#24577;&#24863;&#23448;&#22522;&#30784;&#65292;&#20026;&#29702;&#35299;&#21160;&#29289;&#22914;&#20309;&#21033;&#29992;&#24863;&#23448;&#20449;&#24687;&#21644;&#20869;&#37096;&#29366;&#24577;&#36827;&#34892;&#31038;&#20132;&#34892;&#20026;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2408.01683</link><description>&lt;p&gt;
Probabilistic modeling reveals coordinated social interaction states and their multisensory bases
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01683
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21019;&#26032;&#24615;&#22320;&#21033;&#29992;&#27010;&#29575;&#27169;&#22411;&#20998;&#26512;&#20102; zebrafish &#22312;&#31038;&#20250;&#20114;&#21160;&#20013;&#30340;&#21327;&#35843;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;&#36825;&#31181;&#34892;&#20026;&#30340;&#22810;&#27169;&#24577;&#24863;&#23448;&#22522;&#30784;&#65292;&#20026;&#29702;&#35299;&#21160;&#29289;&#22914;&#20309;&#21033;&#29992;&#24863;&#23448;&#20449;&#24687;&#21644;&#20869;&#37096;&#29366;&#24577;&#36827;&#34892;&#31038;&#20132;&#34892;&#20026;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01683v1 Announce Type: new  Abstract: Social behavior across animal species ranges from simple pairwise interactions to thousands of individuals coordinating goal-directed movements. Regardless of the scale, these interactions are governed by the interplay between multimodal sensory information and the internal state of each animal. Here, we investigate how animals use multiple sensory modalities to guide social behavior in the highly social zebrafish (Danio rerio) and uncover the complex features of pairwise interactions early in development. To identify distinct behaviors and understand how they vary over time, we developed a new hidden Markov model with constrained linear-model emissions to automatically classify states of coordinated interaction, using the movements of one animal to predict those of another. We discovered that social behaviors alternate between two interaction states within a single experimental session, distinguished by unique movements and timescales. 
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#23637;&#31034;&#20102;&#22810;&#21464;&#37327;Granger&#22240;&#26524;&#20998;&#26512;&#33021;&#22815;&#26816;&#27979;&#20855;&#26377;&#23454;&#26102;&#20915;&#31574;&#19981;&#30830;&#23450;&#30417;&#25511;&#30340;&#29983;&#29289;&#24615;&#20915;&#31574;&#32593;&#32476;&#27169;&#22411;&#30340;&#22797;&#26434;&#22810;&#31283;&#24577;&#31070;&#32463;&#32593;&#32476;&#20013;&#33410;&#28857;&#30340;&#26102;&#38388;&#24207;&#21015;&#27963;&#21160;&#20043;&#38388;&#30340;&#30452;&#25509;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2408.01528</link><description>&lt;p&gt;
Can multivariate Granger causality detect directed connectivity of a multistable and dynamic biological decision network model?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01528
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#23637;&#31034;&#20102;&#22810;&#21464;&#37327;Granger&#22240;&#26524;&#20998;&#26512;&#33021;&#22815;&#26816;&#27979;&#20855;&#26377;&#23454;&#26102;&#20915;&#31574;&#19981;&#30830;&#23450;&#30417;&#25511;&#30340;&#29983;&#29289;&#24615;&#20915;&#31574;&#32593;&#32476;&#27169;&#22411;&#30340;&#22797;&#26434;&#22810;&#31283;&#24577;&#31070;&#32463;&#32593;&#32476;&#20013;&#33410;&#28857;&#30340;&#26102;&#38388;&#24207;&#21015;&#27963;&#21160;&#20043;&#38388;&#30340;&#30452;&#25509;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01528v1 Announce Type: new  Abstract: Extracting causal connections can advance interpretable AI and machine learning. Granger causality (GC) is a robust statistical method for estimating directed influences (DC) between signals. While GC has been widely applied to analysing neuronal signals in biological neural networks and other domains, its application to complex, nonlinear, and multistable neural networks is less explored. In this study, we applied time-domain multi-variate Granger causality (MVGC) to the time series neural activity of all nodes in a trained multistable biologically based decision neural network model with real-time decision uncertainty monitoring. Our analysis demonstrated that challenging two-choice decisions, where input signals could be closely matched, and the appropriate application of fine-grained sliding time windows, could readily reveal the original model's DC. Furthermore, the identified DC varied based on whether the network had correct or er
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#23545;&#27604;&#20102;&#29992;&#20110;&#23612;&#26085;&#21033;&#20122;&#27604;&#23572;&#23425;&#183;&#20975;&#27604;&#30340;&#33426;&#26524;&#26524;&#23454;&#20154;&#24037;&#20652;&#29087;&#21058;&#30340;&#26408;&#28784;&#12289;&#33609;&#28784;&#21644;&#31859;&#29255;&#22312;&#29289;&#29702;&#21644;&#32454;&#32990;&#26680;&#27602;&#24615;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2408.01425</link><description>&lt;p&gt;
Comparative Evaluation of the Proximate and Cytogenotoxicity of Ash and Rice Chips Used as Mango Fruit Artificial Ripening Agents in Birnin Kebbi, Nigeria
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.01425
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#23545;&#27604;&#20102;&#29992;&#20110;&#23612;&#26085;&#21033;&#20122;&#27604;&#23572;&#23425;&#183;&#20975;&#27604;&#30340;&#33426;&#26524;&#26524;&#23454;&#20154;&#24037;&#20652;&#29087;&#21058;&#30340;&#26408;&#28784;&#12289;&#33609;&#28784;&#21644;&#31859;&#29255;&#22312;&#29289;&#29702;&#21644;&#32454;&#32990;&#26680;&#27602;&#24615;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.01425v1 Announce Type: new  Abstract: The high demand for mango (Mangifera indica L.) fruits has led sellers to employ ripening agents. However, concerns are growing regarding the potential toxicities of induced ripening, emphasizing the need for scientific investigation. Samples of artificially and naturally ripened mangoes were analyzed for proximate composition using standard protocols. Cytogenotoxicity was then assessed using the Allium cepa L. toxicity test. Twenty (20)A. cepa (onion) bulbs were used, with 5 ripened naturally, 5 with wood ash, 5 with herbaceous ash, and 5 with rice chips, all grown over tap water for five days. The root tips of the bulbs were assayed and examined for chromosomal aberrations. The results revealed a significant (P&lt;0.05) increase in moisture, protein, and ash content of mangoes as ripening agents were introduced. Mangoes ripened with wood ash exhibited the highest moisture content (81%), while those ripened with rice chips had the highest 
&lt;/p&gt;</description></item><item><title>&#29992;&#25143;&#36755;&#20837;&#20869;&#23481;&#20013;&#26368;&#37325;&#35201;&#30340;&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#20026;&#65306;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#36830;&#32493;&#20869;&#37096;&#24863;&#26579;&#26399;&#65288;intra-vector viral dynamics&#65289;&#38454;&#27573;&#30340;&#27169;&#22411;&#65292;&#25361;&#25112;&#20102;&#20256;&#32479;&#27169;&#22411;&#20013;&#23545;&#38463;&#22827;&#27931;&#30149;&#27602;&#65288;&#22914;&#30331;&#38761;&#28909;&#12289;&#23528;&#21345;&#21644;&#22522;&#23380;&#32943;&#38597;&#30149;&#27602;&#65289;&#30340;&#20256;&#25773;&#26426;&#21046;&#30340;&#20551;&#35774;&#65292;&#21253;&#25324;&#23545;&#22806;&#24310;&#28508;&#20239;&#26399;&#65288;extrinsic incubation period&#65289;&#30340;&#31616;&#21270;&#34920;&#31034;&#21644;&#30149;&#27602;&#22312;&#23487;&#20027;&#38388;&#20256;&#25773;&#26102;&#30340;&#25104;&#21151;&#29575;&#20551;&#35774;&#12290;</title><link>https://arxiv.org/abs/2408.00409</link><description>&lt;p&gt;
Within-vector viral dynamics challenges how to model the extrinsic incubation period for major arboviruses: dengue, Zika, and chikungunya
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2408.00409
&lt;/p&gt;
&lt;p&gt;
&#29992;&#25143;&#36755;&#20837;&#20869;&#23481;&#20013;&#26368;&#37325;&#35201;&#30340;&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#20026;&#65306;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#36830;&#32493;&#20869;&#37096;&#24863;&#26579;&#26399;&#65288;intra-vector viral dynamics&#65289;&#38454;&#27573;&#30340;&#27169;&#22411;&#65292;&#25361;&#25112;&#20102;&#20256;&#32479;&#27169;&#22411;&#20013;&#23545;&#38463;&#22827;&#27931;&#30149;&#27602;&#65288;&#22914;&#30331;&#38761;&#28909;&#12289;&#23528;&#21345;&#21644;&#22522;&#23380;&#32943;&#38597;&#30149;&#27602;&#65289;&#30340;&#20256;&#25773;&#26426;&#21046;&#30340;&#20551;&#35774;&#65292;&#21253;&#25324;&#23545;&#22806;&#24310;&#28508;&#20239;&#26399;&#65288;extrinsic incubation period&#65289;&#30340;&#31616;&#21270;&#34920;&#31034;&#21644;&#30149;&#27602;&#22312;&#23487;&#20027;&#38388;&#20256;&#25773;&#26102;&#30340;&#25104;&#21151;&#29575;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2408.00409v2 Announce Type: replace  Abstract: Arboviruses represent a significant threat to human, animal, and plant health worldwide. To elucidate transmission, anticipate their spread and efficiently control them, mechanistic modelling has proven its usefulness. However, most models rely on assumptions about how the extrinsic incubation period (EIP) is represented: the intra-vector viral dynamics (IVD), occurring during the EIP, is approximated by a single state. After an average duration, all exposed vectors become infectious. Behind this are hidden two strong hypotheses: (i) EIP is exponentially distributed in the vector population; (ii) viruses successfully cross the infection, dissemination, and transmission barriers in all exposed vectors. To assess these hypotheses, we developed a stochastic compartmental model which represents successive IVD stages, associated to the crossing or not of these three barriers. We calibrated the model using an ABC-SMC (Approximate Bayesian 
&lt;/p&gt;</description></item><item><title>&#29992;&#25143;&#36755;&#20837;&#20869;&#23481;&#20013;&#30340;&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#21487;&#20197;&#24635;&#32467;&#20026;&#19968;&#21477;&#35805;&#65306;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110; least-squares &#26041;&#27861;&#30340;&#19968;&#33268;&#24615;&#36793;&#32536;&#38271;&#24230;&#20272;&#35745;&#20934;&#21017;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26377;&#25928;&#22320;&#24212;&#29992;&#20110;&#24050;&#30693;&#25299;&#25169;&#30340; phylogenetic &#32593;&#32476;&#20013;&#65292;&#20197;&#20272;&#35745;&#36827;&#21270;&#36807;&#31243;&#20013;&#19981;&#21516;&#32447;&#31890;&#20307;&#22522;&#22240;&#32452;&#25104;&#30340;&#36951;&#20256;&#36317;&#31163;&#12290;&#36825;&#31181;&#26041;&#27861;&#30340;&#20851;&#38190;&#20248;&#21183;&#22312;&#20110;&#23427;&#33021;&#22815;&#20998;&#35299;&#36951;&#20256;&#36317;&#31163;&#65292;&#25552;&#21462;&#20986;&#32593;&#32476;&#20869;&#37096;&#19981;&#21464;&#30340;&#37096;&#20998;&#65292;&#24182;&#25454;&#27492;&#36827;&#34892;&#36793;&#32536;&#38271;&#24230;&#30340;&#31934;&#30830;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2407.19343</link><description>&lt;p&gt;
A consistent least-squares criterion for calibrating edge lengths in phylogenetic networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.19343
&lt;/p&gt;
&lt;p&gt;
&#29992;&#25143;&#36755;&#20837;&#20869;&#23481;&#20013;&#30340;&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#21487;&#20197;&#24635;&#32467;&#20026;&#19968;&#21477;&#35805;&#65306;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110; least-squares &#26041;&#27861;&#30340;&#19968;&#33268;&#24615;&#36793;&#32536;&#38271;&#24230;&#20272;&#35745;&#20934;&#21017;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26377;&#25928;&#22320;&#24212;&#29992;&#20110;&#24050;&#30693;&#25299;&#25169;&#30340; phylogenetic &#32593;&#32476;&#20013;&#65292;&#20197;&#20272;&#35745;&#36827;&#21270;&#36807;&#31243;&#20013;&#19981;&#21516;&#32447;&#31890;&#20307;&#22522;&#22240;&#32452;&#25104;&#30340;&#36951;&#20256;&#36317;&#31163;&#12290;&#36825;&#31181;&#26041;&#27861;&#30340;&#20851;&#38190;&#20248;&#21183;&#22312;&#20110;&#23427;&#33021;&#22815;&#20998;&#35299;&#36951;&#20256;&#36317;&#31163;&#65292;&#25552;&#21462;&#20986;&#32593;&#32476;&#20869;&#37096;&#19981;&#21464;&#30340;&#37096;&#20998;&#65292;&#24182;&#25454;&#27492;&#36827;&#34892;&#36793;&#32536;&#38271;&#24230;&#30340;&#31934;&#30830;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.19343v2 Announce Type: replace  Abstract: In phylogenetic networks, it is desirable to estimate edge lengths in substitutions per site or calendar time. Yet, there is a lack of scalable methods that provide such estimates. Here we consider the problem of obtaining edge length estimates from genetic distances, in the presence of rate variation across genes and lineages, when the network topology is known. We propose a novel criterion based on least-squares that is both consistent and computationally tractable. The crux of our approach is to decompose the genetic distances into two parts, one of which is invariant across displayed trees of the network. The scaled genetic distances are then fitted to the invariant part, while the average scaled genetic distances are fitted to the non-invariant part. We show that this criterion is consistent provided that there exists a tree path between some pair of tips in the network, and that edge lengths in the network are identifiable from
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#20855;&#26377;EML4-ALK&#22522;&#22240;&#34701;&#21512;&#30340;&#38750;&#23567;&#32454;&#32990;&#32954;&#30284;(NSCLC)&#20013;&#65292;TSA102&#25233;&#21046;&#21058;&#23545;EML4-ALK&#38451;&#24615;&#32454;&#32990;&#30340;&#22686;&#27542;&#21644;&#32959;&#30244;&#29983;&#38271;&#20855;&#26377;&#39640;&#24230;&#36873;&#25321;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#20307;&#20869;&#22806;&#25233;&#21046;ALK&#38451;&#24615;&#32959;&#30244;&#32454;&#32990;&#31995;&#30340;ALK&#28608;&#37238;&#27963;&#24615;&#65292;&#36825;&#21487;&#33021;&#20026;ALK&#38451;&#24615;NSCLC&#30340;&#27835;&#30103;&#25552;&#20379;&#26032;&#30340;&#27835;&#30103;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2407.19112</link><description>&lt;p&gt;
Mitosis, Cytoskeleton Regulation, and Drug Resistance in Receptor Triple Negative Breast Cancer
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.19112
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#20855;&#26377;EML4-ALK&#22522;&#22240;&#34701;&#21512;&#30340;&#38750;&#23567;&#32454;&#32990;&#32954;&#30284;(NSCLC)&#20013;&#65292;TSA102&#25233;&#21046;&#21058;&#23545;EML4-ALK&#38451;&#24615;&#32454;&#32990;&#30340;&#22686;&#27542;&#21644;&#32959;&#30244;&#29983;&#38271;&#20855;&#26377;&#39640;&#24230;&#36873;&#25321;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#20307;&#20869;&#22806;&#25233;&#21046;ALK&#38451;&#24615;&#32959;&#30244;&#32454;&#32990;&#31995;&#30340;ALK&#28608;&#37238;&#27963;&#24615;&#65292;&#36825;&#21487;&#33021;&#20026;ALK&#38451;&#24615;NSCLC&#30340;&#27835;&#30103;&#25552;&#20379;&#26032;&#30340;&#27835;&#30103;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.19112v3 Announce Type: replace  Abstract: During cell division, the receptor triple-negative MDA-MB-231 mitotic spindles are the largest in comparison to other BC cell lines. Many of the MDA-MB-231 spindles exhibit rapid lateral twisting during metaphase, which remains unaffected by knockdown of the oncogene Myc and treatment with inhibitors of the serine/threonine-protein kinase B-Raf and the epidermal growth factor receptor (EGFR), alone or in any combination. The MDA-MB-231 cells are the most aggressive and rapidly form metastatic tumors in xenograft transplant models, and exhibited very high proliferation rates when plated as three-dimensional cultures in Matrigel. Quantitative image analysis of microtubules (MTs) in six BC cell lines - MDA-MB-231 (receptor negative), HCC-1143 (receptor negative), HCC-3153 (receptor negative), ZR75B (estrogen receptor-positive), LY2 (progesterone receptor-positive), HCC-1428 (estrogen receptor-positive, progesterone receptor-positive) - 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#20381;&#36182;&#20559;&#24046;&#20316;&#20026;&#20449;&#24687;&#29942;&#39048;&#19979;&#26368;&#20248;&#34892;&#21160;&#30340;&#31574;&#30053;&#65292;&#29702;&#35770;&#39044;&#27979;&#20102;&#23384;&#22312;&#20351;&#29992;&#20381;&#36182;&#20559;&#24046;&#65292;&#24182;&#39044;&#27979;&#20102;&#19982;&#25163;&#37096;&#20351;&#29992;&#30456;&#20851;&#30340;&#20004;&#20010;&#20854;&#20182;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2407.17793</link><description>&lt;p&gt;
Use-dependent Biases as Optimal Action under Information Bottleneck
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2407.17793
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#20381;&#36182;&#20559;&#24046;&#20316;&#20026;&#20449;&#24687;&#29942;&#39048;&#19979;&#26368;&#20248;&#34892;&#21160;&#30340;&#31574;&#30053;&#65292;&#29702;&#35770;&#39044;&#27979;&#20102;&#23384;&#22312;&#20351;&#29992;&#20381;&#36182;&#20559;&#24046;&#65292;&#24182;&#39044;&#27979;&#20102;&#19982;&#25163;&#37096;&#20351;&#29992;&#30456;&#20851;&#30340;&#20004;&#20010;&#20854;&#20182;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2407.17793v2 Announce Type: replace  Abstract: Use-dependent bias is a phenomenon in human sensorimotor behavior whereby movements become biased towards previously repeated actions. Despite being well-documented, the reason why this phenomenon occurs is not year clearly understood. Here, we propose that use-dependent biases can be understood as a rational strategy for movement under limitations on the capacity to process sensory information to guide motor output. We adopt an information-theoretic approach to characterize sensorimotor information processing and determine how behavior should be optimized given limitations to this capacity. We show that this theory naturally predicts the existence of use-dependent biases. Our framework also generates two further predictions. The first prediction relates to handedness. The dominant hand is associated with enhanced dexterity and reduced movement variability compared to the non-dominant hand, which we propose relates to a greater capac
&lt;/p&gt;</description></item><item><title>&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#25991;&#21457;&#29616;&#20102;&#20154;&#31867;&#35270;&#35273;&#31995;&#32479;&#26500;&#24314;&#30340;&#29289;&#20307;&#31354;&#38388;&#19981;&#20165;&#20381;&#36182;&#20110;&#29289;&#20307;&#30340;&#35270;&#35273;&#21644;&#27010;&#24565;&#29305;&#24449;&#65292;&#36824;&#20381;&#36182;&#20110;&#29289;&#20307;&#23545;&#20110;&#34892;&#21160;&#32773;&#25552;&#20379;&#30340;&#21487;&#34892;&#24615;&#65288;&#21363;&#20379;&#32473;&#65289;&#20197;&#21450;&#23427;&#20204;&#19982;&#34892;&#21160;&#32773;&#31354;&#38388;&#20851;&#31995;&#65288;&#21363;&#23384;&#22312;&#65289;&#30340;&#29289;&#29702;&#29305;&#24615;&#12290;&#36890;&#36807;&#37327;&#21270;&#34892;&#21160;&#21407;&#23376;&#30340;&#26041;&#27861;&#65292;&#30740;&#31350;&#20154;&#21592;&#39564;&#35777;&#20102;&#29289;&#20307;&#20027;&#35266;&#30456;&#20284;&#24615;&#30340;&#26500;&#25104;&#65292;&#36825;&#34920;&#26126;&#29289;&#20307;&#31354;&#38388;&#21487;&#33021;&#26159;&#22312;&#19968;&#20010;&#29983;&#24577;&#23398;&#30340;&#32972;&#26223;&#19979;&#65292;&#36890;&#36807;&#19968;&#20010;&#29289;&#20307;&#30340;&#34892;&#21160;&#21487;&#34892;&#24615;&#26469;&#23450;&#20041;&#30340;&#12290;</title><link>https://arxiv.org/abs/2406.19659</link><description>&lt;p&gt;
Object Space is Embodied
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2406.19659
&lt;/p&gt;
&lt;p&gt;
&#37325;&#35201;&#21019;&#26032;&#21644;&#36129;&#29486;&#24635;&#32467;&#65306;&#26412;&#25991;&#21457;&#29616;&#20102;&#20154;&#31867;&#35270;&#35273;&#31995;&#32479;&#26500;&#24314;&#30340;&#29289;&#20307;&#31354;&#38388;&#19981;&#20165;&#20381;&#36182;&#20110;&#29289;&#20307;&#30340;&#35270;&#35273;&#21644;&#27010;&#24565;&#29305;&#24449;&#65292;&#36824;&#20381;&#36182;&#20110;&#29289;&#20307;&#23545;&#20110;&#34892;&#21160;&#32773;&#25552;&#20379;&#30340;&#21487;&#34892;&#24615;&#65288;&#21363;&#20379;&#32473;&#65289;&#20197;&#21450;&#23427;&#20204;&#19982;&#34892;&#21160;&#32773;&#31354;&#38388;&#20851;&#31995;&#65288;&#21363;&#23384;&#22312;&#65289;&#30340;&#29289;&#29702;&#29305;&#24615;&#12290;&#36890;&#36807;&#37327;&#21270;&#34892;&#21160;&#21407;&#23376;&#30340;&#26041;&#27861;&#65292;&#30740;&#31350;&#20154;&#21592;&#39564;&#35777;&#20102;&#29289;&#20307;&#20027;&#35266;&#30456;&#20284;&#24615;&#30340;&#26500;&#25104;&#65292;&#36825;&#34920;&#26126;&#29289;&#20307;&#31354;&#38388;&#21487;&#33021;&#26159;&#22312;&#19968;&#20010;&#29983;&#24577;&#23398;&#30340;&#32972;&#26223;&#19979;&#65292;&#36890;&#36807;&#19968;&#20010;&#29289;&#20307;&#30340;&#34892;&#21160;&#21487;&#34892;&#24615;&#26469;&#23450;&#20041;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2406.19659v2 Announce Type: replace  Abstract: The perceived similarity between objects has often been attributed to their physical and conceptual features, such as appearance and animacy, and the theoretical framework of object space is accordingly conceived. Here, we extend this framework by proposing that object space may also be defined by embodied features, specifically action possibilities that objects afford to an agent (i.e., affordance) and their spatial relation with the agent (i.e., situatedness). To test this proposal, we quantified the embodied features with a set of action atoms. We found that embodied features explained the subjective similarity among familiar objects along with the objects' visual features. This observation was further replicated with novel objects. Our study demonstrates that embodied features, which place objects within an ecological context, are essential in constructing object space in the human visual system, emphasizing the importance of inc
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#39044;&#27979;&#20102;&#22312;&#22797;&#26434;&#32593;&#32476;&#19978;&#30142;&#30149;&#20256;&#25773;&#30340;&#25351;&#25968;&#22686;&#38271;&#36895;&#29575;&#65292;&#24182;&#21457;&#29616;&#20102;&#19968;&#20010;&#22522;&#20110;&#32593;&#32476;&#24230;&#20998;&#24067;&#12289;&#21516;&#36136;&#24615;&#27700;&#24179;&#21644;&#38598;&#32676;&#27700;&#24179;&#30340;&#26032;&#32321;&#27542;&#25968;&#34920;&#36798;&#24335;&#65292;&#20174;&#32780;&#20026;&#20256;&#26579;&#30149;&#22312;&#32593;&#32476;&#19978;&#30340;&#26089;&#26399;&#20256;&#25773;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#12290;</title><link>https://arxiv.org/abs/2406.15449</link><description>&lt;p&gt;
Rate of epidemic spreading on complex networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2406.15449
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#39044;&#27979;&#20102;&#22312;&#22797;&#26434;&#32593;&#32476;&#19978;&#30142;&#30149;&#20256;&#25773;&#30340;&#25351;&#25968;&#22686;&#38271;&#36895;&#29575;&#65292;&#24182;&#21457;&#29616;&#20102;&#19968;&#20010;&#22522;&#20110;&#32593;&#32476;&#24230;&#20998;&#24067;&#12289;&#21516;&#36136;&#24615;&#27700;&#24179;&#21644;&#38598;&#32676;&#27700;&#24179;&#30340;&#26032;&#32321;&#27542;&#25968;&#34920;&#36798;&#24335;&#65292;&#20174;&#32780;&#20026;&#20256;&#26579;&#30149;&#22312;&#32593;&#32476;&#19978;&#30340;&#26089;&#26399;&#20256;&#25773;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2406.15449v3 Announce Type: replace-cross  Abstract: The initial phase of an epidemic is often characterized by an exponential increase in the number of infected individuals. In this Letter, we predict the exponential spreading rate of an epidemic on a complex network. We first find an expression of the reproduction number for a network, based on the degree distribution, the network assortativity, and the level of clustering. We then connect this reproduction number and the disease infectiousness to the spreading rate. Our result holds for a broad range of networks, apart from networks with very broad degree distribution, where no clear exponential regime is present. Our theory bridges the gap between classic epidemiology and the theory of complex network, with broad implications for model inference and policy making.
&lt;/p&gt;</description></item><item><title>The developed 3D MR fingerprinting method enables accurate and dynamic quantification of contrast agent transport in mouse brain MRI scans with a 4.3-minute temporal resolution, offering improved sensitivity and specificity for in vivo imaging studies.</title><link>https://arxiv.org/abs/2405.00513</link><description>&lt;p&gt;
3D MR Fingerprinting for Dynamic Contrast-Enhanced Imaging of Whole Mouse Brain
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2405.00513
&lt;/p&gt;
&lt;p&gt;
The developed 3D MR fingerprinting method enables accurate and dynamic quantification of contrast agent transport in mouse brain MRI scans with a 4.3-minute temporal resolution, offering improved sensitivity and specificity for in vivo imaging studies.
&lt;/p&gt;
&lt;p&gt;
arXiv:2405.00513v2 Announce Type: replace  Abstract: Quantitative MRI enables direct quantification of contrast agent concentrations in contrast-enhanced scans. However, the lengthy scan times required by conventional methods are inadequate for tracking contrast agent transport dynamically in mouse brain. We developed a 3D MR fingerprinting (MRF) method for simultaneous T1 and T2 mapping across the whole mouse brain with 4.3-min temporal resolution. We designed a 3D MRF sequence with variable acquisition segment lengths and magnetization preparations on a 9.4T preclinical MRI scanner. Model-based reconstruction approaches were employed to improve the accuracy and speed of MRF acquisition. The method's accuracy for T1 and T2 measurements was validated in vitro, while its repeatability of T1 and T2 measurements was evaluated in vivo (n=3). The utility of the 3D MRF sequence for dynamic tracking of intracisternally infused Gd-DTPA in the whole mouse brain was demonstrated (n=5). Phantom s
&lt;/p&gt;</description></item><item><title>&#35813;&#25991;&#31295;&#25552;&#20379;&#20102;&#20449;&#24687;&#35770;&#30340;&#22522;&#26412;&#23450;&#20041;&#21644;&#32972;&#26223;&#65292;&#26088;&#22312;&#20026;&#29702;&#35770;&#29983;&#29289;&#29289;&#29702;&#23398;&#26257;&#26399;&#23398;&#26657;&#30340;&#23398;&#29983;&#25552;&#20379;&#19968;&#20010;&#20851;&#20110;&#20449;&#24687;&#35770;&#30340;&#25945;&#31243;&#65292;&#23613;&#31649;&#23427;&#20391;&#37325;&#20110;&#38416;&#36848;&#32780;&#38750;&#35814;&#23613;&#30340;&#35745;&#31639;&#65292;&#20294;&#20173;&#28982;&#21253;&#21547;&#20102;&#19968;&#20123;&#23454;&#29992;&#20869;&#23481;&#12290;</title><link>https://arxiv.org/abs/2402.16556</link><description>&lt;p&gt;
A brief tutorial on information theory
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16556
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#31295;&#25552;&#20379;&#20102;&#20449;&#24687;&#35770;&#30340;&#22522;&#26412;&#23450;&#20041;&#21644;&#32972;&#26223;&#65292;&#26088;&#22312;&#20026;&#29702;&#35770;&#29983;&#29289;&#29289;&#29702;&#23398;&#26257;&#26399;&#23398;&#26657;&#30340;&#23398;&#29983;&#25552;&#20379;&#19968;&#20010;&#20851;&#20110;&#20449;&#24687;&#35770;&#30340;&#25945;&#31243;&#65292;&#23613;&#31649;&#23427;&#20391;&#37325;&#20110;&#38416;&#36848;&#32780;&#38750;&#35814;&#23613;&#30340;&#35745;&#31639;&#65292;&#20294;&#20173;&#28982;&#21253;&#21547;&#20102;&#19968;&#20123;&#23454;&#29992;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16556v3 Announce Type: replace-cross  Abstract: At the 2023 Les Houches Summer School on Theoretical Biological Physics, several students asked for some background on information theory, and so we added a tutorial to the scheduled lectures. This is largely a transcript of that tutorial, lightly edited. It covers basic definitions and context rather than detailed calculations. We hope to have maintained the informality of the presentation, including exchanges with the students, while still being useful.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#30340;&#21019;&#26032;&#28857;&#22312;&#20110;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#25968;&#25454;&#39537;&#21160;&#39044;&#27979;&#26500;&#24314;&#30340;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#20165;&#35266;&#27979;&#21040;&#33180;&#30005;&#21387;&#30340; Hodgkin-Huxley &#22411;&#31070;&#32463;&#20803;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#24403;&#23384;&#22312;&#26410;&#30693;&#25968;&#37327;&#30340;&#20869;&#22312;&#30005;&#27969;&#26102;&#12290;&#36825;&#19968;&#26041;&#27861;&#33021;&#22815;&#31934;&#30830;&#25511;&#21046;&#31070;&#32463;&#31995;&#32479;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#65292;&#23613;&#31649;&#38754;&#20020;&#36873;&#21462;&#36866;&#24403;&#30340;&#27169;&#22411;&#12289;&#38480;&#21046;&#21442;&#25968;&#20197;&#21450;&#19982;&#31070;&#32463;&#31995;&#32479;&#21516;&#27493;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2312.14274</link><description>&lt;p&gt;
Nonlinear Model Predictive Control of a Conductance-Based Neuron Model via Data-Driven Forecasting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14274
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#30340;&#21019;&#26032;&#28857;&#22312;&#20110;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#25968;&#25454;&#39537;&#21160;&#39044;&#27979;&#26500;&#24314;&#30340;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#20165;&#35266;&#27979;&#21040;&#33180;&#30005;&#21387;&#30340; Hodgkin-Huxley &#22411;&#31070;&#32463;&#20803;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#24403;&#23384;&#22312;&#26410;&#30693;&#25968;&#37327;&#30340;&#20869;&#22312;&#30005;&#27969;&#26102;&#12290;&#36825;&#19968;&#26041;&#27861;&#33021;&#22815;&#31934;&#30830;&#25511;&#21046;&#31070;&#32463;&#31995;&#32479;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#65292;&#23613;&#31649;&#38754;&#20020;&#36873;&#21462;&#36866;&#24403;&#30340;&#27169;&#22411;&#12289;&#38480;&#21046;&#21442;&#25968;&#20197;&#21450;&#19982;&#31070;&#32463;&#31995;&#32479;&#21516;&#27493;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14274v2 Announce Type: replace  Abstract: Objective. Precise control of neural systems is essential to experimental investigations of how the brain controls behavior and holds the potential for therapeutic manipulations to correct aberrant network states. Model predictive control, which employs a dynamical model of the system to find optimal control inputs, has promise for dealing with the nonlinear dynamics, high levels of exogenous noise, and limited information about unmeasured states and parameters that are common in a wide range of neural systems. However, the challenge still remains of selecting the right model, constraining its parameters, and synchronizing to the neural system. Approach. As a proof of principle, we used recent advances in data-driven forecasting to construct a nonlinear machine-learning model of a Hodgkin-Huxley type neuron when only the membrane voltage is observable and there are an unknown number of intrinsic currents. Main Results. We show that t
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026; Asynchronous Bioplausible Neuron (ABN) &#30340;&#21160;&#24577;&#31361;&#35302;&#25918;&#30005;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#33021;&#22815;&#33258;&#21160;&#35843;&#25972;&#36755;&#20837;&#20449;&#21495;&#30340;&#27874;&#21160;&#65292;&#22312;&#21253;&#25324;&#22270;&#20687;&#20998;&#31867;&#21644;&#20998;&#21106;&#22312;&#20869;&#30340;&#22810;&#31181;&#25968;&#25454;&#38598;&#19978;&#26174;&#31034;&#20986;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12289;&#31070;&#32463;&#24179;&#34913;&#30340;&#32500;&#25252;&#20197;&#21450;&#33021;&#28304;&#25928;&#29575;&#30340;&#25552;&#39640;&#12290;</title><link>https://arxiv.org/abs/2311.11853</link><description>&lt;p&gt;
Asynchronous Bioplausible Neuron for SNN for Event Vision
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.11853
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026; Asynchronous Bioplausible Neuron (ABN) &#30340;&#21160;&#24577;&#31361;&#35302;&#25918;&#30005;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#33021;&#22815;&#33258;&#21160;&#35843;&#25972;&#36755;&#20837;&#20449;&#21495;&#30340;&#27874;&#21160;&#65292;&#22312;&#21253;&#25324;&#22270;&#20687;&#20998;&#31867;&#21644;&#20998;&#21106;&#22312;&#20869;&#30340;&#22810;&#31181;&#25968;&#25454;&#38598;&#19978;&#26174;&#31034;&#20986;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12289;&#31070;&#32463;&#24179;&#34913;&#30340;&#32500;&#25252;&#20197;&#21450;&#33021;&#28304;&#25928;&#29575;&#30340;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.11853v2 Announce Type: replace-cross  Abstract: Spiking Neural Networks (SNNs) offer a biologically inspired approach to computer vision that can lead to more efficient processing of visual data with reduced energy consumption. However, maintaining homeostasis within these networks is challenging, as it requires continuous adjustment of neural responses to preserve equilibrium and optimal processing efficiency amidst diverse and often unpredictable input signals. In response to these challenges, we propose the Asynchronous Bioplausible Neuron (ABN), a dynamic spike firing mechanism to auto-adjust the variations in the input signal. Comprehensive evaluation across various datasets demonstrates ABN's enhanced performance in image classification and segmentation, maintenance of neural equilibrium, and energy efficiency.
&lt;/p&gt;</description></item><item><title>&#26631;&#39064;&#65306;&#36866;&#24212;&#31995;&#32479;&#21160;&#21147;&#29702;&#35770;
&#25688;&#35201;&#65306;arXiv:2306.01403v5 &#23459;&#24067;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#30740;&#31350;&#21253;&#21547;&#20004;&#31181;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#21464;&#21270;&#30340;&#36866;&#24212;&#21160;&#24577;&#23398;&#65292;&#19968;&#31181;&#26159;&#29366;&#24577;&#21464;&#37327;&#30340;&#24555;&#36895;&#21464;&#21270;&#65292;&#21478;&#19968;&#31181;&#26159;&#25511;&#21046;&#21069;&#32773;&#30340;&#21442;&#25968;&#30340;&#32531;&#24930;&#36866;&#24212;&#24615;&#65292;&#23545;&#20110;&#29702;&#35299;&#39537;&#21160;&#36827;&#21270;&#21644;&#23398;&#20064;&#21453;&#39304;&#26426;&#21046;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#39532;&#19969;-&#35199;&#21152;&#20122;-&#32599;&#26031;-&#24503;&#22810;&#37324;&#23433;&#33576;-&#25196;&#26862;&#65288;MSRDJ&#65289;&#30340;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#65292;&#26469;&#20998;&#26512;&#27492;&#31867;&#21160;&#24577;&#31995;&#32479;&#20013;&#38750;&#24179;&#34913;&#30456;&#21464;&#12290;&#20316;&#20026;&#23454;&#20363;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#21160;&#24577;&#22522;&#22240;-&#34920;&#22411;&#22320;&#22270;&#19979;&#30340;&#22522;&#22240;&#35843;&#25511;&#32593;&#32476;&#36866;&#24212;&#24615;&#65306;&#34920;&#22411;&#21464;&#21270;&#30001;&#24555;&#36895;&#38543;&#26426;&#22522;&#22240;&#34920;&#36798;&#21160;&#24577;&#20915;&#23450;&#65292;&#24182;&#19982;&#36951;&#20256;&#22411;&#30340;&#20998;&#24067;&#32531;&#24930;&#28436;&#21270;&#30456;&#20851;&#32852;&#65292;&#27599;&#20010;&#36951;&#20256;&#22411;&#30001;&#32593;&#32476;&#32467;&#26500;&#32534;&#30721;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#35813;&#22320;&#22270;&#19979;&#65292;&#20114;&#24800;&#21453;&#39304;&#22238;&#36335;&#32593;&#32476;&#30340;&#22522;&#22240;&#22411;&#22312;&#29615;&#22659;&#24212;&#31572;&#38408;&#20540;&#38468;&#36817;&#34987;&#36873;&#25321;&#12290;</title><link>https://arxiv.org/abs/2306.01403</link><description>&lt;p&gt;
Dynamical Theory for Adaptive Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2306.01403
&lt;/p&gt;
&lt;p&gt;
&#26631;&#39064;&#65306;&#36866;&#24212;&#31995;&#32479;&#21160;&#21147;&#29702;&#35770;
&#25688;&#35201;&#65306;arXiv:2306.01403v5 &#23459;&#24067;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;
&#25688;&#35201;&#65306;&#30740;&#31350;&#21253;&#21547;&#20004;&#31181;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#21464;&#21270;&#30340;&#36866;&#24212;&#21160;&#24577;&#23398;&#65292;&#19968;&#31181;&#26159;&#29366;&#24577;&#21464;&#37327;&#30340;&#24555;&#36895;&#21464;&#21270;&#65292;&#21478;&#19968;&#31181;&#26159;&#25511;&#21046;&#21069;&#32773;&#30340;&#21442;&#25968;&#30340;&#32531;&#24930;&#36866;&#24212;&#24615;&#65292;&#23545;&#20110;&#29702;&#35299;&#39537;&#21160;&#36827;&#21270;&#21644;&#23398;&#20064;&#21453;&#39304;&#26426;&#21046;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#39532;&#19969;-&#35199;&#21152;&#20122;-&#32599;&#26031;-&#24503;&#22810;&#37324;&#23433;&#33576;-&#25196;&#26862;&#65288;MSRDJ&#65289;&#30340;&#36335;&#24452;&#31215;&#20998;&#26041;&#27861;&#65292;&#26469;&#20998;&#26512;&#27492;&#31867;&#21160;&#24577;&#31995;&#32479;&#20013;&#38750;&#24179;&#34913;&#30456;&#21464;&#12290;&#20316;&#20026;&#23454;&#20363;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#21160;&#24577;&#22522;&#22240;-&#34920;&#22411;&#22320;&#22270;&#19979;&#30340;&#22522;&#22240;&#35843;&#25511;&#32593;&#32476;&#36866;&#24212;&#24615;&#65306;&#34920;&#22411;&#21464;&#21270;&#30001;&#24555;&#36895;&#38543;&#26426;&#22522;&#22240;&#34920;&#36798;&#21160;&#24577;&#20915;&#23450;&#65292;&#24182;&#19982;&#36951;&#20256;&#22411;&#30340;&#20998;&#24067;&#32531;&#24930;&#28436;&#21270;&#30456;&#20851;&#32852;&#65292;&#27599;&#20010;&#36951;&#20256;&#22411;&#30001;&#32593;&#32476;&#32467;&#26500;&#32534;&#30721;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#35813;&#22320;&#22270;&#19979;&#65292;&#20114;&#24800;&#21453;&#39304;&#22238;&#36335;&#32593;&#32476;&#30340;&#22522;&#22240;&#22411;&#22312;&#29615;&#22659;&#24212;&#31572;&#38408;&#20540;&#38468;&#36817;&#34987;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2306.01403v5 Announce Type: replace-cross  Abstract: The study of adaptive dynamics, involving many degrees of freedom on two separated timescales, one for fast changes of state variables and another for the slow adaptation of parameters controlling the former's dynamics is crucial for understanding feedback mechanisms underlying evolution and learning. We present a path-integral approach \`a la Martin-Siggia-Rose-De Dominicis-Janssen (MSRDJ) to analyse nonequilibrium phase transitions in such dynamical systems. As an illustration, we apply our framework to the adaptation of gene-regulatory networks under a dynamic genotype-phenotype map: phenotypic variations are shaped by the fast stochastic gene-expression dynamics and are coupled to the slowly evolving distribution of genotypes, each encoded by a network structure. We establish that under this map, genotypes corresponding to reciprocal networks of coherent feedback loops are selected within an intermediate range of environmen
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#21019;&#26032;&#24615;&#22320;&#25193;&#23637;&#20102;SIR&#27169;&#22411;&#20013;&#38750;&#32447;&#24615;&#21457;&#30149;&#29575;&#26465;&#20214;&#19979;&#30123;&#25682;&#36807;&#20914;&#30340;&#19978;&#30028;&#35745;&#31639;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#25509;&#35302;&#32593;&#32476;&#19978;&#30340;&#38750;&#32447;&#24615;&#21457;&#30149;&#29575;&#23545;&#30123;&#25682;&#36807;&#20914;&#19978;&#30028;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2303.01653</link><description>&lt;p&gt;
Upper Bounds on Overshoot in SIR Models with Nonlinear Incidence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2303.01653
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#21019;&#26032;&#24615;&#22320;&#25193;&#23637;&#20102;SIR&#27169;&#22411;&#20013;&#38750;&#32447;&#24615;&#21457;&#30149;&#29575;&#26465;&#20214;&#19979;&#30123;&#25682;&#36807;&#20914;&#30340;&#19978;&#30028;&#35745;&#31639;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#25509;&#35302;&#32593;&#32476;&#19978;&#30340;&#38750;&#32447;&#24615;&#21457;&#30149;&#29575;&#23545;&#30123;&#25682;&#36807;&#20914;&#19978;&#30028;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2303.01653v5 Announce Type: replace  Abstract: We expand the calculation of the upper bound on epidemic overshoot in SIR models to account for nonlinear incidence. We lay out the general procedure and restrictions to perform the calculation analytically for nonlinear functions in the number of susceptibles. We demonstrate the procedure by working through several examples and also numerically study what happens to the upper bound on overshoot when nonlinear incidence manifests in the form of epidemic dynamics over a contact network. We find that both steeper incidence terms and larger contact heterogeneity can increase the range of communicable diseases at which the overshoot remains a relatively large public health hazard.
&lt;/p&gt;</description></item></channel></rss>