{
    "title": "Compress and Compare: Interactively Evaluating Efficiency and Behavior Across ML Model Compression Experiments",
    "abstract": "arXiv:2408.03274v1 Announce Type: cross  Abstract: To deploy machine learning models on-device, practitioners use compression algorithms to shrink and speed up models while maintaining their high-quality output. A critical aspect of compression in practice is model comparison, including tracking many compression experiments, identifying subtle changes in model behavior, and negotiating complex accuracy-efficiency trade-offs. However, existing compression tools poorly support comparison, leading to tedious and, sometimes, incomplete analyses spread across disjoint tools. To support real-world comparative workflows, we develop an interactive visual system called Compress and Compare. Within a single interface, Compress and Compare surfaces promising compression strategies by visualizing provenance relationships between compressed models and reveals compression-induced behavior changes by comparing models' predictions, weights, and activations. We demonstrate how Compress and Compare supp",
    "link": "https://arxiv.org/abs/2408.03274",
    "context": "Title: Compress and Compare: Interactively Evaluating Efficiency and Behavior Across ML Model Compression Experiments\nAbstract: arXiv:2408.03274v1 Announce Type: cross  Abstract: To deploy machine learning models on-device, practitioners use compression algorithms to shrink and speed up models while maintaining their high-quality output. A critical aspect of compression in practice is model comparison, including tracking many compression experiments, identifying subtle changes in model behavior, and negotiating complex accuracy-efficiency trade-offs. However, existing compression tools poorly support comparison, leading to tedious and, sometimes, incomplete analyses spread across disjoint tools. To support real-world comparative workflows, we develop an interactive visual system called Compress and Compare. Within a single interface, Compress and Compare surfaces promising compression strategies by visualizing provenance relationships between compressed models and reveals compression-induced behavior changes by comparing models' predictions, weights, and activations. We demonstrate how Compress and Compare supp",
    "path": "papers/24/08/2408.03274.json",
    "total_tokens": 350,
    "tldr": "该文章设计并实现了一个交互式视觉系统Compress and Compare，该系统旨在支持机器学习模型压缩的效率评估和行为比较。用户可以通过一个统一的界面来探索压缩策略，并通过可视化比较来观察模型之间的预测、权重和激活行为差异。Compress and Compare特别适用于处理压缩模型的复杂对比分析，从而帮助用户在保持模型性能的同时优化其效率。"
}