{
    "title": "Developing PUGG for Polish: A Modern Approach to KBQA, MRC, and IR Dataset Construction",
    "abstract": "arXiv:2408.02337v1 Announce Type: new  Abstract: Advancements in AI and natural language processing have revolutionized machine-human language interactions, with question answering (QA) systems playing a pivotal role. The knowledge base question answering (KBQA) task, utilizing structured knowledge graphs (KG), allows for handling extensive knowledge-intensive questions. However, a significant gap exists in KBQA datasets, especially for low-resource languages. Many existing construction pipelines for these datasets are outdated and inefficient in human labor, and modern assisting tools like Large Language Models (LLM) are not utilized to reduce the workload. To address this, we have designed and implemented a modern, semi-automated approach for creating datasets, encompassing tasks such as KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR), tailored explicitly for low-resource environments. We executed this pipeline and introduced the PUGG dataset, the first Poli",
    "link": "https://arxiv.org/abs/2408.02337",
    "context": "Title: Developing PUGG for Polish: A Modern Approach to KBQA, MRC, and IR Dataset Construction\nAbstract: arXiv:2408.02337v1 Announce Type: new  Abstract: Advancements in AI and natural language processing have revolutionized machine-human language interactions, with question answering (QA) systems playing a pivotal role. The knowledge base question answering (KBQA) task, utilizing structured knowledge graphs (KG), allows for handling extensive knowledge-intensive questions. However, a significant gap exists in KBQA datasets, especially for low-resource languages. Many existing construction pipelines for these datasets are outdated and inefficient in human labor, and modern assisting tools like Large Language Models (LLM) are not utilized to reduce the workload. To address this, we have designed and implemented a modern, semi-automated approach for creating datasets, encompassing tasks such as KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR), tailored explicitly for low-resource environments. We executed this pipeline and introduced the PUGG dataset, the first Poli",
    "path": "papers/24/08/2408.02337.json",
    "total_tokens": 681,
    "translated_title": "开发 PUGG 对于波兰语：针对 KBQA、MRC 和 IR 数据集构建的现代方法",
    "translated_abstract": "arXiv:2408.02337v1 宣布类型：新  摘要：人工智能和自然语言处理领域的进步已经彻底改变了机器与人类之间的语言互动，问答系统（QA）在这一过程中扮演了核心角色。知识基质问答（KBQA）任务，利用结构化知识图（KG），允许处理大量知识密集型的问题。但是，对于低资源语言的KBQA数据集存在着显著的差距。许多现有数据集的构建管道过时且在人力资源方面效率低下，并不利用现代辅助工具，如大型语言模型（LLM）来减少工作量。为了解决这个问题，我们设计并实现了专门针对低资源环境的现代半自动化数据集构建方法，涵盖了KBQA、机器阅读理解（MRC）和信息检索（IR）等任务。我们执行了这个管道，并推出了PUGG数据集，这是首个波兰语KBQA数据集，通过结合LLM技术和波兰语知识图谱，显著提升了问答系统的效率和准确性，为波兰语的低资源环境带来了期望的改进。",
    "tldr": "本文介绍了一种现代的半自动化方法，用于创建针对低资源语言的KBQA、MRC和IR数据集，并推出了首个波兰语KBQA数据集PUGG，结合大型语言模型和波兰语知识图谱，显著提升了问答系统的效率和准确性。"
}