{
    "title": "Enhanced Prototypical Part Network (EPPNet) For Explainable Image Classification Via Prototypes",
    "abstract": "arXiv:2408.04606v1 Announce Type: new  Abstract: Explainable Artificial Intelligence (xAI) has the potential to enhance the transparency and trust of AI-based systems. Although accurate predictions can be made using Deep Neural Networks (DNNs), the process used to arrive at such predictions is usually hard to explain. In terms of perceptibly human-friendly representations, such as word phrases in text or super-pixels in images, prototype-based explanations can justify a model's decision. In this work, we introduce a DNN architecture for image classification, the Enhanced Prototypical Part Network (EPPNet), which achieves strong performance while discovering relevant prototypes that can be used to explain the classification results. This is achieved by introducing a novel cluster loss that helps to discover more relevant human-understandable prototypes. We also introduce a faithfulness score to evaluate the explainability of the results based on the discovered prototypes. Our score not ",
    "link": "https://arxiv.org/abs/2408.04606",
    "context": "Title: Enhanced Prototypical Part Network (EPPNet) For Explainable Image Classification Via Prototypes\nAbstract: arXiv:2408.04606v1 Announce Type: new  Abstract: Explainable Artificial Intelligence (xAI) has the potential to enhance the transparency and trust of AI-based systems. Although accurate predictions can be made using Deep Neural Networks (DNNs), the process used to arrive at such predictions is usually hard to explain. In terms of perceptibly human-friendly representations, such as word phrases in text or super-pixels in images, prototype-based explanations can justify a model's decision. In this work, we introduce a DNN architecture for image classification, the Enhanced Prototypical Part Network (EPPNet), which achieves strong performance while discovering relevant prototypes that can be used to explain the classification results. This is achieved by introducing a novel cluster loss that helps to discover more relevant human-understandable prototypes. We also introduce a faithfulness score to evaluate the explainability of the results based on the discovered prototypes. Our score not ",
    "path": "papers/24/08/2408.04606.json",
    "total_tokens": 378,
    "tldr": "该文章提出了一种名为EPPNet的增强型原型部分网络架构，用于通过发现可解释的图像分类原型增强机器学习系统的透明度和信任度。该架构通过引入一种新的原型损失函数来提高原型的相关性，从而在保持高水平准确性同时实现了良好的人性化解释性。此外，文章还提出了一个公正性评分，用于评价基于发现的原型结果的解释能力。"
}