{
    "title": "Benchmarking In-the-wild Multimodal Disease Recognition and A Versatile Baseline",
    "abstract": "arXiv:2408.03120v1 Announce Type: new  Abstract: Existing plant disease classification models have achieved remarkable performance in recognizing in-laboratory diseased images. However, their performance often significantly degrades in classifying in-the-wild images. Furthermore, we observed that in-the-wild plant images may exhibit similar appearances across various diseases (i.e., small inter-class discrepancy) while the same diseases may look quite different (i.e., large intra-class variance). Motivated by this observation, we propose an in-the-wild multimodal plant disease recognition dataset that contains the largest number of disease classes but also text-based descriptions for each disease. Particularly, the newly provided text descriptions are introduced to provide rich information in textual modality and facilitate in-the-wild disease classification with small inter-class discrepancy and large intra-class variance issues. Therefore, our proposed dataset can be regarded as an i",
    "link": "https://arxiv.org/abs/2408.03120",
    "context": "Title: Benchmarking In-the-wild Multimodal Disease Recognition and A Versatile Baseline\nAbstract: arXiv:2408.03120v1 Announce Type: new  Abstract: Existing plant disease classification models have achieved remarkable performance in recognizing in-laboratory diseased images. However, their performance often significantly degrades in classifying in-the-wild images. Furthermore, we observed that in-the-wild plant images may exhibit similar appearances across various diseases (i.e., small inter-class discrepancy) while the same diseases may look quite different (i.e., large intra-class variance). Motivated by this observation, we propose an in-the-wild multimodal plant disease recognition dataset that contains the largest number of disease classes but also text-based descriptions for each disease. Particularly, the newly provided text descriptions are introduced to provide rich information in textual modality and facilitate in-the-wild disease classification with small inter-class discrepancy and large intra-class variance issues. Therefore, our proposed dataset can be regarded as an i",
    "path": "papers/24/08/2408.03120.json",
    "total_tokens": 400,
    "tldr": "该文章提出的综述对现有植物疾病分类模型在实验室条件下表现出色，但野外图像识别上表现不佳的现象进行了深入剖析，并针对植物疾病的相似外观和不同疾病外观的矛盾提出了解决方案。文章还介绍了最大的植物疾病文本描述数据集，旨在通过提供丰富的文本信息来解决野外识别中存在的不同疾病相似和同一种疾病外观差异大的问题。通过这些努力，文章旨在提高植物疾病野外图识别中模型在处理小类间差异和大类内差异问题时的性能。"
}