{
    "title": "Play to the Score: Stage-Guided Dynamic Multi-Sensory Fusion for Robotic Manipulation",
    "abstract": "arXiv:2408.01366v1 Announce Type: cross  Abstract: Humans possess a remarkable talent for flexibly alternating to different senses when interacting with the environment. Picture a chef skillfully gauging the timing of ingredient additions and controlling the heat according to the colors, sounds, and aromas, seamlessly navigating through every stage of the complex cooking process. This ability is founded upon a thorough comprehension of task stages, as achieving the sub-goal within each stage can necessitate the utilization of different senses. In order to endow robots with similar ability, we incorporate the task stages divided by sub-goals into the imitation learning process to accordingly guide dynamic multi-sensory fusion. We propose MS-Bot, a stage-guided dynamic multi-sensory fusion method with coarse-to-fine stage understanding, which dynamically adjusts the priority of modalities based on the fine-grained state within the predicted current stage. We train a robot system equipped",
    "link": "https://arxiv.org/abs/2408.01366",
    "context": "Title: Play to the Score: Stage-Guided Dynamic Multi-Sensory Fusion for Robotic Manipulation\nAbstract: arXiv:2408.01366v1 Announce Type: cross  Abstract: Humans possess a remarkable talent for flexibly alternating to different senses when interacting with the environment. Picture a chef skillfully gauging the timing of ingredient additions and controlling the heat according to the colors, sounds, and aromas, seamlessly navigating through every stage of the complex cooking process. This ability is founded upon a thorough comprehension of task stages, as achieving the sub-goal within each stage can necessitate the utilization of different senses. In order to endow robots with similar ability, we incorporate the task stages divided by sub-goals into the imitation learning process to accordingly guide dynamic multi-sensory fusion. We propose MS-Bot, a stage-guided dynamic multi-sensory fusion method with coarse-to-fine stage understanding, which dynamically adjusts the priority of modalities based on the fine-grained state within the predicted current stage. We train a robot system equipped",
    "path": "papers/24/08/2408.01366.json",
    "total_tokens": 628,
    "translated_title": "基于分数的舞台引导动态多感官融合方法用于机器手操纵",
    "translated_abstract": "人类具有在交互环境中灵活地交替不同感觉的惊人天赋。想象一个厨师熟练地根据配料的变化和控制温度，根据颜色、声音和气味的颜色，无缝地导航通过复杂烹饪过程的每一个阶段。这种能力是基于对任务阶段的深刻理解，因为实现每个阶段的子目标是可能需要使用不同的感官。为了赋予机器人类似的能力，我们将在模仿学习过程中结合任务阶段，以相应的指导动态多感官融合。我们提出了MS-Bot，一种基于舞台的动态多感官融合方法，该方法具有从粗到精的阶段理解，根据当前预测阶段的精细状态动态调整模态的优先级。我们训练了一个配备的机器人系统，该系统成功地利用了我们提出的方法在多感官信息融合过程中适应了不同的任务阶段。",
    "tldr": "本文提出了一种基于任务阶段动态调整多感官优先级的机器人操纵方法，使得机器人能够像人类一样灵活地在不同的任务阶段使用不同的感官信息。"
}