{
    "title": "Spatio-Temporal Partial Sensing Forecast for Long-term Traffic",
    "abstract": "arXiv:2408.02689v1 Announce Type: cross  Abstract: Traffic forecasting uses recent measurements by sensors installed at chosen locations to forecast the future road traffic. Existing work either assumes all locations are equipped with sensors or focuses on short-term forecast. This paper studies partial sensing traffic forecast of long-term traffic, assuming sensors only at some locations. The study is important in lowering the infrastructure investment cost in traffic management since deploying sensors at all locations could incur prohibitively high cost. However, the problem is challenging due to the unknown distribution at unsensed locations, the intricate spatio-temporal correlation in long-term forecasting, as well as noise in data and irregularities in traffic patterns (e.g., road closure). We propose a Spatio-Temporal Partial Sensing (STPS) forecast model for long-term traffic prediction, with several novel contributions, including a rank-based embedding technique to capture irr",
    "link": "https://arxiv.org/abs/2408.02689",
    "context": "Title: Spatio-Temporal Partial Sensing Forecast for Long-term Traffic\nAbstract: arXiv:2408.02689v1 Announce Type: cross  Abstract: Traffic forecasting uses recent measurements by sensors installed at chosen locations to forecast the future road traffic. Existing work either assumes all locations are equipped with sensors or focuses on short-term forecast. This paper studies partial sensing traffic forecast of long-term traffic, assuming sensors only at some locations. The study is important in lowering the infrastructure investment cost in traffic management since deploying sensors at all locations could incur prohibitively high cost. However, the problem is challenging due to the unknown distribution at unsensed locations, the intricate spatio-temporal correlation in long-term forecasting, as well as noise in data and irregularities in traffic patterns (e.g., road closure). We propose a Spatio-Temporal Partial Sensing (STPS) forecast model for long-term traffic prediction, with several novel contributions, including a rank-based embedding technique to capture irr",
    "path": "papers/24/08/2408.02689.json",
    "total_tokens": 403,
    "tldr": "该文章提出了一种名为STPS的模型，用于具有部分传感的长期交通预报问题，旨在降低交通管理中传感器的基础设施成本。该模型创新地使用了一种基于秩的嵌入技术来捕捉交通数据中的非线性时间序列特性和不可知的不确定性。这有助于在不完全传感的环境中预测复杂时空关联的长期交通流，同时考虑了数据的噪声和不规律的交通模式，如道路封闭。\n\n以上总结包括了用户输入内容中的“部分传感”、“长期交通预报”、“模型”、“嵌入技术”等关键词。"
}