{
    "title": "IBB Traffic Graph Data: Benchmarking and Road Traffic Prediction Model",
    "abstract": "arXiv:2408.01016v1 Announce Type: cross  Abstract: Road traffic congestion prediction is a crucial component of intelligent transportation systems, since it enables proactive traffic management, enhances suburban experience, reduces environmental impact, and improves overall safety and efficiency. Although there are several public datasets, especially for metropolitan areas, these datasets may not be applicable to practical scenarios due to insufficiency in the scale of data (i.e. number of sensors and road links) and several external factors like different characteristics of the target area such as urban, highways and the data collection location. To address this, this paper introduces a novel IBB Traffic graph dataset as an alternative benchmark dataset to mitigate these limitations and enrich the literature with new geographical characteristics. IBB Traffic graph dataset covers the sensor data collected at 2451 distinct locations. Moreover, we propose a novel Road Traffic Prediction",
    "link": "https://arxiv.org/abs/2408.01016",
    "context": "Title: IBB Traffic Graph Data: Benchmarking and Road Traffic Prediction Model\nAbstract: arXiv:2408.01016v1 Announce Type: cross  Abstract: Road traffic congestion prediction is a crucial component of intelligent transportation systems, since it enables proactive traffic management, enhances suburban experience, reduces environmental impact, and improves overall safety and efficiency. Although there are several public datasets, especially for metropolitan areas, these datasets may not be applicable to practical scenarios due to insufficiency in the scale of data (i.e. number of sensors and road links) and several external factors like different characteristics of the target area such as urban, highways and the data collection location. To address this, this paper introduces a novel IBB Traffic graph dataset as an alternative benchmark dataset to mitigate these limitations and enrich the literature with new geographical characteristics. IBB Traffic graph dataset covers the sensor data collected at 2451 distinct locations. Moreover, we propose a novel Road Traffic Prediction",
    "path": "papers/24/08/2408.01016.json",
    "total_tokens": 613,
    "translated_title": "道路交通图数据：基准测试与道路交通预测模型",
    "translated_abstract": "引言: 道路交通堵塞预测是智能交通系统中的一个关键组成部分，因为它能使得交通管理具有前瞻性，提高郊区体验，减少环境影响，并整体提高安全和效率。虽然有多个公共数据集，尤其是在都市地区，但这些数据集可能并不适用于实际情况，因为数据量不够（即传感器和道路连接数量不足）以及一些外部因素，如目标地区的特性差异，如城市、高速公路以及数据收集位置等因素。为了解决这个问题，本文介绍了一个新的IBB交通图数据集，作为一种替代基准数据集，以减轻这些限制，并丰富具有新地理特征的文献。IBB交通图数据集涵盖了在2451个不同地点收集的传感器数据。此外，我们还提出了一个关于道路交通预测的新模型。",
    "tldr": "本文介绍了一种新的IBB交通图数据集，以解决现有道路交通数据集在适用性和多样性方面的问题，并提出了一个预测模型，旨在提高智能交通系统的效率和安全性。"
}