{
    "title": "Dynamic Behavior of Origami Structures: Computational and Experimental Study",
    "abstract": "arXiv:2408.01889v1 Announce Type: cross  Abstract: Origami structures have been receiving a lot of attention from engineering and scientific researchers owing to their unique properties such as deployability, multi-stability, negative stiffness, etc. However, dynamic properties of origami structures have not been explored much due to a lack of validated analytical dynamic modeling approaches. Given the range of interesting properties and applications of origami structures, it is important to study the dynamic behavior of origami structures. In this study, a dynamic modeling approach for origami structures is presented considering distributed mass modeling, which has the potential to be a generalizable approach. In the proposed approach, stiffness is modeled using the bar and hinge modeling approach while the mass is modeled using the mass distribution approach. Various candidate mass distribution approaches were investigated by comparing their responses to the finite element method res",
    "link": "https://arxiv.org/abs/2408.01889",
    "context": "Title: Dynamic Behavior of Origami Structures: Computational and Experimental Study\nAbstract: arXiv:2408.01889v1 Announce Type: cross  Abstract: Origami structures have been receiving a lot of attention from engineering and scientific researchers owing to their unique properties such as deployability, multi-stability, negative stiffness, etc. However, dynamic properties of origami structures have not been explored much due to a lack of validated analytical dynamic modeling approaches. Given the range of interesting properties and applications of origami structures, it is important to study the dynamic behavior of origami structures. In this study, a dynamic modeling approach for origami structures is presented considering distributed mass modeling, which has the potential to be a generalizable approach. In the proposed approach, stiffness is modeled using the bar and hinge modeling approach while the mass is modeled using the mass distribution approach. Various candidate mass distribution approaches were investigated by comparing their responses to the finite element method res",
    "path": "papers/24/08/2408.01889.json",
    "total_tokens": 438,
    "tldr": "Title: 动态行为研究：折纸结构的计算和实验分析\n摘要：arXiv:2408.01889v1 宣布类型：交叉\n\n摘要：折纸结构因为其独特的特性，如可展开性、多稳态、负刚度等，已经引起了工程和科学研究者的极大关注。然而，折纸结构的动态特性由于缺乏验证的动态建模方法而尚未得到充分的研究。鉴于折纸结构潜在的广泛应用和有趣特性，研究折纸结构的动态行为非常重要。本研究提出了一种针对折纸结构的动态建模方法，考虑分布质量建模，该方法具有广泛适用的潜力。在提议的方法中，刚度采用杆和铰建模方法进行建模，而质量则采用质量分布方法进行建模。通过与有限元方法的结果进行比较，研究了各种候选质量分布方法的响应。"
}