{
    "title": "Reconstruction of the shape of irregular rough particles from their interferometric images using a convolutional neural network",
    "abstract": "arXiv:2408.03327v1 Announce Type: new  Abstract: We have developed a convolutional neural network (CNN) to reconstruct the shape of irregular rough particles from their interferometric images. The CNN is based on a UNET architecture with residual block modules. The database has been constructed using the experimental patterns generated by perfectly known pseudo-particles programmed on a Digital Micromirror Device (DMD) and under laser illumination. The CNN has been trained on a basis of 18000 experimental interferometric images using the AUSTRAL super computer (at CRIANN in Normandy). The CNN is tested in the case of centrosymmetric (stick, cross, dendrite) and non-centrosymmetric (like T, Y or L) particles. The size and the 3D orientation of the programmed particles are random. The different shapes are reconstructed by the CNN with good accuracy. Using three angles of view, the 3D reconstruction of particles from three reconstructed faces can be further done.",
    "link": "https://arxiv.org/abs/2408.03327",
    "context": "Title: Reconstruction of the shape of irregular rough particles from their interferometric images using a convolutional neural network\nAbstract: arXiv:2408.03327v1 Announce Type: new  Abstract: We have developed a convolutional neural network (CNN) to reconstruct the shape of irregular rough particles from their interferometric images. The CNN is based on a UNET architecture with residual block modules. The database has been constructed using the experimental patterns generated by perfectly known pseudo-particles programmed on a Digital Micromirror Device (DMD) and under laser illumination. The CNN has been trained on a basis of 18000 experimental interferometric images using the AUSTRAL super computer (at CRIANN in Normandy). The CNN is tested in the case of centrosymmetric (stick, cross, dendrite) and non-centrosymmetric (like T, Y or L) particles. The size and the 3D orientation of the programmed particles are random. The different shapes are reconstructed by the CNN with good accuracy. Using three angles of view, the 3D reconstruction of particles from three reconstructed faces can be further done.",
    "path": "papers/24/08/2408.03327.json",
    "total_tokens": 358,
    "tldr": "该文章通过使用基于UNet架构的卷积神经网络，能够从干涉图像中准确重建不规则粗糙颗粒的三维形状，有效应用于不同对称性的复杂粒子上，展示了其在材料学和微纳加工领域的潜在应用价值。"
}