{
    "title": "A Taxonomy of Architecture Options for Foundation Model-based Agents: Analysis and Decision Model",
    "abstract": "arXiv:2408.02920v1 Announce Type: cross  Abstract: The rapid advancement of AI technology has led to widespread applications of agent systems across various domains. However, the need for detailed architecture design poses significant challenges in designing and operating these systems. This paper introduces a taxonomy focused on the architectures of foundation-model-based agents, addressing critical aspects such as functional capabilities and non-functional qualities. We also discuss the operations involved in both design-time and run-time phases, providing a comprehensive view of architectural design and operational characteristics. By unifying and detailing these classifications, our taxonomy aims to improve the design of foundation-model-based agents. Additionally, the paper establishes a decision model that guides critical design and runtime decisions, offering a structured approach to enhance the development of foundation-model-based agents. Our contributions include providing a ",
    "link": "https://arxiv.org/abs/2408.02920",
    "context": "Title: A Taxonomy of Architecture Options for Foundation Model-based Agents: Analysis and Decision Model\nAbstract: arXiv:2408.02920v1 Announce Type: cross  Abstract: The rapid advancement of AI technology has led to widespread applications of agent systems across various domains. However, the need for detailed architecture design poses significant challenges in designing and operating these systems. This paper introduces a taxonomy focused on the architectures of foundation-model-based agents, addressing critical aspects such as functional capabilities and non-functional qualities. We also discuss the operations involved in both design-time and run-time phases, providing a comprehensive view of architectural design and operational characteristics. By unifying and detailing these classifications, our taxonomy aims to improve the design of foundation-model-based agents. Additionally, the paper establishes a decision model that guides critical design and runtime decisions, offering a structured approach to enhance the development of foundation-model-based agents. Our contributions include providing a ",
    "path": "papers/24/08/2408.02920.json",
    "total_tokens": 313,
    "tldr": "该文章提出了一个以基础模型为架构的智能体系统设计框架，具体包括功能能力和非功能性质量等的架构设计分类，以及设计决策模型，旨在提升智能体系统的开发和运行效率。"
}