{
    "title": "TURTLMap: Real-time Localization and Dense Mapping of Low-texture Underwater Environments with a Low-cost Unmanned Underwater Vehicle",
    "abstract": "arXiv:2408.01569v1 Announce Type: new  Abstract: Significant work has been done on advancing localization and mapping in underwater environments. Still, state-of-the-art methods are challenged by low-texture environments, which is common for underwater settings. This makes it difficult to use existing methods in diverse, real-world scenes. In this paper, we present TURTLMap, a novel solution that focuses on textureless underwater environments through a real-time localization and mapping method. We show that this method is low-cost, and capable of tracking the robot accurately, while constructing a dense map of a low-textured environment in real-time. We evaluate the proposed method using real-world data collected in an indoor water tank with a motion capture system and ground truth reference map. Qualitative and quantitative results validate the proposed system achieves accurate and robust localization and precise dense mapping, even when subject to wave conditions. The project page fo",
    "link": "https://arxiv.org/abs/2408.01569",
    "context": "Title: TURTLMap: Real-time Localization and Dense Mapping of Low-texture Underwater Environments with a Low-cost Unmanned Underwater Vehicle\nAbstract: arXiv:2408.01569v1 Announce Type: new  Abstract: Significant work has been done on advancing localization and mapping in underwater environments. Still, state-of-the-art methods are challenged by low-texture environments, which is common for underwater settings. This makes it difficult to use existing methods in diverse, real-world scenes. In this paper, we present TURTLMap, a novel solution that focuses on textureless underwater environments through a real-time localization and mapping method. We show that this method is low-cost, and capable of tracking the robot accurately, while constructing a dense map of a low-textured environment in real-time. We evaluate the proposed method using real-world data collected in an indoor water tank with a motion capture system and ground truth reference map. Qualitative and quantitative results validate the proposed system achieves accurate and robust localization and precise dense mapping, even when subject to wave conditions. The project page fo",
    "path": "papers/24/08/2408.01569.json",
    "total_tokens": 707,
    "translated_title": "TURTLMap: 实时定位和低纹理水下环境的密集映射，使用低成本无人水下机器人",
    "translated_abstract": "arXiv:2408.01569v1 公告类型：新  摘要：在推进水下环境定位和映射方面已经取得了显著成果。尽管如此，现有技术仍然面临低纹理环境的挑战，而在水下环境中，低纹理环境是常见的。这使得在实际世界中使用现有技术变得困难。在本文中，我们提出了 TURTLMap，这是一种专注于通过实时定位和映射方法解决低纹理水下环境的创新解决方案。我们展示了这种方法成本低廉，并且能够准确跟踪机器人，在此同时，在低纹理环境中实时构建密集的地图。我们使用在具有运动捕捉系统的室内水池中收集的真实世界数据和真实参考地图对提出的方法进行了评估。定性和定量的结果验证了所提出的系统即使在波浪条件下也能实现准确的实时定位和精确密集地图构建。项目的页面可以从提供的数据和软件中访问，这对于研究和教育目的将是非常有用的。",
    "tldr": "TURTLMap 是一种创新的解决方案，专注于通过实时定位和映射方法解决低纹理水下环境的挑战，成本低廉，能够准确跟踪机器人，在低纹理环境中实时构建密集地图。"
}