{
    "title": "Robust Curve Detection in Volumetric Medical Imaging via Attraction Field",
    "abstract": "arXiv:2408.01159v1 Announce Type: new  Abstract: Understanding body part geometry is crucial for precise medical diagnostics. Curves effectively describe anatomical structures and are widely used in medical imaging applications related to cardiovascular, respiratory, and skeletal diseases. Traditional curve detection methods are often task-specific, relying heavily on domain-specific features, limiting their broader applicability. This paper introduces a novel approach for detecting non-branching curves, which does not require prior knowledge of the object's orientation, shape, or position. Our method uses neural networks to predict (1) an attraction field, which offers subpixel accuracy, and (2) a closeness map, which limits the region of interest and essentially eliminates outliers far from the desired curve. We tested our curve detector on several clinically relevant tasks with diverse morphologies and achieved impressive subpixel-level accuracy results that surpass existing methods",
    "link": "https://arxiv.org/abs/2408.01159",
    "context": "Title: Robust Curve Detection in Volumetric Medical Imaging via Attraction Field\nAbstract: arXiv:2408.01159v1 Announce Type: new  Abstract: Understanding body part geometry is crucial for precise medical diagnostics. Curves effectively describe anatomical structures and are widely used in medical imaging applications related to cardiovascular, respiratory, and skeletal diseases. Traditional curve detection methods are often task-specific, relying heavily on domain-specific features, limiting their broader applicability. This paper introduces a novel approach for detecting non-branching curves, which does not require prior knowledge of the object's orientation, shape, or position. Our method uses neural networks to predict (1) an attraction field, which offers subpixel accuracy, and (2) a closeness map, which limits the region of interest and essentially eliminates outliers far from the desired curve. We tested our curve detector on several clinically relevant tasks with diverse morphologies and achieved impressive subpixel-level accuracy results that surpass existing methods",
    "path": "papers/24/08/2408.01159.json",
    "total_tokens": 646,
    "translated_title": "基于吸引场的鲁棒体素医疗成像曲线检测",
    "translated_abstract": "论文标题：理解身体几何在精确的医学诊断中至关重要。曲线有效地描述了人体结构，并在与心血管、呼吸系统和骨骼疾病相关的医学成像应用中得到了广泛应用。传统的大众检测方法通常是专门为特定任务设计的，它们依赖于领域特定的特征，这限制了它们更广泛的应用范围。本文介绍了一种检测非分支曲线的全新方法，该方法不需要事先了解物体方向、形状或位置等方面的知识。我们的方法使用神经网络预测（1）吸引场，该场提供亚像素精度，以及（2）亲密度图，该图限制了感兴趣的区域，有效地消除了远离所需曲线远处的异常值。我们在几种临床相关任务上测试了我们的曲线检测器，这些任务包含多种不同的形态学特征，并获得了超越现有方法的可喜的亚像素级精度结果。",
    "tldr": "本文提出了一种不依赖物体方向、形状或位置预测的曲线检测新方法，该方法利用神经网络预测吸引场和亲密度图，实现了超越现有方法的惊艳曲线检测精度。"
}