{
    "title": "Refined Infrared Small Target Detection Scheme with Single-Point Supervision",
    "abstract": "arXiv:2408.02773v1 Announce Type: new  Abstract: Recently, infrared small target detection with single-point supervision has attracted extensive attention. However, the detection accuracy of existing methods has difficulty meeting actual needs. Therefore, we propose an innovative refined infrared small target detection scheme with single-point supervision, which has excellent segmentation accuracy and detection rate. Specifically, we introduce label evolution with single point supervision (LESPS) framework and explore the performance of various excellent infrared small target detection networks based on this framework. Meanwhile, to improve the comprehensive performance, we construct a complete post-processing strategy. On the one hand, to improve the segmentation accuracy, we use a combination of test-time augmentation (TTA) and conditional random field (CRF) for post-processing. On the other hand, to improve the detection rate, we introduce an adjustable sensitivity (AS) strategy for",
    "link": "https://arxiv.org/abs/2408.02773",
    "context": "Title: Refined Infrared Small Target Detection Scheme with Single-Point Supervision\nAbstract: arXiv:2408.02773v1 Announce Type: new  Abstract: Recently, infrared small target detection with single-point supervision has attracted extensive attention. However, the detection accuracy of existing methods has difficulty meeting actual needs. Therefore, we propose an innovative refined infrared small target detection scheme with single-point supervision, which has excellent segmentation accuracy and detection rate. Specifically, we introduce label evolution with single point supervision (LESPS) framework and explore the performance of various excellent infrared small target detection networks based on this framework. Meanwhile, to improve the comprehensive performance, we construct a complete post-processing strategy. On the one hand, to improve the segmentation accuracy, we use a combination of test-time augmentation (TTA) and conditional random field (CRF) for post-processing. On the other hand, to improve the detection rate, we introduce an adjustable sensitivity (AS) strategy for",
    "path": "papers/24/08/2408.02773.json",
    "total_tokens": 320,
    "tldr": "该文章提出了一种具有单点监督的精炼红外小目标检测方案，通过引入评估标签进化框架，结合TTA和CRF技术提升了目标检测的准确性，并通过可调灵敏度策略提高了检测率。"
}