{
    "title": "Wave-Mamba: Wavelet State Space Model for Ultra-High-Definition Low-Light Image Enhancement",
    "abstract": "arXiv:2408.01276v1 Announce Type: new  Abstract: Ultra-high-definition (UHD) technology has attracted widespread attention due to its exceptional visual quality, but it also poses new challenges for low-light image enhancement (LLIE) techniques. UHD images inherently possess high computational complexity, leading existing UHD LLIE methods to employ high-magnification downsampling to reduce computational costs, which in turn results in information loss. The wavelet transform not only allows downsampling without loss of information, but also separates the image content from the noise. It enables state space models (SSMs) to avoid being affected by noise when modeling long sequences, thus making full use of the long-sequence modeling capability of SSMs. On this basis, we propose Wave-Mamba, a novel approach based on two pivotal insights derived from the wavelet domain: 1) most of the content information of an image exists in the low-frequency component, less in the high-frequency componen",
    "link": "https://arxiv.org/abs/2408.01276",
    "context": "Title: Wave-Mamba: Wavelet State Space Model for Ultra-High-Definition Low-Light Image Enhancement\nAbstract: arXiv:2408.01276v1 Announce Type: new  Abstract: Ultra-high-definition (UHD) technology has attracted widespread attention due to its exceptional visual quality, but it also poses new challenges for low-light image enhancement (LLIE) techniques. UHD images inherently possess high computational complexity, leading existing UHD LLIE methods to employ high-magnification downsampling to reduce computational costs, which in turn results in information loss. The wavelet transform not only allows downsampling without loss of information, but also separates the image content from the noise. It enables state space models (SSMs) to avoid being affected by noise when modeling long sequences, thus making full use of the long-sequence modeling capability of SSMs. On this basis, we propose Wave-Mamba, a novel approach based on two pivotal insights derived from the wavelet domain: 1) most of the content information of an image exists in the low-frequency component, less in the high-frequency componen",
    "path": "papers/24/08/2408.01276.json",
    "total_tokens": 750,
    "translated_title": "Wave-Mamba：适用于超高清低光照增强的波尔状态空间模型",
    "translated_abstract": "超高清（UHD）技术因其卓越的视觉效果而受到广泛关注，但它也对低光照图像增强（LLIE）技术提出了新的挑战。UHD图像固有的高计算复杂性使得现有的UHD LLIE方法在降低计算成本时采用了高倍率下采样，这又导致了信息的损失。小波变换不仅允许无损下采样，而且可以将图像内容与噪声分离。它使状态空间模型（SSM）在不受噪声影响的情况下建模长序列，从而充分利用了SSM的长序列建模能力。在此基础上，我们提出了一种名为Wave-Mamba的全新方法，该方法基于小波域的两个关键洞察：1）图像中的绝大多数内容信息存在于低频成分中，高频成分中的较少；2）SSMs可以避免在高噪声条件下建模带来的问题，因为小波变换会分离噪声。基于这些洞察，Wave-Mamba能够实现对超高清低光照图像的高效和高质量增强，同时保留图像的细节和对比度，并在噪声水平较高的情况下仍然保持清晰度。我们实现了Wave-Mamba，并通过实验验证了其在UHD LLIE方面的有效性和优越性。",
    "tldr": "Wave-Mamba利用小波变换和无损下采样的优势，提出了一种针对超高清低光照增强的新方法，该方法能够有效提升图像的清晰度和对比度，即使在噪声较大的环境中也能保持良好的图像质量。"
}