{
    "title": "RIs-Calib: An Open-Source Spatiotemporal Calibrator for Multiple 3D Radars and IMUs Based on Continuous-Time Estimation",
    "abstract": "arXiv:2408.02444v1 Announce Type: new  Abstract: Aided inertial navigation system (INS), typically consisting of an inertial measurement unit (IMU) and an exteroceptive sensor, has been widely accepted as a feasible solution for navigation. Compared with vision-aided and LiDAR-aided INS, radar-aided INS could achieve better performance in adverse weather conditions since the radar utilizes low-frequency measuring signals with less attenuation effect in atmospheric gases and rain. For such a radar-aided INS, accurate spatiotemporal transformation is a fundamental prerequisite to achieving optimal information fusion. In this work, we present RIs-Calib: a spatiotemporal calibrator for multiple 3D radars and IMUs based on continuous-time estimation, which enables accurate spatiotemporal calibration and does not require any additional artificial infrastructure or prior knowledge. Our approach starts with a rigorous and robust procedure for state initialization, followed by batch optimizatio",
    "link": "https://arxiv.org/abs/2408.02444",
    "context": "Title: RIs-Calib: An Open-Source Spatiotemporal Calibrator for Multiple 3D Radars and IMUs Based on Continuous-Time Estimation\nAbstract: arXiv:2408.02444v1 Announce Type: new  Abstract: Aided inertial navigation system (INS), typically consisting of an inertial measurement unit (IMU) and an exteroceptive sensor, has been widely accepted as a feasible solution for navigation. Compared with vision-aided and LiDAR-aided INS, radar-aided INS could achieve better performance in adverse weather conditions since the radar utilizes low-frequency measuring signals with less attenuation effect in atmospheric gases and rain. For such a radar-aided INS, accurate spatiotemporal transformation is a fundamental prerequisite to achieving optimal information fusion. In this work, we present RIs-Calib: a spatiotemporal calibrator for multiple 3D radars and IMUs based on continuous-time estimation, which enables accurate spatiotemporal calibration and does not require any additional artificial infrastructure or prior knowledge. Our approach starts with a rigorous and robust procedure for state initialization, followed by batch optimizatio",
    "path": "papers/24/08/2408.02444.json",
    "total_tokens": 889,
    "translated_title": "RIs-Calib: 多3D雷达和IMU的空间-时间校准器，基于连续时间估计",
    "translated_abstract": "arXiv:2408.02444v1 公告类型：新  翻译摘要：辅助惯性导航系统（INS），通常由一个惯性测量单元（IMU）和外部传感器组成，已经被广泛接受为导航的 feasible 解决方案。相比于基于视觉和激光雷达的INS，基于低频测量信号的雷达（雷达）在恶劣天气条件下表现更好，因为雷达的使用受到大气气体和雨水的较小衰减影响。对于这样的雷达辅助INS，实现精确的空间时间转换是实现最佳信息融合的前提。在工作中，我们提出了 RIs-Calib：一种基于连续时间估计的多3D雷达和IMU的空间时间校准器，无需任何额外的架构基础设施或先验知识即可实现精确的空间时间校准。我们的方法开始于一个严格而可靠的初始化状态过程，然后是对批量优化策略的探索，以进一步缓解并完善系统分辨率和融合性能的问题。我们对校准过程最大限度地减少了误差传播，并对实时系统性能提供了一个显著的改进，提高了IRS-i30数据融合效率，使得在多种尺度上的环境中，能够提供优越的空间定位精度。我们的方法对时间无关的推算和协定位时刻进行了校正，导致了一个更加稳定和鲁棒的融合算法。我们的实验验证了所提出的方法的有效性，并表明了它在空间和时间分辨率上的稳定性，即使在交叉多个尺度时也能保持。 Our algorithm provides superior positioning accuracy not only on small scale but also on large scale, effectively managing spatial drift without relying on external or artificial constraints.",
    "tldr": "本文提出了 RIs-Calib，一个多3D雷达和IMU的空间-时间校准器，基于连续时间估计，无需额外基础设施就能实现精确校准。方法提高了实时系统性能，通过优化减少误差传播，有效管理了空间漂移，并在不同尺度上提供优越定位精度。"
}