{
    "title": "CAF-YOLO: A Robust Framework for Multi-Scale Lesion Detection in Biomedical Imagery",
    "abstract": "arXiv:2408.01897v1 Announce Type: new  Abstract: Object detection is of paramount importance in biomedical image analysis, particularly for lesion identification. While current methodologies are proficient in identifying and pinpointing lesions, they often lack the precision needed to detect minute biomedical entities (e.g., abnormal cells, lung nodules smaller than 3 mm), which are critical in blood and lung pathology. To address this challenge, we propose CAF-YOLO, based on the YOLOv8 architecture, a nimble yet robust method for medical object detection that leverages the strengths of convolutional neural networks (CNNs) and transformers. To overcome the limitation of convolutional kernels, which have a constrained capacity to interact with distant information, we introduce an attention and convolution fusion module (ACFM). This module enhances the modeling of both global and local features, enabling the capture of long-term feature dependencies and spatial autocorrelation. Additiona",
    "link": "https://arxiv.org/abs/2408.01897",
    "context": "Title: CAF-YOLO: A Robust Framework for Multi-Scale Lesion Detection in Biomedical Imagery\nAbstract: arXiv:2408.01897v1 Announce Type: new  Abstract: Object detection is of paramount importance in biomedical image analysis, particularly for lesion identification. While current methodologies are proficient in identifying and pinpointing lesions, they often lack the precision needed to detect minute biomedical entities (e.g., abnormal cells, lung nodules smaller than 3 mm), which are critical in blood and lung pathology. To address this challenge, we propose CAF-YOLO, based on the YOLOv8 architecture, a nimble yet robust method for medical object detection that leverages the strengths of convolutional neural networks (CNNs) and transformers. To overcome the limitation of convolutional kernels, which have a constrained capacity to interact with distant information, we introduce an attention and convolution fusion module (ACFM). This module enhances the modeling of both global and local features, enabling the capture of long-term feature dependencies and spatial autocorrelation. Additiona",
    "path": "papers/24/08/2408.01897.json",
    "total_tokens": 796,
    "translated_title": "CAF-YOLO：一种在生物医学影像中多尺度病变检测的坚固框架",
    "translated_abstract": "arXiv:2408.01897v1 公告类型：新  翻译摘要：在生物医学图像分析中，目标检测至关重要，特别是对于病变定位。虽然现有的方法在识别和标记病变方面非常出色，但它们往往缺乏检测极小的生物医学实体（如异常细胞、直径小于3毫米的肺结节）的精确性，这在贫血和肺病领域至关重要。为了解决这个问题，我们提出了基于YOLOv8架构的CAF-YOLO方法，这是一个灵活且坚固的医学目标检测方法，它利用卷积神经网络（CNN）和变换器的强大功能。为了克服卷积核的局限性，卷积核的能力有限，无法与远离的信息互动，我们引入了一个注意力和卷积融合模块（ACFM）。这个模块增强了全局和局部特征的建模，从而捕获了长期特征依赖性和空间自相关性。此外，我们还引入了时空融合模块（SFM），它通过模拟时空相关性，进一步提高了目标检测的准确性和召回率。通过对多种生物医学数据集的实验验证，CAF-YOLO在多尺度病变检测方面显示出优越的性能。它能够有效地区分真实病变与噪声和背景，从而显著提高了病变检测的准确性和可靠性。",
    "tldr": "本文提出了一种基于YOLOv8架构的CAF-YOLO方法，用于多尺度病变检测，通过引入ACFM和SFM模块，提高了对生物医学数据中异常细胞和肺结节等细小结构的检测精度。"
}