{
    "title": "Controllable Unlearning for Image-to-Image Generative Models via $\\varepsilon$-Constrained Optimization",
    "abstract": "arXiv:2408.01689v1 Announce Type: cross  Abstract: While generative models have made significant advancements in recent years, they also raise concerns such as privacy breaches and biases. Machine unlearning has emerged as a viable solution, aiming to remove specific training data, e.g., containing private information and bias, from models. In this paper, we study the machine unlearning problem in Image-to-Image (I2I) generative models. Previous studies mainly treat it as a single objective optimization problem, offering a solitary solution, thereby neglecting the varied user expectations towards the trade-off between complete unlearning and model utility. To address this issue, we propose a controllable unlearning framework that uses a control coefficient $\\varepsilon$ to control the trade-off. We reformulate the I2I generative model unlearning problem into a $\\varepsilon$-constrained optimization problem and solve it with a gradient-based method to find optimal solutions for unlearni",
    "link": "https://arxiv.org/abs/2408.01689",
    "context": "Title: Controllable Unlearning for Image-to-Image Generative Models via $\\varepsilon$-Constrained Optimization\nAbstract: arXiv:2408.01689v1 Announce Type: cross  Abstract: While generative models have made significant advancements in recent years, they also raise concerns such as privacy breaches and biases. Machine unlearning has emerged as a viable solution, aiming to remove specific training data, e.g., containing private information and bias, from models. In this paper, we study the machine unlearning problem in Image-to-Image (I2I) generative models. Previous studies mainly treat it as a single objective optimization problem, offering a solitary solution, thereby neglecting the varied user expectations towards the trade-off between complete unlearning and model utility. To address this issue, we propose a controllable unlearning framework that uses a control coefficient $\\varepsilon$ to control the trade-off. We reformulate the I2I generative model unlearning problem into a $\\varepsilon$-constrained optimization problem and solve it with a gradient-based method to find optimal solutions for unlearni",
    "path": "papers/24/08/2408.01689.json",
    "total_tokens": 671,
    "translated_title": "使用ε约束优化方法的图像到图像生成模型的可控制遗忘",
    "translated_abstract": "虽然生成模型在近年来取得了显著的进步，但也引发了对隐私泄露和偏见等问题的担忧。机器去学习作为一种可行的解决方案，旨在从模型中移除特定的训练数据，例如含有私人信息和偏见的训练数据。在本文中，我们研究了Image-to-Image（I2I）生成模型中的机器去学习问题。以往的研究主要将这个问题视为一个单一目标优化问题，仅提供一种解决方案，这忽视了用户对去学习和模型效用之间的多样化期待。为了解决这个问题，我们提出了一种可控制去学习的框架，它使用控制系数ε来控制这种取舍。我们将I2I生成模型去学习的問題重新表述为一个ε约束优化问题，并使用一种基于梯度的方法来解决这个问题，以找到针对遗忘的优化的解决方案，同时能够保持模型的新鲜度和优越性。我们期望这种方法能够有效地应用于需要频繁更新模型的场景，如图形设计、自然语言处理和视觉内容创建等，以保护用户的数据安全和隐私。",
    "tldr": "本文提出了一种使用ε控制因子调节图像到图像生成模型去学习程度的方法，旨在平衡去学习和模型性能，保护用户数据安全。"
}