{
    "title": "CodexGraph: Bridging Large Language Models and Code Repositories via Code Graph Databases",
    "abstract": "arXiv:2408.03910v1 Announce Type: cross  Abstract: Large Language Models (LLMs) excel in stand-alone code tasks like HumanEval and MBPP, but struggle with handling entire code repositories. This challenge has prompted research on enhancing LLM-codebase interaction at a repository scale. Current solutions rely on similarity-based retrieval or manual tools and APIs, each with notable drawbacks. Similarity-based retrieval often has low recall in complex tasks, while manual tools and APIs are typically task-specific and require expert knowledge, reducing their generalizability across diverse code tasks and real-world applications. To mitigate these limitations, we introduce \\framework, a system that integrates LLM agents with graph database interfaces extracted from code repositories. By leveraging the structural properties of graph databases and the flexibility of the graph query language, \\framework enables the LLM agent to construct and execute queries, allowing for precise, code struct",
    "link": "https://arxiv.org/abs/2408.03910",
    "context": "Title: CodexGraph: Bridging Large Language Models and Code Repositories via Code Graph Databases\nAbstract: arXiv:2408.03910v1 Announce Type: cross  Abstract: Large Language Models (LLMs) excel in stand-alone code tasks like HumanEval and MBPP, but struggle with handling entire code repositories. This challenge has prompted research on enhancing LLM-codebase interaction at a repository scale. Current solutions rely on similarity-based retrieval or manual tools and APIs, each with notable drawbacks. Similarity-based retrieval often has low recall in complex tasks, while manual tools and APIs are typically task-specific and require expert knowledge, reducing their generalizability across diverse code tasks and real-world applications. To mitigate these limitations, we introduce \\framework, a system that integrates LLM agents with graph database interfaces extracted from code repositories. By leveraging the structural properties of graph databases and the flexibility of the graph query language, \\framework enables the LLM agent to construct and execute queries, allowing for precise, code struct",
    "path": "papers/24/08/2408.03910.json",
    "total_tokens": 356,
    "tldr": "该文章提出了CodexGraph系统，它是一种利用代码图数据库将大型语言模型与代码库连接起来的方法。通过集成查询语言和图数据库的灵活性，CodexGraph增强了LLM在处理大型代码库方面的能力，使其能够在复杂的代码任务中精确地检索和操作代码结构，从而提高这些任务的整体性能和效率。"
}