{
    "title": "Single-Point Supervised High-Resolution Dynamic Network for Infrared Small Target Detection",
    "abstract": "arXiv:2408.01976v1 Announce Type: new  Abstract: Infrared small target detection (IRSTD) tasks are extremely challenging for two main reasons: 1) it is difficult to obtain accurate labelling information that is critical to existing methods, and 2) infrared (IR) small target information is easily lost in deep networks. To address these issues, we propose a single-point supervised high-resolution dynamic network (SSHD-Net). In contrast to existing methods, we achieve state-of-the-art (SOTA) detection performance using only single-point supervision. Specifically, we first design a high-resolution cross-feature extraction module (HCEM), that achieves bi-directional feature interaction through stepped feature cascade channels (SFCC). It balances network depth and feature resolution to maintain deep IR small-target information. Secondly, the effective integration of global and local features is achieved through the dynamic coordinate fusion module (DCFM), which enhances the anti-interference",
    "link": "https://arxiv.org/abs/2408.01976",
    "context": "Title: Single-Point Supervised High-Resolution Dynamic Network for Infrared Small Target Detection\nAbstract: arXiv:2408.01976v1 Announce Type: new  Abstract: Infrared small target detection (IRSTD) tasks are extremely challenging for two main reasons: 1) it is difficult to obtain accurate labelling information that is critical to existing methods, and 2) infrared (IR) small target information is easily lost in deep networks. To address these issues, we propose a single-point supervised high-resolution dynamic network (SSHD-Net). In contrast to existing methods, we achieve state-of-the-art (SOTA) detection performance using only single-point supervision. Specifically, we first design a high-resolution cross-feature extraction module (HCEM), that achieves bi-directional feature interaction through stepped feature cascade channels (SFCC). It balances network depth and feature resolution to maintain deep IR small-target information. Secondly, the effective integration of global and local features is achieved through the dynamic coordinate fusion module (DCFM), which enhances the anti-interference",
    "path": "papers/24/08/2408.01976.json",
    "total_tokens": 393,
    "tldr": "该文章提出一种名为SSHD-Net的单一点监督高分辨率动态网络，通过使用单一点监督达到了现有方法难以达到的红外小目标检测性能。SSHD-Net通过设计一种高分辨率交叉特征提取模块（HCEM）和动态坐标融合模块（DCFM），实现了生物向特征交互和高分辨率深层红外小目标信息的维护，进而提高了红外小目标检测的准确性和抗干扰能力。"
}