{
    "title": "Judgment2vec: Apply Graph Analytics to Searching and Recommendation of Similar Judgments",
    "abstract": "arXiv:2408.04382v1 Announce Type: cross  Abstract: In court practice, legal professionals rely on their training to provide opinions that resolve cases, one of the most crucial aspects being the ability to identify similar judgments from previous courts efficiently. However, finding a similar case is challenging and often depends on experience, legal domain knowledge, and extensive labor hours, making veteran lawyers or judges indispensable. This research aims to automate the analysis of judgment text similarity. We utilized a judgment dataset labeled as the \"golden standard\" by experts, which includes human-verified features that can be converted into an \"expert similarity score.\" We then constructed a knowledge graph based on \"case-article\" relationships, ranking each case using natural language processing to derive a \"Node2vec similarity score.\" By evaluating these two similarity scores, we identified their discrepancies and relationships. The results can significantly reduce the la",
    "link": "https://arxiv.org/abs/2408.04382",
    "context": "Title: Judgment2vec: Apply Graph Analytics to Searching and Recommendation of Similar Judgments\nAbstract: arXiv:2408.04382v1 Announce Type: cross  Abstract: In court practice, legal professionals rely on their training to provide opinions that resolve cases, one of the most crucial aspects being the ability to identify similar judgments from previous courts efficiently. However, finding a similar case is challenging and often depends on experience, legal domain knowledge, and extensive labor hours, making veteran lawyers or judges indispensable. This research aims to automate the analysis of judgment text similarity. We utilized a judgment dataset labeled as the \"golden standard\" by experts, which includes human-verified features that can be converted into an \"expert similarity score.\" We then constructed a knowledge graph based on \"case-article\" relationships, ranking each case using natural language processing to derive a \"Node2vec similarity score.\" By evaluating these two similarity scores, we identified their discrepancies and relationships. The results can significantly reduce the la",
    "path": "papers/24/08/2408.04382.json",
    "total_tokens": 381,
    "tldr": "该文章提出了一种名为\"Judgment2vec\"的解决方案，旨在通过图分析技术来搜索和推荐类似的判决。研究者利用专家标注的黄金标准司法判例数据库，构建了一个基于\"案件-法条\"关系的知识图谱，并利用自然语言处理技术排名每一起案件。通过比较专家相似度和Node2vec相似度，该研究探索了两者之间的差异和关系，旨在显著减少法律专业人士在海量判例中查找相似案例的时间和成本。"
}