{
    "title": "Multi-scale structural complexity as a quantitative measure of visual complexity",
    "abstract": "arXiv:2408.04076v1 Announce Type: cross  Abstract: While intuitive for humans, the concept of visual complexity is hard to define and quantify formally. We suggest adopting the multi-scale structural complexity (MSSC) measure, an approach that defines structural complexity of an object as the amount of dissimilarities between distinct scales in its hierarchical organization. In this work, we apply MSSC to the case of visual stimuli, using an open dataset of images with subjective complexity scores obtained from human participants (SAVOIAS). We demonstrate that MSSC correlates with subjective complexity on par with other computational complexity measures, while being more intuitive by definition, consistent across categories of images, and easier to compute. We discuss objective and subjective elements inherently present in human perception of complexity and the domains where the two are more likely to diverge. We show how the multi-scale nature of MSSC allows further investigation of c",
    "link": "https://arxiv.org/abs/2408.04076",
    "context": "Title: Multi-scale structural complexity as a quantitative measure of visual complexity\nAbstract: arXiv:2408.04076v1 Announce Type: cross  Abstract: While intuitive for humans, the concept of visual complexity is hard to define and quantify formally. We suggest adopting the multi-scale structural complexity (MSSC) measure, an approach that defines structural complexity of an object as the amount of dissimilarities between distinct scales in its hierarchical organization. In this work, we apply MSSC to the case of visual stimuli, using an open dataset of images with subjective complexity scores obtained from human participants (SAVOIAS). We demonstrate that MSSC correlates with subjective complexity on par with other computational complexity measures, while being more intuitive by definition, consistent across categories of images, and easier to compute. We discuss objective and subjective elements inherently present in human perception of complexity and the domains where the two are more likely to diverge. We show how the multi-scale nature of MSSC allows further investigation of c",
    "path": "papers/24/08/2408.04076.json",
    "total_tokens": 387,
    "tldr": "该文章提出了一种多尺度结构复杂性度量方法，该方法通过对图像在不同层次上的差异性进行量化来评估视觉复杂性。应用此方法到一组具有人类评定复杂性的开放图像数据集上，结果显示该方法在预测主观复杂性方面与现有方法相当，且因其定义直观、跨类别一致并易于计算而具有优势。研究还探讨了客观视觉复杂性与主观认知之间的差异，并指出多尺度特性使该方法在进一步分析视觉复杂性的各个方面方面具有潜力。"
}