{
    "title": "Building an Ethical and Trustworthy Biomedical AI Ecosystem for the Translational and Clinical Integration of Foundational Models",
    "abstract": "arXiv:2408.01431v1 Announce Type: cross  Abstract: Foundational Models (FMs) are emerging as the cornerstone of the biomedical AI ecosystem due to their ability to represent and contextualize multimodal biomedical data. These capabilities allow FMs to be adapted for various tasks, including biomedical reasoning, hypothesis generation, and clinical decision-making. This review paper examines the foundational components of an ethical and trustworthy AI (ETAI) biomedical ecosystem centered on FMs, highlighting key challenges and solutions. The ETAI biomedical ecosystem is defined by seven key components which collectively integrate FMs into clinical settings: Data Lifecycle Management, Data Processing, Model Development, Model Evaluation, Clinical Translation, AI Governance and Regulation, and Stakeholder Engagement. While the potential of biomedical AI is immense, it requires heightened ethical vigilance and responsibility. For instance, biases can arise from data, algorithms, and user i",
    "link": "https://arxiv.org/abs/2408.01431",
    "context": "Title: Building an Ethical and Trustworthy Biomedical AI Ecosystem for the Translational and Clinical Integration of Foundational Models\nAbstract: arXiv:2408.01431v1 Announce Type: cross  Abstract: Foundational Models (FMs) are emerging as the cornerstone of the biomedical AI ecosystem due to their ability to represent and contextualize multimodal biomedical data. These capabilities allow FMs to be adapted for various tasks, including biomedical reasoning, hypothesis generation, and clinical decision-making. This review paper examines the foundational components of an ethical and trustworthy AI (ETAI) biomedical ecosystem centered on FMs, highlighting key challenges and solutions. The ETAI biomedical ecosystem is defined by seven key components which collectively integrate FMs into clinical settings: Data Lifecycle Management, Data Processing, Model Development, Model Evaluation, Clinical Translation, AI Governance and Regulation, and Stakeholder Engagement. While the potential of biomedical AI is immense, it requires heightened ethical vigilance and responsibility. For instance, biases can arise from data, algorithms, and user i",
    "path": "papers/24/08/2408.01431.json",
    "total_tokens": 408,
    "tldr": "该文章主要探讨了基于基础模型（FMs）构建一个符合伦理和可信的生物医学AI生态系统，以便将这些模型集成到临床和转化研究中。文章强调了整合基础模型到临床环境中的关键挑战和解决方案，包括数据生命周期管理、数据处理、模型开发、模型评价、临床翻译、AI治理和监管以及利益相关者参与等领域。通过这些方面的综合考虑，文章旨在提供一个框架，以促进人工智能在生物医学领域中更加稳健和透明的发展，最终实现其潜在的临床应用价值。"
}