{
    "title": "AdapMTL: Adaptive Pruning Framework for Multitask Learning Model",
    "abstract": "arXiv:2408.03913v1 Announce Type: new  Abstract: In the domain of multimedia and multimodal processing, the efficient handling of diverse data streams such as images, video, and sensor data is paramount. Model compression and multitask learning (MTL) are crucial in this field, offering the potential to address the resource-intensive demands of processing and interpreting multiple forms of media simultaneously. However, effectively compressing a multitask model presents significant challenges due to the complexities of balancing sparsity allocation and accuracy performance across multiple tasks. To tackle these challenges, we propose AdapMTL, an adaptive pruning framework for MTL models. AdapMTL leverages multiple learnable soft thresholds independently assigned to the shared backbone and the task-specific heads to capture the nuances in different components' sensitivity to pruning. During training, it co-optimizes the soft thresholds and MTL model weights to automatically determine the",
    "link": "https://arxiv.org/abs/2408.03913",
    "context": "Title: AdapMTL: Adaptive Pruning Framework for Multitask Learning Model\nAbstract: arXiv:2408.03913v1 Announce Type: new  Abstract: In the domain of multimedia and multimodal processing, the efficient handling of diverse data streams such as images, video, and sensor data is paramount. Model compression and multitask learning (MTL) are crucial in this field, offering the potential to address the resource-intensive demands of processing and interpreting multiple forms of media simultaneously. However, effectively compressing a multitask model presents significant challenges due to the complexities of balancing sparsity allocation and accuracy performance across multiple tasks. To tackle these challenges, we propose AdapMTL, an adaptive pruning framework for MTL models. AdapMTL leverages multiple learnable soft thresholds independently assigned to the shared backbone and the task-specific heads to capture the nuances in different components' sensitivity to pruning. During training, it co-optimizes the soft thresholds and MTL model weights to automatically determine the",
    "path": "papers/24/08/2408.03913.json",
    "total_tokens": 346,
    "tldr": "该文章提出的AdapMTL框架通过为共享骨干和特定于任务的头部分配可学习的软阈值，实现了对多任务学习模型的自适应剪枝，能够针对不同组件的剪枝敏感性进行精细调节，同时优化软阈值和多任务模型权重，自动确定最优剪枝策略。"
}