{
    "title": "Perceive, Reflect, and Plan: Designing LLM Agent for Goal-Directed City Navigation without Instructions",
    "abstract": "arXiv:2408.04168v1 Announce Type: new  Abstract: This paper considers a scenario in city navigation: an AI agent is provided with language descriptions of the goal location with respect to some well-known landmarks; By only observing the scene around, including recognizing landmarks and road network connections, the agent has to make decisions to navigate to the goal location without instructions. This problem is very challenging, because it requires agent to establish self-position and acquire spatial representation of complex urban environment, where landmarks are often invisible. In the absence of navigation instructions, such abilities are vital for the agent to make high-quality decisions in long-range city navigation. With the emergent reasoning ability of large language models (LLMs), a tempting baseline is to prompt LLMs to \"react\" on each observation and make decisions accordingly. However, this baseline has very poor performance that the agent often repeatedly visits same loc",
    "link": "https://arxiv.org/abs/2408.04168",
    "context": "Title: Perceive, Reflect, and Plan: Designing LLM Agent for Goal-Directed City Navigation without Instructions\nAbstract: arXiv:2408.04168v1 Announce Type: new  Abstract: This paper considers a scenario in city navigation: an AI agent is provided with language descriptions of the goal location with respect to some well-known landmarks; By only observing the scene around, including recognizing landmarks and road network connections, the agent has to make decisions to navigate to the goal location without instructions. This problem is very challenging, because it requires agent to establish self-position and acquire spatial representation of complex urban environment, where landmarks are often invisible. In the absence of navigation instructions, such abilities are vital for the agent to make high-quality decisions in long-range city navigation. With the emergent reasoning ability of large language models (LLMs), a tempting baseline is to prompt LLMs to \"react\" on each observation and make decisions accordingly. However, this baseline has very poor performance that the agent often repeatedly visits same loc",
    "path": "papers/24/08/2408.04168.json",
    "total_tokens": 401,
    "tldr": "该文章提出了一种设计思路，利用大型语言模型（LLM）创建了一种目标导向的城市导航代理，该代理在没有直接指令的情况下仅通过观察环境识别目标地标和道路网络连接，并据此进行决策。尽管这一任务对AI代理来说极具挑战性，因为它需要代理建立自我定位并构建复杂城市环境的空间表示，尤其是在地标不可见的情况下，但通过引入合理的设计决策，确保代理即使在缺乏导航指令的情况下也能有效导航。文章强调这一方法在提升AI代理在城市环境中导航能力方面的潜在应用和重要性。"
}