{
    "title": "Selective pruning and neuronal death generate heavy-tail network connectivity",
    "abstract": "arXiv:2408.02625v1 Announce Type: new  Abstract: From the proliferative mechanisms generating neurons from progenitor cells to neuron migration and synaptic connection formation, several vicissitudes culminate in the mature brain. Both component loss and gain remain ubiquitous during brain development. For example, rodent brains lose over half of their initial neurons and synapses during healthy development. The role of deleterious steps in network ontogeny remains unclear, yet it is unlikely these costly processes are random. Like neurogenesis and synaptogenesis, synaptic pruning and neuron death likely evolved to support complex, efficient computations. In order to incorporate both component loss and gain in describing neuronal networks, we propose an algorithm where a directed network evolves through the selective deletion of less-connected nodes (neurons) and edges (synapses). Resulting in networks that display scale-invariant degree distributions, provided the network is predomina",
    "link": "https://arxiv.org/abs/2408.02625",
    "context": "Title: Selective pruning and neuronal death generate heavy-tail network connectivity\nAbstract: arXiv:2408.02625v1 Announce Type: new  Abstract: From the proliferative mechanisms generating neurons from progenitor cells to neuron migration and synaptic connection formation, several vicissitudes culminate in the mature brain. Both component loss and gain remain ubiquitous during brain development. For example, rodent brains lose over half of their initial neurons and synapses during healthy development. The role of deleterious steps in network ontogeny remains unclear, yet it is unlikely these costly processes are random. Like neurogenesis and synaptogenesis, synaptic pruning and neuron death likely evolved to support complex, efficient computations. In order to incorporate both component loss and gain in describing neuronal networks, we propose an algorithm where a directed network evolves through the selective deletion of less-connected nodes (neurons) and edges (synapses). Resulting in networks that display scale-invariant degree distributions, provided the network is predomina",
    "path": "papers/24/08/2408.02625.json",
    "total_tokens": 352,
    "tldr": "这项研究提出了一种算法，该算法通过对网络中节点（神经元）和边（突触）的随机删除来模拟选择性修剪和神经死亡过程，从而产生具有偏态网络连接度的网络。这种模型的创新贡献在于其能够有效地描述神经网络的发展过程中节点和边数量随时间变化的非随机性，并揭示了神经网络复杂度和效率之间的可能关系。"
}