{
    "title": "AgentsCoMerge: Large Language Model Empowered Collaborative Decision Making for Ramp Merging",
    "abstract": "arXiv:2408.03624v1 Announce Type: new  Abstract: Ramp merging is one of the bottlenecks in traffic systems, which commonly cause traffic congestion, accidents, and severe carbon emissions. In order to address this essential issue and enhance the safety and efficiency of connected and autonomous vehicles (CAVs) at multi-lane merging zones, we propose a novel collaborative decision-making framework, named AgentsCoMerge, to leverage large language models (LLMs). Specifically, we first design a scene observation and understanding module to allow an agent to capture the traffic environment. Then we propose a hierarchical planning module to enable the agent to make decisions and plan trajectories based on the observation and the agent's own state. In addition, in order to facilitate collaboration among multiple agents, we introduce a communication module to enable the surrounding agents to exchange necessary information and coordinate their actions. Finally, we develop a reinforcement reflec",
    "link": "https://arxiv.org/abs/2408.03624",
    "context": "Title: AgentsCoMerge: Large Language Model Empowered Collaborative Decision Making for Ramp Merging\nAbstract: arXiv:2408.03624v1 Announce Type: new  Abstract: Ramp merging is one of the bottlenecks in traffic systems, which commonly cause traffic congestion, accidents, and severe carbon emissions. In order to address this essential issue and enhance the safety and efficiency of connected and autonomous vehicles (CAVs) at multi-lane merging zones, we propose a novel collaborative decision-making framework, named AgentsCoMerge, to leverage large language models (LLMs). Specifically, we first design a scene observation and understanding module to allow an agent to capture the traffic environment. Then we propose a hierarchical planning module to enable the agent to make decisions and plan trajectories based on the observation and the agent's own state. In addition, in order to facilitate collaboration among multiple agents, we introduce a communication module to enable the surrounding agents to exchange necessary information and coordinate their actions. Finally, we develop a reinforcement reflec",
    "path": "papers/24/08/2408.03624.json",
    "total_tokens": 412,
    "tldr": "该文章提出了一种名为AgentsCoMerge的协作决策框架，该框架结合了大型语言模型（LLMs），旨在提高连接和自主车辆在多车道合并区域的安全性和效率，以及减少交通拥堵、事故发生率和相关碳排放。通过设计场景观察和理解模块，框架能够让单个车辆作为决策者，理解其周围环境，并通过层次规划模块做出决策并计划路径。此外，该框架通过引入通信模块，允许车辆之间交换必要信息并协同行为，从而实现在合并点上的协作。整个系统通过强化学习和模拟测试来优化，展示了其在提高交通系统性能方面的创新贡献。"
}