{
    "title": "Lost in Translation: Latent Concept Misalignment in Text-to-Image Diffusion Models",
    "abstract": "arXiv:2408.00230v2 Announce Type: replace  Abstract: Advancements in text-to-image diffusion models have broadened extensive downstream practical applications, but such models often encounter misalignment issues between text and image. Taking the generation of a combination of two disentangled concepts as an example, say given the prompt \"a tea cup of iced coke\", existing models usually generate a glass cup of iced coke because the iced coke usually co-occurs with the glass cup instead of the tea one during model training. The root of such misalignment is attributed to the confusion in the latent semantic space of text-to-image diffusion models, and hence we refer to the \"a tea cup of iced coke\" phenomenon as Latent Concept Misalignment (LC-Mis). We leverage large language models (LLMs) to thoroughly investigate the scope of LC-Mis, and develop an automated pipeline for aligning the latent semantics of diffusion models to text prompts. Empirical assessments confirm the effectiveness of",
    "link": "https://arxiv.org/abs/2408.00230",
    "context": "Title: Lost in Translation: Latent Concept Misalignment in Text-to-Image Diffusion Models\nAbstract: arXiv:2408.00230v2 Announce Type: replace  Abstract: Advancements in text-to-image diffusion models have broadened extensive downstream practical applications, but such models often encounter misalignment issues between text and image. Taking the generation of a combination of two disentangled concepts as an example, say given the prompt \"a tea cup of iced coke\", existing models usually generate a glass cup of iced coke because the iced coke usually co-occurs with the glass cup instead of the tea one during model training. The root of such misalignment is attributed to the confusion in the latent semantic space of text-to-image diffusion models, and hence we refer to the \"a tea cup of iced coke\" phenomenon as Latent Concept Misalignment (LC-Mis). We leverage large language models (LLMs) to thoroughly investigate the scope of LC-Mis, and develop an automated pipeline for aligning the latent semantics of diffusion models to text prompts. Empirical assessments confirm the effectiveness of",
    "path": "papers/24/08/2408.00230.json",
    "total_tokens": 357,
    "tldr": "该文章提出了一种通过引入大型语言模型来调查和自动调整文本到图像扩散模型中的潜在概念错配问题的新方法，并验证了所提出方法的效能在实际评估中的应用，从而促进了下游实用应用的发展。"
}