{
    "title": "Improving the Intelligent Driver Model by Incorporating Vehicle Dynamics: Microscopic Calibration and Macroscopic Validation",
    "abstract": "arXiv:2408.03722v1 Announce Type: new  Abstract: Microscopic traffic simulations are used to evaluate the impact of infrastructure modifications and evolving vehicle technologies, such as connected and automated driving. Simulated vehicles are controlled via car-following, lane-changing and junction models, which are designed to imitate human driving behavior. However, physics-based car-following models (CFMs) cannot fully replicate measured vehicle trajectories. Therefore, we present model extensions for the Intelligent Driver Model (IDM), of which some are already included in the Extended Intelligent Driver Model (EIDM), to improve calibration and validation results. They consist of equations based on vehicle dynamics and drive off procedures. In addition, parameter selection plays a decisive role. Thus, we introduce a framework to calibrate CFMs using drone data captured at a signalized intersection in Stuttgart, Germany. We compare the calibration error of the Krauss Model with the",
    "link": "https://arxiv.org/abs/2408.03722",
    "context": "Title: Improving the Intelligent Driver Model by Incorporating Vehicle Dynamics: Microscopic Calibration and Macroscopic Validation\nAbstract: arXiv:2408.03722v1 Announce Type: new  Abstract: Microscopic traffic simulations are used to evaluate the impact of infrastructure modifications and evolving vehicle technologies, such as connected and automated driving. Simulated vehicles are controlled via car-following, lane-changing and junction models, which are designed to imitate human driving behavior. However, physics-based car-following models (CFMs) cannot fully replicate measured vehicle trajectories. Therefore, we present model extensions for the Intelligent Driver Model (IDM), of which some are already included in the Extended Intelligent Driver Model (EIDM), to improve calibration and validation results. They consist of equations based on vehicle dynamics and drive off procedures. In addition, parameter selection plays a decisive role. Thus, we introduce a framework to calibrate CFMs using drone data captured at a signalized intersection in Stuttgart, Germany. We compare the calibration error of the Krauss Model with the",
    "path": "papers/24/08/2408.03722.json",
    "total_tokens": 391,
    "tldr": "该文章提出通过整合车辆动态特性对智能驾驶员模型进行改进，包括微观参数校准和宏观验证，以提高仿真结果的效度。作者增加了部分已在扩展智能驾驶员模型中应用的物理驱动模型扩展，以改善模拟结果并更准确地复制实际车辆轨迹。此外，文章还介绍了基于无人机拍摄数据的框架，用于校准卡鲁斯模型并对其参数进行选择，从而显著减少了校准误差。"
}