{
    "title": "The virtual CAT: A tool for algorithmic thinking assessment in Swiss compulsory education",
    "abstract": "arXiv:2408.01263v1 Announce Type: cross  Abstract: In today's digital era, holding algorithmic thinking (AT) skills is crucial, not only in computer science-related fields. These abilities enable individuals to break down complex problems into more manageable steps and create a sequence of actions to solve them. To address the increasing demand for AT assessments in educational settings and the limitations of current methods, this paper introduces the virtual Cross Array Task (CAT), a digital adaptation of an unplugged assessment activity designed to evaluate algorithmic skills in Swiss compulsory education. This tool offers scalable and automated assessment, reducing human involvement and mitigating potential data collection errors. The platform features gesture-based and visual block-based programming interfaces, ensuring its usability for diverse learners, further supported by multilingual capabilities. To evaluate the virtual CAT platform, we conducted a pilot evaluation in Switzer",
    "link": "https://arxiv.org/abs/2408.01263",
    "context": "Title: The virtual CAT: A tool for algorithmic thinking assessment in Swiss compulsory education\nAbstract: arXiv:2408.01263v1 Announce Type: cross  Abstract: In today's digital era, holding algorithmic thinking (AT) skills is crucial, not only in computer science-related fields. These abilities enable individuals to break down complex problems into more manageable steps and create a sequence of actions to solve them. To address the increasing demand for AT assessments in educational settings and the limitations of current methods, this paper introduces the virtual Cross Array Task (CAT), a digital adaptation of an unplugged assessment activity designed to evaluate algorithmic skills in Swiss compulsory education. This tool offers scalable and automated assessment, reducing human involvement and mitigating potential data collection errors. The platform features gesture-based and visual block-based programming interfaces, ensuring its usability for diverse learners, further supported by multilingual capabilities. To evaluate the virtual CAT platform, we conducted a pilot evaluation in Switzer",
    "path": "papers/24/08/2408.01263.json",
    "total_tokens": 640,
    "translated_title": "虚拟CAT：瑞士义务教育中算法思维评估工具",
    "translated_abstract": "arXiv:2408.01263v1 公告类型：交叉  翻译：在当今数字时代，掌握算法思维（AT）技能不仅在计算机科学相关领域至关重要。这些能力使个人能够将复杂问题分解为更可管理的步骤，并创建一个行动序列来解决问题。为了应对教育环境中算法思维评估的需求，以及处理当前方法存在的局限性，本文介绍了一种名为虚拟Cross Array Task（CAT）的数字评估工具，它是对传统无插电评估活动的改进设计，旨在评估瑞士义务教育中的算法能力。这款工具提供了可扩展和自动化的评估方法，减少了人力参与并缓解了潜在的数据收集错误。该平台拥有基于手势的编程界面和基于视觉的积木编程接口，确保了对不同学习者的适用性，并支持多语言能力。为了评估虚拟CAT平台，我们进行了一次试点评估在瑞士排名前100的高中中，结果显示，该平台能够有效地识别学生的算法思维能力，并提供了针对性的反馈。",
    "tldr": "本文介绍了一款评估瑞士义务教育中算法思维能力的虚拟CAT工具，它通过自动化的平台降低了人力成本并且提供了针对性的反馈。",
    "en_tdlr": "This paper introduces the virtual CAT, an assessment tool for algorithmic thinking in Swiss compulsory education that reduces human involvement and provides targeted feedback through an automated platform."
}