{
    "title": "Robust Implementation of Discrete-time Quantum Walks in Any Finite-dimensional Quantum System",
    "abstract": "arXiv:2408.00530v2 Announce Type: replace-cross  Abstract: Research has shown that quantum walks can accelerate certain quantum algorithms and act as a universal paradigm for quantum processing. The discrete-time quantum walk (DTQW) model, owing to its discrete nature, stands out as one of the most suitable choices for circuit implementation. Nevertheless, most current implementations are characterized by extensive, multi-layered quantum circuits, leading to higher computational expenses and a notable decrease in the number of confidently executable time steps on current quantum computers. Since quantum computers are not scalable enough in this NISQ era, we also must confine ourselves to the ancilla-free frontier zone. Therefore, in this paper, we have successfully cut down the circuit cost concerning gate count and circuit depth by half through our proposed methodology in qubit systems as compared to the state-of-the-art increment-decrement approach. Furthermore, for the engineering e",
    "link": "https://arxiv.org/abs/2408.00530",
    "context": "Title: Robust Implementation of Discrete-time Quantum Walks in Any Finite-dimensional Quantum System\nAbstract: arXiv:2408.00530v2 Announce Type: replace-cross  Abstract: Research has shown that quantum walks can accelerate certain quantum algorithms and act as a universal paradigm for quantum processing. The discrete-time quantum walk (DTQW) model, owing to its discrete nature, stands out as one of the most suitable choices for circuit implementation. Nevertheless, most current implementations are characterized by extensive, multi-layered quantum circuits, leading to higher computational expenses and a notable decrease in the number of confidently executable time steps on current quantum computers. Since quantum computers are not scalable enough in this NISQ era, we also must confine ourselves to the ancilla-free frontier zone. Therefore, in this paper, we have successfully cut down the circuit cost concerning gate count and circuit depth by half through our proposed methodology in qubit systems as compared to the state-of-the-art increment-decrement approach. Furthermore, for the engineering e",
    "path": "papers/24/08/2408.00530.json",
    "total_tokens": 389,
    "tldr": "该文章成功地通过提出的方法论将量子行走的电路成本降低了半，尤其是在 qubit 系统中相比于现有技术的增减方法。这种方法论显著减少了量子门的数量和电路的深度，从而降低了在当前量子计算机上执行的时间步数的费用，并且可应用于无需辅助量子比特的有限区域。这样，尽管量子计算机还处于 NISQ 期间的不完全可扩展阶段，量子算法的加速也保持了相应的效率，为量子计算机在现实世界的应用打开了新的可能性。"
}