{
    "title": "Bayesian Active Learning for Semantic Segmentation",
    "abstract": "arXiv:2408.01694v1 Announce Type: new  Abstract: Fully supervised training of semantic segmentation models is costly and challenging because each pixel within an image needs to be labeled. Therefore, the sparse pixel-level annotation methods have been introduced to train models with a subset of pixels within each image. We introduce a Bayesian active learning framework based on sparse pixel-level annotation that utilizes a pixel-level Bayesian uncertainty measure based on Balanced Entropy (BalEnt) [84]. BalEnt captures the information between the models' predicted marginalized probability distribution and the pixel labels. BalEnt has linear scalability with a closed analytical form and can be calculated independently per pixel without relational computations with other pixels. We train our proposed active learning framework for Cityscapes, Camvid, ADE20K and VOC2012 benchmark datasets and show that it reaches supervised levels of mIoU using only a fraction of labeled pixels while outpe",
    "link": "https://arxiv.org/abs/2408.01694",
    "context": "Title: Bayesian Active Learning for Semantic Segmentation\nAbstract: arXiv:2408.01694v1 Announce Type: new  Abstract: Fully supervised training of semantic segmentation models is costly and challenging because each pixel within an image needs to be labeled. Therefore, the sparse pixel-level annotation methods have been introduced to train models with a subset of pixels within each image. We introduce a Bayesian active learning framework based on sparse pixel-level annotation that utilizes a pixel-level Bayesian uncertainty measure based on Balanced Entropy (BalEnt) [84]. BalEnt captures the information between the models' predicted marginalized probability distribution and the pixel labels. BalEnt has linear scalability with a closed analytical form and can be calculated independently per pixel without relational computations with other pixels. We train our proposed active learning framework for Cityscapes, Camvid, ADE20K and VOC2012 benchmark datasets and show that it reaches supervised levels of mIoU using only a fraction of labeled pixels while outpe",
    "path": "papers/24/08/2408.01694.json",
    "total_tokens": 725,
    "translated_title": "基于贝叶斯主动学习的方法用于语义分割",
    "translated_abstract": "arXiv:2408.01694v1 公告类型：新摘要：语义分割模型的完全监督训练成本高昂且困难，因为每张图像中的像素都需要进行标注。因此，引入了稀疏像素级标注方法，该方法仅对每张图像中的子集像素进行标注来训练模型。我们介绍了一种基于稀疏像素级标注的贝叶斯主动学习框架，该框架利用基于平衡熵（Balanced Entropy）的像素级贝叶斯不确定性度量，其中Balanced Entropy是一种基于[84]的平衡熵，能够捕捉模型预测的几何分布和相关像素标签之间的信息。Balanced Entropy具有线性的可扩展性，并且具有封闭形式的解析解，并且可以在不考虑其他像素的情况下独立计算每个像素的Balanced Entropy值。我们在我提出的主动学习框架上培训了Cityscapes、Camvid、ADE20K和VOC2012基准数据集，并展示了它在使用仅占先前描述数据集一小部分的数据的情况下，达到了与监督水平相似的mIoU。同时，我们在Cityscapes、Camvid、ADE20K和VOC2012数据集中初步测试了我们的方法。",
    "tldr": "我们提出了一个贝叶斯主动学习框架，通过平衡熵来优化对稀疏像素级标注的数据集的语义分割模型的训练，仅使用很少的像素标注即可达到监督训练水平。",
    "en_tdlr": "We propose a Bayesian active learning framework optimized for training semantic segmentation models on datasets with sparse pixel-level annotations, using Balanced Entropy to select the most informative pixels and achieve supervised performance levels with significantly fewer labeled pixels."
}