{
    "title": "Integrated Dynamic Phenological Feature for Remote Sensing Image Land Cover Change Detection",
    "abstract": "arXiv:2408.04144v1 Announce Type: new  Abstract: Remote sensing image change detection (CD) is essential for analyzing land surface changes over time, with a significant challenge being the differentiation of actual changes from complex scenes while filtering out pseudo-changes. A primary contributor to this challenge is the intra-class dynamic changes due to phenological characteristics in natural areas. To overcome this, we introduce the InPhea model, which integrates phenological features into a remote sensing image CD framework. The model features a detector with a differential attention module for improved feature representation of change information, coupled with high-resolution feature extraction and spatial pyramid blocks to enhance performance. Additionally, a constrainer with four constraint modules and a multi-stage contrastive learning approach is employed to aid in the model's understanding of phenological characteristics. Experiments on the HRSCD, SECD, and PSCD-Wuhan dat",
    "link": "https://arxiv.org/abs/2408.04144",
    "context": "Title: Integrated Dynamic Phenological Feature for Remote Sensing Image Land Cover Change Detection\nAbstract: arXiv:2408.04144v1 Announce Type: new  Abstract: Remote sensing image change detection (CD) is essential for analyzing land surface changes over time, with a significant challenge being the differentiation of actual changes from complex scenes while filtering out pseudo-changes. A primary contributor to this challenge is the intra-class dynamic changes due to phenological characteristics in natural areas. To overcome this, we introduce the InPhea model, which integrates phenological features into a remote sensing image CD framework. The model features a detector with a differential attention module for improved feature representation of change information, coupled with high-resolution feature extraction and spatial pyramid blocks to enhance performance. Additionally, a constrainer with four constraint modules and a multi-stage contrastive learning approach is employed to aid in the model's understanding of phenological characteristics. Experiments on the HRSCD, SECD, and PSCD-Wuhan dat",
    "path": "papers/24/08/2408.04144.json",
    "total_tokens": 393,
    "tldr": "该文章提出了一个名为InPhea的模型，该模型将生物节律特征整合到遥感图像变化检测的框架中，通过一个包含差异性注意力模块的检测器来提高变化信息的特征表示，并采用高分辨率特征提取和空间金字塔块来增强性能。此外，模型还包括一个由四个约束模块和一个多阶段对比学习方法组成的约束器，以帮助模型理解生物节律特性。实验验证了该模型在HRSCD、SECD和PSCD-Wuhan数据集上的有效性。"
}