{
    "title": "F1tenth Autonomous Racing With Offline Reinforcement Learning Methods",
    "abstract": "arXiv:2408.04198v1 Announce Type: new  Abstract: Autonomous racing serves as a critical platform for evaluating automated driving systems and enhancing vehicle mobility intelligence. This work investigates offline reinforcement learning methods to train agents within the dynamic F1tenth racing environment. The study begins by exploring the challenges of online training in the Austria race track environment, where agents consistently fail to complete the laps. Consequently, this research pivots towards an offline strategy, leveraging `expert' demonstration dataset to facilitate agent training. A waypoint-based suboptimal controller is developed to gather data with successful lap episodes. This data is then employed to train offline learning-based algorithms, with a subsequent analysis of the agents' cross-track performance, evaluating their zero-shot transferability from seen to unseen scenarios and their capacity to adapt to changes in environment dynamics. Beyond mere algorithm benchm",
    "link": "https://arxiv.org/abs/2408.04198",
    "context": "Title: F1tenth Autonomous Racing With Offline Reinforcement Learning Methods\nAbstract: arXiv:2408.04198v1 Announce Type: new  Abstract: Autonomous racing serves as a critical platform for evaluating automated driving systems and enhancing vehicle mobility intelligence. This work investigates offline reinforcement learning methods to train agents within the dynamic F1tenth racing environment. The study begins by exploring the challenges of online training in the Austria race track environment, where agents consistently fail to complete the laps. Consequently, this research pivots towards an offline strategy, leveraging `expert' demonstration dataset to facilitate agent training. A waypoint-based suboptimal controller is developed to gather data with successful lap episodes. This data is then employed to train offline learning-based algorithms, with a subsequent analysis of the agents' cross-track performance, evaluating their zero-shot transferability from seen to unseen scenarios and their capacity to adapt to changes in environment dynamics. Beyond mere algorithm benchm",
    "path": "papers/24/08/2408.04198.json",
    "total_tokens": 360,
    "tldr": "该文章系统研究了借助离线强化学习方法在F1tenth自动化赛车环境中训练代理所面临的挑战。通过构建一套非最优的基于航点的控制策略，以收集附带成功圈数的训练数据，研究了这些数据对训练离线强化学习代理的效能。并对以这些数据训练出的代理在未见过环境下的表现进行了测试，证实了代理能够成功适应新的赛道环境和更好的克服不等挑战。"
}