{
    "title": "AdaCBM: An Adaptive Concept Bottleneck Model for Explainable and Accurate Diagnosis",
    "abstract": "arXiv:2408.02001v1 Announce Type: new  Abstract: The integration of vision-language models such as CLIP and Concept Bottleneck Models (CBMs) offers a promising approach to explaining deep neural network (DNN) decisions using concepts understandable by humans, addressing the black-box concern of DNNs. While CLIP provides both explainability and zero-shot classification capability, its pre-training on generic image and text data may limit its classification accuracy and applicability to medical image diagnostic tasks, creating a transfer learning problem. To maintain explainability and address transfer learning needs, CBM methods commonly design post-processing modules after the bottleneck module. However, this way has been ineffective. This paper takes an unconventional approach by re-examining the CBM framework through the lens of its geometrical representation as a simple linear classification system. The analysis uncovers that post-CBM fine-tuning modules merely rescale and shift the",
    "link": "https://arxiv.org/abs/2408.02001",
    "context": "Title: AdaCBM: An Adaptive Concept Bottleneck Model for Explainable and Accurate Diagnosis\nAbstract: arXiv:2408.02001v1 Announce Type: new  Abstract: The integration of vision-language models such as CLIP and Concept Bottleneck Models (CBMs) offers a promising approach to explaining deep neural network (DNN) decisions using concepts understandable by humans, addressing the black-box concern of DNNs. While CLIP provides both explainability and zero-shot classification capability, its pre-training on generic image and text data may limit its classification accuracy and applicability to medical image diagnostic tasks, creating a transfer learning problem. To maintain explainability and address transfer learning needs, CBM methods commonly design post-processing modules after the bottleneck module. However, this way has been ineffective. This paper takes an unconventional approach by re-examining the CBM framework through the lens of its geometrical representation as a simple linear classification system. The analysis uncovers that post-CBM fine-tuning modules merely rescale and shift the",
    "path": "papers/24/08/2408.02001.json",
    "total_tokens": 397,
    "tldr": "该文章提出了一个名为AdaCBM的适应性概念瓶颈模型，该模型在确保诊断结果的可解释性的同时，能够提高深度神经网络的准确率。通过重新审视概念瓶颈框架的几何表示，文章揭示了现有模型的局限性，并提出了一种新的适应性训练方法，以适应从通用数据到特定诊断任务的转移学习需求。通过这篇文章，研究人员展示了如何通过改进模型的参数调整和数据适应性，来提高深度学习模型在医疗图像诊断任务中的表现。"
}