{
    "title": "Trade-offs of Dynamic Control Structure in Human-swarm Systems",
    "abstract": "arXiv:2408.02605v1 Announce Type: new  Abstract: Swarm robotics is a study of simple robots that exhibit complex behaviour only by interacting locally with other robots and their environment. The control in swarm robotics is mainly distributed whereas centralised control is widely used in other fields of robotics. Centralised and decentralised control strategies both pose a unique set of benefits and drawbacks for the control of multi-robot systems. While decentralised systems are more scalable and resilient, they are less efficient compared to the centralised systems and they lead to excessive data transmissions to the human operators causing cognitive overload. We examine the trade-offs of each of these approaches in a human-swarm system to perform an environmental monitoring task and propose a flexible hybrid approach, which combines elements of hierarchical and decentralised systems. We find that a flexible hybrid system can outperform a centralised system (in our environmental mon",
    "link": "https://arxiv.org/abs/2408.02605",
    "context": "Title: Trade-offs of Dynamic Control Structure in Human-swarm Systems\nAbstract: arXiv:2408.02605v1 Announce Type: new  Abstract: Swarm robotics is a study of simple robots that exhibit complex behaviour only by interacting locally with other robots and their environment. The control in swarm robotics is mainly distributed whereas centralised control is widely used in other fields of robotics. Centralised and decentralised control strategies both pose a unique set of benefits and drawbacks for the control of multi-robot systems. While decentralised systems are more scalable and resilient, they are less efficient compared to the centralised systems and they lead to excessive data transmissions to the human operators causing cognitive overload. We examine the trade-offs of each of these approaches in a human-swarm system to perform an environmental monitoring task and propose a flexible hybrid approach, which combines elements of hierarchical and decentralised systems. We find that a flexible hybrid system can outperform a centralised system (in our environmental mon",
    "path": "papers/24/08/2408.02605.json",
    "total_tokens": 596,
    "translated_title": "人类-群体系统动态控制结构的权衡",
    "translated_abstract": "arXiv:2408.02605v1 公告类型: 新 Abstract: 群体机器人研究的是具有复杂行为的简单机器人，这些行为的实现仅依赖于与其它机器人和环境的局部互动。群体机器人的控制主要采用分布式策略，而其他机器人领域的控制则广泛采用集中式策略。多机器人系统中集中式和分散式控制策略都各自带来了一定数量的好处和弊端。尽管分散式系统在扩展性和抗故障方面更具优势，但它们相对于集中式系统而言效率较低，并且会导致对人类操作员的数据传输量过多，从而引起认知过载。我们对执行环境监测任务的基于人类-群体系统的不同控制方法进行了权衡分析，并提出了一种灵活的混合方法，该方法结合了分层系统和分散式系统的元素。我们的研究发现在人类-群体系统中采用灵活的混合系统可以超越集中式系统的性能（在我们进行的环境监测任务中）。",
    "tldr": "本文探讨了在执行环境监测任务的人类-群体系统中集中式与分散式控制策略的权衡，并提出了一种灵活的混合系统，以提高效率并减轻人类操作员的数据传输负担。"
}