{
    "title": "Is Large Language Model Good at Database Knob Tuning? A Comprehensive Experimental Evaluation",
    "abstract": "arXiv:2408.02213v1 Announce Type: cross  Abstract: Knob tuning plays a crucial role in optimizing databases by adjusting knobs to enhance database performance. However, traditional tuning methods often follow a Try-Collect-Adjust approach, proving inefficient and database-specific. Moreover, these methods are often opaque, making it challenging for DBAs to grasp the underlying decision-making process.   The emergence of large language models (LLMs) like GPT-4 and Claude-3 has excelled in complex natural language tasks, yet their potential in database knob tuning remains largely unexplored. This study harnesses LLMs as experienced DBAs for knob-tuning tasks with carefully designed prompts. We identify three key subtasks in the tuning system: knob pruning, model initialization, and knob recommendation, proposing LLM-driven solutions to replace conventional methods for each subtask.   We conduct extensive experiments to compare LLM-driven approaches against traditional methods across the ",
    "link": "https://arxiv.org/abs/2408.02213",
    "context": "Title: Is Large Language Model Good at Database Knob Tuning? A Comprehensive Experimental Evaluation\nAbstract: arXiv:2408.02213v1 Announce Type: cross  Abstract: Knob tuning plays a crucial role in optimizing databases by adjusting knobs to enhance database performance. However, traditional tuning methods often follow a Try-Collect-Adjust approach, proving inefficient and database-specific. Moreover, these methods are often opaque, making it challenging for DBAs to grasp the underlying decision-making process.   The emergence of large language models (LLMs) like GPT-4 and Claude-3 has excelled in complex natural language tasks, yet their potential in database knob tuning remains largely unexplored. This study harnesses LLMs as experienced DBAs for knob-tuning tasks with carefully designed prompts. We identify three key subtasks in the tuning system: knob pruning, model initialization, and knob recommendation, proposing LLM-driven solutions to replace conventional methods for each subtask.   We conduct extensive experiments to compare LLM-driven approaches against traditional methods across the ",
    "path": "papers/24/08/2408.02213.json",
    "total_tokens": 390,
    "tldr": "该文章是关于研究大型语言模型是否能够有效地进行数据库调优。研究团队通过仔细设计的问题提示，将大型语言模型（如GPT-4和Claude-3）用作具备经验的DBA进行调优任务。研究提出了使用LLM替代传统方法的方案，解决了调优系统中的三个关键子任务：参数修剪、模型初始化和参数建议。通过广泛的实验对比了LLM驱动的方法与传统方法在各种数据库系统中的效果。"
}