{
    "title": "An investigation into the causes of race bias in AI-based cine CMR segmentation",
    "abstract": "arXiv:2408.02462v1 Announce Type: cross  Abstract: Artificial intelligence (AI) methods are being used increasingly for the automated segmentation of cine cardiac magnetic resonance (CMR) imaging. However, these methods have been shown to be subject to race bias, i.e. they exhibit different levels of performance for different races depending on the (im)balance of the data used to train the AI model. In this paper we investigate the source of this bias, seeking to understand its root cause(s) so that it can be effectively mitigated. We perform a series of classification and segmentation experiments on short-axis cine CMR images acquired from Black and White subjects from the UK Biobank and apply AI interpretability methods to understand the results. In the classification experiments, we found that race can be predicted with high accuracy from the images alone, but less accurately from ground truth segmentations, suggesting that the distributional shift between races, which is often the ",
    "link": "https://arxiv.org/abs/2408.02462",
    "context": "Title: An investigation into the causes of race bias in AI-based cine CMR segmentation\nAbstract: arXiv:2408.02462v1 Announce Type: cross  Abstract: Artificial intelligence (AI) methods are being used increasingly for the automated segmentation of cine cardiac magnetic resonance (CMR) imaging. However, these methods have been shown to be subject to race bias, i.e. they exhibit different levels of performance for different races depending on the (im)balance of the data used to train the AI model. In this paper we investigate the source of this bias, seeking to understand its root cause(s) so that it can be effectively mitigated. We perform a series of classification and segmentation experiments on short-axis cine CMR images acquired from Black and White subjects from the UK Biobank and apply AI interpretability methods to understand the results. In the classification experiments, we found that race can be predicted with high accuracy from the images alone, but less accurately from ground truth segmentations, suggesting that the distributional shift between races, which is often the ",
    "path": "papers/24/08/2408.02462.json",
    "total_tokens": 653,
    "translated_title": "关于AI基于电影CMR分割中的种族偏见调查",
    "translated_abstract": "arXiv:2408.02462v1 Announce Type: cross 摘要：人工智能（AI）方法正在越来越多地用于自动分割电影心脏磁共振（CMR）成像。然而，这些方法已经被证明存在种族偏见，即它们根据用于训练AI模型的数据的平衡（不平衡）水平表现出不同的性能。在本文中，我们调查了这种偏见的来源，寻求理解其根本原因，以便有效地加以缓解。我们在英国生物银行收集的黑人和白人受者的短轴电影CMR图像上进行了分类和分割实验，并应用了AI可解释性方法来理解结果。在分类实验中，我们从图像中独自预测种族，发现准确率很高，但从 ground truth 分割中预测的准确率较低，这表明种族之间的分布差异，这通常是导致AI模型性能差异的关键因素。ent 10.17632/ngpcgbvrb.2.",
    "tldr": "该研究发现AI在基于电影的心脏磁共振图像分割中存在种族偏见，并探讨了可能的原因，以便在未来改进模型以消除这些偏见的影响。"
}