{
    "title": "Is Generative Communication between Embodied Agents Good for Zero-Shot ObjectNav?",
    "abstract": "arXiv:2408.01877v1 Announce Type: cross  Abstract: In Zero-Shot ObjectNav, an embodied ground agent is expected to navigate to a target object specified by a natural language label without any environment-specific fine-tuning. This is challenging, given the limited view of a ground agent and its independent exploratory behavior. To address these issues, we consider an assistive overhead agent with a bounded global view alongside the ground agent and present two coordinated navigation schemes for judicious exploration. We establish the influence of the Generative Communication (GC) between the embodied agents equipped with Vision-Language Models (VLMs) in improving zero-shot ObjectNav, achieving a 10% improvement in the ground agent's ability to find the target object in comparison with an unassisted setup in simulation. We further analyze the GC for unique traits quantifying the presence of hallucination and cooperation. In particular, we identify a unique trait of \"preemptive hallucin",
    "link": "https://arxiv.org/abs/2408.01877",
    "context": "Title: Is Generative Communication between Embodied Agents Good for Zero-Shot ObjectNav?\nAbstract: arXiv:2408.01877v1 Announce Type: cross  Abstract: In Zero-Shot ObjectNav, an embodied ground agent is expected to navigate to a target object specified by a natural language label without any environment-specific fine-tuning. This is challenging, given the limited view of a ground agent and its independent exploratory behavior. To address these issues, we consider an assistive overhead agent with a bounded global view alongside the ground agent and present two coordinated navigation schemes for judicious exploration. We establish the influence of the Generative Communication (GC) between the embodied agents equipped with Vision-Language Models (VLMs) in improving zero-shot ObjectNav, achieving a 10% improvement in the ground agent's ability to find the target object in comparison with an unassisted setup in simulation. We further analyze the GC for unique traits quantifying the presence of hallucination and cooperation. In particular, we identify a unique trait of \"preemptive hallucin",
    "path": "papers/24/08/2408.01877.json",
    "total_tokens": 737,
    "translated_title": "实体代理间的生成式通信对零样本目标导航有效吗？",
    "translated_abstract": "arXiv:2408.01877v1 公告类型：交叉  翻译摘要：在零样本目标导航中，实体地面代理被期望在没有进行特定环境微调的情况下，沿着目标对象的自然语言标签导航。鉴于地面代理的有限视野和独立探索行为，这是一项挑战。为了解决这些问题，我们考虑了一个具有有限全局视野的空中代理，并与地面代理一起，提出了两种协同导航方案，以进行明智的探索。我们确立了具有视觉语言模型（VLMs）的实体代理之间的生成性通信（GC）在改进零样本ObjectNav中的影响，在模拟中，相对于一个没有协助的设置，实现了地面代理找到目标对象的10%的改进。我们还分析了对GC的分析，为量化幻觉和合作的存在确定了独特特征。特别地，我们识别了“预防性幻觉行为”的独特特征，这种行为有助于地面代理更早地定位目标对象，而不必盲目探索。此外，GC通过加深对空中代理输出的理解，提高了对目标对象位置的预测精确度，从而促进了地面代理的搜索策略。总之，我们的研究表明，通过合适的策略来集成GC，可以显著提高实体代理在无监督下导航到目标对象的能力。",
    "tldr": "本研究通过在实体地面代理和空中代理之间实施基于视觉语言模型的生成式通信，显著提高了其在模拟环境中的零样本目标导航能力，同时减少了盲目探索的时间。"
}