{
    "title": "Counterfactuals and Uncertainty-Based Explainable Paradigm for the Automated Detection and Segmentation of Renal Cysts in Computed Tomography Images: A Multi-Center Study",
    "abstract": "arXiv:2408.03789v1 Announce Type: cross  Abstract: Routine computed tomography (CT) scans often detect a wide range of renal cysts, some of which may be malignant. Early and precise localization of these cysts can significantly aid quantitative image analysis. Current segmentation methods, however, do not offer sufficient interpretability at the feature and pixel levels, emphasizing the necessity for an explainable framework that can detect and rectify model inaccuracies. We developed an interpretable segmentation framework and validated it on a multi-centric dataset. A Variational Autoencoder Generative Adversarial Network (VAE-GAN) was employed to learn the latent representation of 3D input patches and reconstruct input images. Modifications in the latent representation using the gradient of the segmentation model generated counterfactual explanations for varying dice similarity coefficients (DSC). Radiomics features extracted from these counterfactual images, using a ground truth cy",
    "link": "https://arxiv.org/abs/2408.03789",
    "context": "Title: Counterfactuals and Uncertainty-Based Explainable Paradigm for the Automated Detection and Segmentation of Renal Cysts in Computed Tomography Images: A Multi-Center Study\nAbstract: arXiv:2408.03789v1 Announce Type: cross  Abstract: Routine computed tomography (CT) scans often detect a wide range of renal cysts, some of which may be malignant. Early and precise localization of these cysts can significantly aid quantitative image analysis. Current segmentation methods, however, do not offer sufficient interpretability at the feature and pixel levels, emphasizing the necessity for an explainable framework that can detect and rectify model inaccuracies. We developed an interpretable segmentation framework and validated it on a multi-centric dataset. A Variational Autoencoder Generative Adversarial Network (VAE-GAN) was employed to learn the latent representation of 3D input patches and reconstruct input images. Modifications in the latent representation using the gradient of the segmentation model generated counterfactual explanations for varying dice similarity coefficients (DSC). Radiomics features extracted from these counterfactual images, using a ground truth cy",
    "path": "papers/24/08/2408.03789.json",
    "total_tokens": 406,
    "tldr": "该文章提供了一种基于不确定性的可解释自动化机制，用于在多中心CT图像研究中检测和分割肾囊肿。通过结合VAE-GAN来学习图像的潜在表示，并利用梯度来生成不同的假想图像以解释分类不准确的原因，从而提高算法的可解释性。通过这种方式，文章中的创新贡献在于提出了一个可以精确检测肾囊肿同时提供解释性的自动化检测系统，这对于早期识别潜在的恶性囊肿非常重要。"
}