{
    "title": "An Empirical Comparison of Video Frame Sampling Methods for Multi-Modal RAG Retrieval",
    "abstract": "arXiv:2408.03340v1 Announce Type: cross  Abstract: Numerous video frame sampling methodologies detailed in the literature present a significant challenge in determining the optimal video frame method for Video RAG pattern without a comparative side-by-side analysis. In this work, we investigate the trade-offs in frame sampling methods for Video & Frame Retrieval using natural language questions. We explore the balance between the quantity of sampled frames and the retrieval recall score, aiming to identify efficient video frame sampling strategies that maintain high retrieval efficacy with reduced storage and processing demands. Our study focuses on the storage and retrieval of image data (video frames) within a vector database required by Video RAG pattern, comparing the effectiveness of various frame sampling techniques. Our investigation indicates that the recall@k metric for both text-to-video and text-to-frame retrieval tasks using various methods covered as part of this work is c",
    "link": "https://arxiv.org/abs/2408.03340",
    "context": "Title: An Empirical Comparison of Video Frame Sampling Methods for Multi-Modal RAG Retrieval\nAbstract: arXiv:2408.03340v1 Announce Type: cross  Abstract: Numerous video frame sampling methodologies detailed in the literature present a significant challenge in determining the optimal video frame method for Video RAG pattern without a comparative side-by-side analysis. In this work, we investigate the trade-offs in frame sampling methods for Video & Frame Retrieval using natural language questions. We explore the balance between the quantity of sampled frames and the retrieval recall score, aiming to identify efficient video frame sampling strategies that maintain high retrieval efficacy with reduced storage and processing demands. Our study focuses on the storage and retrieval of image data (video frames) within a vector database required by Video RAG pattern, comparing the effectiveness of various frame sampling techniques. Our investigation indicates that the recall@k metric for both text-to-video and text-to-frame retrieval tasks using various methods covered as part of this work is c",
    "path": "papers/24/08/2408.03340.json",
    "total_tokens": 337,
    "tldr": "该文章详细比较了多种视频帧抽样方法在多模态自动生成文本（RAG）检索中的效果，探讨了在尽可能减少存储和处理需求的同时保持高召回得分的方法，从而为视频和帧检索任务提供了高效的帧抽样策略。"
}