{
    "title": "ST-SACLF: Style Transfer Informed Self-Attention Classifier for Bias-Aware Painting Classification",
    "abstract": "arXiv:2408.01827v1 Announce Type: new  Abstract: Painting classification plays a vital role in organizing, finding, and suggesting artwork for digital and classic art galleries. Existing methods struggle with adapting knowledge from the real world to artistic images during training, leading to poor performance when dealing with different datasets. Our innovation lies in addressing these challenges through a two-step process. First, we generate more data using Style Transfer with Adaptive Instance Normalization (AdaIN), bridging the gap between diverse styles. Then, our classifier gains a boost with feature-map adaptive spatial attention modules, improving its understanding of artistic details. Moreover, we tackle the problem of imbalanced class representation by dynamically adjusting augmented samples. Through a dual-stage process involving careful hyperparameter search and model fine-tuning, we achieve an impressive 87.24\\% accuracy using the ResNet-50 backbone over 40 training epochs",
    "link": "https://arxiv.org/abs/2408.01827",
    "context": "Title: ST-SACLF: Style Transfer Informed Self-Attention Classifier for Bias-Aware Painting Classification\nAbstract: arXiv:2408.01827v1 Announce Type: new  Abstract: Painting classification plays a vital role in organizing, finding, and suggesting artwork for digital and classic art galleries. Existing methods struggle with adapting knowledge from the real world to artistic images during training, leading to poor performance when dealing with different datasets. Our innovation lies in addressing these challenges through a two-step process. First, we generate more data using Style Transfer with Adaptive Instance Normalization (AdaIN), bridging the gap between diverse styles. Then, our classifier gains a boost with feature-map adaptive spatial attention modules, improving its understanding of artistic details. Moreover, we tackle the problem of imbalanced class representation by dynamically adjusting augmented samples. Through a dual-stage process involving careful hyperparameter search and model fine-tuning, we achieve an impressive 87.24\\% accuracy using the ResNet-50 backbone over 40 training epochs",
    "path": "papers/24/08/2408.01827.json",
    "total_tokens": 352,
    "tldr": "该文章提出了ST-SACLF模型，通过Style Transfer结合AdaIN生成数据，结合自注意力机制和动态样本调整，实现了对艺术作品的高精度分类，显著改善了模型在不同数据集上的表现，尤其是对于不平衡数据集的适应性。"
}