{
    "title": "Spatial-Spectral Morphological Mamba for Hyperspectral Image Classification",
    "abstract": "arXiv:2408.01372v1 Announce Type: new  Abstract: In recent years, Transformers have garnered significant attention for Hyperspectral Image Classification (HSIC) due to their self-attention mechanism, which provides strong classification performance. However, these models face major challenges in computational efficiency, as their complexity increases quadratically with the sequence length. The Mamba architecture, leveraging a State Space Model, offers a more efficient alternative to Transformers. This paper introduces the Spatial-Spectral Morphological Mamba (MorpMamba) model. In the MorpMamba model, a token generation module first converts the Hyperspectral Image (HSI) patch into spatial-spectral tokens. These tokens are then processed by a morphology block, which computes structural and shape information using depthwise separable convolutional operations. The extracted information is enhanced in a feature enhancement module that adjusts the spatial and spectral tokens based on the ce",
    "link": "https://arxiv.org/abs/2408.01372",
    "context": "Title: Spatial-Spectral Morphological Mamba for Hyperspectral Image Classification\nAbstract: arXiv:2408.01372v1 Announce Type: new  Abstract: In recent years, Transformers have garnered significant attention for Hyperspectral Image Classification (HSIC) due to their self-attention mechanism, which provides strong classification performance. However, these models face major challenges in computational efficiency, as their complexity increases quadratically with the sequence length. The Mamba architecture, leveraging a State Space Model, offers a more efficient alternative to Transformers. This paper introduces the Spatial-Spectral Morphological Mamba (MorpMamba) model. In the MorpMamba model, a token generation module first converts the Hyperspectral Image (HSI) patch into spatial-spectral tokens. These tokens are then processed by a morphology block, which computes structural and shape information using depthwise separable convolutional operations. The extracted information is enhanced in a feature enhancement module that adjusts the spatial and spectral tokens based on the ce",
    "path": "papers/24/08/2408.01372.json",
    "total_tokens": 667,
    "translated_title": "基于空间光谱形态学的鳗鱼模型用于 hyperspectral 图像分类",
    "translated_abstract": "最近几年，因为它们的自我注意力机制，Transformer 在超光谱图像分类（HSIC）领域中引起了广泛的关注，并提供了强大的分类性能。然而，这些模型在计算效率方面面临重大挑战，因为它们的复杂性与序列长度成平方增加。Mamba 架构利用状态空间模型提供了一个比Transformer更高效的替代方案。本文介绍了一种新的模型——空间光谱形态鳗鱼（MorpMamba）模型。在MorpMamba模型中，一个 token 生成模块首先将超光谱图像（HSI）的补丁转换为空间光谱 token。这些 token 随后由一个形态学块处理，形态学块使用深度可分离卷积操作计算结构信息和形状信息。一个特征增强模块进一步增强提取的信息，该模块根据计算的空间和平行通道的 token 调整它们的空间和平行通道。",
    "tldr": "本文提出了一种新的基于深度可分离卷积操作的空间光谱形态鳗鱼模型，该模型能够生成并增强空间光谱 token，从而提高超光谱图像分类的效率和性能。",
    "en_tdlr": "This paper introduces a new spatial-spectral Morphological Mamba model, employing depthwise separable convolutional operations to generate and enhance spatial-spectral tokens, which can improve the efficiency and performance of hyperspectral image classification."
}