{
    "title": "Trade-offs of Dynamic Control Structure in Human-swarm Systems",
    "abstract": "arXiv:2408.02605v1 Announce Type: new  Abstract: Swarm robotics is a study of simple robots that exhibit complex behaviour only by interacting locally with other robots and their environment. The control in swarm robotics is mainly distributed whereas centralised control is widely used in other fields of robotics. Centralised and decentralised control strategies both pose a unique set of benefits and drawbacks for the control of multi-robot systems. While decentralised systems are more scalable and resilient, they are less efficient compared to the centralised systems and they lead to excessive data transmissions to the human operators causing cognitive overload. We examine the trade-offs of each of these approaches in a human-swarm system to perform an environmental monitoring task and propose a flexible hybrid approach, which combines elements of hierarchical and decentralised systems. We find that a flexible hybrid system can outperform a centralised system (in our environmental mon",
    "link": "https://arxiv.org/abs/2408.02605",
    "context": "Title: Trade-offs of Dynamic Control Structure in Human-swarm Systems\nAbstract: arXiv:2408.02605v1 Announce Type: new  Abstract: Swarm robotics is a study of simple robots that exhibit complex behaviour only by interacting locally with other robots and their environment. The control in swarm robotics is mainly distributed whereas centralised control is widely used in other fields of robotics. Centralised and decentralised control strategies both pose a unique set of benefits and drawbacks for the control of multi-robot systems. While decentralised systems are more scalable and resilient, they are less efficient compared to the centralised systems and they lead to excessive data transmissions to the human operators causing cognitive overload. We examine the trade-offs of each of these approaches in a human-swarm system to perform an environmental monitoring task and propose a flexible hybrid approach, which combines elements of hierarchical and decentralised systems. We find that a flexible hybrid system can outperform a centralised system (in our environmental mon",
    "path": "papers/24/08/2408.02605.json",
    "total_tokens": 372,
    "tldr": "该文章研究了在人-群系统中的动态控制结构，探讨了集中式与分布式控制策略的优劣。提出了一种灵活的混合方法，结合了层次式和分布式系统的特点，以提高执行环境监测任务时的效率。混合方法在效率和灵活性上取得平衡，能够应对跨时段的动态环境变化。研究显示，这种混合方法在性能上优于集中式系统，降低了人类操作者的认知负担，为机器人集群的智能化控制提供了新的视角。"
}