{
    "title": "Temporal Evolution of Knee Osteoarthritis: A Diffusion-based Morphing Model for X-ray Medical Image Synthesis",
    "abstract": "arXiv:2408.00891v1 Announce Type: cross  Abstract: Knee Osteoarthritis (KOA) is a common musculoskeletal disorder that significantly affects the mobility of older adults. In the medical domain, images containing temporal data are frequently utilized to study temporal dynamics and statistically monitor disease progression. While deep learning-based generative models for natural images have been widely researched, there are comparatively few methods available for synthesizing temporal knee X-rays. In this work, we introduce a novel deep-learning model designed to synthesize intermediate X-ray images between a specific patient's healthy knee and severe KOA stages. During the testing phase, based on a healthy knee X-ray, the proposed model can produce a continuous and effective sequence of KOA X-ray images with varying degrees of severity. Specifically, we introduce a Diffusion-based Morphing Model by modifying the Denoising Diffusion Probabilistic Model. Our approach integrates diffusion ",
    "link": "https://arxiv.org/abs/2408.00891",
    "context": "Title: Temporal Evolution of Knee Osteoarthritis: A Diffusion-based Morphing Model for X-ray Medical Image Synthesis\nAbstract: arXiv:2408.00891v1 Announce Type: cross  Abstract: Knee Osteoarthritis (KOA) is a common musculoskeletal disorder that significantly affects the mobility of older adults. In the medical domain, images containing temporal data are frequently utilized to study temporal dynamics and statistically monitor disease progression. While deep learning-based generative models for natural images have been widely researched, there are comparatively few methods available for synthesizing temporal knee X-rays. In this work, we introduce a novel deep-learning model designed to synthesize intermediate X-ray images between a specific patient's healthy knee and severe KOA stages. During the testing phase, based on a healthy knee X-ray, the proposed model can produce a continuous and effective sequence of KOA X-ray images with varying degrees of severity. Specifically, we introduce a Diffusion-based Morphing Model by modifying the Denoising Diffusion Probabilistic Model. Our approach integrates diffusion ",
    "path": "papers/24/08/2408.00891.json",
    "total_tokens": 711,
    "translated_title": "膝关节骨关节炎时间演化: 一种基于扩散的X射线医学图像合成形态学模型",
    "translated_abstract": "arXiv:2408.00891v1 公告类型: 交叉 摘要: 膝关节骨关节炎(KOA)是一种常见于老年人且严重影响其活动能力的肌肉骨骼疾病。在医疗领域，为了研究疾病的动态变化并对其进行统计监测，经常使用含有时间数据的图像。尽管基于深度学习的自然图像生成模型已经得到了广泛的研究，但用于合成膝X射线图像的模型却相对较少。在本工作中，我们提出了一种新型深层学习模型，旨在合成特定患者健康膝关节和严重KOA阶段之间的一系列X射线图像。在测试阶段，基于患者的健康膝关节X射线图像，我们提出的模型能够生成一条连续且有效的KOA X射线图像序列，序列中的图像表现出了不同的严重程度。具体来说，我们引入了一种基于扩散的形态学模型，通过修改 denoising diffusion probabilistic model 来实现。我们的方法整合了扩散 和生成对抗网络，从而为进一步的医学图像合成和分析提供了可能。实验验证了所提方法的有效性，并为疾病的动态监测提供了一种有力的工具。",
    "tldr": "该研究提出了一种基于扩散的模型，用于合成患者膝关节骨关节炎疾病进程中的不同阶段的X射线图像，能够帮助医学监测和研究。"
}