{
    "title": "MARCO: A Memory-Augmented Reinforcement Framework for Combinatorial Optimization",
    "abstract": "arXiv:2408.02207v1 Announce Type: cross  Abstract: Neural Combinatorial Optimization (NCO) is an emerging domain where deep learning techniques are employed to address combinatorial optimization problems as a standalone solver. Despite their potential, existing NCO methods often suffer from inefficient search space exploration, frequently leading to local optima entrapment or redundant exploration of previously visited states. This paper introduces a versatile framework, referred to as Memory-Augmented Reinforcement for Combinatorial Optimization (MARCO), that can be used to enhance both constructive and improvement methods in NCO through an innovative memory module. MARCO stores data collected throughout the optimization trajectory and retrieves contextually relevant information at each state. This way, the search is guided by two competing criteria: making the best decision in terms of the quality of the solution and avoiding revisiting already explored solutions. This approach promo",
    "link": "https://arxiv.org/abs/2408.02207",
    "context": "Title: MARCO: A Memory-Augmented Reinforcement Framework for Combinatorial Optimization\nAbstract: arXiv:2408.02207v1 Announce Type: cross  Abstract: Neural Combinatorial Optimization (NCO) is an emerging domain where deep learning techniques are employed to address combinatorial optimization problems as a standalone solver. Despite their potential, existing NCO methods often suffer from inefficient search space exploration, frequently leading to local optima entrapment or redundant exploration of previously visited states. This paper introduces a versatile framework, referred to as Memory-Augmented Reinforcement for Combinatorial Optimization (MARCO), that can be used to enhance both constructive and improvement methods in NCO through an innovative memory module. MARCO stores data collected throughout the optimization trajectory and retrieves contextually relevant information at each state. This way, the search is guided by two competing criteria: making the best decision in terms of the quality of the solution and avoiding revisiting already explored solutions. This approach promo",
    "path": "papers/24/08/2408.02207.json",
    "total_tokens": 380,
    "tldr": "该文章提出了一种名为MARCO的强化学习框架，它通过记忆模块提高了神经组合优化(NCO)方法的有效性，尤其是在解决组合优化问题时的状态探索效率。MARCO能够在构造型和改进型NCO方法中发挥作用，通过记忆模块存储和检索与当前状态相关联的信息，从而在做出最佳解决方案决策的同时避免重复探索已有的状态。这种竞争性策略改善了搜索质量，并减少了不必要的重复探索，为组合优化问题提供了更为有效的解决方案。"
}