{
    "title": "Deep Generative Models in Robotics: A Survey on Learning from Multimodal Demonstrations",
    "abstract": "arXiv:2408.04380v1 Announce Type: new  Abstract: Learning from Demonstrations, the field that proposes to learn robot behavior models from data, is gaining popularity with the emergence of deep generative models. Although the problem has been studied for years under names such as Imitation Learning, Behavioral Cloning, or Inverse Reinforcement Learning, classical methods have relied on models that don't capture complex data distributions well or don't scale well to large numbers of demonstrations. In recent years, the robot learning community has shown increasing interest in using deep generative models to capture the complexity of large datasets. In this survey, we aim to provide a unified and comprehensive review of the last year's progress in the use of deep generative models in robotics. We present the different types of models that the community has explored, such as energy-based models, diffusion models, action value maps, or generative adversarial networks. We also present the d",
    "link": "https://arxiv.org/abs/2408.04380",
    "context": "Title: Deep Generative Models in Robotics: A Survey on Learning from Multimodal Demonstrations\nAbstract: arXiv:2408.04380v1 Announce Type: new  Abstract: Learning from Demonstrations, the field that proposes to learn robot behavior models from data, is gaining popularity with the emergence of deep generative models. Although the problem has been studied for years under names such as Imitation Learning, Behavioral Cloning, or Inverse Reinforcement Learning, classical methods have relied on models that don't capture complex data distributions well or don't scale well to large numbers of demonstrations. In recent years, the robot learning community has shown increasing interest in using deep generative models to capture the complexity of large datasets. In this survey, we aim to provide a unified and comprehensive review of the last year's progress in the use of deep generative models in robotics. We present the different types of models that the community has explored, such as energy-based models, diffusion models, action value maps, or generative adversarial networks. We also present the d",
    "path": "papers/24/08/2408.04380.json",
    "total_tokens": 347,
    "tldr": "该文章总结了过去一年中，深度生成模型在机器人学中的应用进展。文章涉及了多种类型的模型，包括能量基模型、扩散模型、动作价值图以及生成对抗网络等，并探讨了这些模型如何帮助机器人更好地从复杂的演示数据中学习。"
}