{
    "title": "Dialogue Ontology Relation Extraction via Constrained Chain-of-Thought Decoding",
    "abstract": "arXiv:2408.02361v1 Announce Type: cross  Abstract: State-of-the-art task-oriented dialogue systems typically rely on task-specific ontologies for fulfilling user queries. The majority of task-oriented dialogue data, such as customer service recordings, comes without ontology and annotation. Such ontologies are normally built manually, limiting the application of specialised systems. Dialogue ontology construction is an approach for automating that process and typically consists of two steps: term extraction and relation extraction. In this work, we focus on relation extraction in a transfer learning set-up. To improve the generalisation, we propose an extension to the decoding mechanism of large language models. We adapt Chain-of-Thought (CoT) decoding, recently developed for reasoning problems, to generative relation extraction. Here, we generate multiple branches in the decoding space and select the relations based on a confidence threshold. By constraining the decoding to ontology t",
    "link": "https://arxiv.org/abs/2408.02361",
    "context": "Title: Dialogue Ontology Relation Extraction via Constrained Chain-of-Thought Decoding\nAbstract: arXiv:2408.02361v1 Announce Type: cross  Abstract: State-of-the-art task-oriented dialogue systems typically rely on task-specific ontologies for fulfilling user queries. The majority of task-oriented dialogue data, such as customer service recordings, comes without ontology and annotation. Such ontologies are normally built manually, limiting the application of specialised systems. Dialogue ontology construction is an approach for automating that process and typically consists of two steps: term extraction and relation extraction. In this work, we focus on relation extraction in a transfer learning set-up. To improve the generalisation, we propose an extension to the decoding mechanism of large language models. We adapt Chain-of-Thought (CoT) decoding, recently developed for reasoning problems, to generative relation extraction. Here, we generate multiple branches in the decoding space and select the relations based on a confidence threshold. By constraining the decoding to ontology t",
    "path": "papers/24/08/2408.02361.json",
    "total_tokens": 696,
    "translated_title": "通过有约束的思考链解码进行会话本体关系提取",
    "translated_abstract": "arXiv:2408.02361v1 公告类型: 交叉 摘要: 领域领先的任务导向对话系统大多依赖于任务特定的本体以满足用户查询。像客户服务录音这样的任务导向对话数据的大多数，都没有本体和标注。这样的本体通常是通过手动构建的，这限制了专用系统的应用。对话本体构造是一种自动化该过程的方法，通常包括两步：术语提取和关系提取。在本文工作中，我们专注于跨学习环境中的关系提取。为了提高泛化能力，我们提出了对大型语言模型解码机制的扩展。我们采纳了最近为推理问题开发的思想链(CoT)解码技术，将其应用于生成式关系提取。在这里，我们在解码空间中生成多个分支，并根据信心阈值选择关系。通过约束解码器至本体术语的定义，我们训练模型学习更具体的信息，并将负样的生成预防到了最优解中。实验结果表明，与基线模型相比，我们的方法能够更好地提取对话和相关关系，从而降低了对手动构建本体的需求，对构建动态调整的用户服务系统有着积极的意义。",
    "tldr": "本文提出了一种使用有约束的思考链解码技术来提高对话系统中的关系提取的准确性，通过训练模型学习更具体的信息，减少了对手动构建本体的需求。"
}