{
    "title": "FacialPulse: An Efficient RNN-based Depression Detection via Temporal Facial Landmarks",
    "abstract": "arXiv:2408.03499v1 Announce Type: new  Abstract: Depression is a prevalent mental health disorder that significantly impacts individuals' lives and well-being. Early detection and intervention are crucial for effective treatment and management of depression. Recently, there are many end-to-end deep learning methods leveraging the facial expression features for automatic depression detection. However, most current methods overlook the temporal dynamics of facial expressions. Although very recent 3DCNN methods remedy this gap, they introduce more computational cost due to the selection of CNN-based backbones and redundant facial features.   To address the above limitations, by considering the timing correlation of facial expressions, we propose a novel framework called FacialPulse, which recognizes depression with high accuracy and speed. By harnessing the bidirectional nature and proficiently addressing long-term dependencies, the Facial Motion Modeling Module (FMMM) is designed in Faci",
    "link": "https://arxiv.org/abs/2408.03499",
    "context": "Title: FacialPulse: An Efficient RNN-based Depression Detection via Temporal Facial Landmarks\nAbstract: arXiv:2408.03499v1 Announce Type: new  Abstract: Depression is a prevalent mental health disorder that significantly impacts individuals' lives and well-being. Early detection and intervention are crucial for effective treatment and management of depression. Recently, there are many end-to-end deep learning methods leveraging the facial expression features for automatic depression detection. However, most current methods overlook the temporal dynamics of facial expressions. Although very recent 3DCNN methods remedy this gap, they introduce more computational cost due to the selection of CNN-based backbones and redundant facial features.   To address the above limitations, by considering the timing correlation of facial expressions, we propose a novel framework called FacialPulse, which recognizes depression with high accuracy and speed. By harnessing the bidirectional nature and proficiently addressing long-term dependencies, the Facial Motion Modeling Module (FMMM) is designed in Faci",
    "path": "papers/24/08/2408.03499.json",
    "total_tokens": 327,
    "tldr": "该文章提出了一种名为FacialPulse的深度学习框架，该框架通过利用面部表情的时间相关性，能够高效地使用时序面部特征点检测抑郁，从而实现高准确性和快速识别。"
}