{
    "title": "Tackling Noisy Clients in Federated Learning with End-to-end Label Correction",
    "abstract": "arXiv:2408.04301v1 Announce Type: cross  Abstract: Recently, federated learning (FL) has achieved wide successes for diverse privacy-sensitive applications without sacrificing the sensitive private information of clients. However, the data quality of client datasets can not be guaranteed since corresponding annotations of different clients often contain complex label noise of varying degrees, which inevitably causes the performance degradation. Intuitively, the performance degradation is dominated by clients with higher noise rates since their trained models contain more misinformation from data, thus it is necessary to devise an effective optimization scheme to mitigate the negative impacts of these noisy clients. In this work, we propose a two-stage framework FedELC to tackle this complicated label noise issue. The first stage aims to guide the detection of noisy clients with higher label noise, while the second stage aims to correct the labels of noisy clients' data via an end-to-en",
    "link": "https://arxiv.org/abs/2408.04301",
    "context": "Title: Tackling Noisy Clients in Federated Learning with End-to-end Label Correction\nAbstract: arXiv:2408.04301v1 Announce Type: cross  Abstract: Recently, federated learning (FL) has achieved wide successes for diverse privacy-sensitive applications without sacrificing the sensitive private information of clients. However, the data quality of client datasets can not be guaranteed since corresponding annotations of different clients often contain complex label noise of varying degrees, which inevitably causes the performance degradation. Intuitively, the performance degradation is dominated by clients with higher noise rates since their trained models contain more misinformation from data, thus it is necessary to devise an effective optimization scheme to mitigate the negative impacts of these noisy clients. In this work, we propose a two-stage framework FedELC to tackle this complicated label noise issue. The first stage aims to guide the detection of noisy clients with higher label noise, while the second stage aims to correct the labels of noisy clients' data via an end-to-en",
    "path": "papers/24/08/2408.04301.json",
    "total_tokens": 328,
    "tldr": "该文章提出了一种针对联邦学习中的噪音客户端问题，通过端到端标签校正的两阶段框架FedELC，旨在识别噪音更高的客户端并对其数据进行标签校正，以缓解噪音客户端对模型性能的负面影响。"
}