{
    "title": "Optimal Layout-Aware CNOT Circuit Synthesis with Qubit Permutation",
    "abstract": "arXiv:2408.04349v1 Announce Type: cross  Abstract: CNOT optimization plays a significant role in noise reduction for Quantum Circuits. Several heuristic and exact approaches exist for CNOT optimization. In this paper, we investigate more complicated variations of optimal synthesis by allowing qubit permutations and handling layout restrictions. We encode such problems into Planning, SAT, and QBF. We provide optimization for both CNOT gate count and circuit depth. For experimental evaluation, we consider standard T-gate optimized benchmarks and optimize CNOT sub-circuits. We show that allowing qubit permutations can further reduce up to 56% in CNOT count and 46% in circuit depth. In the case of optimally mapped circuits under layout restrictions, we observe a reduction up to 17% CNOT count and 19% CNOT depth.",
    "link": "https://arxiv.org/abs/2408.04349",
    "context": "Title: Optimal Layout-Aware CNOT Circuit Synthesis with Qubit Permutation\nAbstract: arXiv:2408.04349v1 Announce Type: cross  Abstract: CNOT optimization plays a significant role in noise reduction for Quantum Circuits. Several heuristic and exact approaches exist for CNOT optimization. In this paper, we investigate more complicated variations of optimal synthesis by allowing qubit permutations and handling layout restrictions. We encode such problems into Planning, SAT, and QBF. We provide optimization for both CNOT gate count and circuit depth. For experimental evaluation, we consider standard T-gate optimized benchmarks and optimize CNOT sub-circuits. We show that allowing qubit permutations can further reduce up to 56% in CNOT count and 46% in circuit depth. In the case of optimally mapped circuits under layout restrictions, we observe a reduction up to 17% CNOT count and 19% CNOT depth.",
    "path": "papers/24/08/2408.04349.json",
    "total_tokens": 342,
    "tldr": "该文章通过允许qubit的重新排序和考虑布局限制，对基于CNOT的量子电路进行了优化合成，编码为不同的规划问题，并提供了对于CNOT门数量和电路深度的显著优化，特别是对于映射到具体物理架构的电路，进一步减少了CNOT门数量和深度的最高比例分别达到17%和19%。"
}