{
    "title": "Combining Diverse Information for Coordinated Action: Stochastic Bandit Algorithms for Heterogeneous Agents",
    "abstract": "arXiv:2408.03405v1 Announce Type: cross  Abstract: Stochastic multi-agent multi-armed bandits typically assume that the rewards from each arm follow a fixed distribution, regardless of which agent pulls the arm. However, in many real-world settings, rewards can depend on the sensitivity of each agent to their environment. In medical screening, disease detection rates can vary by test type; in preference matching, rewards can depend on user preferences; and in environmental sensing, observation quality can vary across sensors. Since past work does not specify how to allocate agents of heterogeneous but known sensitivity of these types in a stochastic bandit setting, we introduce a UCB-style algorithm, Min-Width, which aggregates information from diverse agents. In doing so, we address the joint challenges of (i) aggregating the rewards, which follow different distributions for each agent-arm pair, and (ii) coordinating the assignments of agents to arms. Min-Width facilitates efficient c",
    "link": "https://arxiv.org/abs/2408.03405",
    "context": "Title: Combining Diverse Information for Coordinated Action: Stochastic Bandit Algorithms for Heterogeneous Agents\nAbstract: arXiv:2408.03405v1 Announce Type: cross  Abstract: Stochastic multi-agent multi-armed bandits typically assume that the rewards from each arm follow a fixed distribution, regardless of which agent pulls the arm. However, in many real-world settings, rewards can depend on the sensitivity of each agent to their environment. In medical screening, disease detection rates can vary by test type; in preference matching, rewards can depend on user preferences; and in environmental sensing, observation quality can vary across sensors. Since past work does not specify how to allocate agents of heterogeneous but known sensitivity of these types in a stochastic bandit setting, we introduce a UCB-style algorithm, Min-Width, which aggregates information from diverse agents. In doing so, we address the joint challenges of (i) aggregating the rewards, which follow different distributions for each agent-arm pair, and (ii) coordinating the assignments of agents to arms. Min-Width facilitates efficient c",
    "path": "papers/24/08/2408.03405.json",
    "total_tokens": 372,
    "tldr": "该文章提出了一种新的STAC-Min-Width算法，用于解决在具有不同敏感性的多代理人多臂乐队问题中，如何综合来自不同代理人的信息并协调他们的行动。该算法通过精心设计的策略，能够从不同的概率分布中聚合奖励，并有效地协调代理人的任务分配，从而在提高整体性能的同时保持效率。"
}