{
    "title": "A Reinforcement Learning Based Motion Planner for Quadrotor Autonomous Flight in Dense Environment",
    "abstract": "arXiv:2408.00275v2 Announce Type: replace  Abstract: Quadrotor motion planning is critical for autonomous flight in complex environments, such as rescue operations. Traditional methods often employ trajectory generation optimization and passive time allocation strategies, which can limit the exploitation of the quadrotor's dynamic capabilities and introduce delays and inaccuracies. To address these challenges, we propose a novel motion planning framework that integrates visibility path searching and reinforcement learning (RL) motion generation. Our method constructs collision-free paths using heuristic search and visibility graphs, which are then refined by an RL policy to generate low-level motion commands. We validate our approach in simulated indoor environments, demonstrating better performance than traditional methods in terms of time span.",
    "link": "https://arxiv.org/abs/2408.00275",
    "context": "Title: A Reinforcement Learning Based Motion Planner for Quadrotor Autonomous Flight in Dense Environment\nAbstract: arXiv:2408.00275v2 Announce Type: replace  Abstract: Quadrotor motion planning is critical for autonomous flight in complex environments, such as rescue operations. Traditional methods often employ trajectory generation optimization and passive time allocation strategies, which can limit the exploitation of the quadrotor's dynamic capabilities and introduce delays and inaccuracies. To address these challenges, we propose a novel motion planning framework that integrates visibility path searching and reinforcement learning (RL) motion generation. Our method constructs collision-free paths using heuristic search and visibility graphs, which are then refined by an RL policy to generate low-level motion commands. We validate our approach in simulated indoor environments, demonstrating better performance than traditional methods in terms of time span.",
    "path": "papers/24/08/2408.00275.json",
    "total_tokens": 278,
    "tldr": "该文章提出了一种结合启发式搜索和可见性图构建路径以及基于强化学习的低级运动命令生成方法，以改善室内环境中的无人机自主飞行性能。"
}