{
    "title": "Attacks and Defenses for Generative Diffusion Models: A Comprehensive Survey",
    "abstract": "arXiv:2408.03400v1 Announce Type: cross  Abstract: Diffusion models (DMs) have achieved state-of-the-art performance on various generative tasks such as image synthesis, text-to-image, and text-guided image-to-image generation. However, the more powerful the DMs, the more harmful they potentially are. Recent studies have shown that DMs are prone to a wide range of attacks, including adversarial attacks, membership inference, backdoor injection, and various multi-modal threats. Since numerous pre-trained DMs are published widely on the Internet, potential threats from these attacks are especially detrimental to the society, making DM-related security a worth investigating topic. Therefore, in this paper, we conduct a comprehensive survey on the security aspect of DMs, focusing on various attack and defense methods for DMs. First, we present crucial knowledge of DMs with five main types of DMs, including denoising diffusion probabilistic models, denoising diffusion implicit models, noise",
    "link": "https://arxiv.org/abs/2408.03400",
    "context": "Title: Attacks and Defenses for Generative Diffusion Models: A Comprehensive Survey\nAbstract: arXiv:2408.03400v1 Announce Type: cross  Abstract: Diffusion models (DMs) have achieved state-of-the-art performance on various generative tasks such as image synthesis, text-to-image, and text-guided image-to-image generation. However, the more powerful the DMs, the more harmful they potentially are. Recent studies have shown that DMs are prone to a wide range of attacks, including adversarial attacks, membership inference, backdoor injection, and various multi-modal threats. Since numerous pre-trained DMs are published widely on the Internet, potential threats from these attacks are especially detrimental to the society, making DM-related security a worth investigating topic. Therefore, in this paper, we conduct a comprehensive survey on the security aspect of DMs, focusing on various attack and defense methods for DMs. First, we present crucial knowledge of DMs with five main types of DMs, including denoising diffusion probabilistic models, denoising diffusion implicit models, noise",
    "path": "papers/24/08/2408.03400.json",
    "total_tokens": 378,
    "tldr": "该文章介绍了生成扩散模型（DMs）在图像合成、文本到图像和其他生成任务中的最新进展，并强调了这种强大的技术也可能成为潜在的威胁。作者详细分析了多模态攻击，如对抗攻击、成员推断、后门注入和多重威胁，并给出了解决方案，强调了DM安全性的重要性，以防止这些攻击对社会造成伤害。"
}