{
    "title": "Networks of Pendula with Diffusive Interactions",
    "abstract": "arXiv:2408.02352v1 Announce Type: cross  Abstract: We study a system of coupled pendula with diffusive interactions, which could depend both on positions and on momenta. The coupling structure is defined by an undirected network, while the dynamic equations are derived from a Hamiltonian; as such, the energy is conserved. We provide sufficient conditions on the energy for bounded motion, identifying the oscillatory regime. We also describe the bifurcations of synchronised states, exploiting the quantities related to the network structure. Moreover, we consider patterns of anti-synchrony arising from the specific properties of the model. Such patterns can be linked to global properties of the system by looking at motion of the centre of mass. Nonetheless, the anti-synchrony patterns play also a relevant role in the bifurcation analysis. For the case of graphs with a large number of nodes, we characterise the parameter range in which the bifurcations occur. We complement the analysis wit",
    "link": "https://arxiv.org/abs/2408.02352",
    "context": "Title: Networks of Pendula with Diffusive Interactions\nAbstract: arXiv:2408.02352v1 Announce Type: cross  Abstract: We study a system of coupled pendula with diffusive interactions, which could depend both on positions and on momenta. The coupling structure is defined by an undirected network, while the dynamic equations are derived from a Hamiltonian; as such, the energy is conserved. We provide sufficient conditions on the energy for bounded motion, identifying the oscillatory regime. We also describe the bifurcations of synchronised states, exploiting the quantities related to the network structure. Moreover, we consider patterns of anti-synchrony arising from the specific properties of the model. Such patterns can be linked to global properties of the system by looking at motion of the centre of mass. Nonetheless, the anti-synchrony patterns play also a relevant role in the bifurcation analysis. For the case of graphs with a large number of nodes, we characterise the parameter range in which the bifurcations occur. We complement the analysis wit",
    "path": "papers/24/08/2408.02352.json",
    "total_tokens": 459,
    "tldr": "标题：具有扩散相互作用的摆网\n摘要：arXiv:2408.02352v1 公告类型：交叉 摘要：我们研究了一个具有扩散相互作用的耦合摆系统，这种相互作用可能同时取决于位置和动量。耦合结构由无向网络定义，动态方程是从Hamilton算子导出的；因此，能量是守恒的。我们为有限的运动提供了关于能量充足条件，识别了振荡区域。我们还描述了同步状态的分形，通过与网络结构相关的量来利用。此外，我们还考虑了特定于模型的反同步模式。这样的模式可以通过查看质心运动的轨迹来联系到系统的全局特性。然而，反同步模式在分形分析中也起着重要作用。对于有很多节点的图，我们描述了分形发生的参数范围。我们通过数值计算和图形分析来增强分析。"
}