{
    "title": "A Robotics-Inspired Scanpath Model Reveals the Importance of Uncertainty and Semantic Object Cues for Gaze Guidance in Dynamic Scenes",
    "abstract": "arXiv:2408.01322v1 Announce Type: new  Abstract: How we perceive objects around us depends on what we actively attend to, yet our eye movements depend on the perceived objects. Still, object segmentation and gaze behavior are typically treated as two independent processes. Drawing on an information processing pattern from robotics, we present a mechanistic model that simulates these processes for dynamic real-world scenes. Our image-computable model uses the current scene segmentation for object-based saccadic decision-making while using the foveated object to refine its scene segmentation recursively. To model this refinement, we use a Bayesian filter, which also provides an uncertainty estimate for the segmentation that we use to guide active scene exploration. We demonstrate that this model closely resembles observers' free viewing behavior, measured by scanpath statistics, including foveation duration and saccade amplitude distributions used for parameter fitting and higher-level s",
    "link": "https://arxiv.org/abs/2408.01322",
    "context": "Title: A Robotics-Inspired Scanpath Model Reveals the Importance of Uncertainty and Semantic Object Cues for Gaze Guidance in Dynamic Scenes\nAbstract: arXiv:2408.01322v1 Announce Type: new  Abstract: How we perceive objects around us depends on what we actively attend to, yet our eye movements depend on the perceived objects. Still, object segmentation and gaze behavior are typically treated as two independent processes. Drawing on an information processing pattern from robotics, we present a mechanistic model that simulates these processes for dynamic real-world scenes. Our image-computable model uses the current scene segmentation for object-based saccadic decision-making while using the foveated object to refine its scene segmentation recursively. To model this refinement, we use a Bayesian filter, which also provides an uncertainty estimate for the segmentation that we use to guide active scene exploration. We demonstrate that this model closely resembles observers' free viewing behavior, measured by scanpath statistics, including foveation duration and saccade amplitude distributions used for parameter fitting and higher-level s",
    "path": "papers/24/08/2408.01322.json",
    "total_tokens": 753,
    "translated_title": "启发自机器人的扫描路径模型揭示动态场景中不确定性和语义对象线索对于视线引导的重要性",
    "translated_abstract": "arXiv:2408.01322v1 宣布类型：新 摘要：我们周围世界感知的方式取决于我们所积极关注的内容，但我们眼球的移动又依赖于感知到的事物。然而，物体分割和眼球运动的通常被看作是两个独立的过程。我们提出一个机制模型，它对于动态的真实世界场景模拟这些过程，并借鉴了机器人学中的信息处理模式。我们的图像可计算模型在动态场景下，不仅使用当前的物体分割进行基于物体的跳跃决策，而且还使用聚焦点物体来反复改进其场景分割结果。为了模拟这种改进，我们使用贝叶斯滤波器，还提供了对于分割的不确定性估计，以用于指导主动场景探索。我们展示了这个模型在模拟观察者自由观看行为时，与扫描路径统计数据密切相关，包括用于参数拟合的聚焦持续时间和跳跃幅度分布以及更高的层面上的观测数据。我们不仅展示了这个模型在模拟观察者自由观看行为时，与扫描路径统计数据密切相关，包括用于参数拟合的聚焦持续时间和跳跃幅度分布以及更高的层面上的观测数据。此外，我们还展示了这个模型在模拟观察者自由观看行为时，与扫描路径统计数据密切相关，包括用于参数拟合的聚焦持续时间和跳跃幅度分布以及更高的层面上的观测数据。",
    "tldr": "该研究提出了一种基于机器学习模型的扫描路径算法，它在动态场景中通过不确定性和语义对象线索的结合，有效引导视线行为，并模拟了观察者的实际观看行为。",
    "en_tdlr": "The study presents an algorithm that utilizes a robotic-inspired model to guide eye movement behavior in dynamic scenes through a combination of uncertainty and semantic object cues, closely simulating observers' actual viewing behavior."
}