{
    "title": "Visual-Inertial SLAM for Agricultural Robotics: Benchmarking the Benefits and Computational Costs of Loop Closing",
    "abstract": "arXiv:2408.01716v1 Announce Type: new  Abstract: Simultaneous Localization and Mapping (SLAM) is essential for mobile robotics, enabling autonomous navigation in dynamic, unstructured outdoor environments without relying on external positioning systems. In agricultural applications, where environmental conditions can be particularly challenging due to variable lighting or weather conditions, Visual-Inertial SLAM has emerged as a potential solution. This paper benchmarks several open-source Visual-Inertial SLAM systems, including ORB-SLAM3, VINS-Fusion, OpenVINS, Kimera, and SVO Pro, to evaluate their performance in agricultural settings. We focus on the impact of loop closing on localization accuracy and computational demands, providing a comprehensive analysis of these systems' effectiveness in real-world environments and especially their application to embedded systems in agricultural robotics. Our contributions further include an assessment of varying frame rates on localization acc",
    "link": "https://arxiv.org/abs/2408.01716",
    "context": "Title: Visual-Inertial SLAM for Agricultural Robotics: Benchmarking the Benefits and Computational Costs of Loop Closing\nAbstract: arXiv:2408.01716v1 Announce Type: new  Abstract: Simultaneous Localization and Mapping (SLAM) is essential for mobile robotics, enabling autonomous navigation in dynamic, unstructured outdoor environments without relying on external positioning systems. In agricultural applications, where environmental conditions can be particularly challenging due to variable lighting or weather conditions, Visual-Inertial SLAM has emerged as a potential solution. This paper benchmarks several open-source Visual-Inertial SLAM systems, including ORB-SLAM3, VINS-Fusion, OpenVINS, Kimera, and SVO Pro, to evaluate their performance in agricultural settings. We focus on the impact of loop closing on localization accuracy and computational demands, providing a comprehensive analysis of these systems' effectiveness in real-world environments and especially their application to embedded systems in agricultural robotics. Our contributions further include an assessment of varying frame rates on localization acc",
    "path": "papers/24/08/2408.01716.json",
    "total_tokens": 742,
    "translated_title": "农业机器人视觉-惯性SLAM: 用于基准测试闭环闭合的好处和计算成本的性能",
    "translated_abstract": "arXiv:2408.01716v1 公告类型: 新  摘要: 同步定位与地图构建(SLAM)对于移动机器人至关重要，它在不依赖于外部定位系统的情况下，允许在动态和非结构化的户外环境中进行自主导航。在农业应用中，由于照明或天气条件的可变性，视觉-惯性SLAM已成为潜在的解决方案。本文对几种开源视觉-惯性SLAM系统进行了基准测试，包括ORB-SLAM3、VINS-Fusion、OpenVINS、Kimera和SVO Pro，以评估这些系统在农业环境中的表现。我们侧重于闭环闭合对定位精度和计算需求的影响，提供了这些系统在实际工作环境中的有效性分析，尤其是它们在农业机器人嵌入式系统中的应用。我们的贡献还包括对帧率变化对定位精度影响的评估，以及对不同系统在阳光直射和遮挡下的性能比较，以及在高重复性场景中的表现评估。我们的实验结果表明，对于农业机器人导航，闭环闭合显著提高了定位精度，但同时也增加了计算成本。此外，我们还分析了不同系统在能量消耗方面的表现，为嵌入式系统中潜在的能源优化提供了见解。我们的工作将为农业机器人中的视觉-惯性SLAM的选型提供重要参考，并为未来研究指明了方向。",
    "tldr": "本文对多种视觉-惯性SLAM系统进行了农业机器人场景下的性能评估，重点分析了闭环闭合对定位精度和计算成本的影响。"
}