{
    "title": "EcoFollower: An Environment-Friendly Car Following Model Considering Fuel Consumption",
    "abstract": "arXiv:2408.03950v1 Announce Type: new  Abstract: To alleviate energy shortages and environmental impacts caused by transportation, this study introduces EcoFollower, a novel eco-car-following model developed using reinforcement learning (RL) to optimize fuel consumption in car-following scenarios. Employing the NGSIM datasets, the performance of EcoFollower was assessed in comparison with the well-established Intelligent Driver Model (IDM). The findings demonstrate that EcoFollower excels in simulating realistic driving behaviors, maintaining smooth vehicle operations, and closely matching the ground truth metrics of time-to-collision (TTC), headway, and comfort. Notably, the model achieved a significant reduction in fuel consumption, lowering it by 10.42\\% compared to actual driving scenarios. These results underscore the capability of RL-based models like EcoFollower to enhance autonomous vehicle algorithms, promoting safer and more energy-efficient driving strategies.",
    "link": "https://arxiv.org/abs/2408.03950",
    "context": "Title: EcoFollower: An Environment-Friendly Car Following Model Considering Fuel Consumption\nAbstract: arXiv:2408.03950v1 Announce Type: new  Abstract: To alleviate energy shortages and environmental impacts caused by transportation, this study introduces EcoFollower, a novel eco-car-following model developed using reinforcement learning (RL) to optimize fuel consumption in car-following scenarios. Employing the NGSIM datasets, the performance of EcoFollower was assessed in comparison with the well-established Intelligent Driver Model (IDM). The findings demonstrate that EcoFollower excels in simulating realistic driving behaviors, maintaining smooth vehicle operations, and closely matching the ground truth metrics of time-to-collision (TTC), headway, and comfort. Notably, the model achieved a significant reduction in fuel consumption, lowering it by 10.42\\% compared to actual driving scenarios. These results underscore the capability of RL-based models like EcoFollower to enhance autonomous vehicle algorithms, promoting safer and more energy-efficient driving strategies.",
    "path": "papers/24/08/2408.03950.json",
    "total_tokens": 430,
    "tldr": "该文章提出了一种名为EcoFollower的新型环境友好型跟随车辆模型，该模型考虑了燃料消耗，通过强化学习优化交通场景下的行驶效率。通过对比行业标准智能司机模型（IDM），研究发现EcoFollower不仅模拟了更真实的驾驶行为，保持了车辆操作的流畅性，并且与时间碰撞、跟车距离和舒适度等真实指标的匹配度极高。更重要的是，EcoFollower在燃料消耗方面表现出色，相比实际的驾驶场景，其降低了10.42%的燃料消耗，显示出强化学习模型在提高自动驾驶车辆性能和推广更安全、更环保驾驶策略方面的潜力。"
}