{
    "title": "Frontend Diffusion: Exploring Intent-Based User Interfaces through Abstract-to-Detailed Task Transitions",
    "abstract": "arXiv:2408.00778v1 Announce Type: cross  Abstract: The emergence of Generative AI is catalyzing a paradigm shift in user interfaces from command-based to intent-based outcome specification. In this paper, we explore abstract-to-detailed task transitions in the context of frontend code generation as a step towards intent-based user interfaces, aiming to bridge the gap between abstract user intentions and concrete implementations. We introduce Frontend Diffusion, an end-to-end LLM-powered tool that generates high-quality websites from user sketches. The system employs a three-stage task transition process: sketching, writing, and coding. We demonstrate the potential of task transitions to reduce human intervention and communication costs in complex tasks. Our work also opens avenues for exploring similar approaches in other domains, potentially extending to more complex, interdependent tasks such as video production.",
    "link": "https://arxiv.org/abs/2408.00778",
    "context": "Title: Frontend Diffusion: Exploring Intent-Based User Interfaces through Abstract-to-Detailed Task Transitions\nAbstract: arXiv:2408.00778v1 Announce Type: cross  Abstract: The emergence of Generative AI is catalyzing a paradigm shift in user interfaces from command-based to intent-based outcome specification. In this paper, we explore abstract-to-detailed task transitions in the context of frontend code generation as a step towards intent-based user interfaces, aiming to bridge the gap between abstract user intentions and concrete implementations. We introduce Frontend Diffusion, an end-to-end LLM-powered tool that generates high-quality websites from user sketches. The system employs a three-stage task transition process: sketching, writing, and coding. We demonstrate the potential of task transitions to reduce human intervention and communication costs in complex tasks. Our work also opens avenues for exploring similar approaches in other domains, potentially extending to more complex, interdependent tasks such as video production.",
    "path": "papers/24/08/2408.00778.json",
    "total_tokens": 621,
    "translated_title": "前端扩散：通过抽象到详细任务过渡探索意图驱动的用户界面",
    "translated_abstract": "arXiv:2408.00778v1 公告类型：交叉",
    "tldr": "本文提出Frontend Diffusion工具，旨在通过用户的草图和端到端语言模型实现从抽象意图到详细网页的生成过程。",
    "en_tdlr": "This paper introduces the Frontend Diffusion tool aimed at generating detailed web pages from user sketches and an end-to-end language model, bridging the gap between abstract user intentions and concrete implementations."
}