{
    "title": "Biomedical Image Segmentation: A Systematic Literature Review of Deep Learning Based Object Detection Methods",
    "abstract": "arXiv:2408.03393v1 Announce Type: cross  Abstract: Biomedical image segmentation plays a vital role in diagnosis of diseases across various organs. Deep learning-based object detection methods are commonly used for such segmentation. There exists an extensive research in this topic. However, there is no standard review on this topic. Existing surveys often lack a standardized approach or focus on broader segmentation techniques. In this paper, we conducted a systematic literature review (SLR), collected and analysed 148 articles that explore deep learning object detection methods for biomedical image segmentation. We critically analyzed these methods, identified the key challenges, and discussed the future directions. From the selected articles we extracted the results including the deep learning models, targeted imaging modalities, targeted diseases, and the metrics for the analysis of the methods. The results have been presented in tabular and/or charted forms. The results are presen",
    "link": "https://arxiv.org/abs/2408.03393",
    "context": "Title: Biomedical Image Segmentation: A Systematic Literature Review of Deep Learning Based Object Detection Methods\nAbstract: arXiv:2408.03393v1 Announce Type: cross  Abstract: Biomedical image segmentation plays a vital role in diagnosis of diseases across various organs. Deep learning-based object detection methods are commonly used for such segmentation. There exists an extensive research in this topic. However, there is no standard review on this topic. Existing surveys often lack a standardized approach or focus on broader segmentation techniques. In this paper, we conducted a systematic literature review (SLR), collected and analysed 148 articles that explore deep learning object detection methods for biomedical image segmentation. We critically analyzed these methods, identified the key challenges, and discussed the future directions. From the selected articles we extracted the results including the deep learning models, targeted imaging modalities, targeted diseases, and the metrics for the analysis of the methods. The results have been presented in tabular and/or charted forms. The results are presen",
    "path": "papers/24/08/2408.03393.json",
    "total_tokens": 327,
    "tldr": "该文章通过系统性文献回顾，系统地分析了148篇关于深度学习在生物医学图像分割中应用的文章，深入探讨了深度学习模型在生物医学图像分割中的应用，并提出了未来研究的方向。"
}