{
    "title": "FBINeRF: Feature-Based Integrated Recurrent Network for Pinhole and Fisheye Neural Radiance Fields",
    "abstract": "arXiv:2408.01878v1 Announce Type: new  Abstract: Previous studies aiming to optimize and bundle-adjust camera poses using Neural Radiance Fields (NeRFs), such as BARF and DBARF, have demonstrated impressive capabilities in 3D scene reconstruction. However, these approaches have been designed for pinhole-camera pose optimization and do not perform well under radial image distortions such as those in fisheye cameras. Furthermore, inaccurate depth initialization in DBARF results in erroneous geometric information affecting the overall convergence and quality of results. In this paper, we propose adaptive GRUs with a flexible bundle-adjustment method adapted to radial distortions and incorporate feature-based recurrent neural networks to generate continuous novel views from fisheye datasets. Other NeRF methods for fisheye images, such as SCNeRF and OMNI-NeRF, use projected ray distance loss for distorted pose refinement, causing severe artifacts, long rendering time, and are difficult to u",
    "link": "https://arxiv.org/abs/2408.01878",
    "context": "Title: FBINeRF: Feature-Based Integrated Recurrent Network for Pinhole and Fisheye Neural Radiance Fields\nAbstract: arXiv:2408.01878v1 Announce Type: new  Abstract: Previous studies aiming to optimize and bundle-adjust camera poses using Neural Radiance Fields (NeRFs), such as BARF and DBARF, have demonstrated impressive capabilities in 3D scene reconstruction. However, these approaches have been designed for pinhole-camera pose optimization and do not perform well under radial image distortions such as those in fisheye cameras. Furthermore, inaccurate depth initialization in DBARF results in erroneous geometric information affecting the overall convergence and quality of results. In this paper, we propose adaptive GRUs with a flexible bundle-adjustment method adapted to radial distortions and incorporate feature-based recurrent neural networks to generate continuous novel views from fisheye datasets. Other NeRF methods for fisheye images, such as SCNeRF and OMNI-NeRF, use projected ray distance loss for distorted pose refinement, causing severe artifacts, long rendering time, and are difficult to u",
    "path": "papers/24/08/2408.01878.json",
    "total_tokens": 740,
    "translated_title": "FBINeRF: 基于特征的递归神经网络集成方法用于鱼眼和标头神经辐射场",
    "translated_abstract": "我们已经在前面的研究中展示了优化和调整相机姿势的能力，比如使用基于神经辐射场的BARF和DBARF方法，为标头相机姿势的优化提供了一种有效的解决方案，但是这些方法并不能很好地处理包括鱼眼相机在内的各种相机类型的图像失真问题。此外，在DBARF方法中，初始深度值的误差会影响最终结果的收敛性和准确性。在本研究中，我们提出了一种自适应的GRU单元以及一种灵活的调整方法来解决斜径失真等问题，并采用基于特征的递归神经网络来从鱼眼相机图像数据集中生成连续的新图像。其他针对鱼眼相机图像的NeRF方法，如SCNeRF和OMNI-NeRF，使用了投影光束距离损失来细化失真姿势，这导致了严重的图像失真、较长的渲染时间和难以理解的计算过程。相比之下，我们的方法采用了一个新颖的封装光束损失函数，它不仅能够处理斜径失真，而且能够通过递归网络有效地集成特征信息，从而在保持图像细节的同时提高收敛速度和重建质量。",
    "tldr": "This study introduces FBINeRF, a novel technique integrating feature-based recurrent neural networks with adaptive GRUs for improved camera pose adjustment in capturing 3D scenes, especially for fisheye cameras, offering faster convergence and higher reconstruction quality relative to existing methods.",
    "en_tdlr": "This work presents FBINeRF, a cutting-edge method that combines feature-driven recurrent neural networks with adaptive GRUs for enhanced camera pose optimization, particularly for fisheye photography, outperforming existing techniques in terms of convergence speed and scene reconstruction quality."
}