{
    "title": "Enhancing Online Road Network Perception and Reasoning with Standard Definition Maps",
    "abstract": "arXiv:2408.01471v1 Announce Type: cross  Abstract: Autonomous driving for urban and highway driving applications often requires High Definition (HD) maps to generate a navigation plan. Nevertheless, various challenges arise when generating and maintaining HD maps at scale. While recent online mapping methods have started to emerge, their performance especially for longer ranges is limited by heavy occlusion in dynamic environments. With these considerations in mind, our work focuses on leveraging lightweight and scalable priors-Standard Definition (SD) maps-in the development of online vectorized HD map representations. We first examine the integration of prototypical rasterized SD map representations into various online mapping architectures. Furthermore, to identify lightweight strategies, we extend the OpenLane-V2 dataset with OpenStreetMaps and evaluate the benefits of graphical SD map representations. A key finding from designing SD map integration components is that SD map encode",
    "link": "https://arxiv.org/abs/2408.01471",
    "context": "Title: Enhancing Online Road Network Perception and Reasoning with Standard Definition Maps\nAbstract: arXiv:2408.01471v1 Announce Type: cross  Abstract: Autonomous driving for urban and highway driving applications often requires High Definition (HD) maps to generate a navigation plan. Nevertheless, various challenges arise when generating and maintaining HD maps at scale. While recent online mapping methods have started to emerge, their performance especially for longer ranges is limited by heavy occlusion in dynamic environments. With these considerations in mind, our work focuses on leveraging lightweight and scalable priors-Standard Definition (SD) maps-in the development of online vectorized HD map representations. We first examine the integration of prototypical rasterized SD map representations into various online mapping architectures. Furthermore, to identify lightweight strategies, we extend the OpenLane-V2 dataset with OpenStreetMaps and evaluate the benefits of graphical SD map representations. A key finding from designing SD map integration components is that SD map encode",
    "path": "papers/24/08/2408.01471.json",
    "total_tokens": 384,
    "tldr": "该文章创新性地提出了利用标准定义地图（SD）作为先验知识，以增强在线道路网络感知和推理能力。通过将SD地图的rasterized表示集成到不同的在线映射架构中，并扩展OpenLane-V2数据集以结合OpenStreetMaps，研究者发现了一种有利的图形SD地图表示，能够为自动车辆在城市和高速公路环境下导航提供更准确的HD地图。本文的主要贡献在于展示了如何利用轻量级的SD地图策略，提高在线映射系统对于动态环境中大量遮挡的适应性。"
}