{
    "title": "A First Look at Chebyshev-Sobolev Series for Digital Ink",
    "abstract": "arXiv:2408.02135v1 Announce Type: new  Abstract: Considering digital ink as plane curves provides a valuable framework for various applications, including signature verification, note-taking, and mathematical handwriting recognition. These plane curves can be obtained as parameterized pairs of approximating truncated series (x(s), y(s)) determined by sampled points. Earlier work has found that representing these truncated series (polynomials) in a Legendre or Legendre-Sobolev basis has a number of desirable properties. These include compact data representation, meaningful clustering of like symbols in the vector space of polynomial coefficients, linear separability of classes in this space, and highly efficient calculation of variation between curves. In this work, we take a first step at examining the use of Chebyshev-Sobolev series for symbol recognition. The early indication is that this representation may be superior to Legendre-Sobolev representation for some purposes.",
    "link": "https://arxiv.org/abs/2408.02135",
    "context": "Title: A First Look at Chebyshev-Sobolev Series for Digital Ink\nAbstract: arXiv:2408.02135v1 Announce Type: new  Abstract: Considering digital ink as plane curves provides a valuable framework for various applications, including signature verification, note-taking, and mathematical handwriting recognition. These plane curves can be obtained as parameterized pairs of approximating truncated series (x(s), y(s)) determined by sampled points. Earlier work has found that representing these truncated series (polynomials) in a Legendre or Legendre-Sobolev basis has a number of desirable properties. These include compact data representation, meaningful clustering of like symbols in the vector space of polynomial coefficients, linear separability of classes in this space, and highly efficient calculation of variation between curves. In this work, we take a first step at examining the use of Chebyshev-Sobolev series for symbol recognition. The early indication is that this representation may be superior to Legendre-Sobolev representation for some purposes.",
    "path": "papers/24/08/2408.02135.json",
    "total_tokens": 689,
    "translated_title": "关于切比雪夫-索布列夫级数对数字墨的初步研究",
    "translated_abstract": "arXiv:2408.02135v1 公告类型：新  摘要：将数字墨视为平面曲线为各种应用提供了有价值的框架，包括签名验证、笔记编写和数学手写识别。这些平面曲线可以通过采样点确定的简化级数的参数化对 (x(s), y(s)) 获得。以前的工作已经发现，在这些简化级数（多项式）中采用拉格朗日或拉格朗日-索布列夫基具有许多理想的属性。这些属性包括数据表示的紧凑性、同种符号在多项式系数矢量空间中的有意义聚类、该空间中类间的线性可分离性，以及该空间中曲线之间变异性的高效计算。在这项工作中，我们迈出了探索切比雪夫-索布列夫级数在符号识别中应用的第一步。早期的迹象表明，这种表示对于某些目的来说可能优于拉格朗日-索布列夫表示。",
    "tldr": "本文探讨了使用切比雪夫-索布列夫级数对数字墨的初步研究，发现了这种表示方法可能在某些方面优于拉格朗日-索布列夫级数对数字墨表示。"
}