{
    "title": "PRISM: PRogressive dependency maxImization for Scale-invariant image Matching",
    "abstract": "arXiv:2408.03598v1 Announce Type: new  Abstract: Image matching aims at identifying corresponding points between a pair of images. Currently, detector-free methods have shown impressive performance in challenging scenarios, thanks to their capability of generating dense matches and global receptive field. However, performing feature interaction and proposing matches across the entire image is unnecessary, because not all image regions contribute to the matching process. Interacting and matching in unmatchable areas can introduce errors, reducing matching accuracy and efficiency. Meanwhile, the scale discrepancy issue still troubles existing methods. To address above issues, we propose PRogressive dependency maxImization for Scale-invariant image Matching (PRISM), which jointly prunes irrelevant patch features and tackles the scale discrepancy. To do this, we firstly present a Multi-scale Pruning Module (MPM) to adaptively prune irrelevant features by maximizing the dependency between t",
    "link": "https://arxiv.org/abs/2408.03598",
    "context": "Title: PRISM: PRogressive dependency maxImization for Scale-invariant image Matching\nAbstract: arXiv:2408.03598v1 Announce Type: new  Abstract: Image matching aims at identifying corresponding points between a pair of images. Currently, detector-free methods have shown impressive performance in challenging scenarios, thanks to their capability of generating dense matches and global receptive field. However, performing feature interaction and proposing matches across the entire image is unnecessary, because not all image regions contribute to the matching process. Interacting and matching in unmatchable areas can introduce errors, reducing matching accuracy and efficiency. Meanwhile, the scale discrepancy issue still troubles existing methods. To address above issues, we propose PRogressive dependency maxImization for Scale-invariant image Matching (PRISM), which jointly prunes irrelevant patch features and tackles the scale discrepancy. To do this, we firstly present a Multi-scale Pruning Module (MPM) to adaptively prune irrelevant features by maximizing the dependency between t",
    "path": "papers/24/08/2408.03598.json",
    "total_tokens": 323,
    "tldr": "该文章提出了一种新的方法PRISM（PRogressive dependency maxImization for Scale-invariant image Matching），该方法通过渐进式依赖最大化来解决尺度不变图像匹配中的问题，提高了匹配的准确性和效率。"
}