{
    "title": "PanoFree: Tuning-Free Holistic Multi-view Image Generation with Cross-view Self-Guidance",
    "abstract": "arXiv:2408.02157v1 Announce Type: new  Abstract: Immersive scene generation, notably panorama creation, benefits significantly from the adaptation of large pre-trained text-to-image (T2I) models for multi-view image generation. Due to the high cost of acquiring multi-view images, tuning-free generation is preferred. However, existing methods are either limited to simple correspondences or require extensive fine-tuning to capture complex ones. We present PanoFree, a novel method for tuning-free multi-view image generation that supports an extensive array of correspondences. PanoFree sequentially generates multi-view images using iterative warping and inpainting, addressing the key issues of inconsistency and artifacts from error accumulation without the need for fine-tuning. It improves error accumulation by enhancing cross-view awareness and refines the warping and inpainting processes via cross-view guidance, risky area estimation and erasing, and symmetric bidirectional guided genera",
    "link": "https://arxiv.org/abs/2408.02157",
    "context": "Title: PanoFree: Tuning-Free Holistic Multi-view Image Generation with Cross-view Self-Guidance\nAbstract: arXiv:2408.02157v1 Announce Type: new  Abstract: Immersive scene generation, notably panorama creation, benefits significantly from the adaptation of large pre-trained text-to-image (T2I) models for multi-view image generation. Due to the high cost of acquiring multi-view images, tuning-free generation is preferred. However, existing methods are either limited to simple correspondences or require extensive fine-tuning to capture complex ones. We present PanoFree, a novel method for tuning-free multi-view image generation that supports an extensive array of correspondences. PanoFree sequentially generates multi-view images using iterative warping and inpainting, addressing the key issues of inconsistency and artifacts from error accumulation without the need for fine-tuning. It improves error accumulation by enhancing cross-view awareness and refines the warping and inpainting processes via cross-view guidance, risky area estimation and erasing, and symmetric bidirectional guided genera",
    "path": "papers/24/08/2408.02157.json",
    "total_tokens": 389,
    "tldr": "该文章提出了一种名为PanoFree的无须微调的全局多视图图像生成方法，采用跨视图自我指导来处理复杂的视图对应关系。该方法通过迭代地执行视图之间的变换和插值，解决了累积误差带来的不一致和伪像问题，并通过增强跨视图意识和改进插值和变换过程，以及使用对称的双向引导策略，显著提高了图像生成的质量。"
}