{
    "title": "Estimating Environmental Cost Throughout Model's Adaptive Life Cycle",
    "abstract": "arXiv:2408.01446v1 Announce Type: cross  Abstract: With the rapid increase in the research, development, and application of neural networks in the current era, there is a proportional increase in the energy needed to train and use models. Crucially, this is accompanied by the increase in carbon emissions into the environment. A sustainable and socially beneficial approach to reducing the carbon footprint and rising energy demands associated with the modern age of AI/deep learning is the adaptive and continuous reuse of models with regard to changes in the environment of model deployment or variations/changes in the input data. In this paper, we propose PreIndex, a predictive index to estimate the environmental and compute resources associated with model retraining to distributional shifts in data. PreIndex can be used to estimate environmental costs such as carbon emissions and energy usage when retraining from current data distribution to new data distribution. It also correlates with",
    "link": "https://arxiv.org/abs/2408.01446",
    "context": "Title: Estimating Environmental Cost Throughout Model's Adaptive Life Cycle\nAbstract: arXiv:2408.01446v1 Announce Type: cross  Abstract: With the rapid increase in the research, development, and application of neural networks in the current era, there is a proportional increase in the energy needed to train and use models. Crucially, this is accompanied by the increase in carbon emissions into the environment. A sustainable and socially beneficial approach to reducing the carbon footprint and rising energy demands associated with the modern age of AI/deep learning is the adaptive and continuous reuse of models with regard to changes in the environment of model deployment or variations/changes in the input data. In this paper, we propose PreIndex, a predictive index to estimate the environmental and compute resources associated with model retraining to distributional shifts in data. PreIndex can be used to estimate environmental costs such as carbon emissions and energy usage when retraining from current data distribution to new data distribution. It also correlates with",
    "path": "papers/24/08/2408.01446.json",
    "total_tokens": 622,
    "translated_title": "一种新的神经网络环境成本估计模型及其在适应性生命周期中的应用",
    "translated_abstract": "arXiv:2408.01446v1 公告类型: 交叉  翻译摘要: 随着神经网络在当前时代的快速发展，需要越来越多的能源来训练和使用模型。特别是，这伴随着碳排放到环境中的增加。为了减少人工智能/深度学习时代的碳足迹以及相关的能源需求，我们提出了一种模型再培训的预测指数，PreIndex，以估计与模型再培训相关的环境成本，如碳排放和能源消耗。模型再培训是为了适应数据分布的变化或在数据分布之间的变化/差异。PreIndex指数可以用来估算从当前数据分布到新数据分布的重新训练的成本，它也与Model的适应性生命周期有关。我们的研究旨在为模型的适应性生命周期的设计提供支持，从而帮助降低再培训的成本和环境影响。",
    "tldr": "本文提出了一种预测指数PreIndex，用来估计在模型适应性生命周期的再培训过程中，从当前数据分布到新数据分布的变化中，所涉及的环境成本（如碳排放和能源消耗）。"
}