{
    "title": "LR-Net: A Lightweight and Robust Network for Infrared Small Target Detection",
    "abstract": "arXiv:2408.02780v1 Announce Type: new  Abstract: Limited by equipment limitations and the lack of target intrinsic features, existing infrared small target detection methods have difficulty meeting actual comprehensive performance requirements. Therefore, we propose an innovative lightweight and robust network (LR-Net), which abandons the complex structure and achieves an effective balance between detection accuracy and resource consumption. Specifically, to ensure the lightweight and robustness, on the one hand, we construct a lightweight feature extraction attention (LFEA) module, which can fully extract target features and strengthen information interaction across channels. On the other hand, we construct a simple refined feature transfer (RFT) module. Compared with direct cross-layer connections, the RFT module can improve the network's feature refinement extraction capability with little resource consumption. Meanwhile, to solve the problem of small target loss in high-level featu",
    "link": "https://arxiv.org/abs/2408.02780",
    "context": "Title: LR-Net: A Lightweight and Robust Network for Infrared Small Target Detection\nAbstract: arXiv:2408.02780v1 Announce Type: new  Abstract: Limited by equipment limitations and the lack of target intrinsic features, existing infrared small target detection methods have difficulty meeting actual comprehensive performance requirements. Therefore, we propose an innovative lightweight and robust network (LR-Net), which abandons the complex structure and achieves an effective balance between detection accuracy and resource consumption. Specifically, to ensure the lightweight and robustness, on the one hand, we construct a lightweight feature extraction attention (LFEA) module, which can fully extract target features and strengthen information interaction across channels. On the other hand, we construct a simple refined feature transfer (RFT) module. Compared with direct cross-layer connections, the RFT module can improve the network's feature refinement extraction capability with little resource consumption. Meanwhile, to solve the problem of small target loss in high-level featu",
    "path": "papers/24/08/2408.02780.json",
    "total_tokens": 335,
    "tldr": "该文章提出了一个轻量级且鲁棒的红外小目标检测网络LR-Net，通过构建轻量级的特征提取注意力模块和简单的特征细化传输模块，实现了对目标特征的有效提取和信息交流，显著提高了网络的特征精细提取能力，同时在资源消耗上取得了较好的平衡。"
}