{
    "title": "Learning with Digital Agents: An Analysis based on the Activity Theory",
    "abstract": "arXiv:2408.04304v1 Announce Type: cross  Abstract: Digital agents are considered a general-purpose technology. They spread quickly in private and organizational contexts, including education. Yet, research lacks a conceptual framing to describe interaction with such agents in a holistic manner. While focusing on the interaction with a pedagogical agent, i.e., a digital agent capable of natural-language interaction with a learner, we propose a model of learning activity based on activity theory. We use this model and a review of prior research on digital agents in education to analyze how various characteristics of the activity, including features of a pedagogical agent or learner, influence learning outcomes. The analysis leads to identification of IS research directions and guidance for developers of pedagogical agents and digital agents in general. We conclude by extending the activity theory-based model beyond the context of education and show how it helps designers and researchers ",
    "link": "https://arxiv.org/abs/2408.04304",
    "context": "Title: Learning with Digital Agents: An Analysis based on the Activity Theory\nAbstract: arXiv:2408.04304v1 Announce Type: cross  Abstract: Digital agents are considered a general-purpose technology. They spread quickly in private and organizational contexts, including education. Yet, research lacks a conceptual framing to describe interaction with such agents in a holistic manner. While focusing on the interaction with a pedagogical agent, i.e., a digital agent capable of natural-language interaction with a learner, we propose a model of learning activity based on activity theory. We use this model and a review of prior research on digital agents in education to analyze how various characteristics of the activity, including features of a pedagogical agent or learner, influence learning outcomes. The analysis leads to identification of IS research directions and guidance for developers of pedagogical agents and digital agents in general. We conclude by extending the activity theory-based model beyond the context of education and show how it helps designers and researchers ",
    "path": "papers/24/08/2408.04304.json",
    "total_tokens": 312,
    "tldr": "该文章创新性地提出了一个基于活动理论的模型，用于分析数字代理在与学习者互动中的学习活动特点，并指出了数字代理的教育应用对学习成果的影响。"
}