{
    "title": "Reporting and Analysing the Environmental Impact of Language Models on the Example of Commonsense Question Answering with External Knowledge",
    "abstract": "arXiv:2408.01453v1 Announce Type: cross  Abstract: Human-produced emissions are growing at an alarming rate, causing already observable changes in the climate and environment in general. Each year global carbon dioxide emissions hit a new record, and it is reported that 0.5% of total US greenhouse gas emissions are attributed to data centres as of 2021. The release of ChatGPT in late 2022 sparked social interest in Large Language Models (LLMs), the new generation of Language Models with a large number of parameters and trained on massive amounts of data. Currently, numerous companies are releasing products featuring various LLMs, with many more models in development and awaiting release. Deep Learning research is a competitive field, with only models that reach top performance attracting attention and being utilized. Hence, achieving better accuracy and results is often the first priority, while the model's efficiency and the environmental impact of the study are neglected. However, LL",
    "link": "https://arxiv.org/abs/2408.01453",
    "context": "Title: Reporting and Analysing the Environmental Impact of Language Models on the Example of Commonsense Question Answering with External Knowledge\nAbstract: arXiv:2408.01453v1 Announce Type: cross  Abstract: Human-produced emissions are growing at an alarming rate, causing already observable changes in the climate and environment in general. Each year global carbon dioxide emissions hit a new record, and it is reported that 0.5% of total US greenhouse gas emissions are attributed to data centres as of 2021. The release of ChatGPT in late 2022 sparked social interest in Large Language Models (LLMs), the new generation of Language Models with a large number of parameters and trained on massive amounts of data. Currently, numerous companies are releasing products featuring various LLMs, with many more models in development and awaiting release. Deep Learning research is a competitive field, with only models that reach top performance attracting attention and being utilized. Hence, achieving better accuracy and results is often the first priority, while the model's efficiency and the environmental impact of the study are neglected. However, LL",
    "path": "papers/24/08/2408.01453.json",
    "total_tokens": 346,
    "tldr": "该文章创新性地探讨了大型语言模型在常识问答任务中使用外部知识的影响，通过案例研究分析了这些模型对环境的影响，强调了在推动模型性能的同时必须注意其能源消耗和温室气体排放问题。"
}