{
    "title": "Within-vector viral dynamics challenges how to model the extrinsic incubation period for major arboviruses: dengue, Zika, and chikungunya",
    "abstract": "arXiv:2408.00409v2 Announce Type: replace  Abstract: Arboviruses represent a significant threat to human, animal, and plant health worldwide. To elucidate transmission, anticipate their spread and efficiently control them, mechanistic modelling has proven its usefulness. However, most models rely on assumptions about how the extrinsic incubation period (EIP) is represented: the intra-vector viral dynamics (IVD), occurring during the EIP, is approximated by a single state. After an average duration, all exposed vectors become infectious. Behind this are hidden two strong hypotheses: (i) EIP is exponentially distributed in the vector population; (ii) viruses successfully cross the infection, dissemination, and transmission barriers in all exposed vectors. To assess these hypotheses, we developed a stochastic compartmental model which represents successive IVD stages, associated to the crossing or not of these three barriers. We calibrated the model using an ABC-SMC (Approximate Bayesian ",
    "link": "https://arxiv.org/abs/2408.00409",
    "context": "Title: Within-vector viral dynamics challenges how to model the extrinsic incubation period for major arboviruses: dengue, Zika, and chikungunya\nAbstract: arXiv:2408.00409v2 Announce Type: replace  Abstract: Arboviruses represent a significant threat to human, animal, and plant health worldwide. To elucidate transmission, anticipate their spread and efficiently control them, mechanistic modelling has proven its usefulness. However, most models rely on assumptions about how the extrinsic incubation period (EIP) is represented: the intra-vector viral dynamics (IVD), occurring during the EIP, is approximated by a single state. After an average duration, all exposed vectors become infectious. Behind this are hidden two strong hypotheses: (i) EIP is exponentially distributed in the vector population; (ii) viruses successfully cross the infection, dissemination, and transmission barriers in all exposed vectors. To assess these hypotheses, we developed a stochastic compartmental model which represents successive IVD stages, associated to the crossing or not of these three barriers. We calibrated the model using an ABC-SMC (Approximate Bayesian ",
    "path": "papers/24/08/2408.00409.json",
    "total_tokens": 385,
    "tldr": "用户输入内容中最重要的创新和贡献总结为：开发了一个考虑连续内部感染期（intra-vector viral dynamics）阶段的模型，挑战了传统模型中对阿夫洛病毒（如登革热、寨卡和基孔肯雅病毒）的传播机制的假设，包括对外延潜伏期（extrinsic incubation period）的简化表示和病毒在宿主间传播时的成功率假设。"
}