{
    "title": "Online Detection of Anomalies in Temporal Knowledge Graphs with Interpretability",
    "abstract": "arXiv:2408.00872v1 Announce Type: new  Abstract: Temporal knowledge graphs (TKGs) are valuable resources for capturing evolving relationships among entities, yet they are often plagued by noise, necessitating robust anomaly detection mechanisms. Existing dynamic graph anomaly detection approaches struggle to capture the rich semantics introduced by node and edge categories within TKGs, while TKG embedding methods lack interpretability, undermining the credibility of anomaly detection. Moreover, these methods falter in adapting to pattern changes and semantic drifts resulting from knowledge updates. To tackle these challenges, we introduce AnoT, an efficient TKG summarization method tailored for interpretable online anomaly detection in TKGs. AnoT begins by summarizing a TKG into a novel rule graph, enabling flexible inference of complex patterns in TKGs. When new knowledge emerges, AnoT maps it onto a node in the rule graph and traverses the rule graph recursively to derive the anomaly",
    "link": "https://arxiv.org/abs/2408.00872",
    "context": "Title: Online Detection of Anomalies in Temporal Knowledge Graphs with Interpretability\nAbstract: arXiv:2408.00872v1 Announce Type: new  Abstract: Temporal knowledge graphs (TKGs) are valuable resources for capturing evolving relationships among entities, yet they are often plagued by noise, necessitating robust anomaly detection mechanisms. Existing dynamic graph anomaly detection approaches struggle to capture the rich semantics introduced by node and edge categories within TKGs, while TKG embedding methods lack interpretability, undermining the credibility of anomaly detection. Moreover, these methods falter in adapting to pattern changes and semantic drifts resulting from knowledge updates. To tackle these challenges, we introduce AnoT, an efficient TKG summarization method tailored for interpretable online anomaly detection in TKGs. AnoT begins by summarizing a TKG into a novel rule graph, enabling flexible inference of complex patterns in TKGs. When new knowledge emerges, AnoT maps it onto a node in the rule graph and traverses the rule graph recursively to derive the anomaly",
    "path": "papers/24/08/2408.00872.json",
    "total_tokens": 639,
    "translated_title": "时序知识图异常检测方法及其可解释性",
    "translated_abstract": "时序知识图（TKGs）对于捕捉实体之间的演变关系非常宝贵，但往往充斥着噪声，因此需要强大的异常检测机制。现有的动态图异常检测方法在捕捉TKGs中节点和边类的丰富语义方面遇到挑战，而TKG嵌入方法的可解释性不足，削弱了异常检测的可靠性。此外，这些方法在适应因知识更新而导致的模式变化和语义漂移方面也表现不佳。为了解决这些挑战，我们引入了AnoT，一种针对TKG的高效可解释性在线异常检测方法。AnoT首先将TKG总结为一种新的规则图，从而能够在TKGs中灵活地推断出复杂的模式。当新的知识出现时，AnoT将它映射到规则图中的一个节点上，并递归地遍历规则图来推导出异常。",
    "tldr": "AnoT通过将时序知识图转换成规则图，提供了一种易理解和可解释的在线异常检测方法，它可以适应知识更新的模式变化和语义漂移。",
    "en_tdlr": "AnoT transforms temporal knowledge graphs into rule graphs and provides an online anomaly detection method that is interpretable, adaptable to changes in pattern and drift in semantics due to knowledge updates."
}