{
    "title": "Multi-Scale Cell Decomposition for Path Planning using Restrictive Routing Potential Fields",
    "abstract": "arXiv:2408.02786v1 Announce Type: new  Abstract: In burgeoning domains, like urban goods distribution, the advent of aerial cargo transportation necessitates the development of routing solutions that prioritize safety. This paper introduces Larp, a novel path planning framework that leverages the concept of restrictive potential fields to forge routes demonstrably safer than those derived from existing methods. The algorithm achieves it by segmenting a potential field into a hierarchy of cells, each with a designated restriction zone determined by obstacle proximity. While the primary impetus behind Larp is to enhance the safety of aerial pathways for cargo-carrying Unmanned Aerial Vehicles (UAVs), its utility extends to a wide array of path planning scenarios. Comparative analyses with both established and contemporary potential field-based methods reveal Larp's proficiency in maintaining a safe distance from restrictions and its adeptness in circumventing local minima.",
    "link": "https://arxiv.org/abs/2408.02786",
    "context": "Title: Multi-Scale Cell Decomposition for Path Planning using Restrictive Routing Potential Fields\nAbstract: arXiv:2408.02786v1 Announce Type: new  Abstract: In burgeoning domains, like urban goods distribution, the advent of aerial cargo transportation necessitates the development of routing solutions that prioritize safety. This paper introduces Larp, a novel path planning framework that leverages the concept of restrictive potential fields to forge routes demonstrably safer than those derived from existing methods. The algorithm achieves it by segmenting a potential field into a hierarchy of cells, each with a designated restriction zone determined by obstacle proximity. While the primary impetus behind Larp is to enhance the safety of aerial pathways for cargo-carrying Unmanned Aerial Vehicles (UAVs), its utility extends to a wide array of path planning scenarios. Comparative analyses with both established and contemporary potential field-based methods reveal Larp's proficiency in maintaining a safe distance from restrictions and its adeptness in circumventing local minima.",
    "path": "papers/24/08/2408.02786.json",
    "total_tokens": 355,
    "tldr": "该文章提出了一种新型的路径规划框架Larp，它通过将潜在场分割成具有不同障碍物距离限制区的高级层次细胞来提高路径的安全性。与现有方法相比，Larp在避免局部最小值和保证远离障碍物方面表现出更高的效率，显着提升了数十亿领域中无人机运输的安全性。"
}