{
    "title": "Compositional Physical Reasoning of Objects and Events from Videos",
    "abstract": "arXiv:2408.02687v1 Announce Type: new  Abstract: Understanding and reasoning about objects' physical properties in the natural world is a fundamental challenge in artificial intelligence. While some properties like colors and shapes can be directly observed, others, such as mass and electric charge, are hidden from the objects' visual appearance. This paper addresses the unique challenge of inferring these hidden physical properties from objects' motion and interactions and predicting corresponding dynamics based on the inferred physical properties. We first introduce the Compositional Physical Reasoning (ComPhy) dataset. For a given set of objects, ComPhy includes limited videos of them moving and interacting under different initial conditions. The model is evaluated based on its capability to unravel the compositional hidden properties, such as mass and charge, and use this knowledge to answer a set of questions. Besides the synthetic videos from simulators, we also collect a real-wo",
    "link": "https://arxiv.org/abs/2408.02687",
    "context": "Title: Compositional Physical Reasoning of Objects and Events from Videos\nAbstract: arXiv:2408.02687v1 Announce Type: new  Abstract: Understanding and reasoning about objects' physical properties in the natural world is a fundamental challenge in artificial intelligence. While some properties like colors and shapes can be directly observed, others, such as mass and electric charge, are hidden from the objects' visual appearance. This paper addresses the unique challenge of inferring these hidden physical properties from objects' motion and interactions and predicting corresponding dynamics based on the inferred physical properties. We first introduce the Compositional Physical Reasoning (ComPhy) dataset. For a given set of objects, ComPhy includes limited videos of them moving and interacting under different initial conditions. The model is evaluated based on its capability to unravel the compositional hidden properties, such as mass and charge, and use this knowledge to answer a set of questions. Besides the synthetic videos from simulators, we also collect a real-wo",
    "path": "papers/24/08/2408.02687.json",
    "total_tokens": 355,
    "tldr": "该文章提出了一个Compositional Physical Reasoning (ComPhy)数据集，旨在通过有限的视频内容让模型能够推断出对象的物理属性（如质量和电荷），并预测这些属性在交互中的动态效果。此外，研究还评价了模型回答相关问题的能力。通过训练和测试模型，该方法在理解和模拟自然界的物理过程方面显示出潜在的贡献。"
}