{
    "title": "Medical Graph RAG: Towards Safe Medical Large Language Model via Graph Retrieval-Augmented Generation",
    "abstract": "arXiv:2408.04187v1 Announce Type: new  Abstract: We introduce a novel graph-based Retrieval-Augmented Generation (RAG) framework specifically designed for the medical domain, called \\textbf{MedGraphRAG}, aimed at enhancing Large Language Model (LLM) capabilities and generating evidence-based results, thereby improving safety and reliability when handling private medical data. Our comprehensive pipeline begins with a hybrid static-semantic approach to document chunking, significantly improving context capture over traditional methods. Extracted entities are used to create a three-tier hierarchical graph structure, linking entities to foundational medical knowledge sourced from medical papers and dictionaries. These entities are then interconnected to form meta-graphs, which are merged based on semantic similarities to develop a comprehensive global graph. This structure supports precise information retrieval and response generation. The retrieval process employs a U-retrieve method to b",
    "link": "https://arxiv.org/abs/2408.04187",
    "context": "Title: Medical Graph RAG: Towards Safe Medical Large Language Model via Graph Retrieval-Augmented Generation\nAbstract: arXiv:2408.04187v1 Announce Type: new  Abstract: We introduce a novel graph-based Retrieval-Augmented Generation (RAG) framework specifically designed for the medical domain, called \\textbf{MedGraphRAG}, aimed at enhancing Large Language Model (LLM) capabilities and generating evidence-based results, thereby improving safety and reliability when handling private medical data. Our comprehensive pipeline begins with a hybrid static-semantic approach to document chunking, significantly improving context capture over traditional methods. Extracted entities are used to create a three-tier hierarchical graph structure, linking entities to foundational medical knowledge sourced from medical papers and dictionaries. These entities are then interconnected to form meta-graphs, which are merged based on semantic similarities to develop a comprehensive global graph. This structure supports precise information retrieval and response generation. The retrieval process employs a U-retrieve method to b",
    "path": "papers/24/08/2408.04187.json",
    "total_tokens": 437,
    "tldr": "该文章提出了一种名为MedGraphRAG的医学领域特定的大型语言模型生成框架，通过图检索增强生成方法，旨在提高处理敏感医疗信息的安全性和可靠性。该框架采用了一种结合静态和语义方法的分块技术，提高了上下文信息的捕获能力。提取的实体被用于创建一个三级层次的图结构，将实体与来自医学论文和词典的基础医学知识相连接。这些实体被相互连接形成元图，这些元图根据语义相似性合并为一个全球性的图结构，支持精确的信息检索和响应生成。检索过程使用了一种名为U-retrieve的方法，以实现更高的检索效率和准确性，并通过这种方法增强生成模型的知识表示能力，确保生成结果的可靠性和相关性。"
}