{
    "title": "In-Depth Analysis of Emotion Recognition through Knowledge-Based Large Language Models",
    "abstract": "arXiv:2408.00780v1 Announce Type: cross  Abstract: Emotion recognition in social situations is a complex task that requires integrating information from both facial expressions and the situational context. While traditional approaches to automatic emotion recognition have focused on decontextualized signals, recent research emphasizes the importance of context in shaping emotion perceptions. This paper contributes to the emerging field of context-based emotion recognition by leveraging psychological theories of human emotion perception to inform the design of automated methods. We propose an approach that combines emotion recognition methods with Bayesian Cue Integration (BCI) to integrate emotion inferences from decontextualized facial expressions and contextual knowledge inferred via Large-language Models. We test this approach in the context of interpreting facial expressions during a social task, the prisoner's dilemma. Our results provide clear support for BCI across a range of au",
    "link": "https://arxiv.org/abs/2408.00780",
    "context": "Title: In-Depth Analysis of Emotion Recognition through Knowledge-Based Large Language Models\nAbstract: arXiv:2408.00780v1 Announce Type: cross  Abstract: Emotion recognition in social situations is a complex task that requires integrating information from both facial expressions and the situational context. While traditional approaches to automatic emotion recognition have focused on decontextualized signals, recent research emphasizes the importance of context in shaping emotion perceptions. This paper contributes to the emerging field of context-based emotion recognition by leveraging psychological theories of human emotion perception to inform the design of automated methods. We propose an approach that combines emotion recognition methods with Bayesian Cue Integration (BCI) to integrate emotion inferences from decontextualized facial expressions and contextual knowledge inferred via Large-language Models. We test this approach in the context of interpreting facial expressions during a social task, the prisoner's dilemma. Our results provide clear support for BCI across a range of au",
    "path": "papers/24/08/2408.00780.json",
    "total_tokens": 618,
    "translated_title": "深度分析通过知识驱动的大型语言模型进行情绪识别",
    "translated_abstract": "arXiv:2408.00780v1 公告类型：交叉 摘要：社交情境中的情绪识别是一项复杂的工作，它需要整合面部表情和情境上下文的信息。尽管自动情绪识别的传统方法专注于脱情境的信号，但最近的研究强调了情境在塑造情绪感知中的重要性。本文对新兴的社会情境下的情绪识别这一领域做出了贡献，通过心理学的情绪感知理论来指导自动方法的设计。我们提出了一个结合了情绪识别方法和贝叶斯线索整合（BCI）的方法，以整合面部表情的脱情境信息和通过大型语言模型获得的情境知识。我们在囚徒困境这一社会任务的情境下测试了这个方法。我们的结果在各种主观情感评估测试中对BCI提供了明确的支撑。",
    "tldr": "本研究提出了一种结合情绪识别方法和贝叶斯线索整合的方法，利用大型语言模型获得的情境知识来提高在社交情境中分析面部表情的准确性，并在囚徒困境这一社会任务中得到了验证。"
}