{
    "title": "Hierarchical Neural Constructive Solver for Real-world TSP Scenarios",
    "abstract": "arXiv:2408.03585v1 Announce Type: cross  Abstract: Existing neural constructive solvers for routing problems have predominantly employed transformer architectures, conceptualizing the route construction as a set-to-sequence learning task. However, their efficacy has primarily been demonstrated on entirely random problem instances that inadequately capture real-world scenarios. In this paper, we introduce realistic Traveling Salesman Problem (TSP) scenarios relevant to industrial settings and derive the following insights: (1) The optimal next node (or city) to visit often lies within proximity to the current node, suggesting the potential benefits of biasing choices based on current locations. (2) Effectively solving the TSP requires robust tracking of unvisited nodes and warrants succinct grouping strategies. Building upon these insights, we propose integrating a learnable choice layer inspired by Hypernetworks to prioritize choices based on the current location, and a learnable appro",
    "link": "https://arxiv.org/abs/2408.03585",
    "context": "Title: Hierarchical Neural Constructive Solver for Real-world TSP Scenarios\nAbstract: arXiv:2408.03585v1 Announce Type: cross  Abstract: Existing neural constructive solvers for routing problems have predominantly employed transformer architectures, conceptualizing the route construction as a set-to-sequence learning task. However, their efficacy has primarily been demonstrated on entirely random problem instances that inadequately capture real-world scenarios. In this paper, we introduce realistic Traveling Salesman Problem (TSP) scenarios relevant to industrial settings and derive the following insights: (1) The optimal next node (or city) to visit often lies within proximity to the current node, suggesting the potential benefits of biasing choices based on current locations. (2) Effectively solving the TSP requires robust tracking of unvisited nodes and warrants succinct grouping strategies. Building upon these insights, we propose integrating a learnable choice layer inspired by Hypernetworks to prioritize choices based on the current location, and a learnable appro",
    "path": "papers/24/08/2408.03585.json",
    "total_tokens": 372,
    "tldr": "该文章聚焦于旅游推销问题的神经构造解决方案，为了解决实际问题中出现的与随机问题实例不同的挑战，研究者们提出了一种层次化的神经构造求解器，它能够更好地处理现实世界的场景。该求解器不仅考虑了当前位置，而且对未访问的节点进行了有效的管理，同时通过引入基于自编码器和Hypernetworks的机制对下一步的选择进行优先排序，从而提出了一种更为有效的构造解决方案的方法。"
}