{
    "title": "IDNet: A Novel Dataset for Identity Document Analysis and Fraud Detection",
    "abstract": "arXiv:2408.01690v1 Announce Type: new  Abstract: Effective fraud detection and analysis of government-issued identity documents, such as passports, driver's licenses, and identity cards, are essential in thwarting identity theft and bolstering security on online platforms. The training of accurate fraud detection and analysis tools depends on the availability of extensive identity document datasets. However, current publicly available benchmark datasets for identity document analysis, including MIDV-500, MIDV-2020, and FMIDV, fall short in several respects: they offer a limited number of samples, cover insufficient varieties of fraud patterns, and seldom include alterations in critical personal identifying fields like portrait images, limiting their utility in training models capable of detecting realistic frauds while preserving privacy.   In response to these shortcomings, our research introduces a new benchmark dataset, IDNet, designed to advance privacy-preserving fraud detection e",
    "link": "https://arxiv.org/abs/2408.01690",
    "context": "Title: IDNet: A Novel Dataset for Identity Document Analysis and Fraud Detection\nAbstract: arXiv:2408.01690v1 Announce Type: new  Abstract: Effective fraud detection and analysis of government-issued identity documents, such as passports, driver's licenses, and identity cards, are essential in thwarting identity theft and bolstering security on online platforms. The training of accurate fraud detection and analysis tools depends on the availability of extensive identity document datasets. However, current publicly available benchmark datasets for identity document analysis, including MIDV-500, MIDV-2020, and FMIDV, fall short in several respects: they offer a limited number of samples, cover insufficient varieties of fraud patterns, and seldom include alterations in critical personal identifying fields like portrait images, limiting their utility in training models capable of detecting realistic frauds while preserving privacy.   In response to these shortcomings, our research introduces a new benchmark dataset, IDNet, designed to advance privacy-preserving fraud detection e",
    "path": "papers/24/08/2408.01690.json",
    "total_tokens": 619,
    "translated_title": "IDNet: 一个用于身份文档分析和欺诈检测的新型数据集",
    "translated_abstract": "arXiv:2408.01690v1 公告类型: 新  翻译摘要: 在在线平台上挫败身份盗窃并加强安全，有效进行欺诈检测和对政府发行的身份文档(如护照、驾驶执照和身份证)的分析至关重要。训练准确的身份文档欺诈检测和分析工具依赖于大量身份文档数据集的可用性。然而，目前可公开获得的用于身份文档分析的基准数据集，包括MIDV-500、MIDV-2020和FMIDV，在多个方面存在缺陷：它们提供的样本数量有限，涉及的欺诈模式不足，而且很少包括对关键个人身份识别字段(如肖像图像)的更改，这限制了其在训练模型方面的实用性，这些模型能够检测真实生活中的欺诈行为，同时保护隐私。  为了回应这些不足，我们的研究引入了一个新的基准数据集——IDNet，旨在推进隐私保护的欺诈检测技术的进步。",
    "tldr": "本研究引入了一个新的数据集IDNet，旨在促进隐私保护的欺诈检测技术的进步。",
    "en_tdlr": "Our research introduces a new benchmark dataset, IDNet, designed to advance privacy-preserving fraud detection technologies."
}