{
    "title": "Individualized multi-horizon MRI trajectory prediction for Alzheimer's Disease",
    "abstract": "arXiv:2408.02018v1 Announce Type: new  Abstract: Neurodegeneration as measured through magnetic resonance imaging (MRI) is recognized as a potential biomarker for diagnosing Alzheimer's disease (AD), but is generally considered less specific than amyloid or tau based biomarkers. Due to a large amount of variability in brain anatomy between different individuals, we hypothesize that leveraging MRI time series can help improve specificity, by treating each patient as their own baseline. Here we turn to conditional variational autoencoders to generate individualized MRI predictions given the subject's age, disease status and one previous scan. Using serial imaging data from the Alzheimer's Disease Neuroimaging Initiative, we train a novel architecture to build a latent space distribution which can be sampled from to generate future predictions of changing anatomy. This enables us to extrapolate beyond the dataset and predict MRIs up to 10 years. We evaluated the model on a held-out set fr",
    "link": "https://arxiv.org/abs/2408.02018",
    "context": "Title: Individualized multi-horizon MRI trajectory prediction for Alzheimer's Disease\nAbstract: arXiv:2408.02018v1 Announce Type: new  Abstract: Neurodegeneration as measured through magnetic resonance imaging (MRI) is recognized as a potential biomarker for diagnosing Alzheimer's disease (AD), but is generally considered less specific than amyloid or tau based biomarkers. Due to a large amount of variability in brain anatomy between different individuals, we hypothesize that leveraging MRI time series can help improve specificity, by treating each patient as their own baseline. Here we turn to conditional variational autoencoders to generate individualized MRI predictions given the subject's age, disease status and one previous scan. Using serial imaging data from the Alzheimer's Disease Neuroimaging Initiative, we train a novel architecture to build a latent space distribution which can be sampled from to generate future predictions of changing anatomy. This enables us to extrapolate beyond the dataset and predict MRIs up to 10 years. We evaluated the model on a held-out set fr",
    "path": "papers/24/08/2408.02018.json",
    "total_tokens": 656,
    "translated_title": "个体化多时间线MRI轨迹预测用于阿尔茨海默病",
    "translated_abstract": "神经退行性改变通过磁共振成像（MRI）来测量，这是诊断阿尔茨海默病（AD）的一种潜在生物标志物，但其普遍认为不如淀粉样蛋白或tau生物标志物特异性。由于不同个体之间脑解剖结构的差异很大，我们假设利用MRI时间序列可以帮助提高特异性，即将每个患者视为其自身的基线。在这里，我们转向条件变分 Autoencoder 来生成个体化的MRI预测，这些预测基于患者的年龄、疾病状态和之前的扫描。使用阿尔茨海默病神经影像倡议（ADNI）的连续成像数据，我们训练了一个新的架构，以构建一个潜在空间分布，可以从该分布中抽样生成解剖结构变化的未来预测。这使我们可以超出数据集的范围进行外推，并对未来的MRI进行预测，最多可达10年。我们在一个保留的数据集中评估了模型，该数据集从未被用来训练或微调过模型。",
    "tldr": "本文通过使用条件变分AutoEncoder，构建了一个能在个体基础上进行MRI时间序列预测的模型，从而提高了阿尔茨海默病诊断的特异性。"
}