{
    "title": "Do Sharpness-based Optimizers Improve Generalization in Medical Image Analysis?",
    "abstract": "arXiv:2408.04065v1 Announce Type: cross  Abstract: Effective clinical deployment of deep learning models in healthcare demands high generalization performance to ensure accurate diagnosis and treatment planning. In recent years, significant research has focused on improving the generalization of deep learning models by regularizing the sharpness of the loss landscape. Among the optimization approaches that explicitly minimize sharpness, Sharpness-Aware Minimization (SAM) has shown potential in enhancing generalization performance on general domain image datasets. This success has led to the development of several advanced sharpness-based algorithms aimed at addressing the limitations of SAM, such as Adaptive SAM, surrogate-Gap SAM, Weighted SAM, and Curvature Regularized SAM. These sharpness-based optimizers have shown improvements in model generalization compared to conventional stochastic gradient descent optimizers and their variants on general domain image datasets, but they have n",
    "link": "https://arxiv.org/abs/2408.04065",
    "context": "Title: Do Sharpness-based Optimizers Improve Generalization in Medical Image Analysis?\nAbstract: arXiv:2408.04065v1 Announce Type: cross  Abstract: Effective clinical deployment of deep learning models in healthcare demands high generalization performance to ensure accurate diagnosis and treatment planning. In recent years, significant research has focused on improving the generalization of deep learning models by regularizing the sharpness of the loss landscape. Among the optimization approaches that explicitly minimize sharpness, Sharpness-Aware Minimization (SAM) has shown potential in enhancing generalization performance on general domain image datasets. This success has led to the development of several advanced sharpness-based algorithms aimed at addressing the limitations of SAM, such as Adaptive SAM, surrogate-Gap SAM, Weighted SAM, and Curvature Regularized SAM. These sharpness-based optimizers have shown improvements in model generalization compared to conventional stochastic gradient descent optimizers and their variants on general domain image datasets, but they have n",
    "path": "papers/24/08/2408.04065.json",
    "total_tokens": 365,
    "tldr": "该文章探索了通过优化损失函数景观的尖锐度来提升医疗图像分析中深度学习模型的泛化性能的可能性。通过比较不同类型的尖锐性校正优化器对在健康医疗应用中部署的深度学习模型泛化能力的潜在影响，研究揭示了尖锐性校正优化器在提高模型在图像数据集中的性能方面可能取得的改进。该研究成果对于优化医疗图像分析中深度学习模型的泛化能力具有重要意义。"
}