{
    "title": "Dynamics on invariant tori emerging through forced symmetry breaking in phase oscillator networks",
    "abstract": "arXiv:2408.02119v1 Announce Type: cross  Abstract: We consider synchrony patterns in coupled phase oscillator networks that correspond to invariant tori. For specific nongeneric coupling, these tori are equilibria relative to a continuous symmetry action. We analyze how the invariant tori deform under forced symmetry breaking as more general network interaction terms are introduced. We first show in general that perturbed tori that are relative equilibria can be computed using a parametrization method; this yields an asymptotic expansion of an embedding of the perturbed torus, as well as the local dynamics on the torus. We then apply this result to a coupled oscillator network, and we numerically study the dynamics on the persisting tori in the network by looking for bifurcations of their periodic orbits in a boundary-value-problem setup. This way we find new bifurcating stable synchrony patterns that can be the building blocks of larger global structures such as heteroclinic cycles.",
    "link": "https://arxiv.org/abs/2408.02119",
    "context": "Title: Dynamics on invariant tori emerging through forced symmetry breaking in phase oscillator networks\nAbstract: arXiv:2408.02119v1 Announce Type: cross  Abstract: We consider synchrony patterns in coupled phase oscillator networks that correspond to invariant tori. For specific nongeneric coupling, these tori are equilibria relative to a continuous symmetry action. We analyze how the invariant tori deform under forced symmetry breaking as more general network interaction terms are introduced. We first show in general that perturbed tori that are relative equilibria can be computed using a parametrization method; this yields an asymptotic expansion of an embedding of the perturbed torus, as well as the local dynamics on the torus. We then apply this result to a coupled oscillator network, and we numerically study the dynamics on the persisting tori in the network by looking for bifurcations of their periodic orbits in a boundary-value-problem setup. This way we find new bifurcating stable synchrony patterns that can be the building blocks of larger global structures such as heteroclinic cycles.",
    "path": "papers/24/08/2408.02119.json",
    "total_tokens": 481,
    "tldr": "Title: 失对称强迫打破动态网络中不变环面的涌现\n摘要：arXiv:2408.02119v1 公告类型：交汇 摘要：我们考虑耦合相位振荡器网络中的同步模式，这些模式对应于不变环面。对于非一般性的耦合情况，这些环面是对某个连续对称操作的平衡点。我们对如何在不完全对称打破（forced symmetry breaking）下计算不变环面的变形进行了分析。作为普遍网络交互项的引入，环面会变形。我们首先证明，在一般情况下，相对于平衡点的环面可以通过参数化方法进行计算；这种方法可以得到环面的嵌入，以及环面上的局部动力学。然后我们将这一成果应用于耦合振荡器网络，并在边界值问题设置中通过寻找周期轨道的分支来研究环面上的动力学。通过这种方式，我们找到了新的稳定同步模式，这些模式可以构成更复杂的全球结构，如纵断流通路循环。"
}