{
    "title": "Review of Cloud Service Composition for Intelligent Manufacturing",
    "abstract": "arXiv:2408.01795v1 Announce Type: new  Abstract: Intelligent manufacturing is a new model that uses advanced technologies such as the Internet of Things, big data, and artificial intelligence to improve the efficiency and quality of manufacturing production. As an important support to promote the transformation and upgrading of the manufacturing industry, cloud service optimization has received the attention of researchers. In recent years, remarkable research results have been achieved in this field. For the sustainability of intelligent manufacturing platforms, in this paper we summarize the process of cloud service optimization for intelligent manufacturing. Further, to address the problems of dispersed optimization indicators and nonuniform/unstandardized definitions in the existing research, 11 optimization indicators that take into account three-party participant subjects are defined from the urgent requirements of the sustainable development of intelligent manufacturing platform",
    "link": "https://arxiv.org/abs/2408.01795",
    "context": "Title: Review of Cloud Service Composition for Intelligent Manufacturing\nAbstract: arXiv:2408.01795v1 Announce Type: new  Abstract: Intelligent manufacturing is a new model that uses advanced technologies such as the Internet of Things, big data, and artificial intelligence to improve the efficiency and quality of manufacturing production. As an important support to promote the transformation and upgrading of the manufacturing industry, cloud service optimization has received the attention of researchers. In recent years, remarkable research results have been achieved in this field. For the sustainability of intelligent manufacturing platforms, in this paper we summarize the process of cloud service optimization for intelligent manufacturing. Further, to address the problems of dispersed optimization indicators and nonuniform/unstandardized definitions in the existing research, 11 optimization indicators that take into account three-party participant subjects are defined from the urgent requirements of the sustainable development of intelligent manufacturing platform",
    "path": "papers/24/08/2408.01795.json",
    "total_tokens": 550,
    "translated_title": "智能制造业的云服务组合综述",
    "translated_abstract": "arXiv:2408.01795v1 公告类型：新 Abstract: 智能制造业是一种使用先进技术，如物联网、大数据和人工智能的新模型，以提高制造生产的效率和质量。作为推动制造业转型和升级的重要支持，云服务优化已经引起了研究者的关注。近年来，该领域取得了显著的研究成果。为了智能制造平台的可持续发展，本文总结了智能制造业的云服务优化过程。此外，为了解决现有研究中分散的优化指标和非统一/非标准定义的问题，我们从智能制造平台可持续发展的迫切需求出发，定义了11个考虑三方参与者主体的优化指标，以满足不同需求，实现资源的高效利用和可持续发展。",
    "tldr": "本文综述了智能制造业中云服务优化的研究进展，并提出了统一的优化指标体系，旨在支持智能制造平台的可持续发展。"
}