{
    "title": "Scaling CS1 Support with Compiler-Integrated Conversational AI",
    "abstract": "arXiv:2408.02378v1 Announce Type: cross  Abstract: This paper introduces DCC Sidekick, a web-based conversational AI tool that enhances an existing LLM-powered C/C++ compiler by generating educational programming error explanations. The tool seamlessly combines code display, compile- and run-time error messages, and stack frame read-outs alongside an AI interface, leveraging compiler error context for improved explanations. We analyse usage data from a large Australian CS1 course, where 959 students engaged in 11,222 DCC Sidekick sessions, resulting in 17,982 error explanations over seven weeks. Notably, over 50% of interactions occurred outside business hours, underscoring the tool's value as an always-available resource. Our findings reveal strong adoption of AI-assisted debugging tools, demonstrating their scalability in supporting extensive CS1 courses. We provide implementation insights and recommendations for educators seeking to incorporate AI tools with appropriate pedagogical ",
    "link": "https://arxiv.org/abs/2408.02378",
    "context": "Title: Scaling CS1 Support with Compiler-Integrated Conversational AI\nAbstract: arXiv:2408.02378v1 Announce Type: cross  Abstract: This paper introduces DCC Sidekick, a web-based conversational AI tool that enhances an existing LLM-powered C/C++ compiler by generating educational programming error explanations. The tool seamlessly combines code display, compile- and run-time error messages, and stack frame read-outs alongside an AI interface, leveraging compiler error context for improved explanations. We analyse usage data from a large Australian CS1 course, where 959 students engaged in 11,222 DCC Sidekick sessions, resulting in 17,982 error explanations over seven weeks. Notably, over 50% of interactions occurred outside business hours, underscoring the tool's value as an always-available resource. Our findings reveal strong adoption of AI-assisted debugging tools, demonstrating their scalability in supporting extensive CS1 courses. We provide implementation insights and recommendations for educators seeking to incorporate AI tools with appropriate pedagogical ",
    "path": "papers/24/08/2408.02378.json",
    "total_tokens": 465,
    "tldr": "该文章介绍了一种名为DCC Sidekick的Web版对话式AI工具，它通过结合代码展示、编译和运行时错误消息以及堆栈帧读数，提高了LLM支持的C/C++编译器生成编程错误解释的能力。研究分析了来自一个大型的澳大利亚初级计算机科学课程的使用数据，发现DCC Sidekick工具在七周内记录了11,222个会话，涉及17,982个错误解释。数据表明，超过50%的互动发生在非营业时间，凸显了该工具作为随时可用资源的潜力。研究结果表明，AI辅助的调试工具得到了广泛采用，证明了其在支持大规模初级计算机科学课程中的可扩展性。文章还提供了实施洞察和建议，为寻求整合AI工具的教育工作者提供了教学方面的建议。"
}