{
    "title": "Lighthouse: A User-Friendly Library for Reproducible Video Moment Retrieval and Highlight Detection",
    "abstract": "arXiv:2408.02901v1 Announce Type: new  Abstract: We propose Lighthouse, a user-friendly library for reproducible video moment retrieval and highlight detection (MR-HD). Although researchers proposed various MR-HD approaches, the research community holds two main issues. The first is a lack of comprehensive and reproducible experiments across various methods, datasets, and video-text features. This is because no unified training and evaluation codebase covers multiple settings. The second is user-unfriendly design. Because previous works use different libraries, researchers set up individual environments. In addition, most works release only the training codes, requiring users to implement the whole inference process of MR-HD. Lighthouse addresses these issues by implementing a unified reproducible codebase that includes six models, three features, and five datasets. In addition, it provides an inference API and web demo to make these methods easily accessible for researchers and develo",
    "link": "https://arxiv.org/abs/2408.02901",
    "context": "Title: Lighthouse: A User-Friendly Library for Reproducible Video Moment Retrieval and Highlight Detection\nAbstract: arXiv:2408.02901v1 Announce Type: new  Abstract: We propose Lighthouse, a user-friendly library for reproducible video moment retrieval and highlight detection (MR-HD). Although researchers proposed various MR-HD approaches, the research community holds two main issues. The first is a lack of comprehensive and reproducible experiments across various methods, datasets, and video-text features. This is because no unified training and evaluation codebase covers multiple settings. The second is user-unfriendly design. Because previous works use different libraries, researchers set up individual environments. In addition, most works release only the training codes, requiring users to implement the whole inference process of MR-HD. Lighthouse addresses these issues by implementing a unified reproducible codebase that includes six models, three features, and five datasets. In addition, it provides an inference API and web demo to make these methods easily accessible for researchers and develo",
    "path": "papers/24/08/2408.02901.json",
    "total_tokens": 395,
    "tldr": "该文章提出Lighthouse，一个综合性的、可复现的视频时刻检索和突出检测（MR-HD）用户友好型库。Lighthouse旨在解决现有研究中缺乏跨方法、数据集和视频文本特征的全面和可复现实验的问题，并在统一训练和评估代码库中涵盖多种设置，同时通过提供一个可复用的代码基、六个模型、三种特征和五个数据集以及在API和网页演示上的易访问性，使得研究者和开发者能够轻松地使用这些方法。"
}