{
    "title": "Individualized multi-horizon MRI trajectory prediction for Alzheimer's Disease",
    "abstract": "arXiv:2408.02018v1 Announce Type: new  Abstract: Neurodegeneration as measured through magnetic resonance imaging (MRI) is recognized as a potential biomarker for diagnosing Alzheimer's disease (AD), but is generally considered less specific than amyloid or tau based biomarkers. Due to a large amount of variability in brain anatomy between different individuals, we hypothesize that leveraging MRI time series can help improve specificity, by treating each patient as their own baseline. Here we turn to conditional variational autoencoders to generate individualized MRI predictions given the subject's age, disease status and one previous scan. Using serial imaging data from the Alzheimer's Disease Neuroimaging Initiative, we train a novel architecture to build a latent space distribution which can be sampled from to generate future predictions of changing anatomy. This enables us to extrapolate beyond the dataset and predict MRIs up to 10 years. We evaluated the model on a held-out set fr",
    "link": "https://arxiv.org/abs/2408.02018",
    "context": "Title: Individualized multi-horizon MRI trajectory prediction for Alzheimer's Disease\nAbstract: arXiv:2408.02018v1 Announce Type: new  Abstract: Neurodegeneration as measured through magnetic resonance imaging (MRI) is recognized as a potential biomarker for diagnosing Alzheimer's disease (AD), but is generally considered less specific than amyloid or tau based biomarkers. Due to a large amount of variability in brain anatomy between different individuals, we hypothesize that leveraging MRI time series can help improve specificity, by treating each patient as their own baseline. Here we turn to conditional variational autoencoders to generate individualized MRI predictions given the subject's age, disease status and one previous scan. Using serial imaging data from the Alzheimer's Disease Neuroimaging Initiative, we train a novel architecture to build a latent space distribution which can be sampled from to generate future predictions of changing anatomy. This enables us to extrapolate beyond the dataset and predict MRIs up to 10 years. We evaluated the model on a held-out set fr",
    "path": "papers/24/08/2408.02018.json",
    "total_tokens": 391,
    "tldr": "该文章提出了一种个体化多时间尺度MRI轨迹预测方法，通过使用条件变分auto编码器模型来生成基于年龄、疾病状态和单个患者历史扫描数据的未来MRI预测。此方法利用阿尔茨海默病神经影像学倡议的连续成像数据训练了一个新颖的架构，能够构建一个分布，从中采样以生成未来解剖学变化的预测，从而能够预测10年后的MRI图像。在验证集上的指标显示了模型的有效性。"
}