{
    "title": "MaxMind: A Memory Loop Network to Enhance Software Productivity based on Large Language Models",
    "abstract": "arXiv:2408.03841v1 Announce Type: cross  Abstract: The application of large language models to facilitate automated software operations and tool generation (SOTG), thus augmenting software productivity, mirrors the early stages of human evolution when the ability to create and use tools accelerated the progress of civilization. These complex tasks require AI to continuously summarize and improve. Current research often overlooks the importance of converting real-time task experiences into system memory and differentiating the value of existing knowledge for future reference. This paper addresses these issues by evolving external memory models into Memory-Loop Networks for timely memorization and experience referencing. We also enhance a RAG mechanism with knowledge precision segmentation to utilize memory based on value differentiation, and design the MaxMind model for SOTG accordingly.To demonstrate our approach, we developed MaxMind4Sheet, an electronic spreadsheet processing system ",
    "link": "https://arxiv.org/abs/2408.03841",
    "context": "Title: MaxMind: A Memory Loop Network to Enhance Software Productivity based on Large Language Models\nAbstract: arXiv:2408.03841v1 Announce Type: cross  Abstract: The application of large language models to facilitate automated software operations and tool generation (SOTG), thus augmenting software productivity, mirrors the early stages of human evolution when the ability to create and use tools accelerated the progress of civilization. These complex tasks require AI to continuously summarize and improve. Current research often overlooks the importance of converting real-time task experiences into system memory and differentiating the value of existing knowledge for future reference. This paper addresses these issues by evolving external memory models into Memory-Loop Networks for timely memorization and experience referencing. We also enhance a RAG mechanism with knowledge precision segmentation to utilize memory based on value differentiation, and design the MaxMind model for SOTG accordingly.To demonstrate our approach, we developed MaxMind4Sheet, an electronic spreadsheet processing system ",
    "path": "papers/24/08/2408.03841.json",
    "total_tokens": 354,
    "tldr": "该文章提出了一种名为MaxMind的记忆循环网络模型，旨在利用大型语言模型提高软件开发效率，通过实时记忆和经验参考机制，以及知识精确度分段，优化了RAG机制，并设计了一个名为MaxMind4Sheet的电子表格处理软件，展示了如何将记忆模型应用于特定的软件工具开发中，从而提高了软件开发的效率和智能化水平。"
}