{
    "title": "FBINeRF: Feature-Based Integrated Recurrent Network for Pinhole and Fisheye Neural Radiance Fields",
    "abstract": "arXiv:2408.01878v1 Announce Type: new  Abstract: Previous studies aiming to optimize and bundle-adjust camera poses using Neural Radiance Fields (NeRFs), such as BARF and DBARF, have demonstrated impressive capabilities in 3D scene reconstruction. However, these approaches have been designed for pinhole-camera pose optimization and do not perform well under radial image distortions such as those in fisheye cameras. Furthermore, inaccurate depth initialization in DBARF results in erroneous geometric information affecting the overall convergence and quality of results. In this paper, we propose adaptive GRUs with a flexible bundle-adjustment method adapted to radial distortions and incorporate feature-based recurrent neural networks to generate continuous novel views from fisheye datasets. Other NeRF methods for fisheye images, such as SCNeRF and OMNI-NeRF, use projected ray distance loss for distorted pose refinement, causing severe artifacts, long rendering time, and are difficult to u",
    "link": "https://arxiv.org/abs/2408.01878",
    "context": "Title: FBINeRF: Feature-Based Integrated Recurrent Network for Pinhole and Fisheye Neural Radiance Fields\nAbstract: arXiv:2408.01878v1 Announce Type: new  Abstract: Previous studies aiming to optimize and bundle-adjust camera poses using Neural Radiance Fields (NeRFs), such as BARF and DBARF, have demonstrated impressive capabilities in 3D scene reconstruction. However, these approaches have been designed for pinhole-camera pose optimization and do not perform well under radial image distortions such as those in fisheye cameras. Furthermore, inaccurate depth initialization in DBARF results in erroneous geometric information affecting the overall convergence and quality of results. In this paper, we propose adaptive GRUs with a flexible bundle-adjustment method adapted to radial distortions and incorporate feature-based recurrent neural networks to generate continuous novel views from fisheye datasets. Other NeRF methods for fisheye images, such as SCNeRF and OMNI-NeRF, use projected ray distance loss for distorted pose refinement, causing severe artifacts, long rendering time, and are difficult to u",
    "path": "papers/24/08/2408.01878.json",
    "total_tokens": 411,
    "tldr": "该文章提出了一种名为FBINeRF的框架，它结合了特征导向的循环神经网络和可适应的GRUs（门控循环单元），用于处理带有时序信息的fisheye相机数据，并通过灵活的相机姿态调整方法，解决了由于深度初始化不准确导致的深度信息错误问题。此外，该论文还介绍了一种新的连续视图生成方法，能够从fisheye图像中生成高质量的神经影像场，有效避免了其他方法因投影光束距离损失引起的图像质量问题。"
}