{
    "title": "Contrastive Learning-based Chaining-Cluster for Multilingual Voice-Face Association",
    "abstract": "arXiv:2408.02025v1 Announce Type: cross  Abstract: The innate correlation between a person's face and voice has recently emerged as a compelling area of study, especially within the context of multilingual environments. This paper introduces our novel solution to the Face-Voice Association in Multilingual Environments (FAME) 2024 challenge, focusing on a contrastive learning-based chaining-cluster method to enhance face-voice association. This task involves the challenges of building biometric relations between auditory and visual modality cues and modelling the prosody interdependence between different languages while addressing both intrinsic and extrinsic variability present in the data. To handle these non-trivial challenges, our method employs supervised cross-contrastive (SCC) learning to establish robust associations between voices and faces in multi-language scenarios. Following this, we have specifically designed a chaining-cluster-based post-processing step to mitigate the im",
    "link": "https://arxiv.org/abs/2408.02025",
    "context": "Title: Contrastive Learning-based Chaining-Cluster for Multilingual Voice-Face Association\nAbstract: arXiv:2408.02025v1 Announce Type: cross  Abstract: The innate correlation between a person's face and voice has recently emerged as a compelling area of study, especially within the context of multilingual environments. This paper introduces our novel solution to the Face-Voice Association in Multilingual Environments (FAME) 2024 challenge, focusing on a contrastive learning-based chaining-cluster method to enhance face-voice association. This task involves the challenges of building biometric relations between auditory and visual modality cues and modelling the prosody interdependence between different languages while addressing both intrinsic and extrinsic variability present in the data. To handle these non-trivial challenges, our method employs supervised cross-contrastive (SCC) learning to establish robust associations between voices and faces in multi-language scenarios. Following this, we have specifically designed a chaining-cluster-based post-processing step to mitigate the im",
    "path": "papers/24/08/2408.02025.json",
    "total_tokens": 645,
    "translated_title": "基于对比学习的方法对于多语言的声音与面部识别",
    "translated_abstract": "arXiv:2408.02025v1 公告类型: cross 摘要: 最近，在多语言环境中研究一个人脸与声音的固有联系已经成为一个引人注目的领域。本文介绍的是我们为2024年FAME（Face-Voice Association in Multilingual Environments）挑战赛提出的创新解决方案，重点是使用基于对比学习的方法来提高多语言环境中面部与声音的关联。这项任务涉及在跨语言环境下建立视觉和听觉模态信号的生物识别关系，以及建模在不同语言中的语音节奏之间的相互依赖关系，同时处理数据中的内在和外在可变性。为了处理这些不简单的挑战，我们的方法采用了监督的交叉对比学习（SCC）来建立多语言情景中的声音与面孔的坚固关联。随后，我们特别设计了一个基于链式集群的后续处理步骤，以减轻问题的复杂性并提高算法的性能。",
    "tldr": "本文提出了一种基于对比学习的算法，用于解决多语言环境中面部与声音识别面临的复杂问题，特别是在无法面对面识别的情况下。"
}