{
    "title": "RobNODDI: Robust NODDI Parameter Estimation with Adaptive Sampling under Continuous Representation",
    "abstract": "arXiv:2408.01944v1 Announce Type: new  Abstract: Neurite Orientation Dispersion and Density Imaging (NODDI) is an important imaging technology used to evaluate the microstructure of brain tissue, which is of great significance for the discovery and treatment of various neurological diseases. Current deep learning-based methods perform parameter estimation through diffusion magnetic resonance imaging (dMRI) with a small number of diffusion gradients. These methods speed up parameter estimation and improve accuracy. However, the diffusion directions used by most existing deep learning models during testing needs to be strictly consistent with the diffusion directions during training. This results in poor generalization and robustness of deep learning models in dMRI parameter estimation. In this work, we verify for the first time that the parameter estimation performance of current mainstream methods will significantly decrease when the testing diffusion directions and the training diffus",
    "link": "https://arxiv.org/abs/2408.01944",
    "context": "Title: RobNODDI: Robust NODDI Parameter Estimation with Adaptive Sampling under Continuous Representation\nAbstract: arXiv:2408.01944v1 Announce Type: new  Abstract: Neurite Orientation Dispersion and Density Imaging (NODDI) is an important imaging technology used to evaluate the microstructure of brain tissue, which is of great significance for the discovery and treatment of various neurological diseases. Current deep learning-based methods perform parameter estimation through diffusion magnetic resonance imaging (dMRI) with a small number of diffusion gradients. These methods speed up parameter estimation and improve accuracy. However, the diffusion directions used by most existing deep learning models during testing needs to be strictly consistent with the diffusion directions during training. This results in poor generalization and robustness of deep learning models in dMRI parameter estimation. In this work, we verify for the first time that the parameter estimation performance of current mainstream methods will significantly decrease when the testing diffusion directions and the training diffus",
    "path": "papers/24/08/2408.01944.json",
    "total_tokens": 340,
    "tldr": "该文章提出了一种名为RobNODDI的算法，该算法通过自适应采样和连续表示实现了NODDI参数的鲁棒估计。这项工作首次验证了现有主流方法在测试扩散方向与训练方向不匹配时的参数估计性能显著下降的问题，并提出了一种更为鲁棒的估计方法。"
}