{
    "title": "CAF-YOLO: A Robust Framework for Multi-Scale Lesion Detection in Biomedical Imagery",
    "abstract": "arXiv:2408.01897v1 Announce Type: new  Abstract: Object detection is of paramount importance in biomedical image analysis, particularly for lesion identification. While current methodologies are proficient in identifying and pinpointing lesions, they often lack the precision needed to detect minute biomedical entities (e.g., abnormal cells, lung nodules smaller than 3 mm), which are critical in blood and lung pathology. To address this challenge, we propose CAF-YOLO, based on the YOLOv8 architecture, a nimble yet robust method for medical object detection that leverages the strengths of convolutional neural networks (CNNs) and transformers. To overcome the limitation of convolutional kernels, which have a constrained capacity to interact with distant information, we introduce an attention and convolution fusion module (ACFM). This module enhances the modeling of both global and local features, enabling the capture of long-term feature dependencies and spatial autocorrelation. Additiona",
    "link": "https://arxiv.org/abs/2408.01897",
    "context": "Title: CAF-YOLO: A Robust Framework for Multi-Scale Lesion Detection in Biomedical Imagery\nAbstract: arXiv:2408.01897v1 Announce Type: new  Abstract: Object detection is of paramount importance in biomedical image analysis, particularly for lesion identification. While current methodologies are proficient in identifying and pinpointing lesions, they often lack the precision needed to detect minute biomedical entities (e.g., abnormal cells, lung nodules smaller than 3 mm), which are critical in blood and lung pathology. To address this challenge, we propose CAF-YOLO, based on the YOLOv8 architecture, a nimble yet robust method for medical object detection that leverages the strengths of convolutional neural networks (CNNs) and transformers. To overcome the limitation of convolutional kernels, which have a constrained capacity to interact with distant information, we introduce an attention and convolution fusion module (ACFM). This module enhances the modeling of both global and local features, enabling the capture of long-term feature dependencies and spatial autocorrelation. Additiona",
    "path": "papers/24/08/2408.01897.json",
    "total_tokens": 394,
    "tldr": "该文章提出CAF-YOLO框架，通过融合注意力机制和卷积操作，增强了在生物医学图像中识别小规模病灶的能力。CAF-YOLO修改了YOLOv8，使用ACFM模块解决了传统卷积网络难以处理远距离信息交互的缺点，从而提高了对全局和局部特征的建模，特别是对于血液和肺病病理中的微小病变有准确的检测效果。"
}