{
    "title": "Physical prior guided cooperative learning framework for joint turbulence degradation estimation and infrared video restoration",
    "abstract": "arXiv:2408.04227v1 Announce Type: cross  Abstract: Infrared imaging and turbulence strength measurements are in widespread demand in many fields. This paper introduces a Physical Prior Guided Cooperative Learning (P2GCL) framework to jointly enhance atmospheric turbulence strength estimation and infrared image restoration. P2GCL involves a cyclic collaboration between two models, i.e., a TMNet measures turbulence strength and outputs the refractive index structure constant (Cn2) as a physical prior, a TRNet conducts infrared image sequence restoration based on Cn2 and feeds the restored images back to the TMNet to boost the measurement accuracy. A novel Cn2-guided frequency loss function and a physical constraint loss are introduced to align the training process with physical theories. Experiments demonstrate P2GCL achieves the best performance for both turbulence strength estimation (improving Cn2 MAE by 0.0156, enhancing R2 by 0.1065) and image restoration (enhancing PSNR by 0.2775 d",
    "link": "https://arxiv.org/abs/2408.04227",
    "context": "Title: Physical prior guided cooperative learning framework for joint turbulence degradation estimation and infrared video restoration\nAbstract: arXiv:2408.04227v1 Announce Type: cross  Abstract: Infrared imaging and turbulence strength measurements are in widespread demand in many fields. This paper introduces a Physical Prior Guided Cooperative Learning (P2GCL) framework to jointly enhance atmospheric turbulence strength estimation and infrared image restoration. P2GCL involves a cyclic collaboration between two models, i.e., a TMNet measures turbulence strength and outputs the refractive index structure constant (Cn2) as a physical prior, a TRNet conducts infrared image sequence restoration based on Cn2 and feeds the restored images back to the TMNet to boost the measurement accuracy. A novel Cn2-guided frequency loss function and a physical constraint loss are introduced to align the training process with physical theories. Experiments demonstrate P2GCL achieves the best performance for both turbulence strength estimation (improving Cn2 MAE by 0.0156, enhancing R2 by 0.1065) and image restoration (enhancing PSNR by 0.2775 d",
    "path": "papers/24/08/2408.04227.json",
    "total_tokens": 368,
    "tldr": "该文章提出了一种基于物理先验的协作学习框架，它能够联合估计大气湍流强度并恢复红外视频，通过模型的相互协作和物理先验知识，使得湍流强度的测量更加精确，同时提高了图像的恢复质量。"
}