{
    "title": "Qubernetes: Towards a Unified Cloud-Native Execution Platform for Hybrid Classic-Quantum Computing",
    "abstract": "arXiv:2408.01436v1 Announce Type: cross  Abstract: Context: The emergence of quantum computing proposes a revolutionary paradigm that can radically transform numerous scientific and industrial application domains. The ability of quantum computers to scale computations beyond what the current computers are capable of implies better performance and efficiency for certain algorithmic tasks.   Objective: However, to benefit from such improvement, quantum computers must be integrated with existing software systems, a process that is not straightforward. In this paper, we propose a unified execution model that addresses the challenges that emerge from building hybrid classical-quantum applications at scale.   Method: Following the Design Science Research methodology, we proposed a convention for mapping quantum resources and artifacts to Kubernetes concepts. Then, in an experimental Kubernetes cluster, we conducted experiments for scheduling and executing quantum tasks on both quantum simula",
    "link": "https://arxiv.org/abs/2408.01436",
    "context": "Title: Qubernetes: Towards a Unified Cloud-Native Execution Platform for Hybrid Classic-Quantum Computing\nAbstract: arXiv:2408.01436v1 Announce Type: cross  Abstract: Context: The emergence of quantum computing proposes a revolutionary paradigm that can radically transform numerous scientific and industrial application domains. The ability of quantum computers to scale computations beyond what the current computers are capable of implies better performance and efficiency for certain algorithmic tasks.   Objective: However, to benefit from such improvement, quantum computers must be integrated with existing software systems, a process that is not straightforward. In this paper, we propose a unified execution model that addresses the challenges that emerge from building hybrid classical-quantum applications at scale.   Method: Following the Design Science Research methodology, we proposed a convention for mapping quantum resources and artifacts to Kubernetes concepts. Then, in an experimental Kubernetes cluster, we conducted experiments for scheduling and executing quantum tasks on both quantum simula",
    "path": "papers/24/08/2408.01436.json",
    "total_tokens": 318,
    "tldr": "该文章提出了\"Qubernetes\"平台，旨在建立一个统一的云原生执行环境，将经典计算机与量子计算机集成，促进了混合计算的应用在不同规模上的开发和部署，通过映射量子资源到Kubernetes概念，提高了量子任务的调度与执行效率。"
}