{
    "title": "Understanding How Blind Users Handle Object Recognition Errors: Strategies and Challenges",
    "abstract": "arXiv:2408.03303v1 Announce Type: cross  Abstract: Object recognition technologies hold the potential to support blind and low-vision people in navigating the world around them. However, the gap between benchmark performances and practical usability remains a significant challenge. This paper presents a study aimed at understanding blind users' interaction with object recognition systems for identifying and avoiding errors. Leveraging a pre-existing object recognition system, URCam, fine-tuned for our experiment, we conducted a user study involving 12 blind and low-vision participants. Through in-depth interviews and hands-on error identification tasks, we gained insights into users' experiences, challenges, and strategies for identifying errors in camera-based assistive technologies and object recognition systems. During interviews, many participants preferred independent error review, while expressing apprehension toward misrecognitions. In the error identification task, participants",
    "link": "https://arxiv.org/abs/2408.03303",
    "context": "Title: Understanding How Blind Users Handle Object Recognition Errors: Strategies and Challenges\nAbstract: arXiv:2408.03303v1 Announce Type: cross  Abstract: Object recognition technologies hold the potential to support blind and low-vision people in navigating the world around them. However, the gap between benchmark performances and practical usability remains a significant challenge. This paper presents a study aimed at understanding blind users' interaction with object recognition systems for identifying and avoiding errors. Leveraging a pre-existing object recognition system, URCam, fine-tuned for our experiment, we conducted a user study involving 12 blind and low-vision participants. Through in-depth interviews and hands-on error identification tasks, we gained insights into users' experiences, challenges, and strategies for identifying errors in camera-based assistive technologies and object recognition systems. During interviews, many participants preferred independent error review, while expressing apprehension toward misrecognitions. In the error identification task, participants",
    "path": "papers/24/08/2408.03303.json",
    "total_tokens": 304,
    "tldr": "该文章通过深入研究盲人用户与物体识别错误处理的相关策略和挑战，揭示了在相机辅助技术和物体识别系统中识别错误时用户的直观经验。"
}