{
    "title": "Anytime Multi-Agent Path Finding with an Adaptive Delay-Based Heuristic",
    "abstract": "arXiv:2408.02960v1 Announce Type: new  Abstract: Anytime multi-agent path finding (MAPF) is a promising approach to scalable path optimization in multi-agent systems. MAPF-LNS, based on Large Neighborhood Search (LNS), is the current state-of-the-art approach where a fast initial solution is iteratively optimized by destroying and repairing selected paths of the solution. Current MAPF-LNS variants commonly use an adaptive selection mechanism to choose among multiple destroy heuristics. However, to determine promising destroy heuristics, MAPF-LNS requires a considerable amount of exploration time. As common destroy heuristics are non-adaptive, any performance bottleneck caused by these heuristics cannot be overcome via adaptive heuristic selection alone, thus limiting the overall effectiveness of MAPF-LNS in terms of solution cost. In this paper, we propose Adaptive Delay-based Destroy-and-Repair Enhanced with Success-based Self-Learning (ADDRESS) as a single-destroy-heuristic variant o",
    "link": "https://arxiv.org/abs/2408.02960",
    "context": "Title: Anytime Multi-Agent Path Finding with an Adaptive Delay-Based Heuristic\nAbstract: arXiv:2408.02960v1 Announce Type: new  Abstract: Anytime multi-agent path finding (MAPF) is a promising approach to scalable path optimization in multi-agent systems. MAPF-LNS, based on Large Neighborhood Search (LNS), is the current state-of-the-art approach where a fast initial solution is iteratively optimized by destroying and repairing selected paths of the solution. Current MAPF-LNS variants commonly use an adaptive selection mechanism to choose among multiple destroy heuristics. However, to determine promising destroy heuristics, MAPF-LNS requires a considerable amount of exploration time. As common destroy heuristics are non-adaptive, any performance bottleneck caused by these heuristics cannot be overcome via adaptive heuristic selection alone, thus limiting the overall effectiveness of MAPF-LNS in terms of solution cost. In this paper, we propose Adaptive Delay-based Destroy-and-Repair Enhanced with Success-based Self-Learning (ADDRESS) as a single-destroy-heuristic variant o",
    "path": "papers/24/08/2408.02960.json",
    "total_tokens": 373,
    "tldr": "该文章提出了ADdress方法，这是一个以成功为基础的自学习单破坏-修复增强的任何时间多智能体路径规划方法，它通过动态调整破坏策略成功地减少了大型邻域搜索中的解决成本，提高了路径规划的多智能体系统的效率和实用性。"
}