{
    "title": "A Learning-Based Model Predictive Contouring Control for Vehicle Evasive Manoeuvres",
    "abstract": "arXiv:2408.04485v1 Announce Type: new  Abstract: This paper presents a novel Learning-based Model Predictive Contouring Control (L-MPCC) algorithm for evasive manoeuvres at the limit of handling. The algorithm uses the Student-t Process (STP) to minimise model mismatches and uncertainties online. The proposed STP captures the mismatches between the prediction model and the measured lateral tyre forces and yaw rate. The mismatches correspond to the posterior means provided to the prediction model to improve its accuracy. Simultaneously, the posterior covariances are propagated to the vehicle lateral velocity and yaw rate along the prediction horizon. The STP posterior covariance directly depends on the variance of observed data, so its variance is more significant when the online measurements differ from the recorded ones in the training set and smaller in the opposite case. Thus, these covariances can be utilised in the L-MPCC's cost function to minimise the vehicle state uncertainties",
    "link": "https://arxiv.org/abs/2408.04485",
    "context": "Title: A Learning-Based Model Predictive Contouring Control for Vehicle Evasive Manoeuvres\nAbstract: arXiv:2408.04485v1 Announce Type: new  Abstract: This paper presents a novel Learning-based Model Predictive Contouring Control (L-MPCC) algorithm for evasive manoeuvres at the limit of handling. The algorithm uses the Student-t Process (STP) to minimise model mismatches and uncertainties online. The proposed STP captures the mismatches between the prediction model and the measured lateral tyre forces and yaw rate. The mismatches correspond to the posterior means provided to the prediction model to improve its accuracy. Simultaneously, the posterior covariances are propagated to the vehicle lateral velocity and yaw rate along the prediction horizon. The STP posterior covariance directly depends on the variance of observed data, so its variance is more significant when the online measurements differ from the recorded ones in the training set and smaller in the opposite case. Thus, these covariances can be utilised in the L-MPCC's cost function to minimise the vehicle state uncertainties",
    "path": "papers/24/08/2408.04485.json",
    "total_tokens": 472,
    "tldr": "该文章提出了一种基于学习的模型预测轮廓控制（L-MPCC）算法，用于车辆在极限操控下的避险机动。该算法采用Student-t过程（STP）在线最小化模型偏差和不确定性。STP能够捕获预测模型与测量到的侧向轮胎力和转向率之间的偏差。这些偏差对应于提供给预测模型的后验均值，以提高其准确性。同时，后验协方差被 propagate 到预测时间范围内的车辆侧向速度和转向率上。STP的后验协方差直接取决于观测数据的标准差，因此当在线测量值与训练集中记录的值不同时，其标准差较大，反之则较小。因此，这些协方差可以在L-MPCC的成本函数中使用，以最小化车辆状态的不确定性。"
}