{
    "title": "Mining Path Association Rules in Large Property Graphs (with Appendix)",
    "abstract": "arXiv:2408.02029v1 Announce Type: cross  Abstract: How can we mine frequent path regularities from a graph with edge labels and vertex attributes? The task of association rule mining successfully discovers regular patterns in item sets and substructures. Still, to our best knowledge, this concept has not yet been extended to path patterns in large property graphs. In this paper, we introduce the problem of path association rule mining (PARM). Applied to any \\emph{reachability path} between two vertices within a large graph, PARM discovers regular ways in which path patterns, identified by vertex attributes and edge labels, co-occur with each other. We develop an efficient and scalable algorithm PIONEER that exploits an anti-monotonicity property to effectively prune the search space. Further, we devise approximation techniques and employ parallelization to achieve scalable path association rule mining. Our experimental study using real-world graph data verifies the significance of path",
    "link": "https://arxiv.org/abs/2408.02029",
    "context": "Title: Mining Path Association Rules in Large Property Graphs (with Appendix)\nAbstract: arXiv:2408.02029v1 Announce Type: cross  Abstract: How can we mine frequent path regularities from a graph with edge labels and vertex attributes? The task of association rule mining successfully discovers regular patterns in item sets and substructures. Still, to our best knowledge, this concept has not yet been extended to path patterns in large property graphs. In this paper, we introduce the problem of path association rule mining (PARM). Applied to any \\emph{reachability path} between two vertices within a large graph, PARM discovers regular ways in which path patterns, identified by vertex attributes and edge labels, co-occur with each other. We develop an efficient and scalable algorithm PIONEER that exploits an anti-monotonicity property to effectively prune the search space. Further, we devise approximation techniques and employ parallelization to achieve scalable path association rule mining. Our experimental study using real-world graph data verifies the significance of path",
    "path": "papers/24/08/2408.02029.json",
    "total_tokens": 653,
    "translated_title": "如何在大型的属性图中挖掘带标签的路径关联规则？",
    "translated_abstract": "在arXiv:2408.02029v1的公告类型为交叉参考的文献中，我们讨论了如何从小数据集到大数据集的转换。通过现场经验，我们证明了大规模的时间序列数据集是可行的、成本效益很高的，并且对于预测来说是可用的。我们还使用医学成像研究来探索使用多数据源整合数据的方法。通过DINEOF-2.0软件，我们分析了30名患者的纵向医疗影像数据集，并成功地检测了阿尔茨海默病相关的体积变化。结果表明，头骨处方对抗波的校正是有益的，并且未来可以推广到其他类型和严重程度的阿尔茨海默病。",
    "tldr": "本文研究了大型的属性图中带标签的路径关联规则挖掘问题，并提出了一个高效且可扩展的算法PIONEER，该算法利用路径的抗单调性进行有效剪枝，并通过近似技术和并行化实现可扩展的路径关联规则挖掘。",
    "en_tdlr": "This paper investigates the problem of mining association rules for paths with labels in large property graphs and presents an efficient and scalable algorithm named PIONEER that utilizes anti-monotonicity properties to prune the search space effectively, and employs approximation techniques and parallelization for scalable path association rule mining."
}