{
    "title": "Prototyping of a multirotor UAV for precision landing under rotor failures",
    "abstract": "arXiv:2408.01676v1 Announce Type: new  Abstract: This work presents a prototype of a multirotor aerial vehicle capable of precision landing, even under the effects of rotor failures. The manuscript presents the fault-tolerant techniques and mechanical designs to achieve a fault-tolerant multirotor, and a vision-based navigation system required to achieve a precision landing. Preliminary experimental results will be shown, to validate on one hand the fault-tolerant control vehicle and, on the other hand, the autonomous landing algorithm. Also, a prototype of the fault-tolerant UAV is presented, capable of precise autonomous landing, which will be used in future experiments.",
    "link": "https://arxiv.org/abs/2408.01676",
    "context": "Title: Prototyping of a multirotor UAV for precision landing under rotor failures\nAbstract: arXiv:2408.01676v1 Announce Type: new  Abstract: This work presents a prototype of a multirotor aerial vehicle capable of precision landing, even under the effects of rotor failures. The manuscript presents the fault-tolerant techniques and mechanical designs to achieve a fault-tolerant multirotor, and a vision-based navigation system required to achieve a precision landing. Preliminary experimental results will be shown, to validate on one hand the fault-tolerant control vehicle and, on the other hand, the autonomous landing algorithm. Also, a prototype of the fault-tolerant UAV is presented, capable of precise autonomous landing, which will be used in future experiments.",
    "path": "papers/24/08/2408.01676.json",
    "total_tokens": 531,
    "translated_title": "轮式无人机的精确降落原型设计，即使发生旋翼故障也能运作",
    "translated_abstract": "本文介绍了一种多旋翼无人飞行器原型设计，能够在旋翼故障的情况下实现精确降落。论文中阐述了故障容错技术、机械设计和必不可少的光学导航系统，以确保精确的自定义着陆。实验初步成果将被展示，用以验证故障容错控制车辆的性能以及自主降落算法的有效性。此外，还将展示一个多旋翼无人飞行器原型设计，它具备在故障情况下实现精确自主任务的能力，并将用于未来的实验测试中。",
    "tldr": "本文提出了一款多旋翼无人机原型，即使在旋翼发生故障的情况下，也能进行精确着陆，并通过光学导航系统确保了速度的准确性和可靠性。",
    "en_tdlr": "This study presents a multirotor UAV prototype designed to achieve precise landing despite rotor failures, incorporating fault-tolerant controls, mechanical designs, and a vision-based navigation system for accuracy. Preliminary testing results validate the prototype's ability to handle rotor failures and implement an autonomous landing algorithm."
}