{
    "title": "RAG Foundry: A Framework for Enhancing LLMs for Retrieval Augmented Generation",
    "abstract": "arXiv:2408.02545v1 Announce Type: cross  Abstract: Implementing Retrieval-Augmented Generation (RAG) systems is inherently complex, requiring deep understanding of data, use cases, and intricate design decisions. Additionally, evaluating these systems presents significant challenges, necessitating assessment of both retrieval accuracy and generative quality through a multi-faceted approach. We introduce RAG Foundry, an open-source framework for augmenting large language models for RAG use cases. RAG Foundry integrates data creation, training, inference and evaluation into a single workflow, facilitating the creation of data-augmented datasets for training and evaluating large language models in RAG settings. This integration enables rapid prototyping and experimentation with various RAG techniques, allowing users to easily generate datasets and train RAG models using internal or specialized knowledge sources. We demonstrate the framework effectiveness by augmenting and fine-tuning Llam",
    "link": "https://arxiv.org/abs/2408.02545",
    "context": "Title: RAG Foundry: A Framework for Enhancing LLMs for Retrieval Augmented Generation\nAbstract: arXiv:2408.02545v1 Announce Type: cross  Abstract: Implementing Retrieval-Augmented Generation (RAG) systems is inherently complex, requiring deep understanding of data, use cases, and intricate design decisions. Additionally, evaluating these systems presents significant challenges, necessitating assessment of both retrieval accuracy and generative quality through a multi-faceted approach. We introduce RAG Foundry, an open-source framework for augmenting large language models for RAG use cases. RAG Foundry integrates data creation, training, inference and evaluation into a single workflow, facilitating the creation of data-augmented datasets for training and evaluating large language models in RAG settings. This integration enables rapid prototyping and experimentation with various RAG techniques, allowing users to easily generate datasets and train RAG models using internal or specialized knowledge sources. We demonstrate the framework effectiveness by augmenting and fine-tuning Llam",
    "path": "papers/24/08/2408.02545.json",
    "total_tokens": 390,
    "tldr": "该文章提出了一种名为RAG Foundry的开放源代码框架，用于增强大型语言模型进行检索增强生成（RAG）的能力。该框架整合了数据创建、训练、推理和评估流程，简化了对大型语言模型进行RAG的实验过程，并通过集成数据增强技术和训练数据集的方法，促进了RAG方法的快速原型设计和实验。通过使用内部或专有知识源，用户能够轻松创建数据集并训练RAG模型，从而在实际应用中对大型语言模型进行有效的检索增强。"
}