{
    "title": "Geometric Algebra Meets Large Language Models: Instruction-Based Transformations of Separate Meshes in 3D, Interactive and Controllable Scenes",
    "abstract": "arXiv:2408.02275v1 Announce Type: new  Abstract: This paper introduces a novel integration of Large Language Models (LLMs) with Conformal Geometric Algebra (CGA) to revolutionize controllable 3D scene editing, particularly for object repositioning tasks, which traditionally requires intricate manual processes and specialized expertise. These conventional methods typically suffer from reliance on large training datasets or lack a formalized language for precise edits. Utilizing CGA as a robust formal language, our system, shenlong, precisely models spatial transformations necessary for accurate object repositioning. Leveraging the zero-shot learning capabilities of pre-trained LLMs, shenlong translates natural language instructions into CGA operations which are then applied to the scene, facilitating exact spatial transformations within 3D scenes without the need for specialized pre-training. Implemented in a realistic simulation environment, shenlong ensures compatibility with existing",
    "link": "https://arxiv.org/abs/2408.02275",
    "context": "Title: Geometric Algebra Meets Large Language Models: Instruction-Based Transformations of Separate Meshes in 3D, Interactive and Controllable Scenes\nAbstract: arXiv:2408.02275v1 Announce Type: new  Abstract: This paper introduces a novel integration of Large Language Models (LLMs) with Conformal Geometric Algebra (CGA) to revolutionize controllable 3D scene editing, particularly for object repositioning tasks, which traditionally requires intricate manual processes and specialized expertise. These conventional methods typically suffer from reliance on large training datasets or lack a formalized language for precise edits. Utilizing CGA as a robust formal language, our system, shenlong, precisely models spatial transformations necessary for accurate object repositioning. Leveraging the zero-shot learning capabilities of pre-trained LLMs, shenlong translates natural language instructions into CGA operations which are then applied to the scene, facilitating exact spatial transformations within 3D scenes without the need for specialized pre-training. Implemented in a realistic simulation environment, shenlong ensures compatibility with existing",
    "path": "papers/24/08/2408.02275.json",
    "total_tokens": 647,
    "translated_title": "几何代数与大型语言模型的结合：3D交互型可控场景中分离网格的指令驱动转换",
    "translated_abstract": "这篇论文介绍了一种新型的大语言模型(LLMs)与康式几何代数(CGA)的集成，它旨在革新可控3D场景编辑，特别是对象重新定位任务，这些任务通常需要复杂的手动流程和专业技能。这些传统的技艺通常依赖于大量的训练数据集或缺乏对精确编辑的正式语言描述。我们的系统“shenlong”使用CGA作为强大的正式语言，精确地建模了进行精确对象重新定位所需的空间变换。借助预训练LLMs的无监督学习能力，“shenlong”可以将自然语言指令翻译成CGA操作，并将这些操作应用于场景中，从而在三维场景中实现精确的空间变换，而无需专门的数据预训练。在现实的模拟环境中实施后，“shenlong”确保了与现有系统的兼容性。",
    "tldr": "本系统利用几何代数与大型语言模型结合，实现了3D场景中对象精确重新定位，无需专业训练数据，仅通过自然语言指令即可操作。",
    "en_tdlr": "This system integrates Geometric Algebra with large language models to enable precise object repositioning in 3D scenes, requiring no specialized pre-training data, allowing for editing operations solely through natural language instructions."
}