{
    "title": "Integrating a Digital Twin Concept in the Zero Emission Sea Transporter (ZEST) Project for Sustainable Maritime Transport using Stonefish Simulator",
    "abstract": "arXiv:2408.02277v1 Announce Type: new  Abstract: In response to stringent emission reduction targets imposed by the International Maritime Organization (IMO) and the European Green Deal's Fit for 55 legislation package, the maritime industry has shifted its focus towards decarbonization. While significant attention has been placed on vessels exceeding 5,000 gross tons (GT), emissions from coastal and short sea shipping, amounting to approximately 13% of global shipping transportation and 15% within the European Union (EU), have not received adequate consideration. This abstract introduces the Zero Emission Sea Transporter (ZEST) project, designed to address this issue by developing a zero-emissions multi-purpose catamaran for short sea route",
    "link": "https://arxiv.org/abs/2408.02277",
    "context": "Title: Integrating a Digital Twin Concept in the Zero Emission Sea Transporter (ZEST) Project for Sustainable Maritime Transport using Stonefish Simulator\nAbstract: arXiv:2408.02277v1 Announce Type: new  Abstract: In response to stringent emission reduction targets imposed by the International Maritime Organization (IMO) and the European Green Deal's Fit for 55 legislation package, the maritime industry has shifted its focus towards decarbonization. While significant attention has been placed on vessels exceeding 5,000 gross tons (GT), emissions from coastal and short sea shipping, amounting to approximately 13% of global shipping transportation and 15% within the European Union (EU), have not received adequate consideration. This abstract introduces the Zero Emission Sea Transporter (ZEST) project, designed to address this issue by developing a zero-emissions multi-purpose catamaran for short sea route",
    "path": "papers/24/08/2408.02277.json",
    "total_tokens": 624,
    "translated_title": "零排放海运输工具（ZEST）项目采用石首鱼模拟器整合数字双胞胎概念，为可持续的海上运输提供支持",
    "translated_abstract": "arXiv:2408.02277v1 宣布类型：新 摘要：为了响应国际海事组织（IMO）施加的严格排放减少目标以及欧洲绿色协议的Fit for 55立法包，海上运输行业已经将注意力转向了脱碳化。尽管对于超过5000净吨（GT）的船舶，已经给予了极大的关注，但在欧盟内部，沿海和短途海运的排放量占整个海上运输的13%，且在欧盟内达到了15%，这部分排放量还没有得到足够的考虑。本文介绍了零排放海运输工具（ZEST）项目，该项目旨在通过为短途海运路线开发一款零排放的多用途双体船来解决这一问题。",
    "tldr": "零排放海运输工具（ZEST）项目利用数字双胞胎概念和石首鱼模拟器推进了低碳排放的多用途双体船的开发，以支持可持续的海上运输发展。",
    "en_tdlr": "The ZEST project, integrating digital twin concepts with the Stonefish Simulator, is driving the development of a zero-emission multi-purpose catamaran to promote sustainable maritime transport and reduce carbon emissions."
}