{
    "title": "SGSR: Structure-Guided Multi-Contrast MRI Super-Resolution via Spatio-Frequency Co-Query Attention",
    "abstract": "arXiv:2408.03194v1 Announce Type: cross  Abstract: Magnetic Resonance Imaging (MRI) is a leading diagnostic modality for a wide range of exams, where multiple contrast images are often acquired for characterizing different tissues. However, acquiring high-resolution MRI typically extends scan time, which can introduce motion artifacts. Super-resolution of MRI therefore emerges as a promising approach to mitigate these challenges. Earlier studies have investigated the use of multiple contrasts for MRI super-resolution (MCSR), whereas majority of them did not fully exploit the rich contrast-invariant structural information. To fully utilize such crucial prior knowledge of multi-contrast MRI, in this work, we propose a novel structure-guided MCSR (SGSR) framework based on a new spatio-frequency co-query attention (CQA) mechanism. Specifically, CQA performs attention on features of multiple contrasts with a shared structural query, which is particularly designed to extract, fuse, and refin",
    "link": "https://arxiv.org/abs/2408.03194",
    "context": "Title: SGSR: Structure-Guided Multi-Contrast MRI Super-Resolution via Spatio-Frequency Co-Query Attention\nAbstract: arXiv:2408.03194v1 Announce Type: cross  Abstract: Magnetic Resonance Imaging (MRI) is a leading diagnostic modality for a wide range of exams, where multiple contrast images are often acquired for characterizing different tissues. However, acquiring high-resolution MRI typically extends scan time, which can introduce motion artifacts. Super-resolution of MRI therefore emerges as a promising approach to mitigate these challenges. Earlier studies have investigated the use of multiple contrasts for MRI super-resolution (MCSR), whereas majority of them did not fully exploit the rich contrast-invariant structural information. To fully utilize such crucial prior knowledge of multi-contrast MRI, in this work, we propose a novel structure-guided MCSR (SGSR) framework based on a new spatio-frequency co-query attention (CQA) mechanism. Specifically, CQA performs attention on features of multiple contrasts with a shared structural query, which is particularly designed to extract, fuse, and refin",
    "path": "papers/24/08/2408.03194.json",
    "total_tokens": 390,
    "tldr": "该文章提出了一种基于新提出的空间频率联合查询注意力机制的SGSR框架，用于多对比度MRI超级分辨率。该框架通过共享的结构查询提取、融合和精炼多对比度图像的特征，从而充分利用了多对比度MRI中的结构和对比度不变信息。通过这种方法，文章的创新点在于如何更好地结合结构信息和对比度信息，以提升MRI图像的分辨率，并且减少由于运动引入的 artifacts。"
}