{
    "title": "Leveraging Knowledge Graph Embedding for Effective Conversational Recommendation",
    "abstract": "arXiv:2408.01342v1 Announce Type: cross  Abstract: Conversational recommender system (CRS), which combines the techniques of dialogue system and recommender system, has obtained increasing interest recently. In contrast to traditional recommender system, it learns the user preference better through interactions (i.e. conversations), and then further boosts the recommendation performance. However, existing studies on CRS ignore to address the relationship among attributes, users, and items effectively, which might lead to inappropriate questions and inaccurate recommendations. In this view, we propose a knowledge graph based conversational recommender system (referred as KG-CRS). Specifically, we first integrate the user-item graph and item-attribute graph into a dynamic graph, i.e., dynamically changing during the dialogue process by removing negative items or attributes. We then learn informative embedding of users, items, and attributes by also considering propagation through neighbo",
    "link": "https://arxiv.org/abs/2408.01342",
    "context": "Title: Leveraging Knowledge Graph Embedding for Effective Conversational Recommendation\nAbstract: arXiv:2408.01342v1 Announce Type: cross  Abstract: Conversational recommender system (CRS), which combines the techniques of dialogue system and recommender system, has obtained increasing interest recently. In contrast to traditional recommender system, it learns the user preference better through interactions (i.e. conversations), and then further boosts the recommendation performance. However, existing studies on CRS ignore to address the relationship among attributes, users, and items effectively, which might lead to inappropriate questions and inaccurate recommendations. In this view, we propose a knowledge graph based conversational recommender system (referred as KG-CRS). Specifically, we first integrate the user-item graph and item-attribute graph into a dynamic graph, i.e., dynamically changing during the dialogue process by removing negative items or attributes. We then learn informative embedding of users, items, and attributes by also considering propagation through neighbo",
    "path": "papers/24/08/2408.01342.json",
    "total_tokens": 722,
    "translated_title": "利用知识图谱嵌入技术提高对话推荐系统效率",
    "translated_abstract": "arXiv:2408.01342v1 公告类型：交叉 摘要：最近，对话推荐系统（CRS）引起了越来越多的兴趣，它结合了对话系统和推荐系统的技术。与传统的推荐系统相比，CRS通过互动（即对话）更好地学习用户的偏好，从而进一步提高推荐效果。然而，现有的CRS研究忽视了有效处理属性、用户和项目之间的关系，这可能导致提出不当的问题和推荐不当的建议。因此，我们提出了一个基于知识图谱的对话推荐系统（称为KG-CRS）。具体来说，我们首先将用户-项目图和项目-属性图整合到一个动态图中，即在对话过程中动态变化，通过移除负面项目或属性。然后，我们通过考虑邻接节点之间的传播，学习了用户、项目和属性的信息嵌入。此外，我们还提出了一个专家系统模型来理解和生成候选问题。该模型通过学习用户语言的表示来解释用户选择，提高了对话推荐系统的交互性和准确性。我们实验验证了提出的动态图嵌入方法在对话推荐上的有效性，并与当前最先进的对话推荐方法进行了对比。结果表明，KG-CRS在提高推荐准确性和降低冷启动成本方面表现出了优越性。我们的方法对于对话推荐领域的研究和实际应用都具有重要的意义。",
    "tldr": "本研究提出了一种基于知识图谱的对话推荐系统，通过动态图嵌入技术和专家系统模型的结合，有效改进了对话推荐系统的交互性和准确性。"
}