{
    "title": "Improving Neural Surface Reconstruction with Feature Priors from Multi-View Image",
    "abstract": "arXiv:2408.02079v1 Announce Type: new  Abstract: Recent advancements in Neural Surface Reconstruction (NSR) have significantly improved multi-view reconstruction when coupled with volume rendering. However, relying solely on photometric consistency in image space falls short of addressing complexities posed by real-world data, including occlusions and non-Lambertian surfaces. To tackle these challenges, we propose an investigation into feature-level consistent loss, aiming to harness valuable feature priors from diverse pretext visual tasks and overcome current limitations. It is crucial to note the existing gap in determining the most effective pretext visual task for enhancing NSR. In this study, we comprehensively explore multi-view feature priors from seven pretext visual tasks, comprising thirteen methods. Our main goal is to strengthen NSR training by considering a wide range of possibilities. Additionally, we examine the impact of varying feature resolutions and evaluate both pi",
    "link": "https://arxiv.org/abs/2408.02079",
    "context": "Title: Improving Neural Surface Reconstruction with Feature Priors from Multi-View Image\nAbstract: arXiv:2408.02079v1 Announce Type: new  Abstract: Recent advancements in Neural Surface Reconstruction (NSR) have significantly improved multi-view reconstruction when coupled with volume rendering. However, relying solely on photometric consistency in image space falls short of addressing complexities posed by real-world data, including occlusions and non-Lambertian surfaces. To tackle these challenges, we propose an investigation into feature-level consistent loss, aiming to harness valuable feature priors from diverse pretext visual tasks and overcome current limitations. It is crucial to note the existing gap in determining the most effective pretext visual task for enhancing NSR. In this study, we comprehensively explore multi-view feature priors from seven pretext visual tasks, comprising thirteen methods. Our main goal is to strengthen NSR training by considering a wide range of possibilities. Additionally, we examine the impact of varying feature resolutions and evaluate both pi",
    "path": "papers/24/08/2408.02079.json",
    "total_tokens": 668,
    "translated_title": "使用多视图图像特征先验改进神经表面重建",
    "translated_abstract": "标题: arXiv:2408.02079v1 公告类型: 新的摘要: 最近在神经表面重建(NSR)方面的进展已显着提高了与体积渲染相结合的多视图重建。然而，仅在图像空间中依赖光度一致性并不能解决现实世界数据中提出的复杂问题，包括遮挡和非洛维埃表面。为了解决这些挑战，我们提出了一项对特征级一致性损失的调查，目的是利用多种预假视觉任务中的有价值特征先验，并克服目前的限制。需要指出的是，目前存在着确定最有效预假视觉任务以增强NSR所需方法的差距。在本研究中，我们全面探索了七项预假视觉任务的多视图特征先验，包括十三种方法。我们的主要目标是在广泛的可能性下强化NSR训练。此外，我们还研究了特征分辨率的变化影响，并评估了所有项目的性能和测量的数量级。结果表明，迭代训练能够显著提升重建质量，同时方法二的预训练模型提供了一个性能基准，对于理解NSR的最佳训练策略具有重要意义。",
    "tldr": "本研究旨在通过探究七种预假视觉任务的多视图特征先验来改进神经表面重建，并利用迭代训练显著提升了重建质量。",
    "en_tdlr": "This study aims to enhance neural surface reconstruction by exploring seven pretext visual tasks' multi-view feature priors and significantly improves reconstruction quality through iterative training."
}