{
    "title": "Top K Enhanced Reinforcement Learning Attacks on Heterogeneous Graph Node Classification",
    "abstract": "arXiv:2408.01964v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have attracted substantial interest due to their exceptional performance on graph-based data. However, their robustness, especially on heterogeneous graphs, remains underexplored, particularly against adversarial attacks. This paper proposes HeteroKRLAttack, a targeted evasion black-box attack method for heterogeneous graphs. By integrating reinforcement learning with a Top-K algorithm to reduce the action space, our method efficiently identifies effective attack strategies to disrupt node classification tasks. We validate the effectiveness of HeteroKRLAttack through experiments on multiple heterogeneous graph datasets, showing significant reductions in classification accuracy compared to baseline methods. An ablation study underscores the critical role of the Top-K algorithm in enhancing attack performance. Our findings highlight potential vulnerabilities in current models and provide guidance for future d",
    "link": "https://arxiv.org/abs/2408.01964",
    "context": "Title: Top K Enhanced Reinforcement Learning Attacks on Heterogeneous Graph Node Classification\nAbstract: arXiv:2408.01964v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have attracted substantial interest due to their exceptional performance on graph-based data. However, their robustness, especially on heterogeneous graphs, remains underexplored, particularly against adversarial attacks. This paper proposes HeteroKRLAttack, a targeted evasion black-box attack method for heterogeneous graphs. By integrating reinforcement learning with a Top-K algorithm to reduce the action space, our method efficiently identifies effective attack strategies to disrupt node classification tasks. We validate the effectiveness of HeteroKRLAttack through experiments on multiple heterogeneous graph datasets, showing significant reductions in classification accuracy compared to baseline methods. An ablation study underscores the critical role of the Top-K algorithm in enhancing attack performance. Our findings highlight potential vulnerabilities in current models and provide guidance for future d",
    "path": "papers/24/08/2408.01964.json",
    "total_tokens": 377,
    "tldr": "该文章提出了一种名为HeteroKRLAttack的强化学习攻击方法，旨在对异质图进行高效的节点分类任务破坏。通过整合强化学习和Top-K算法以减少行动空间，文章的贡献在于实现了对异质图的节点的准确分类任务的有效地攻击策略的发现，并通过实验验证了其在多个异质图数据集中的有效性，显示出相比基准方法显著的分类准确率的降低。通过分析发现Top-K算法对攻击性能有着关键的提升作用。"
}