{
    "title": "Efficient and Accurate Pneumonia Detection Using a Novel Multi-Scale Transformer Approach",
    "abstract": "arXiv:2408.04290v1 Announce Type: cross  Abstract: Pneumonia, a severe respiratory disease, poses significant diagnostic challenges, especially in underdeveloped regions. Traditional diagnostic methods, such as chest X-rays, suffer from variability in interpretation among radiologists, necessitating reliable automated tools. In this study, we propose a novel approach combining deep learning and transformer-based attention mechanisms to enhance pneumonia detection from chest X-rays. Our method begins with lung segmentation using a TransUNet model that integrates our specialized transformer module, which has fewer parameters compared to common transformers while maintaining performance. This model is trained on the \"Chest Xray Masks and Labels\" dataset and then applied to the Kermany and Cohen datasets to isolate lung regions, enhancing subsequent classification tasks. For classification, we employ pre-trained ResNet models (ResNet-50 and ResNet-101) to extract multi-scale feature maps, ",
    "link": "https://arxiv.org/abs/2408.04290",
    "context": "Title: Efficient and Accurate Pneumonia Detection Using a Novel Multi-Scale Transformer Approach\nAbstract: arXiv:2408.04290v1 Announce Type: cross  Abstract: Pneumonia, a severe respiratory disease, poses significant diagnostic challenges, especially in underdeveloped regions. Traditional diagnostic methods, such as chest X-rays, suffer from variability in interpretation among radiologists, necessitating reliable automated tools. In this study, we propose a novel approach combining deep learning and transformer-based attention mechanisms to enhance pneumonia detection from chest X-rays. Our method begins with lung segmentation using a TransUNet model that integrates our specialized transformer module, which has fewer parameters compared to common transformers while maintaining performance. This model is trained on the \"Chest Xray Masks and Labels\" dataset and then applied to the Kermany and Cohen datasets to isolate lung regions, enhancing subsequent classification tasks. For classification, we employ pre-trained ResNet models (ResNet-50 and ResNet-101) to extract multi-scale feature maps, ",
    "path": "papers/24/08/2408.04290.json",
    "total_tokens": 380,
    "tldr": "该文章提出了一种结合深度学习和transformer注意力机制的全新方法，用于从X光胸片高效准确地检测肺炎，该方法通过使用具有特殊自研Transformer模块的TransUNet模型进行肺部分割，减少了模型参数数量，同时保持了性能，并通过使用预训练的ResNet模型进行多尺度特征提取，提高分类任务性能，有效解决了传统诊断方法在区域变量和解读不同医生之间的挑战。"
}