{
    "title": "Social Behavior as a Key to Learning-based Multi-Agent Pathfinding Dilemmas",
    "abstract": "arXiv:2408.03063v1 Announce Type: new  Abstract: The Multi-agent Path Finding (MAPF) problem involves finding collision-free paths for a team of agents in a known, static environment, with important applications in warehouse automation, logistics, or last-mile delivery. To meet the needs of these large-scale applications, current learning-based methods often deploy the same fully trained, decentralized network to all agents to improve scalability. However, such parameter sharing typically results in homogeneous behaviors among agents, which may prevent agents from breaking ties around symmetric conflict (e.g., bottlenecks) and might lead to live-/deadlocks. In this paper, we propose SYLPH, a novel learning-based MAPF framework aimed to mitigate the adverse effects of homogeneity by allowing agents to learn and dynamically select different social behaviors (akin to individual, dynamic roles), without affecting the scalability offered by parameter sharing. Specifically, SYLPH agents lear",
    "link": "https://arxiv.org/abs/2408.03063",
    "context": "Title: Social Behavior as a Key to Learning-based Multi-Agent Pathfinding Dilemmas\nAbstract: arXiv:2408.03063v1 Announce Type: new  Abstract: The Multi-agent Path Finding (MAPF) problem involves finding collision-free paths for a team of agents in a known, static environment, with important applications in warehouse automation, logistics, or last-mile delivery. To meet the needs of these large-scale applications, current learning-based methods often deploy the same fully trained, decentralized network to all agents to improve scalability. However, such parameter sharing typically results in homogeneous behaviors among agents, which may prevent agents from breaking ties around symmetric conflict (e.g., bottlenecks) and might lead to live-/deadlocks. In this paper, we propose SYLPH, a novel learning-based MAPF framework aimed to mitigate the adverse effects of homogeneity by allowing agents to learn and dynamically select different social behaviors (akin to individual, dynamic roles), without affecting the scalability offered by parameter sharing. Specifically, SYLPH agents lear",
    "path": "papers/24/08/2408.03063.json",
    "total_tokens": 368,
    "tldr": "该文章介绍了SYLPH框架，它是一种新的学习方法，用于解决团队路径搜索问题。这种方法的创新之处在于，它允许代理学习不同的社会行为以应对交通堵塞等特定情况，同时保持了跨代理参数共享的效率。通过这种方式，SYLPH能够提高路径搜索中的灵活性和效率，减少了碰撞并防止了死锁现象。"
}