{
    "title": "On The Stability of Moral Preferences: A Problem with Computational Elicitation Methods",
    "abstract": "arXiv:2408.02862v1 Announce Type: cross  Abstract: Preference elicitation frameworks feature heavily in the research on participatory ethical AI tools and provide a viable mechanism to enquire and incorporate the moral values of various stakeholders. As part of the elicitation process, surveys about moral preferences, opinions, and judgments are typically administered only once to each participant. This methodological practice is reasonable if participants' responses are stable over time such that, all other relevant factors being held constant, their responses today will be the same as their responses to the same questions at a later time. However, we do not know how often that is the case. It is possible that participants' true moral preferences change, are subject to temporary moods or whims, or are influenced by environmental factors we don't track. If participants' moral responses are unstable in such ways, it would raise important methodological and theoretical issues for how par",
    "link": "https://arxiv.org/abs/2408.02862",
    "context": "Title: On The Stability of Moral Preferences: A Problem with Computational Elicitation Methods\nAbstract: arXiv:2408.02862v1 Announce Type: cross  Abstract: Preference elicitation frameworks feature heavily in the research on participatory ethical AI tools and provide a viable mechanism to enquire and incorporate the moral values of various stakeholders. As part of the elicitation process, surveys about moral preferences, opinions, and judgments are typically administered only once to each participant. This methodological practice is reasonable if participants' responses are stable over time such that, all other relevant factors being held constant, their responses today will be the same as their responses to the same questions at a later time. However, we do not know how often that is the case. It is possible that participants' true moral preferences change, are subject to temporary moods or whims, or are influenced by environmental factors we don't track. If participants' moral responses are unstable in such ways, it would raise important methodological and theoretical issues for how par",
    "path": "papers/24/08/2408.02862.json",
    "total_tokens": 349,
    "tldr": "该文章探讨了道德偏好的稳定性问题，提出了仅在单一时间点对个人进行道德偏好调查的方法可能无法准确反映其真实价值观，因为人们的道德判断可能因时间、情绪或环境因素的变化而出现不稳定，这一发现对研究参与式伦理AI工具的调查方法提出了重要挑战。"
}