{
    "title": "Distillation Learning Guided by Image Reconstruction for One-Shot Medical Image Segmentation",
    "abstract": "arXiv:2408.03616v1 Announce Type: cross  Abstract: Traditional one-shot medical image segmentation (MIS) methods use registration networks to propagate labels from a reference atlas or rely on comprehensive sampling strategies to generate synthetic labeled data for training. However, these methods often struggle with registration errors and low-quality synthetic images, leading to poor performance and generalization. To overcome this, we introduce a novel one-shot MIS framework based on knowledge distillation, which allows the network to directly 'see' real images through a distillation process guided by image reconstruction. It focuses on anatomical structures in a single labeled image and a few unlabeled ones. A registration-based data augmentation network creates realistic, labeled samples, while a feature distillation module helps the student network learn segmentation from these samples, guided by the teacher network. During inference, the streamlined student network accurately se",
    "link": "https://arxiv.org/abs/2408.03616",
    "context": "Title: Distillation Learning Guided by Image Reconstruction for One-Shot Medical Image Segmentation\nAbstract: arXiv:2408.03616v1 Announce Type: cross  Abstract: Traditional one-shot medical image segmentation (MIS) methods use registration networks to propagate labels from a reference atlas or rely on comprehensive sampling strategies to generate synthetic labeled data for training. However, these methods often struggle with registration errors and low-quality synthetic images, leading to poor performance and generalization. To overcome this, we introduce a novel one-shot MIS framework based on knowledge distillation, which allows the network to directly 'see' real images through a distillation process guided by image reconstruction. It focuses on anatomical structures in a single labeled image and a few unlabeled ones. A registration-based data augmentation network creates realistic, labeled samples, while a feature distillation module helps the student network learn segmentation from these samples, guided by the teacher network. During inference, the streamlined student network accurately se",
    "path": "papers/24/08/2408.03616.json",
    "total_tokens": 323,
    "tldr": "该文章提出的创新框架通过知识蒸馏结合图像重建技术，为单一标记的医疗图像进行了一键式分割，有效缓解了传统方法因注册错误和低质量合成图像引起的性能问题，增强了模型在实际中的广泛泛化能力。"
}