{
    "title": "FCDFusion: a Fast, Low Color Deviation Method for Fusing Visible and Infrared Image Pairs",
    "abstract": "arXiv:2408.01080v1 Announce Type: new  Abstract: Visible and infrared image fusion (VIF) aims to combine information from visible and infrared images into a single fused image. Previous VIF methods usually employ a color space transformation to keep the hue and saturation from the original visible image. However, for fast VIF methods, this operation accounts for the majority of the calculation and is the bottleneck preventing faster processing. In this paper, we propose a fast fusion method, FCDFusion, with little color deviation. It preserves color information without color space transformations, by directly operating in RGB color space. It incorporates gamma correction at little extra cost, allowing color and contrast to be rapidly improved. We regard the fusion process as a scaling operation on 3D color vectors, greatly simplifying the calculations. A theoretical analysis and experiments show that our method can achieve satisfactory results in only 7 FLOPs per pixel. Compared to sta",
    "link": "https://arxiv.org/abs/2408.01080",
    "context": "Title: FCDFusion: a Fast, Low Color Deviation Method for Fusing Visible and Infrared Image Pairs\nAbstract: arXiv:2408.01080v1 Announce Type: new  Abstract: Visible and infrared image fusion (VIF) aims to combine information from visible and infrared images into a single fused image. Previous VIF methods usually employ a color space transformation to keep the hue and saturation from the original visible image. However, for fast VIF methods, this operation accounts for the majority of the calculation and is the bottleneck preventing faster processing. In this paper, we propose a fast fusion method, FCDFusion, with little color deviation. It preserves color information without color space transformations, by directly operating in RGB color space. It incorporates gamma correction at little extra cost, allowing color and contrast to be rapidly improved. We regard the fusion process as a scaling operation on 3D color vectors, greatly simplifying the calculations. A theoretical analysis and experiments show that our method can achieve satisfactory results in only 7 FLOPs per pixel. Compared to sta",
    "path": "papers/24/08/2408.01080.json",
    "total_tokens": 747,
    "translated_title": "FCDFusion：一种快速的低色差可见与红外图像对融合方法",
    "translated_abstract": "arXiv:2408.01080v1 公告类型：新 Abstract: 可见与红外图像融合（VIF）旨在将可见和红外图像的信息融合为单张融合图像。以往的VIF方法通常使用颜色空间转换来保持原始可见图像的色调和饱和度。然而，对于快速VIF方法，这个操作占计算的大部分，并且是阻止更快速处理的主要瓶颈。在本文中，我们提出了一个快速的融合方法，名为FCDFusion，它具有极低的颜色偏离。通过直接在RGB颜色空间中操作，它不用颜色的空间转换，就能够保留颜色信息。它通过轻微的成本引入伽马校正，允许快速地改善色彩和对比度。我们将融合过程视为对3D颜色向量的缩放操作，大大简化了计算。理论分析和实验表明，我们的方法可以在每像素7个浮点运算（FLOPs）的情况下达到令人满意的成果。相比于现有技术，我们的方法在处理速度、图像质量上都有了显著的提高。",
    "tldr": "该论文提出了一个名为FCDFusion的快速低色差可见与红外图像融合方法，该方法通过直接在RGB颜色空间中操作，以及引入伽马校正，以极低的计算成本实现了图像色彩和对比度的快速提升，从而在保持图像质量的同时显著提高了处理速度。"
}