{
    "title": "An efficient strategy for path planning with a tethered marsupial robotics system",
    "abstract": "arXiv:2408.02141v1 Announce Type: new  Abstract: A marsupial robotics system comprises three components: an Unmanned Ground Vehicle (UGV), an Unmanned Aerial Vehicle (UAV), and a tether connecting both robots. Marsupial systems are highly beneficial in industry as they extend the UAV's battery life during flight. This paper introduces a novel strategy for a specific path planning problem in marsupial systems, where each of the components must avoid collisions with ground and aerial obstacles modeled as 3D cuboids. Given an initial configuration in which the UAV is positioned atop the UGV, the goal is to reach an aerial target with the UAV. We assume that the UGV first moves to a position from which the UAV can take off and fly through a vertical plane to reach an aerial target. We propose an approach that discretizes the space to approximate an optimal solution, minimizing the sum of the lengths of the ground and air paths. First, we assume a taut tether and use a novel algorithm that ",
    "link": "https://arxiv.org/abs/2408.02141",
    "context": "Title: An efficient strategy for path planning with a tethered marsupial robotics system\nAbstract: arXiv:2408.02141v1 Announce Type: new  Abstract: A marsupial robotics system comprises three components: an Unmanned Ground Vehicle (UGV), an Unmanned Aerial Vehicle (UAV), and a tether connecting both robots. Marsupial systems are highly beneficial in industry as they extend the UAV's battery life during flight. This paper introduces a novel strategy for a specific path planning problem in marsupial systems, where each of the components must avoid collisions with ground and aerial obstacles modeled as 3D cuboids. Given an initial configuration in which the UAV is positioned atop the UGV, the goal is to reach an aerial target with the UAV. We assume that the UGV first moves to a position from which the UAV can take off and fly through a vertical plane to reach an aerial target. We propose an approach that discretizes the space to approximate an optimal solution, minimizing the sum of the lengths of the ground and air paths. First, we assume a taut tether and use a novel algorithm that ",
    "path": "papers/24/08/2408.02141.json",
    "total_tokens": 515,
    "tldr": "该文章提出了一种为带有缆绳的负鼠型机器人系统设计的高效路径规划策略，该系统包括无人地面车辆(UGV)、无人空中车辆(UAV)和连接两者的缆绳。研究重点是解决一个特定路径规划问题，其中包括避开地面和空中障碍物，这些障碍物被建模为三维立方体。初始配置中，UAV位于UGV顶部，目标是使UAV到达空中目标点。假设UGV先移动到一个位置，使UAV可以从那里起飞并在垂直平面内飞行以到达空中目标。文章提出了一个将空间进行离散化以近似最优解的方法，最小化地面和空中路径的总长度。文章假设缆绳是松弛的，并且使用了一个新颖的算法，该算法结合了遗传算法和障碍物避让策略，以在多变量规划问题中找到一条路径，使UAV在有限的时间内安全到达目标，且同时考虑到UGV的活动空间。"
}