{
    "title": "Dedicated Nonlinear Control of Robot Manipulators in the Presence of External Vibration and Uncertain Payload",
    "abstract": "arXiv:2408.03098v1 Announce Type: cross  Abstract: Robot manipulators are often tasked with working in environments with vibrations and are subject to load uncertainty. Providing an accurate tracking control design with implementable torque input for these robots is a complex topic. This paper presents two approaches to solve this problem. The approaches consider joint space tracking control design in the presence of nonlinear uncertain torques caused by external vibration and payload variation. The properties of the uncertain torques are used in both approaches. The first approach is based on the boundedness property, while the second approach considers the differentiability and boundedness together. The controllers derived from each approach differ from the perspectives of accuracy, control effort, and disturbance properties. A Lyapunov-based analysis is utilized to guarantee the stability of the control design in each case. Simulation results validate the approaches and demonstrate ",
    "link": "https://arxiv.org/abs/2408.03098",
    "context": "Title: Dedicated Nonlinear Control of Robot Manipulators in the Presence of External Vibration and Uncertain Payload\nAbstract: arXiv:2408.03098v1 Announce Type: cross  Abstract: Robot manipulators are often tasked with working in environments with vibrations and are subject to load uncertainty. Providing an accurate tracking control design with implementable torque input for these robots is a complex topic. This paper presents two approaches to solve this problem. The approaches consider joint space tracking control design in the presence of nonlinear uncertain torques caused by external vibration and payload variation. The properties of the uncertain torques are used in both approaches. The first approach is based on the boundedness property, while the second approach considers the differentiability and boundedness together. The controllers derived from each approach differ from the perspectives of accuracy, control effort, and disturbance properties. A Lyapunov-based analysis is utilized to guarantee the stability of the control design in each case. Simulation results validate the approaches and demonstrate ",
    "path": "papers/24/08/2408.03098.json",
    "total_tokens": 317,
    "tldr": "该文章针对机器人臂在遭遇外部振动和负载不确定性的情况，提出针对性的非线性控制策略，确保了系统的稳定性和有效性，并通过精确控制输入实现了关节轨迹跟踪任务。"
}