{
    "title": "HDPlanner: Advancing Autonomous Deployments in Unknown Environments through Hierarchical Decision Networks",
    "abstract": "arXiv:2408.03768v1 Announce Type: new  Abstract: In this paper, we introduce HDPlanner, a deep reinforcement learning (DRL) based framework designed to tackle two core and challenging tasks for mobile robots: autonomous exploration and navigation, where the robot must optimize its trajectory adaptively to achieve the task objective through continuous interactions in unknown environments. Specifically, HDPlanner relies on novel hierarchical attention networks to empower the robot to reason about its belief across multiple spatial scales and sequence collaborative decisions, where our networks decompose long-term objectives into short-term informative task assignments and informative path plannings. We further propose a contrastive learning-based joint optimization to enhance the robustness of HDPlanner. We empirically demonstrate that HDPlanner significantly outperforms state-of-the-art conventional and learning-based baselines on an extensive set of simulations, including hundreds of t",
    "link": "https://arxiv.org/abs/2408.03768",
    "context": "Title: HDPlanner: Advancing Autonomous Deployments in Unknown Environments through Hierarchical Decision Networks\nAbstract: arXiv:2408.03768v1 Announce Type: new  Abstract: In this paper, we introduce HDPlanner, a deep reinforcement learning (DRL) based framework designed to tackle two core and challenging tasks for mobile robots: autonomous exploration and navigation, where the robot must optimize its trajectory adaptively to achieve the task objective through continuous interactions in unknown environments. Specifically, HDPlanner relies on novel hierarchical attention networks to empower the robot to reason about its belief across multiple spatial scales and sequence collaborative decisions, where our networks decompose long-term objectives into short-term informative task assignments and informative path plannings. We further propose a contrastive learning-based joint optimization to enhance the robustness of HDPlanner. We empirically demonstrate that HDPlanner significantly outperforms state-of-the-art conventional and learning-based baselines on an extensive set of simulations, including hundreds of t",
    "path": "papers/24/08/2408.03768.json",
    "total_tokens": 370,
    "tldr": "该文章提出了一种名为HDPlanner的深度强化学习框架，该框架通过层级注意网络使移动机器人能够在未知环境中进行自主探索和导航，其能够处理两个核心任务：一是优化动作轨迹以适应环境并根据长期目标分配短期任务，二是选择最合适的路径。通过对环境的多层级认知和短期长期目标的高效结合，该框架展现了其在增强机器学习功能和提高环境中移动机器人的导航能力方面的显著优势。"
}