{
    "title": "Improving Air Mobility for Pre-Disaster Planning with Neural Network Accelerated Genetic Algorithm",
    "abstract": "arXiv:2408.00790v1 Announce Type: cross  Abstract: Weather disaster related emergency operations pose a great challenge to air mobility in both aircraft and airport operations, especially when the impact is gradually approaching. We propose an optimized framework for adjusting airport operational schedules for such pre-disaster scenarios. We first, aggregate operational data from multiple airports and then determine the optimal count of evacuation flights to maximize the impacted airport's outgoing capacity without impeding regular air traffic. We then propose a novel Neural Network (NN) accelerated Genetic Algorithm(GA) for evacuation planning. Our experiments show that integration yielded comparable results but with smaller computational overhead. We find that the utilization of a NN enhances the efficiency of a GA, facilitating more rapid convergence even when operating with a reduced population size. This effectiveness persists even when the model is trained on data from airports d",
    "link": "https://arxiv.org/abs/2408.00790",
    "context": "Title: Improving Air Mobility for Pre-Disaster Planning with Neural Network Accelerated Genetic Algorithm\nAbstract: arXiv:2408.00790v1 Announce Type: cross  Abstract: Weather disaster related emergency operations pose a great challenge to air mobility in both aircraft and airport operations, especially when the impact is gradually approaching. We propose an optimized framework for adjusting airport operational schedules for such pre-disaster scenarios. We first, aggregate operational data from multiple airports and then determine the optimal count of evacuation flights to maximize the impacted airport's outgoing capacity without impeding regular air traffic. We then propose a novel Neural Network (NN) accelerated Genetic Algorithm(GA) for evacuation planning. Our experiments show that integration yielded comparable results but with smaller computational overhead. We find that the utilization of a NN enhances the efficiency of a GA, facilitating more rapid convergence even when operating with a reduced population size. This effectiveness persists even when the model is trained on data from airports d",
    "path": "papers/24/08/2408.00790.json",
    "total_tokens": 631,
    "translated_title": "使用神经网络加速遗传算法改进预灾规划的航空机动性",
    "translated_abstract": "arXiv:2408.00790v1 公告类型：交叉 摘要：天气灾害相关的紧急操作对航空机动性造成了巨大的挑战，尤其是在影响逐渐临近的时候，尤其是在影响逐渐临近的时候，尤其是在影响逐渐临近的时候，对飞机和机场操作尤其如此。我们提出了一种调整机场运营计划的优化框架，以应对这种预灾情况。首先，我们从多个机场汇总会运营数据，然后确定最多撤离航班的数量，以最大限度地提高受影响机场的发出能力，同时不阻碍常规航空交通。我们提出了一个新型的神经网络（NN）加速遗传算法（GA）用于疏散规划。我们的实验表明，整合虽然提供了与较小计算开销的相似结果。我们发现，在不缩小种群规模的情况下，使用神经网络能够提高遗传算法的效率，甚至在模型在来自不同机场的数据上进行训练后也同样有效。",
    "tldr": "本研究提出了一种新的遗传算法框架，通过神经网络加速机场运营计划的优化，以应对天气灾害的紧急疏散需求，即使是在数据有限的情况下也能有效提高疏散效率。",
    "en_tdlr": "A novel genetic algorithm framework has been proposed to accelerate the optimization of airport operational schedules for emergency evacuation in pre-disaster scenarios, utilizing a neural network to significantly enhance efficiency even with limited data."
}