{
    "title": "Towards Synergistic Deep Learning Models for Volumetric Cirrhotic Liver Segmentation in MRIs",
    "abstract": "arXiv:2408.04491v1 Announce Type: new  Abstract: Liver cirrhosis, a leading cause of global mortality, requires precise segmentation of ROIs for effective disease monitoring and treatment planning. Existing segmentation models often fail to capture complex feature interactions and generalize across diverse datasets. To address these limitations, we propose a novel synergistic theory that leverages complementary latent spaces for enhanced feature interaction modeling. Our proposed architecture, nnSynergyNet3D integrates continuous and discrete latent spaces for 3D volumes and features auto-configured training. This approach captures both fine-grained and coarse features, enabling effective modeling of intricate feature interactions. We empirically validated nnSynergyNet3D on a private dataset of 628 high-resolution T1 abdominal MRI scans from 339 patients. Our model outperformed the baseline nnUNet3D by approximately 2%. Additionally, zero-shot testing on healthy liver CT scans from the",
    "link": "https://arxiv.org/abs/2408.04491",
    "context": "Title: Towards Synergistic Deep Learning Models for Volumetric Cirrhotic Liver Segmentation in MRIs\nAbstract: arXiv:2408.04491v1 Announce Type: new  Abstract: Liver cirrhosis, a leading cause of global mortality, requires precise segmentation of ROIs for effective disease monitoring and treatment planning. Existing segmentation models often fail to capture complex feature interactions and generalize across diverse datasets. To address these limitations, we propose a novel synergistic theory that leverages complementary latent spaces for enhanced feature interaction modeling. Our proposed architecture, nnSynergyNet3D integrates continuous and discrete latent spaces for 3D volumes and features auto-configured training. This approach captures both fine-grained and coarse features, enabling effective modeling of intricate feature interactions. We empirically validated nnSynergyNet3D on a private dataset of 628 high-resolution T1 abdominal MRI scans from 339 patients. Our model outperformed the baseline nnUNet3D by approximately 2%. Additionally, zero-shot testing on healthy liver CT scans from the",
    "path": "papers/24/08/2408.04491.json",
    "total_tokens": 360,
    "tldr": "该文章提出了一种新型的深度学习模型，用于在MRI图像中实现对肝脏硬化症的准确分割。该模型整合了连续和离散的 latent space，以捕捉图像的复杂特征交互，并在一个包含628个样本的私有数据集上取得了相较于 baseline 模型的显著提升。"
}