{
    "title": "VisionUnite: A Vision-Language Foundation Model for Ophthalmology Enhanced with Clinical Knowledge",
    "abstract": "arXiv:2408.02865v1 Announce Type: cross  Abstract: The need for improved diagnostic methods in ophthalmology is acute, especially in the less developed regions with limited access to specialists and advanced equipment. Therefore, we introduce VisionUnite, a novel vision-language foundation model for ophthalmology enhanced with clinical knowledge. VisionUnite has been pretrained on an extensive dataset comprising 1.24 million image-text pairs, and further refined using our proposed MMFundus dataset, which includes 296,379 high-quality fundus image-text pairs and 889,137 simulated doctor-patient dialogue instances. Our experiments indicate that VisionUnite outperforms existing generative foundation models such as GPT-4V and Gemini Pro. It also demonstrates diagnostic capabilities comparable to junior ophthalmologists. VisionUnite performs well in various clinical scenarios including open-ended multi-disease diagnosis, clinical explanation, and patient interaction, making it a highly vers",
    "link": "https://arxiv.org/abs/2408.02865",
    "context": "Title: VisionUnite: A Vision-Language Foundation Model for Ophthalmology Enhanced with Clinical Knowledge\nAbstract: arXiv:2408.02865v1 Announce Type: cross  Abstract: The need for improved diagnostic methods in ophthalmology is acute, especially in the less developed regions with limited access to specialists and advanced equipment. Therefore, we introduce VisionUnite, a novel vision-language foundation model for ophthalmology enhanced with clinical knowledge. VisionUnite has been pretrained on an extensive dataset comprising 1.24 million image-text pairs, and further refined using our proposed MMFundus dataset, which includes 296,379 high-quality fundus image-text pairs and 889,137 simulated doctor-patient dialogue instances. Our experiments indicate that VisionUnite outperforms existing generative foundation models such as GPT-4V and Gemini Pro. It also demonstrates diagnostic capabilities comparable to junior ophthalmologists. VisionUnite performs well in various clinical scenarios including open-ended multi-disease diagnosis, clinical explanation, and patient interaction, making it a highly vers",
    "path": "papers/24/08/2408.02865.json",
    "total_tokens": 401,
    "tldr": "该文章描述了一个名为VisionUnite的全新面向眼科的视觉语言基础模型，它增强了临床知识，并在1.24亿图像文本对的大型数据集上进行了预训练。VisionUnite在诊断能力上超越了现有的生成性基础模型，如GPT-4V和Gemini Pro，并且在多病种诊断、临床解释和病人互动等临床场景中表现出色，有望成为辅助专科医师的有力工具。"
}