{
    "title": "Multimodal Gender Fairness in Depression Prediction: Insights on Data from the USA & China",
    "abstract": "arXiv:2408.04026v1 Announce Type: cross  Abstract: Social agents and robots are increasingly being used in wellbeing settings. However, a key challenge is that these agents and robots typically rely on machine learning (ML) algorithms to detect and analyse an individual's mental wellbeing. The problem of bias and fairness in ML algorithms is becoming an increasingly greater source of concern. In concurrence, existing literature has also indicated that mental health conditions can manifest differently across genders and cultures. We hypothesise that the representation of features (acoustic, textual, and visual) and their inter-modal relations would vary among subjects from different cultures and genders, thus impacting the performance and fairness of various ML models. We present the very first evaluation of multimodal gender fairness in depression manifestation by undertaking a study on two different datasets from the USA and China. We undertake thorough statistical and ML experimentat",
    "link": "https://arxiv.org/abs/2408.04026",
    "context": "Title: Multimodal Gender Fairness in Depression Prediction: Insights on Data from the USA & China\nAbstract: arXiv:2408.04026v1 Announce Type: cross  Abstract: Social agents and robots are increasingly being used in wellbeing settings. However, a key challenge is that these agents and robots typically rely on machine learning (ML) algorithms to detect and analyse an individual's mental wellbeing. The problem of bias and fairness in ML algorithms is becoming an increasingly greater source of concern. In concurrence, existing literature has also indicated that mental health conditions can manifest differently across genders and cultures. We hypothesise that the representation of features (acoustic, textual, and visual) and their inter-modal relations would vary among subjects from different cultures and genders, thus impacting the performance and fairness of various ML models. We present the very first evaluation of multimodal gender fairness in depression manifestation by undertaking a study on two different datasets from the USA and China. We undertake thorough statistical and ML experimentat",
    "path": "papers/24/08/2408.04026.json",
    "total_tokens": 322,
    "tldr": "该文章首次对来自美国和中国的两个不同数据集中的抑郁表现模式进行了评估，探究了跨文化和跨性别间的模态特征及相互关系如何影响机器学习模型性能和性别公平性的问题。"
}