{
    "title": "Pixel-Level Domain Adaptation: A New Perspective for Enhancing Weakly Supervised Semantic Segmentation",
    "abstract": "arXiv:2408.02039v1 Announce Type: new  Abstract: Recent attention has been devoted to the pursuit of learning semantic segmentation models exclusively from image tags, a paradigm known as image-level Weakly Supervised Semantic Segmentation (WSSS). Existing attempts adopt the Class Activation Maps (CAMs) as priors to mine object regions yet observe the imbalanced activation issue, where only the most discriminative object parts are located. In this paper, we argue that the distribution discrepancy between the discriminative and the non-discriminative parts of objects prevents the model from producing complete and precise pseudo masks as ground truths. For this purpose, we propose a Pixel-Level Domain Adaptation (PLDA) method to encourage the model in learning pixel-wise domain-invariant features. Specifically, a multi-head domain classifier trained adversarially with the feature extraction is introduced to promote the emergence of pixel features that are invariant with respect to the sh",
    "link": "https://arxiv.org/abs/2408.02039",
    "context": "Title: Pixel-Level Domain Adaptation: A New Perspective for Enhancing Weakly Supervised Semantic Segmentation\nAbstract: arXiv:2408.02039v1 Announce Type: new  Abstract: Recent attention has been devoted to the pursuit of learning semantic segmentation models exclusively from image tags, a paradigm known as image-level Weakly Supervised Semantic Segmentation (WSSS). Existing attempts adopt the Class Activation Maps (CAMs) as priors to mine object regions yet observe the imbalanced activation issue, where only the most discriminative object parts are located. In this paper, we argue that the distribution discrepancy between the discriminative and the non-discriminative parts of objects prevents the model from producing complete and precise pseudo masks as ground truths. For this purpose, we propose a Pixel-Level Domain Adaptation (PLDA) method to encourage the model in learning pixel-wise domain-invariant features. Specifically, a multi-head domain classifier trained adversarially with the feature extraction is introduced to promote the emergence of pixel features that are invariant with respect to the sh",
    "path": "papers/24/08/2408.02039.json",
    "total_tokens": 768,
    "translated_title": "像素级域适应：增强弱监督语义分割的新视角",
    "translated_abstract": "arXiv:2408.02039v1 公告类型：新  摘要：最近，已经有人关注从图像标签中学习 semantic segmentation 模型，这一范式被称为 image-level Weakly Supervised Semantic Segmentation (WSSS)。现有尝试采用 Class Activation Maps (CAMs) 作为先验来挖掘物体区域，但观察到激活不平衡问题，只有最具有辨别性的物体部分被定位在此篇文章中，我们认为仅从图像标签学习的模型难以生成完整和精确的伪 mask 做为 ground truths。为此，我们提出了一种 Pixel-Level Domain Adaptation (PLDA) 方法，以此鼓励模型学习像素级的域不变特征。具体地，通过一个对抗训练的多头域分类器，该分类器与特征提取器一起训练，以促进生成与域无关的像素特征。此外，我们还采用了多尺度细化和特征一致性正则化策略，以进一步提升伪 mask 的质量。我们通过实验验证了我们的 PLDA 方法，其在 image-level WSSS 任务中表现出了优越的性能。",
    "tldr": "本文提出了一种名为 Pixel-Level Domain Adaptation (PLDA) 的全新方法，旨在通过对抗训练的方式，使模型学习到在物体不同部分之间具有一致性的像素级特征，从而在从图像标签进行弱监督语义分割的背景下，生成更清晰、更精确的伪 mask 信息。"
}