{
    "title": "HIVE: HIerarchical Volume Encoding for Neural Implicit Surface Reconstruction",
    "abstract": "arXiv:2408.01677v1 Announce Type: new  Abstract: Neural implicit surface reconstruction has become a new trend in reconstructing a detailed 3D shape from images. In previous methods, however, the 3D scene is only encoded by the MLPs which do not have an explicit 3D structure. To better represent 3D shapes, we introduce a volume encoding to explicitly encode the spatial information. We further design hierarchical volumes to encode the scene structures in multiple scales. The high-resolution volumes capture the high-frequency geometry details since spatially varying features could be learned from different 3D points, while the low-resolution volumes enforce the spatial consistency to keep the shape smooth since adjacent locations possess the same low-resolution feature. In addition, we adopt a sparse structure to reduce the memory consumption at high-resolution volumes, and two regularization terms to enhance results smoothness. This hierarchical volume encoding could be appended to any ",
    "link": "https://arxiv.org/abs/2408.01677",
    "context": "Title: HIVE: HIerarchical Volume Encoding for Neural Implicit Surface Reconstruction\nAbstract: arXiv:2408.01677v1 Announce Type: new  Abstract: Neural implicit surface reconstruction has become a new trend in reconstructing a detailed 3D shape from images. In previous methods, however, the 3D scene is only encoded by the MLPs which do not have an explicit 3D structure. To better represent 3D shapes, we introduce a volume encoding to explicitly encode the spatial information. We further design hierarchical volumes to encode the scene structures in multiple scales. The high-resolution volumes capture the high-frequency geometry details since spatially varying features could be learned from different 3D points, while the low-resolution volumes enforce the spatial consistency to keep the shape smooth since adjacent locations possess the same low-resolution feature. In addition, we adopt a sparse structure to reduce the memory consumption at high-resolution volumes, and two regularization terms to enhance results smoothness. This hierarchical volume encoding could be appended to any ",
    "path": "papers/24/08/2408.01677.json",
    "total_tokens": 634,
    "translated_title": "HIVE: 层次化体积编码像素隐式表面重建",
    "translated_abstract": "arXiv:2408.01677v1 声明类型：新 摘要：神经隐式表面重建从图像中重建三维形状的趋势。然而，在以往的方法中，3D场景仅由MLPs编码，这些MLPs没有明确的三维结构。为了更好地表示3D形状，我们引入了一种体积编码方法，以明确编码空间信息。我们还设计了层次化体积，以在多个尺度上编码场景结构。高分辨率体积捕获高频几何细节，因为可以从不同的3D点学习空间变化特征，而低分辨率体积保证了形状的平滑性，因为相邻位置具有相同的低分辨率特征。此外，我们还采用了稀疏结构来减少在高分辨率体积中的内存消耗，以及两种正则化项来增强结果的平滑性。这种层次化体积编码可以附加到任何三维重建网络中，以提高重建的三维形状的精确度和细节表现。",
    "tldr": "HIVE方法通过引入层次化体积编码和稀疏结构，实现了对三维形状的高精度重建，并显著提高了细节表现。"
}