{
    "title": "HistoSPACE: Histology-Inspired Spatial Transcriptome Prediction And Characterization Engine",
    "abstract": "arXiv:2408.03592v1 Announce Type: cross  Abstract: Spatial transcriptomics (ST) enables the visualization of gene expression within the context of tissue morphology. This emerging discipline has the potential to serve as a foundation for developing tools to design precision medicines. However, due to the higher costs and expertise required for such experiments, its translation into a regular clinical practice might be challenging. Despite the implementation of modern deep learning to enhance information obtained from histological images using AI, efforts have been constrained by limitations in the diversity of information. In this paper, we developed a model, HistoSPACE that explore the diversity of histological images available with ST data to extract molecular insights from tissue image. Our proposed study built an image encoder derived from universal image autoencoder. This image encoder was connected to convolution blocks to built the final model. It was further fine tuned with the",
    "link": "https://arxiv.org/abs/2408.03592",
    "context": "Title: HistoSPACE: Histology-Inspired Spatial Transcriptome Prediction And Characterization Engine\nAbstract: arXiv:2408.03592v1 Announce Type: cross  Abstract: Spatial transcriptomics (ST) enables the visualization of gene expression within the context of tissue morphology. This emerging discipline has the potential to serve as a foundation for developing tools to design precision medicines. However, due to the higher costs and expertise required for such experiments, its translation into a regular clinical practice might be challenging. Despite the implementation of modern deep learning to enhance information obtained from histological images using AI, efforts have been constrained by limitations in the diversity of information. In this paper, we developed a model, HistoSPACE that explore the diversity of histological images available with ST data to extract molecular insights from tissue image. Our proposed study built an image encoder derived from universal image autoencoder. This image encoder was connected to convolution blocks to built the final model. It was further fine tuned with the",
    "path": "papers/24/08/2408.03592.json",
    "total_tokens": 326,
    "tldr": "该文章开发了一种名为HistoSPACE的模型，该模型通过整合来自多样化的组织图像和ST数据，使用深度学习方法提取分子层面的信息，从而推动了组织图像分析在分子研究中的应用。"
}