{
    "title": "The Ontoverse: Democratising Access to Knowledge Graph-based Data Through a Cartographic Interface",
    "abstract": "arXiv:2408.03339v1 Announce Type: cross  Abstract: As the number of scientific publications and preprints is growing exponentially, several attempts have been made to navigate this complex and increasingly detailed landscape. These have almost exclusively taken unsupervised approaches that fail to incorporate domain knowledge and lack the structural organisation required for intuitive interactive human exploration and discovery. Especially in highly interdisciplinary fields, a deep understanding of the connectedness of research works across topics is essential for generating insights. We have developed a unique approach to data navigation that leans on geographical visualisation and uses hierarchically structured domain knowledge to enable end-users to explore knowledge spaces grounded in their desired domains of interest. This can take advantage of existing ontologies, proprietary intelligence schemata, or be directly derived from the underlying data through hierarchical topic modelli",
    "link": "https://arxiv.org/abs/2408.03339",
    "context": "Title: The Ontoverse: Democratising Access to Knowledge Graph-based Data Through a Cartographic Interface\nAbstract: arXiv:2408.03339v1 Announce Type: cross  Abstract: As the number of scientific publications and preprints is growing exponentially, several attempts have been made to navigate this complex and increasingly detailed landscape. These have almost exclusively taken unsupervised approaches that fail to incorporate domain knowledge and lack the structural organisation required for intuitive interactive human exploration and discovery. Especially in highly interdisciplinary fields, a deep understanding of the connectedness of research works across topics is essential for generating insights. We have developed a unique approach to data navigation that leans on geographical visualisation and uses hierarchically structured domain knowledge to enable end-users to explore knowledge spaces grounded in their desired domains of interest. This can take advantage of existing ontologies, proprietary intelligence schemata, or be directly derived from the underlying data through hierarchical topic modelli",
    "path": "papers/24/08/2408.03339.json",
    "total_tokens": 310,
    "tldr": "该文章开发了一个名为“知识全景”（Ontoverse）的系统，它通过地理信息系统界面将知识图谱数据民主化，为用户提供创新的交互式探索途径，尤其适用于跨学科领域知识研究的深入分析和发现。"
}