{
    "title": "Iterative CT Reconstruction via Latent Variable Optimization of Shallow Diffusion Models",
    "abstract": "arXiv:2408.03156v1 Announce Type: new  Abstract: Image generative AI has garnered significant attention in recent years. In particular, the diffusion model, a core component of recent generative AI, produces high-quality images with rich diversity. In this study, we propose a novel CT reconstruction method by combining the denoising diffusion probabilistic model with iterative CT reconstruction. In sharp contrast to previous studies, we optimize the fidelity loss of CT reconstruction with respect to the latent variable of the diffusion model, instead of the image and model parameters. To suppress anatomical structure changes produced by the diffusion model, we shallow the diffusion and reverse processes, and fix a set of added noises in the reverse process to make it deterministic during inference. We demonstrate the effectiveness of the proposed method through sparse view CT reconstruction of 1/10 view projection data. Despite the simplicity of the implementation, the proposed method ",
    "link": "https://arxiv.org/abs/2408.03156",
    "context": "Title: Iterative CT Reconstruction via Latent Variable Optimization of Shallow Diffusion Models\nAbstract: arXiv:2408.03156v1 Announce Type: new  Abstract: Image generative AI has garnered significant attention in recent years. In particular, the diffusion model, a core component of recent generative AI, produces high-quality images with rich diversity. In this study, we propose a novel CT reconstruction method by combining the denoising diffusion probabilistic model with iterative CT reconstruction. In sharp contrast to previous studies, we optimize the fidelity loss of CT reconstruction with respect to the latent variable of the diffusion model, instead of the image and model parameters. To suppress anatomical structure changes produced by the diffusion model, we shallow the diffusion and reverse processes, and fix a set of added noises in the reverse process to make it deterministic during inference. We demonstrate the effectiveness of the proposed method through sparse view CT reconstruction of 1/10 view projection data. Despite the simplicity of the implementation, the proposed method ",
    "path": "papers/24/08/2408.03156.json",
    "total_tokens": 313,
    "tldr": "该文章提出了一种新的CT重建方法，该方法通过将退化扩散概率模型的潜变量与迭代CT重建的保真度损失结合起来进行优化，以改进图像质量。"
}