{
    "title": "A Survey on Robotic Prosthetics: Neuroprosthetics, Soft Actuators, and Control Strategies",
    "abstract": "arXiv:2408.01729v1 Announce Type: new  Abstract: The field of robotics is a quickly evolving feat of technology that accepts contributions from various genres of science. Neuroscience, Physiology, Chemistry, Material science, Computer science, and the wide umbrella of mechatronics have all simultaneously contributed to many innovations in the prosthetic applications of robotics. This review begins with a discussion of the scope of the term robotic prosthetics and discusses the evolving domain of Neuroprosthetics. The discussion is then constrained to focus on various actuation and control strategies for robotic prosthetic limbs. This review discusses various soft robotic actuators such as EAP, SMA, FFA, etc., and the merits of such actuators over conventional hard robotic actuators. Options in control strategies for robotic prosthetics, that are in various states of research and development, are reviewed. This paper concludes the discussion with an analysis regarding the prospective di",
    "link": "https://arxiv.org/abs/2408.01729",
    "context": "Title: A Survey on Robotic Prosthetics: Neuroprosthetics, Soft Actuators, and Control Strategies\nAbstract: arXiv:2408.01729v1 Announce Type: new  Abstract: The field of robotics is a quickly evolving feat of technology that accepts contributions from various genres of science. Neuroscience, Physiology, Chemistry, Material science, Computer science, and the wide umbrella of mechatronics have all simultaneously contributed to many innovations in the prosthetic applications of robotics. This review begins with a discussion of the scope of the term robotic prosthetics and discusses the evolving domain of Neuroprosthetics. The discussion is then constrained to focus on various actuation and control strategies for robotic prosthetic limbs. This review discusses various soft robotic actuators such as EAP, SMA, FFA, etc., and the merits of such actuators over conventional hard robotic actuators. Options in control strategies for robotic prosthetics, that are in various states of research and development, are reviewed. This paper concludes the discussion with an analysis regarding the prospective di",
    "path": "papers/24/08/2408.01729.json",
    "total_tokens": 363,
    "tldr": "该文章综述了电动假肢技术，其中涉及神经假体、软体机器人技术与控制策略。文章概述了电动假肢技术的范围，介绍神经假体领域的发展，并对多种软体机器人动力源和控制策略进行了讨论，评估了这些技术与传统硬体机器人技术的利弊，并提出了对未来发展的展望。"
}