{
    "title": "HiLo: A Learning Framework for Generalized Category Discovery Robust to Domain Shifts",
    "abstract": "arXiv:2408.04591v1 Announce Type: new  Abstract: Generalized Category Discovery (GCD) is a challenging task in which, given a partially labelled dataset, models must categorize all unlabelled instances, regardless of whether they come from labelled categories or from new ones. In this paper, we challenge a remaining assumption in this task: that all images share the same domain. Specifically, we introduce a new task and method to handle GCD when the unlabelled data also contains images from different domains to the labelled set. Our proposed `HiLo' networks extract High-level semantic and Low-level domain features, before minimizing the mutual information between the representations. Our intuition is that the clusterings based on domain information and semantic information should be independent. We further extend our method with a specialized domain augmentation tailored for the GCD task, as well as a curriculum learning approach. Finally, we construct a benchmark from corrupted fine-g",
    "link": "https://arxiv.org/abs/2408.04591",
    "context": "Title: HiLo: A Learning Framework for Generalized Category Discovery Robust to Domain Shifts\nAbstract: arXiv:2408.04591v1 Announce Type: new  Abstract: Generalized Category Discovery (GCD) is a challenging task in which, given a partially labelled dataset, models must categorize all unlabelled instances, regardless of whether they come from labelled categories or from new ones. In this paper, we challenge a remaining assumption in this task: that all images share the same domain. Specifically, we introduce a new task and method to handle GCD when the unlabelled data also contains images from different domains to the labelled set. Our proposed `HiLo' networks extract High-level semantic and Low-level domain features, before minimizing the mutual information between the representations. Our intuition is that the clusterings based on domain information and semantic information should be independent. We further extend our method with a specialized domain augmentation tailored for the GCD task, as well as a curriculum learning approach. Finally, we construct a benchmark from corrupted fine-g",
    "path": "papers/24/08/2408.04591.json",
    "total_tokens": 370,
    "tldr": "该文章提出了一种名为HiLo的框架，用于在跨域变化下进行的一般化类别发现任务。该框架提取高阶语义和低阶域特征，并通过最小化两种特征表示之间的互信息来确保类别信息与域信息不相关。通过特殊设计的数据增强和基于课程学习的策略，该框架在处理来自不同域的未标注数据方面取得了显著成果。"
}