{
    "title": "PHOCUS: Physics-Based Deconvolution for Ultrasound Resolution Enhancement",
    "abstract": "arXiv:2408.03657v1 Announce Type: new  Abstract: Ultrasound is widely used in medical diagnostics allowing for accessible and powerful imaging but suffers from resolution limitations due to diffraction and the finite aperture of the imaging system, which restricts diagnostic use. The impulse function of an ultrasound imaging system is called the point spread function (PSF), which is convolved with the spatial distribution of reflectors in the image formation process. Recovering high-resolution reflector distributions by removing image distortions induced by the convolution process improves image clarity and detail. Conventionally, deconvolution techniques attempt to rectify the imaging system's dependent PSF, working directly on the radio-frequency (RF) data. However, RF data is often not readily accessible. Therefore, we introduce a physics-based deconvolution process using a modeled PSF, working directly on the more commonly available B-mode images. By leveraging Implicit Neural Repr",
    "link": "https://arxiv.org/abs/2408.03657",
    "context": "Title: PHOCUS: Physics-Based Deconvolution for Ultrasound Resolution Enhancement\nAbstract: arXiv:2408.03657v1 Announce Type: new  Abstract: Ultrasound is widely used in medical diagnostics allowing for accessible and powerful imaging but suffers from resolution limitations due to diffraction and the finite aperture of the imaging system, which restricts diagnostic use. The impulse function of an ultrasound imaging system is called the point spread function (PSF), which is convolved with the spatial distribution of reflectors in the image formation process. Recovering high-resolution reflector distributions by removing image distortions induced by the convolution process improves image clarity and detail. Conventionally, deconvolution techniques attempt to rectify the imaging system's dependent PSF, working directly on the radio-frequency (RF) data. However, RF data is often not readily accessible. Therefore, we introduce a physics-based deconvolution process using a modeled PSF, working directly on the more commonly available B-mode images. By leveraging Implicit Neural Repr",
    "path": "papers/24/08/2408.03657.json",
    "total_tokens": 350,
    "tldr": "该文章提出了PHOCUS技术，这是一种基于物理学的超声波分辨率增强技术，能够通过建模点扩散函数（PSF）直接在B-模式图像上进行去卷积处理，从而恢复出高分辨率的反射器分布，有效地改善了超声图像的清晰度和细节表现。"
}