{
    "title": "The Quest for the Right Mediator: A History, Survey, and Theoretical Grounding of Causal Interpretability",
    "abstract": "arXiv:2408.01416v1 Announce Type: cross  Abstract: Interpretability provides a toolset for understanding how and why neural networks behave in certain ways. However, there is little unity in the field: most studies employ ad-hoc evaluations and do not share theoretical foundations, making it difficult to measure progress and compare the pros and cons of different techniques. Furthermore, while mechanistic understanding is frequently discussed, the basic causal units underlying these mechanisms are often not explicitly defined. In this paper, we propose a perspective on interpretability research grounded in causal mediation analysis. Specifically, we describe the history and current state of interpretability taxonomized according to the types of causal units (mediators) employed, as well as methods used to search over mediators. We discuss the pros and cons of each mediator, providing insights as to when particular kinds of mediators and search methods are most appropriate depending on ",
    "link": "https://arxiv.org/abs/2408.01416",
    "context": "Title: The Quest for the Right Mediator: A History, Survey, and Theoretical Grounding of Causal Interpretability\nAbstract: arXiv:2408.01416v1 Announce Type: cross  Abstract: Interpretability provides a toolset for understanding how and why neural networks behave in certain ways. However, there is little unity in the field: most studies employ ad-hoc evaluations and do not share theoretical foundations, making it difficult to measure progress and compare the pros and cons of different techniques. Furthermore, while mechanistic understanding is frequently discussed, the basic causal units underlying these mechanisms are often not explicitly defined. In this paper, we propose a perspective on interpretability research grounded in causal mediation analysis. Specifically, we describe the history and current state of interpretability taxonomized according to the types of causal units (mediators) employed, as well as methods used to search over mediators. We discuss the pros and cons of each mediator, providing insights as to when particular kinds of mediators and search methods are most appropriate depending on ",
    "path": "papers/24/08/2408.01416.json",
    "total_tokens": 677,
    "translated_title": "寻找合适的调解者：因果解释性研究的历史、综述和理论基础",
    "translated_abstract": "arXiv:2408.01416v1 公告类型：交叉 摘要：解释性为理解神经网络如何以及为什么在特定方式下行为提供了一套工具。然而，该领域缺乏统一性：大多数研究采用专用的评估方法，并且不共享理论基础，这使得难以衡量进展并与不同技术的优势和劣势进行比较。此外，虽然机制理解经常被讨论，但这些机制的基础因果单位通常没有被明确定义。在本文中，我们提出了一种基于因果中介分析的解释性研究观点。具体来说，我们描述了解释性研究的历史和当前状态，这些研究根据使用的因果单位（调解者）的类型以及用于搜索调解者的方法进行了分类。我们讨论了每种调解者的优缺点，提供了见解，说明在根据不同的情况下，特别是在了解和改进神经网络时，何时最适应用特定类型的调解者和搜索方法取决于多种因素，包括神经网络的结构、工作方式及其潜在的因果机制。",
    "tldr": "本文提出了一种基于因果中介分析的解释性研究视角，分类并讨论了各种调解者类型、搜索方法及其在神经网络学习和更好理解其潜在因果机制时的适用性。",
    "en_tdlr": "This paper introduces a perspective on interpretability research grounded in causal mediation analysis, categorizing and discussing various types of mediators, search methods, and their applicability in neural networks for learning and better understanding their underlying causal mechanisms."
}