{
    "title": "HeteroMorpheus: Universal Control Based on Morphological Heterogeneity Modeling",
    "abstract": "arXiv:2408.01230v1 Announce Type: new  Abstract: In the field of robotic control, designing individual controllers for each robot leads to high computational costs. Universal control policies, applicable across diverse robot morphologies, promise to mitigate this challenge. Predominantly, models based on Graph Neural Networks (GNN) and Transformers are employed, owing to their effectiveness in capturing relational dynamics across a robot's limbs. However, these models typically employ homogeneous graph structures that overlook the functional diversity of different limbs. To bridge this gap, we introduce HeteroMorpheus, a novel method based on heterogeneous graph Transformer. This method uniquely addresses limb heterogeneity, fostering better representation of robot dynamics of various morphologies. Through extensive experiments we demonstrate the superiority of HeteroMorpheus against state-of-the-art methods in the capability of policy generalization, including zero-shot generalization",
    "link": "https://arxiv.org/abs/2408.01230",
    "context": "Title: HeteroMorpheus: Universal Control Based on Morphological Heterogeneity Modeling\nAbstract: arXiv:2408.01230v1 Announce Type: new  Abstract: In the field of robotic control, designing individual controllers for each robot leads to high computational costs. Universal control policies, applicable across diverse robot morphologies, promise to mitigate this challenge. Predominantly, models based on Graph Neural Networks (GNN) and Transformers are employed, owing to their effectiveness in capturing relational dynamics across a robot's limbs. However, these models typically employ homogeneous graph structures that overlook the functional diversity of different limbs. To bridge this gap, we introduce HeteroMorpheus, a novel method based on heterogeneous graph Transformer. This method uniquely addresses limb heterogeneity, fostering better representation of robot dynamics of various morphologies. Through extensive experiments we demonstrate the superiority of HeteroMorpheus against state-of-the-art methods in the capability of policy generalization, including zero-shot generalization",
    "path": "papers/24/08/2408.01230.json",
    "total_tokens": 640,
    "translated_title": "异构魔方斯：基于形态异质性建模的通用控制",
    "translated_abstract": "arXiv:2408.01230v1 公告类型：新 摘要：在机器人控制领域，为每个机器人设计特定的控制器会导致高计算成本。适用于不同机器人形态的通用控制政策有望缓解这一挑战。在捕捉机器人肢体之间的相互关系动态方面，图神经网络（GNN）和Transformer模型被广泛应用，因为它们在这些方面表现出色。然而，这些模型通常使用同质的图结构，这忽视了不同肢体之间的功能多样性。为了弥合这一差距，我们提出了基于异构图Transformer的HeteroMorpheus方法。这种方法独特地解决了肢体异质性问题，促进了各种机器人形态动态的更好表示。通过大量的实验，我们展示了HeteroMorpheus在策略泛化能力方面的优越性，包括零样本泛化。",
    "tldr": "本文介绍了一种名为HeteroMorpheus的新方法，该方法在异构图Transformer的帮助下，针对机器人肢体的功能多样性进行了有效建模，显著提高了机器人通用控制策略的泛化能力。"
}