{
    "title": "HiQuE: Hierarchical Question Embedding Network for Multimodal Depression Detection",
    "abstract": "arXiv:2408.03648v1 Announce Type: new  Abstract: The utilization of automated depression detection significantly enhances early intervention for individuals experiencing depression. Despite numerous proposals on automated depression detection using recorded clinical interview videos, limited attention has been paid to considering the hierarchical structure of the interview questions. In clinical interviews for diagnosing depression, clinicians use a structured questionnaire that includes routine baseline questions and follow-up questions to assess the interviewee's condition. This paper introduces HiQuE (Hierarchical Question Embedding network), a novel depression detection framework that leverages the hierarchical relationship between primary and follow-up questions in clinical interviews. HiQuE can effectively capture the importance of each question in diagnosing depression by learning mutual information across multiple modalities. We conduct extensive experiments on the widely-used ",
    "link": "https://arxiv.org/abs/2408.03648",
    "context": "Title: HiQuE: Hierarchical Question Embedding Network for Multimodal Depression Detection\nAbstract: arXiv:2408.03648v1 Announce Type: new  Abstract: The utilization of automated depression detection significantly enhances early intervention for individuals experiencing depression. Despite numerous proposals on automated depression detection using recorded clinical interview videos, limited attention has been paid to considering the hierarchical structure of the interview questions. In clinical interviews for diagnosing depression, clinicians use a structured questionnaire that includes routine baseline questions and follow-up questions to assess the interviewee's condition. This paper introduces HiQuE (Hierarchical Question Embedding network), a novel depression detection framework that leverages the hierarchical relationship between primary and follow-up questions in clinical interviews. HiQuE can effectively capture the importance of each question in diagnosing depression by learning mutual information across multiple modalities. We conduct extensive experiments on the widely-used ",
    "path": "papers/24/08/2408.03648.json",
    "total_tokens": 301,
    "tldr": "该文章提出了一种名为HiQuE的深度学习模型，该模型能够有效地利用临床访谈中的问题结构信息，通过考虑基础问题和跟进问题之间的层级关系来提高抑郁症的自动检测准确率。"
}