{
    "title": "Guardians of Image Quality: Benchmarking Defenses Against Adversarial Attacks on Image Quality Metrics",
    "abstract": "arXiv:2408.01541v1 Announce Type: new  Abstract: In the field of Image Quality Assessment (IQA), the adversarial robustness of the metrics poses a critical concern. This paper presents a comprehensive benchmarking study of various defense mechanisms in response to the rise in adversarial attacks on IQA. We systematically evaluate 25 defense strategies, including adversarial purification, adversarial training, and certified robustness methods. We applied 14 adversarial attack algorithms of various types in both non-adaptive and adaptive settings and tested these defenses against them. We analyze the differences between defenses and their applicability to IQA tasks, considering that they should preserve IQA scores and image quality. The proposed benchmark aims to guide future developments and accepts submissions of new methods, with the latest results available online: https://videoprocessing.ai/benchmarks/iqa-defenses.html.",
    "link": "https://arxiv.org/abs/2408.01541",
    "context": "Title: Guardians of Image Quality: Benchmarking Defenses Against Adversarial Attacks on Image Quality Metrics\nAbstract: arXiv:2408.01541v1 Announce Type: new  Abstract: In the field of Image Quality Assessment (IQA), the adversarial robustness of the metrics poses a critical concern. This paper presents a comprehensive benchmarking study of various defense mechanisms in response to the rise in adversarial attacks on IQA. We systematically evaluate 25 defense strategies, including adversarial purification, adversarial training, and certified robustness methods. We applied 14 adversarial attack algorithms of various types in both non-adaptive and adaptive settings and tested these defenses against them. We analyze the differences between defenses and their applicability to IQA tasks, considering that they should preserve IQA scores and image quality. The proposed benchmark aims to guide future developments and accepts submissions of new methods, with the latest results available online: https://videoprocessing.ai/benchmarks/iqa-defenses.html.",
    "path": "papers/24/08/2408.01541.json",
    "total_tokens": 375,
    "tldr": "该文章提出了一个全面的研究，对针对图像质量评价(IQA)中对抗攻击的25种防御策略进行评估，包括对抗纯净、对抗训练以及认证鲁棒性方法。研究者使用14种不同类型的非适应性和适应性攻击算法进行了测试，并对这些防御措施的应用范围进行了分析，以确保它们能保持图像质量评分和图像质量。该研究的目的是为了指导未来的研究和发展，并且向提交新的防御策略开放。"
}