{
    "title": "Large Language Models for Base Station Siting: Intelligent Deployment based on Prompt or Agent",
    "abstract": "arXiv:2408.03631v1 Announce Type: new  Abstract: Traditional base station siting (BSS) methods rely heavily on drive testing and user feedback, which are laborious and require extensive expertise in communication, networking, and optimization. As large language models (LLMs) and their associated technologies advance, particularly in the realms of prompt engineering and agent engineering, network optimization will witness a revolutionary approach. This approach entails the strategic use of well-crafted prompts to infuse human experience and knowledge into these sophisticated LLMs, and the deployment of autonomous agents as a communication bridge to seamlessly connect the machine language based LLMs with human users using natural language. This integration represents the future paradigm of artificial intelligence (AI) as a service and AI for more ease. As a preliminary exploration, this research first develops a novel LLM-empowered BSS optimization framework, and heuristically proposes f",
    "link": "https://arxiv.org/abs/2408.03631",
    "context": "Title: Large Language Models for Base Station Siting: Intelligent Deployment based on Prompt or Agent\nAbstract: arXiv:2408.03631v1 Announce Type: new  Abstract: Traditional base station siting (BSS) methods rely heavily on drive testing and user feedback, which are laborious and require extensive expertise in communication, networking, and optimization. As large language models (LLMs) and their associated technologies advance, particularly in the realms of prompt engineering and agent engineering, network optimization will witness a revolutionary approach. This approach entails the strategic use of well-crafted prompts to infuse human experience and knowledge into these sophisticated LLMs, and the deployment of autonomous agents as a communication bridge to seamlessly connect the machine language based LLMs with human users using natural language. This integration represents the future paradigm of artificial intelligence (AI) as a service and AI for more ease. As a preliminary exploration, this research first develops a novel LLM-empowered BSS optimization framework, and heuristically proposes f",
    "path": "papers/24/08/2408.03631.json",
    "total_tokens": 319,
    "tldr": "该文章开发了一种基于大型语言模型的基站选址优化框架，通过引人人的经验和知识，实现了更高效的用户与AI系统的自然语言通信，推进了AI服务在通信领域的应用。"
}