{
    "title": "PRTGS: Precomputed Radiance Transfer of Gaussian Splats for Real-Time High-Quality Relighting",
    "abstract": "arXiv:2408.03538v1 Announce Type: new  Abstract: We proposed Precomputed RadianceTransfer of GaussianSplats (PRTGS), a real-time high-quality relighting method for Gaussian splats in low-frequency lighting environments that captures soft shadows and interreflections by precomputing 3D Gaussian splats' radiance transfer. Existing studies have demonstrated that 3D Gaussian splatting (3DGS) outperforms neural fields' efficiency for dynamic lighting scenarios. However, the current relighting method based on 3DGS still struggles to compute high-quality shadow and indirect illumination in real time for dynamic light, leading to unrealistic rendering results. We solve this problem by precomputing the expensive transport simulations required for complex transfer functions like shadowing, the resulting transfer functions are represented as dense sets of vectors or matrices for every Gaussian splat. We introduce distinct precomputing methods tailored for training and rendering stages, along with",
    "link": "https://arxiv.org/abs/2408.03538",
    "context": "Title: PRTGS: Precomputed Radiance Transfer of Gaussian Splats for Real-Time High-Quality Relighting\nAbstract: arXiv:2408.03538v1 Announce Type: new  Abstract: We proposed Precomputed RadianceTransfer of GaussianSplats (PRTGS), a real-time high-quality relighting method for Gaussian splats in low-frequency lighting environments that captures soft shadows and interreflections by precomputing 3D Gaussian splats' radiance transfer. Existing studies have demonstrated that 3D Gaussian splatting (3DGS) outperforms neural fields' efficiency for dynamic lighting scenarios. However, the current relighting method based on 3DGS still struggles to compute high-quality shadow and indirect illumination in real time for dynamic light, leading to unrealistic rendering results. We solve this problem by precomputing the expensive transport simulations required for complex transfer functions like shadowing, the resulting transfer functions are represented as dense sets of vectors or matrices for every Gaussian splat. We introduce distinct precomputing methods tailored for training and rendering stages, along with",
    "path": "papers/24/08/2408.03538.json",
    "total_tokens": 433,
    "tldr": "该文章提出了一种名为PRTGS（Precomputed Radiance Transfer of Gaussian Splats）的实时高质量环境光重映射方法。该方法通过预先计算3D Gaussian splats的辐射传输，可以捕捉柔和阴影和互反射效果，适用于低频照明环境。通过使用高效的3DGS（3D Gauss Splatting），相较于神经场，该文章解决了现有动态照明场景中观察到的不真实渲染问题。通过预先计算高成本的光传输模拟，并在训练和渲染阶段采用专门的预计算方法，该方法在实时动态照明下实现了高质量的阴影和间接光照计算，显著提高了渲染场景的真实感。"
}