{
    "title": "Learning from Noisy Labels for Long-tailed Data via Optimal Transport",
    "abstract": "arXiv:2408.03977v1 Announce Type: cross  Abstract: Noisy labels, which are common in real-world datasets, can significantly impair the training of deep learning models. However, recent adversarial noise-combating methods overlook the long-tailed distribution of real data, which can significantly harm the effect of denoising strategies. Meanwhile, the mismanagement of noisy labels further compromises the model's ability to handle long-tailed data. To tackle this issue, we propose a novel approach to manage data characterized by both long-tailed distributions and noisy labels. First, we introduce a loss-distance cross-selection module, which integrates class predictions and feature distributions to filter clean samples, effectively addressing uncertainties introduced by noisy labels and long-tailed distributions. Subsequently, we employ optimal transport strategies to generate pseudo-labels for the noise set in a semi-supervised training manner, enhancing pseudo-label quality while mitig",
    "link": "https://arxiv.org/abs/2408.03977",
    "context": "Title: Learning from Noisy Labels for Long-tailed Data via Optimal Transport\nAbstract: arXiv:2408.03977v1 Announce Type: cross  Abstract: Noisy labels, which are common in real-world datasets, can significantly impair the training of deep learning models. However, recent adversarial noise-combating methods overlook the long-tailed distribution of real data, which can significantly harm the effect of denoising strategies. Meanwhile, the mismanagement of noisy labels further compromises the model's ability to handle long-tailed data. To tackle this issue, we propose a novel approach to manage data characterized by both long-tailed distributions and noisy labels. First, we introduce a loss-distance cross-selection module, which integrates class predictions and feature distributions to filter clean samples, effectively addressing uncertainties introduced by noisy labels and long-tailed distributions. Subsequently, we employ optimal transport strategies to generate pseudo-labels for the noise set in a semi-supervised training manner, enhancing pseudo-label quality while mitig",
    "path": "papers/24/08/2408.03977.json",
    "total_tokens": 337,
    "tldr": "该文章提出一种结合损失距离跨选择模块和最优传输策略的框架，旨在应对含有长期尾分布和噪声标签的数据集，有效过滤掉噪声标签并提升伪标签质量，进而提高了模型在长期尾分布数据上的准确率。"
}