{
    "title": "Case-based reasoning approach for diagnostic screening of children with developmental delays",
    "abstract": "arXiv:2408.02073v1 Announce Type: new  Abstract: According to the World Health Organization, the population of children with developmental delays constitutes approximately 6% to 9% of the total population. Based on the number of newborns in Huaibei, Anhui Province, China, in 2023 (94,420), it is estimated that there are about 7,500 cases (suspected cases of developmental delays) of suspicious cases annually. Early identification and appropriate early intervention for these children can significantly reduce the wastage of medical resources and societal costs. International research indicates that the optimal period for intervention in children with developmental delays is before the age of six, with the golden treatment period being before three and a half years of age. Studies have shown that children with developmental delays who receive early intervention exhibit significant improvement in symptoms; some may even fully recover. This research adopts a hybrid model combining a CNN-Tran",
    "link": "https://arxiv.org/abs/2408.02073",
    "context": "Title: Case-based reasoning approach for diagnostic screening of children with developmental delays\nAbstract: arXiv:2408.02073v1 Announce Type: new  Abstract: According to the World Health Organization, the population of children with developmental delays constitutes approximately 6% to 9% of the total population. Based on the number of newborns in Huaibei, Anhui Province, China, in 2023 (94,420), it is estimated that there are about 7,500 cases (suspected cases of developmental delays) of suspicious cases annually. Early identification and appropriate early intervention for these children can significantly reduce the wastage of medical resources and societal costs. International research indicates that the optimal period for intervention in children with developmental delays is before the age of six, with the golden treatment period being before three and a half years of age. Studies have shown that children with developmental delays who receive early intervention exhibit significant improvement in symptoms; some may even fully recover. This research adopts a hybrid model combining a CNN-Tran",
    "path": "papers/24/08/2408.02073.json",
    "total_tokens": 600,
    "translated_title": "基于案例推理的儿童发展迟缓诊断筛查方法",
    "translated_abstract": "根据世界卫生组织的数据，全球约有6%至9%的人口患有发展迟缓。基于中国安徽省淮北市2023年新生儿的数量（94,420），我们估计每年有大约7,500例（疑似发展迟缓病例）的疑虑病例。对这些儿童进行早期识别并进行适当的早期干预，可以显著减少医疗资源的浪费和社会成本。国际研究指出，发展迟缓儿童的最佳干预期是六岁前，最好是在三岁半之前。研究表明，接受早期干预的发展迟缓儿童症状明显改善，甚至有些儿童可能完全康复。本研究采用了一种结合CNN-Trans的混合模型进行案例推理。",
    "tldr": "本文提出了一种基于案例推理的儿童发展迟缓诊断筛查方法，旨在早发现、早干预，减少医疗和社会成本，并提高治疗效果。",
    "en_tdlr": "This study presents a case-based reasoning approach for diagnosing and screening children with developmental delays, aiming to identify and intervene early, reducing medical and societal costs, and improving treatment outcomes."
}