{
    "title": "Preference-Based Abstract Argumentation for Case-Based Reasoning (with Appendix)",
    "abstract": "arXiv:2408.00108v2 Announce Type: replace  Abstract: In the pursuit of enhancing the efficacy and flexibility of interpretable, data-driven classification models, this work introduces a novel incorporation of user-defined preferences with Abstract Argumentation and Case-Based Reasoning (CBR). Specifically, we introduce Preference-Based Abstract Argumentation for Case-Based Reasoning (which we call AA-CBR-P), allowing users to define multiple approaches to compare cases with an ordering that specifies their preference over these comparison approaches. We prove that the model inherently follows these preferences when making predictions and show that previous abstract argumentation for case-based reasoning approaches are insufficient at expressing preferences over constituents of an argument. We then demonstrate how this can be applied to a real-world medical dataset sourced from a clinical trial evaluating differing assessment methods of patients with a primary brain tumour. We show empi",
    "link": "https://arxiv.org/abs/2408.00108",
    "context": "Title: Preference-Based Abstract Argumentation for Case-Based Reasoning (with Appendix)\nAbstract: arXiv:2408.00108v2 Announce Type: replace  Abstract: In the pursuit of enhancing the efficacy and flexibility of interpretable, data-driven classification models, this work introduces a novel incorporation of user-defined preferences with Abstract Argumentation and Case-Based Reasoning (CBR). Specifically, we introduce Preference-Based Abstract Argumentation for Case-Based Reasoning (which we call AA-CBR-P), allowing users to define multiple approaches to compare cases with an ordering that specifies their preference over these comparison approaches. We prove that the model inherently follows these preferences when making predictions and show that previous abstract argumentation for case-based reasoning approaches are insufficient at expressing preferences over constituents of an argument. We then demonstrate how this can be applied to a real-world medical dataset sourced from a clinical trial evaluating differing assessment methods of patients with a primary brain tumour. We show empi",
    "path": "papers/24/08/2408.00108.json",
    "total_tokens": 418,
    "tldr": "该文章提出了一个名为Preference-Based Abstract Argumentation for Case-Based Reasoning（AA-CBR-P）的模型，该模型结合了用户定义的偏好和抽象Argumentation与案例推理（CBR）。这一创新使模型能够在做预测时遵循用户设定的偏好，并且证明在表达对论证组成部分的偏好方面，以往的基于案例的推理方法是不够的。文章展示了这一模型如何应用于一个真实的医疗数据集，该数据集来自对脑肿瘤患者使用不同评估方法进行的临床试验。通过一个真实的医学数据集的案例，文章证明了这种结合能够提高数据驱动的分类模型的有效性和可解释性。"
}