{
    "title": "Dual-branch PolSAR Image Classification Based on GraphMAE and Local Feature Extraction",
    "abstract": "arXiv:2408.04294v1 Announce Type: new  Abstract: The annotation of polarimetric synthetic aperture radar (PolSAR) images is a labor-intensive and time-consuming process. Therefore, classifying PolSAR images with limited labels is a challenging task in remote sensing domain. In recent years, self-supervised learning approaches have proven effective in PolSAR image classification with sparse labels. However, we observe a lack of research on generative selfsupervised learning in the studied task. Motivated by this, we propose a dual-branch classification model based on generative self-supervised learning in this paper. The first branch is a superpixel-branch, which learns superpixel-level polarimetric representations using a generative self-supervised graph masked autoencoder. To acquire finer classification results, a convolutional neural networks-based pixel-branch is further incorporated to learn pixel-level features. Classification with fused dual-branch features is finally performed ",
    "link": "https://arxiv.org/abs/2408.04294",
    "context": "Title: Dual-branch PolSAR Image Classification Based on GraphMAE and Local Feature Extraction\nAbstract: arXiv:2408.04294v1 Announce Type: new  Abstract: The annotation of polarimetric synthetic aperture radar (PolSAR) images is a labor-intensive and time-consuming process. Therefore, classifying PolSAR images with limited labels is a challenging task in remote sensing domain. In recent years, self-supervised learning approaches have proven effective in PolSAR image classification with sparse labels. However, we observe a lack of research on generative selfsupervised learning in the studied task. Motivated by this, we propose a dual-branch classification model based on generative self-supervised learning in this paper. The first branch is a superpixel-branch, which learns superpixel-level polarimetric representations using a generative self-supervised graph masked autoencoder. To acquire finer classification results, a convolutional neural networks-based pixel-branch is further incorporated to learn pixel-level features. Classification with fused dual-branch features is finally performed ",
    "path": "papers/24/08/2408.04294.json",
    "total_tokens": 341,
    "tldr": "该文章提出了一种基于生成自监督学习的双分支 PolSAR 图像分类方法，该方法通过生成掩码自编码器学习超级像素级别的极化特征，并通过融合超级像素和像素级别的特征实现了精细的分类效果。"
}