{
    "title": "PreMix: Boosting Multiple Instance Learning in Digital Histopathology through Pre-training with Intra-Batch Slide Mixing",
    "abstract": "arXiv:2408.01162v1 Announce Type: new  Abstract: The classification of gigapixel-sized whole slide images (WSIs), digital representations of histological slides obtained via a high-resolution scanner, faces significant challenges associated with the meticulous and time-consuming nature of fine-grained labeling. While weakly-supervised multiple instance learning (MIL) has emerged as a promising approach, current MIL methods are constrained by their limited ability to leverage the wealth of information embedded within unlabeled WSIs. This limitation often necessitates training MIL feature aggregators from scratch after the feature extraction process, hindering efficiency and accuracy. PreMix extends the general MIL framework by pre-training the MIL aggregator with an intra-batch slide mixing approach. Specifically, PreMix incorporates Barlow Twins Slide Mixing during pre-training, enhancing its ability to handle diverse WSI sizes and maximizing the utility of unlabeled WSIs. Combined wit",
    "link": "https://arxiv.org/abs/2408.01162",
    "context": "Title: PreMix: Boosting Multiple Instance Learning in Digital Histopathology through Pre-training with Intra-Batch Slide Mixing\nAbstract: arXiv:2408.01162v1 Announce Type: new  Abstract: The classification of gigapixel-sized whole slide images (WSIs), digital representations of histological slides obtained via a high-resolution scanner, faces significant challenges associated with the meticulous and time-consuming nature of fine-grained labeling. While weakly-supervised multiple instance learning (MIL) has emerged as a promising approach, current MIL methods are constrained by their limited ability to leverage the wealth of information embedded within unlabeled WSIs. This limitation often necessitates training MIL feature aggregators from scratch after the feature extraction process, hindering efficiency and accuracy. PreMix extends the general MIL framework by pre-training the MIL aggregator with an intra-batch slide mixing approach. Specifically, PreMix incorporates Barlow Twins Slide Mixing during pre-training, enhancing its ability to handle diverse WSI sizes and maximizing the utility of unlabeled WSIs. Combined wit",
    "path": "papers/24/08/2408.01162.json",
    "total_tokens": 722,
    "translated_title": "PreMix:通过预训练内批量切片混合提高数字组织病理学的多实例学习",
    "translated_abstract": "arXiv:2408.01162v1 公告类型: 新  摘要: 对以高分辨率扫描仪获得的组织学切片数字化表示的整张切片图像(WSIs)进行分类，面临着与细致且耗时的精细粒度标注相关的重大挑战。尽管弱监督的多实例学习(MIL)已经显示出作为一种有吸引力的方法，但现有的MIL方法在从零开始在特征提取过程中训练MIL特征聚合器的能力上受到了限制。这往往需要在大规模未标注WSIs上从头开始训练MIL特征聚合器，从而阻碍效率和准确性。PreMix通过内批量切片混合方法扩展了MIL框架的预训练。具体来说，PreMix在预训练期间结合了Barlow Twins Slide Mixing，提高了处理不同WSIs大小的能力，并最大限度地利用了未标注WSIs的价值。结合高分辨率采样和动态随机投影，PreMix学习到的特征能够较好地区分病理和正常细胞，即使在数据量相对较小的任务中也能表现出良好的泛化能力。实验表明，与当前最先进的MIL方法相比，PreMix在数字组织病理学数据集上的性能得到了提升。",
    "tldr": "PreMix通过预训练内批量切片混合方法提高数字组织病理学的多实例学习效率和准确性，即使在数据量相对较小的任务中也表现出良好的泛化能力。",
    "en_tdlr": "PreMix improves the efficiency and accuracy of multiple instance learning in digital histopathology by using intra-batch slide mixing during pre-training, showcasing good generalization even on tasks with relatively small datasets."
}