{
    "title": "Using a Distance Sensor to Detect Deviations in a Planar Surface",
    "abstract": "arXiv:2408.03838v1 Announce Type: new  Abstract: We investigate methods for determining if a planar surface contains geometric deviations (e.g., protrusions, objects, divots, or cliffs) using only an instantaneous measurement from a miniature optical time-of-flight sensor. The key to our method is to utilize the entirety of information encoded in raw time-of-flight data captured by off-the-shelf distance sensors. We provide an analysis of the problem in which we identify the key ambiguity between geometry and surface photometrics. To overcome this challenging ambiguity, we fit a Gaussian mixture model to a small dataset of planar surface measurements. This model implicitly captures the expected geometry and distribution of photometrics of the planar surface and is used to identify measurements that are likely to contain deviations. We characterize our method on a variety of surfaces and planar deviations across a range of scenarios. We find that our method utilizing raw time-of-flight ",
    "link": "https://arxiv.org/abs/2408.03838",
    "context": "Title: Using a Distance Sensor to Detect Deviations in a Planar Surface\nAbstract: arXiv:2408.03838v1 Announce Type: new  Abstract: We investigate methods for determining if a planar surface contains geometric deviations (e.g., protrusions, objects, divots, or cliffs) using only an instantaneous measurement from a miniature optical time-of-flight sensor. The key to our method is to utilize the entirety of information encoded in raw time-of-flight data captured by off-the-shelf distance sensors. We provide an analysis of the problem in which we identify the key ambiguity between geometry and surface photometrics. To overcome this challenging ambiguity, we fit a Gaussian mixture model to a small dataset of planar surface measurements. This model implicitly captures the expected geometry and distribution of photometrics of the planar surface and is used to identify measurements that are likely to contain deviations. We characterize our method on a variety of surfaces and planar deviations across a range of scenarios. We find that our method utilizing raw time-of-flight ",
    "path": "papers/24/08/2408.03838.json",
    "total_tokens": 386,
    "tldr": "该文章的创新贡献在于开发了一种使用小型光学时间飞行传感器进行平面表面几何偏差检测的方法，通过分析完整的时间飞行数据信息，识别并克服了表面几何与反射特性之间的关键差异。通过在小型数据集中训练高斯混合模型，该模型能够捕捉平面表面的预期几何和反射特性的分布，从而能够区分出可能包含偏差的测量值。文章还详细测试了该方法在不同表面和偏差情况下的有效性。"
}