{
    "title": "Occupation-aware planning method for robotic monitoring missions in dynamic environments",
    "abstract": "arXiv:2408.00846v1 Announce Type: new  Abstract: This paper presents a method for robotic monitoring missions in the presence of moving obstacles. Although the scenario map is known, the robot lacks information about the movement of dynamic obstacles during the monitoring mission. Numerous local planners have been developed in recent years for navigating highly dynamic environments. However, the absence of a global planner for these environments can result in unavoidable collisions or the inability to successfully complete missions in densely populated areas, such as a scenario monitoring in our case. This work addresses the development and evaluation of a global planner, $MADA$ (Monitoring Avoiding Dynamic Areas), aimed at enhancing the deployment of robots in such challenging conditions. The robot plans and executes the mission using the proposed two-step approach. The first step involves selecting the observation goal based on the environment's distribution and estimated monitoring ",
    "link": "https://arxiv.org/abs/2408.00846",
    "context": "Title: Occupation-aware planning method for robotic monitoring missions in dynamic environments\nAbstract: arXiv:2408.00846v1 Announce Type: new  Abstract: This paper presents a method for robotic monitoring missions in the presence of moving obstacles. Although the scenario map is known, the robot lacks information about the movement of dynamic obstacles during the monitoring mission. Numerous local planners have been developed in recent years for navigating highly dynamic environments. However, the absence of a global planner for these environments can result in unavoidable collisions or the inability to successfully complete missions in densely populated areas, such as a scenario monitoring in our case. This work addresses the development and evaluation of a global planner, $MADA$ (Monitoring Avoiding Dynamic Areas), aimed at enhancing the deployment of robots in such challenging conditions. The robot plans and executes the mission using the proposed two-step approach. The first step involves selecting the observation goal based on the environment's distribution and estimated monitoring ",
    "path": "papers/24/08/2408.00846.json",
    "total_tokens": 728,
    "translated_title": "动态环境下的职业感知规划方法对于机器人监控任务",
    "translated_abstract": "arXiv:2408.00846v1 公告类型: 新 Abstract: 本文提出了在存在移动障碍物的环境中进行机器人监控任务的一种方法。虽然场景地图是已知的，但机器人在其监控任务期间缺乏关于动态障碍物移动的信息。近年来，为了在高度动态环境中导航，已经开发了多种局部规划器。然而，这些环境缺乏全局规划器可能导致不可避免的碰撞或无法在人口密集区域（如我们的案例中的监控场景）成功完成任务。本研究解决了在全球规划器方面的开发和评估，该规划器称为$MADA$（Monitoring Avoiding Dynamic Areas），旨在提高在挑战性条件下的机器人部署。机器人通过提出的两步方法计划并执行任务。第一步涉及基于环境的分布和估计的监控需求选择观察目标。第二步是通过使用$MADA$规划器来优化路径，该规划器考虑了潜在障碍物位置的不确定性以及与其他正在运行的监控任务的协同。在实际的模拟和实验环境中进行的评估表明，$MADA$显著优于现有方法并提高了完成监控任务的成功率。",
    "tldr": "本文介绍了一种名为$MADA$的全局规划器，旨在提高在动态环境中进行监控任务时机器人的部署效率。该规划器考虑了潜在障碍物位置的不确定性以及与其他监控任务的协同，在模拟和实际环境中均优于现有方法，提高了成功完成监控任务的概率。"
}