{
    "title": "Earth System Data Cubes: Avenues for advancing Earth system research",
    "abstract": "arXiv:2408.02348v1 Announce Type: new  Abstract: Recent advancements in Earth system science have been marked by the exponential increase in the availability of diverse, multivariate datasets characterised by moderate to high spatio-temporal resolutions. Earth System Data Cubes (ESDCs) have emerged as one suitable solution for transforming this flood of data into a simple yet robust data structure. ESDCs achieve this by organising data into an analysis-ready format aligned with a spatio-temporal grid, facilitating user-friendly analysis and diminishing the need for extensive technical data processing knowledge. Despite these significant benefits, the completion of the entire ESDC life cycle remains a challenging task. Obstacles are not only of a technical nature but also relate to domain-specific problems in Earth system research. There exist barriers to realising the full potential of data collections in light of novel cloud-based technologies, particularly in curating data tailored f",
    "link": "https://arxiv.org/abs/2408.02348",
    "context": "Title: Earth System Data Cubes: Avenues for advancing Earth system research\nAbstract: arXiv:2408.02348v1 Announce Type: new  Abstract: Recent advancements in Earth system science have been marked by the exponential increase in the availability of diverse, multivariate datasets characterised by moderate to high spatio-temporal resolutions. Earth System Data Cubes (ESDCs) have emerged as one suitable solution for transforming this flood of data into a simple yet robust data structure. ESDCs achieve this by organising data into an analysis-ready format aligned with a spatio-temporal grid, facilitating user-friendly analysis and diminishing the need for extensive technical data processing knowledge. Despite these significant benefits, the completion of the entire ESDC life cycle remains a challenging task. Obstacles are not only of a technical nature but also relate to domain-specific problems in Earth system research. There exist barriers to realising the full potential of data collections in light of novel cloud-based technologies, particularly in curating data tailored f",
    "path": "papers/24/08/2408.02348.json",
    "total_tokens": 364,
    "tldr": "该文章阐述了地球系统数据立方体（ESDCs）在推进地球系统研究中的重要作用，通过将数据组织成易用且对用户友好且需要较少技术数据处理知识的分析格式，从而减轻了数据处理的负担。同时，文章也提到了在ESDC生命周期中的诸多挑战，包括技术挑战和特定领域问题，以及这些挑战对实现数据集潜力带来的影响。"
}