{
    "title": "Zero-Shot Surgical Tool Segmentation in Monocular Video Using Segment Anything Model 2",
    "abstract": "arXiv:2408.01648v1 Announce Type: cross  Abstract: The Segment Anything Model 2 (SAM 2) is the latest generation foundation model for image and video segmentation. Trained on the expansive Segment Anything Video (SA-V) dataset, which comprises 35.5 million masks across 50.9K videos, SAM 2 advances its predecessor's capabilities by supporting zero-shot segmentation through various prompts (e.g., points, boxes, and masks). Its robust zero-shot performance and efficient memory usage make SAM 2 particularly appealing for surgical tool segmentation in videos, especially given the scarcity of labeled data and the diversity of surgical procedures. In this study, we evaluate the zero-shot video segmentation performance of the SAM 2 model across different types of surgeries, including endoscopy and microscopy. We also assess its performance on videos featuring single and multiple tools of varying lengths to demonstrate SAM 2's applicability and effectiveness in the surgical domain. We found tha",
    "link": "https://arxiv.org/abs/2408.01648",
    "context": "Title: Zero-Shot Surgical Tool Segmentation in Monocular Video Using Segment Anything Model 2\nAbstract: arXiv:2408.01648v1 Announce Type: cross  Abstract: The Segment Anything Model 2 (SAM 2) is the latest generation foundation model for image and video segmentation. Trained on the expansive Segment Anything Video (SA-V) dataset, which comprises 35.5 million masks across 50.9K videos, SAM 2 advances its predecessor's capabilities by supporting zero-shot segmentation through various prompts (e.g., points, boxes, and masks). Its robust zero-shot performance and efficient memory usage make SAM 2 particularly appealing for surgical tool segmentation in videos, especially given the scarcity of labeled data and the diversity of surgical procedures. In this study, we evaluate the zero-shot video segmentation performance of the SAM 2 model across different types of surgeries, including endoscopy and microscopy. We also assess its performance on videos featuring single and multiple tools of varying lengths to demonstrate SAM 2's applicability and effectiveness in the surgical domain. We found tha",
    "path": "papers/24/08/2408.01648.json",
    "total_tokens": 786,
    "translated_title": "零样本手术工具在单目视频中使用Segmen Anything Model 2的分割",
    "translated_abstract": "arXiv:2408.01648v1 公告类型: 交叉  摘要: Segment Anything Model 2 (SAM 2)是用于图像和视频分割的最新一代基础模型。在庞大的Segment Anything Video（SA-V）数据集上进行训练，该数据集包含50.9K视频中的3550万个掩码，SAM 2通过支持各种提示（例如点、框和掩码）的零样本分割，推进了其前身的性能。其强大的零样本性能和高效的内存使用使其在手术工具视频分割方面特别吸引人，尤其是在标签数据稀缺以及手术程序多样化的背景下。在本文中，我们对SAM 2模型在多种手术类型（包括内窥术和显微术）中的零样本视频分割性能进行了评估。我们还对其在包含单工具和多工具（长度不同）的视频上的表现进行了评估，以展示SAM 2在手术领域应用的适用性和有效性。我们发现，SAM 2在零样本手术工具分割方面的性能是可扩展的，并且能够很好地适应手术视频中的复杂背景。在多种手术和工具长度的情况下，SAM 2的性能均得到了良好的验证。",
    "tldr": "最新一代的图像和视频分割基础模型Segmen Anything Model 2在零样本手术工具分割方面取得了显著进展，尤其是在手术视频中，它能够适应不同手术类型和工具长度的复杂背景，并且性能得到了良好验证。"
}