{
    "title": "Developing PUGG for Polish: A Modern Approach to KBQA, MRC, and IR Dataset Construction",
    "abstract": "arXiv:2408.02337v1 Announce Type: new  Abstract: Advancements in AI and natural language processing have revolutionized machine-human language interactions, with question answering (QA) systems playing a pivotal role. The knowledge base question answering (KBQA) task, utilizing structured knowledge graphs (KG), allows for handling extensive knowledge-intensive questions. However, a significant gap exists in KBQA datasets, especially for low-resource languages. Many existing construction pipelines for these datasets are outdated and inefficient in human labor, and modern assisting tools like Large Language Models (LLM) are not utilized to reduce the workload. To address this, we have designed and implemented a modern, semi-automated approach for creating datasets, encompassing tasks such as KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR), tailored explicitly for low-resource environments. We executed this pipeline and introduced the PUGG dataset, the first Poli",
    "link": "https://arxiv.org/abs/2408.02337",
    "context": "Title: Developing PUGG for Polish: A Modern Approach to KBQA, MRC, and IR Dataset Construction\nAbstract: arXiv:2408.02337v1 Announce Type: new  Abstract: Advancements in AI and natural language processing have revolutionized machine-human language interactions, with question answering (QA) systems playing a pivotal role. The knowledge base question answering (KBQA) task, utilizing structured knowledge graphs (KG), allows for handling extensive knowledge-intensive questions. However, a significant gap exists in KBQA datasets, especially for low-resource languages. Many existing construction pipelines for these datasets are outdated and inefficient in human labor, and modern assisting tools like Large Language Models (LLM) are not utilized to reduce the workload. To address this, we have designed and implemented a modern, semi-automated approach for creating datasets, encompassing tasks such as KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR), tailored explicitly for low-resource environments. We executed this pipeline and introduced the PUGG dataset, the first Poli",
    "path": "papers/24/08/2408.02337.json",
    "total_tokens": 370,
    "tldr": "该文章介绍了一种针对低资源环境的新型半自动方法，用于构建知识基问答（KBQA）、机器阅读理解（MRC）和信息检索（IR）的训练数据集，并演示了其在波兰语（Polish）语言领域中的应用，展示了在极端简化人工作业和利用大型语言模型辅助方面取得的进展。"
}