{
    "title": "SnapE -- Training Snapshot Ensembles of Link Prediction Models",
    "abstract": "arXiv:2408.02707v1 Announce Type: cross  Abstract: Snapshot ensembles have been widely used in various fields of prediction. They allow for training an ensemble of prediction models at the cost of training a single one. They are known to yield more robust predictions by creating a set of diverse base models. In this paper, we introduce an approach to transfer the idea of snapshot ensembles to link prediction models in knowledge graphs. Moreover, since link prediction in knowledge graphs is a setup without explicit negative examples, we propose a novel training loop that iteratively creates negative examples using previous snapshot models. An evaluation with four base models across four datasets shows that this approach constantly outperforms the single model approach, while keeping the training time constant.",
    "link": "https://arxiv.org/abs/2408.02707",
    "context": "Title: SnapE -- Training Snapshot Ensembles of Link Prediction Models\nAbstract: arXiv:2408.02707v1 Announce Type: cross  Abstract: Snapshot ensembles have been widely used in various fields of prediction. They allow for training an ensemble of prediction models at the cost of training a single one. They are known to yield more robust predictions by creating a set of diverse base models. In this paper, we introduce an approach to transfer the idea of snapshot ensembles to link prediction models in knowledge graphs. Moreover, since link prediction in knowledge graphs is a setup without explicit negative examples, we propose a novel training loop that iteratively creates negative examples using previous snapshot models. An evaluation with four base models across four datasets shows that this approach constantly outperforms the single model approach, while keeping the training time constant.",
    "path": "papers/24/08/2408.02707.json",
    "total_tokens": 286,
    "tldr": "该文章提出了一种将快照集合概念应用于无负例知识图链接预测任务的新方法，通过迭代创建负样本并利用先前模型，能够在无需增加训练时间的情况下，通过单一模型训练集合实现性能稳定提升。"
}