{
    "title": "Golden-Retriever: High-Fidelity Agentic Retrieval Augmented Generation for Industrial Knowledge Base",
    "abstract": "arXiv:2408.00798v1 Announce Type: cross  Abstract: This paper introduces Golden-Retriever, designed to efficiently navigate vast industrial knowledge bases, overcoming challenges in traditional LLM fine-tuning and RAG frameworks with domain-specific jargon and context interpretation. Golden-Retriever incorporates a reflection-based question augmentation step before document retrieval, which involves identifying jargon, clarifying its meaning based on context, and augmenting the question accordingly. Specifically, our method extracts and lists all jargon and abbreviations in the input question, determines the context against a pre-defined list, and queries a jargon dictionary for extended definitions and descriptions. This comprehensive augmentation ensures the RAG framework retrieves the most relevant documents by providing clear context and resolving ambiguities, significantly improving retrieval accuracy. Evaluations using three open-source LLMs on a domain-specific question-answer d",
    "link": "https://arxiv.org/abs/2408.00798",
    "context": "Title: Golden-Retriever: High-Fidelity Agentic Retrieval Augmented Generation for Industrial Knowledge Base\nAbstract: arXiv:2408.00798v1 Announce Type: cross  Abstract: This paper introduces Golden-Retriever, designed to efficiently navigate vast industrial knowledge bases, overcoming challenges in traditional LLM fine-tuning and RAG frameworks with domain-specific jargon and context interpretation. Golden-Retriever incorporates a reflection-based question augmentation step before document retrieval, which involves identifying jargon, clarifying its meaning based on context, and augmenting the question accordingly. Specifically, our method extracts and lists all jargon and abbreviations in the input question, determines the context against a pre-defined list, and queries a jargon dictionary for extended definitions and descriptions. This comprehensive augmentation ensures the RAG framework retrieves the most relevant documents by providing clear context and resolving ambiguities, significantly improving retrieval accuracy. Evaluations using three open-source LLMs on a domain-specific question-answer d",
    "path": "papers/24/08/2408.00798.json",
    "total_tokens": 782,
    "translated_title": "Golden-Retriever: 高保真能动性检索增强生成在工业知识库中的应用",
    "translated_abstract": "arXiv:2408.00798v1 公告类型: 交叉 摘要: 本文介绍了Golden-Retriever，旨在高效地导航庞大的工业知识库，克服了通用语言模型微调和基于检索的生成(RAG)框架在特定领域术语和上下文解释方面的传统挑战。Golden-Retriever在文档检索前实施了一种基于反思的查询增强步骤，该步骤涉及识别输入问题中的术语、基于上下文澄清其意义，并在增强查询之前列出所有术语和缩写。我们的方法特别涉及从输入问题中提取和列出所有的术语和缩写、确定与之相符的上下文以及从预定义的术语典中为每项寻求扩展的定义和描述。这种全面的增强确保了RAG框架通过提供清晰的上下文和解释迷惑情境，能够检索到最相关的文档，从而显著提高了检索的准确性。在三个开放源代码的大语言模型上进行的评估，使用了一个特定领域的问答数据集。我们的方法在控制样本集上的搜索准确性得分上获得了明显优势，尤其是在军事和工业语言应用方面，这是因为在监控数据集中，查询弱的领域感被直接转化为增qq强问题对原始查询的良好响应。整体上，Golden-Retriever在数量较多的样本集上也获得了最高性能，实验结果再次验证了我们的方法在工业知识检索和问答方面的有效性以及它在持续纳入新发现的领域术语方面的扩展性。",
    "tldr": "一种名为Golden-Retriever的系统被设计用来增强工业知识库的检索效率，通过推敲式的查询增强和明确的上下文解释，提升了RAG框架的检索准确性。"
}