{
    "title": "Adaptive-Sliding Mode Trajectory Control of Robot Manipulators with Uncertainties",
    "abstract": "arXiv:2408.03102v1 Announce Type: cross  Abstract: In this paper, we propose and demonstrate an adaptive-sliding mode control for trajectory tracking control of robot manipulators subjected to uncertain dynamics, vibration disturbance, and payload variation disturbance. Throughout this work we seek a controller that is, robust to the uncertainty and disturbance, accurate, and implementable. To perform these requirements, we use a nonlinear Lyapunov-based approach for designing the controller and guaranteeing its stability. MATLAB-SIMULINK software is used to validate the approach and demonstrate the performance of the controller. Simulation results show that the derived controller is stable, robust to the disturbance and uncertainties, accurate, and implementable.",
    "link": "https://arxiv.org/abs/2408.03102",
    "context": "Title: Adaptive-Sliding Mode Trajectory Control of Robot Manipulators with Uncertainties\nAbstract: arXiv:2408.03102v1 Announce Type: cross  Abstract: In this paper, we propose and demonstrate an adaptive-sliding mode control for trajectory tracking control of robot manipulators subjected to uncertain dynamics, vibration disturbance, and payload variation disturbance. Throughout this work we seek a controller that is, robust to the uncertainty and disturbance, accurate, and implementable. To perform these requirements, we use a nonlinear Lyapunov-based approach for designing the controller and guaranteeing its stability. MATLAB-SIMULINK software is used to validate the approach and demonstrate the performance of the controller. Simulation results show that the derived controller is stable, robust to the disturbance and uncertainties, accurate, and implementable.",
    "path": "papers/24/08/2408.03102.json",
    "total_tokens": 307,
    "tldr": "该文章提出并验证了一项针对具有不确定动态、振动干扰和负载变化干扰的机器人臂轨迹跟踪控制的适应性滑动模式控制方法。通过MATLAB-SIMULINK软件进行模拟验证，结果表明设计的控制器能在扰动和不确定性的影响下保持稳定性，并且具有良好的准确性和可实施性。"
}