{
    "title": "Prompting for products: Investigating design space exploration strategies for text-to-image generative models",
    "abstract": "arXiv:2408.03946v1 Announce Type: cross  Abstract: Text-to-image models are enabling efficient design space exploration, rapidly generating images from text prompts. However, many generative AI tools are imperfect for product design applications as they are not built for the goals and requirements of product design. The unclear link between text input and image output further complicates their application. This work empirically investigates design space exploration strategies that can successfully yield product images that are feasible, novel, and aesthetic, which are three common goals in product design. Specifically, user actions within the global and local editing modes, including their time spent, prompt length, mono vs. multi-criteria prompts, and goal orientation of prompts, are analyzed. Key findings reveal the pivotal role of mono vs. multi-criteria and goal orientation of prompts in achieving specific design goals over time and prompt length. The study recommends prioritizing ",
    "link": "https://arxiv.org/abs/2408.03946",
    "context": "Title: Prompting for products: Investigating design space exploration strategies for text-to-image generative models\nAbstract: arXiv:2408.03946v1 Announce Type: cross  Abstract: Text-to-image models are enabling efficient design space exploration, rapidly generating images from text prompts. However, many generative AI tools are imperfect for product design applications as they are not built for the goals and requirements of product design. The unclear link between text input and image output further complicates their application. This work empirically investigates design space exploration strategies that can successfully yield product images that are feasible, novel, and aesthetic, which are three common goals in product design. Specifically, user actions within the global and local editing modes, including their time spent, prompt length, mono vs. multi-criteria prompts, and goal orientation of prompts, are analyzed. Key findings reveal the pivotal role of mono vs. multi-criteria and goal orientation of prompts in achieving specific design goals over time and prompt length. The study recommends prioritizing ",
    "path": "papers/24/08/2408.03946.json",
    "total_tokens": 316,
    "tldr": "该文章研究了文本到图像生成模型中的设计空间探索策略，发现用户行为和目标导向的提示至关重要，有助于实现产品设计的可行性和新颖性。"
}