{
    "title": "Statistical Framework for Clustering MU-MIMO Wireless via Second Order Statistics",
    "abstract": "arXiv:2408.04484v1 Announce Type: cross  Abstract: This work explores the clustering of wireless users by examining the distances between their channel covariance matrices, which reside on the Riemannian manifold of positive definite matrices. Specifically, we consider an estimator of the Log-Euclidean distance between multiple sample covariance matrices (SCMs) consistent when the number of samples and the observation size grow unbounded at the same rate. Within the context of multi-user MIMO (MU-MIMO) wireless communication systems, we develop a statistical framework that allows to accurate predictions of the clustering algorithm's performance under realistic conditions. Specifically, we present a central limit theorem that establishes the asymptotic Gaussianity of the consistent estimator of the log-Euclidean distance computed over two sample covariance matrices.",
    "link": "https://arxiv.org/abs/2408.04484",
    "context": "Title: Statistical Framework for Clustering MU-MIMO Wireless via Second Order Statistics\nAbstract: arXiv:2408.04484v1 Announce Type: cross  Abstract: This work explores the clustering of wireless users by examining the distances between their channel covariance matrices, which reside on the Riemannian manifold of positive definite matrices. Specifically, we consider an estimator of the Log-Euclidean distance between multiple sample covariance matrices (SCMs) consistent when the number of samples and the observation size grow unbounded at the same rate. Within the context of multi-user MIMO (MU-MIMO) wireless communication systems, we develop a statistical framework that allows to accurate predictions of the clustering algorithm's performance under realistic conditions. Specifically, we present a central limit theorem that establishes the asymptotic Gaussianity of the consistent estimator of the log-Euclidean distance computed over two sample covariance matrices.",
    "path": "papers/24/08/2408.04484.json",
    "total_tokens": 376,
    "tldr": "该文章提出了一个统计框架，用于通过评估用户通道协方差矩阵之间的距离来对多输入多输出（MU-MIMO）无线通信系统中的用户进行集群划分。该框架以Riemann流形上正定矩阵中的距离为基础，并针对大规模数据集下的均衡样本数和观测大小条件，提出了一个可在宽频带条件下的准相移噪声环境中使用的log Euclidean距离估计器。通过中心极限定理，文章证明了两个样本协方差矩阵间的log Euclidean距离估计器在中心附近具有高斯分布，为无线通信系统中集群算法的实际性能提供了准确预测。"
}