{
    "title": "Enhancing Complex Causality Extraction via Improved Subtask Interaction and Knowledge Fusion",
    "abstract": "arXiv:2408.03079v1 Announce Type: cross  Abstract: Event Causality Extraction (ECE) aims at extracting causal event pairs from texts. Despite ChatGPT's recent success, fine-tuning small models remains the best approach for the ECE task. However, existing fine-tuning based ECE methods cannot address all three key challenges in ECE simultaneously: 1) Complex Causality Extraction, where multiple causal-effect pairs occur within a single sentence; 2) Subtask~ Interaction, which involves modeling the mutual dependence between the two subtasks of ECE, i.e., extracting events and identifying the causal relationship between extracted events; and 3) Knowledge Fusion, which requires effectively fusing the knowledge in two modalities, i.e., the expressive pretrained language models and the structured knowledge graphs. In this paper, we propose a unified ECE framework (UniCE to address all three issues in ECE simultaneously. Specifically, we design a subtask interaction mechanism to enable mutual ",
    "link": "https://arxiv.org/abs/2408.03079",
    "context": "Title: Enhancing Complex Causality Extraction via Improved Subtask Interaction and Knowledge Fusion\nAbstract: arXiv:2408.03079v1 Announce Type: cross  Abstract: Event Causality Extraction (ECE) aims at extracting causal event pairs from texts. Despite ChatGPT's recent success, fine-tuning small models remains the best approach for the ECE task. However, existing fine-tuning based ECE methods cannot address all three key challenges in ECE simultaneously: 1) Complex Causality Extraction, where multiple causal-effect pairs occur within a single sentence; 2) Subtask~ Interaction, which involves modeling the mutual dependence between the two subtasks of ECE, i.e., extracting events and identifying the causal relationship between extracted events; and 3) Knowledge Fusion, which requires effectively fusing the knowledge in two modalities, i.e., the expressive pretrained language models and the structured knowledge graphs. In this paper, we propose a unified ECE framework (UniCE to address all three issues in ECE simultaneously. Specifically, we design a subtask interaction mechanism to enable mutual ",
    "path": "papers/24/08/2408.03079.json",
    "total_tokens": 368,
    "tldr": "该文章提出了一种统一的复杂因果关系提取框架（UniCE），通过改进的子任务交互和知识融合机制，解决了在单一句子中识别多个因果关系提取、子任务间的相互依赖以及两种知识源（语言模型和结构知识图）融合的问题。"
}