{
    "title": "AVESFormer: Efficient Transformer Design for Real-Time Audio-Visual Segmentation",
    "abstract": "arXiv:2408.01708v1 Announce Type: new  Abstract: Recently, transformer-based models have demonstrated remarkable performance on audio-visual segmentation (AVS) tasks. However, their expensive computational cost makes real-time inference impractical. By characterizing attention maps of the network, we identify two key obstacles in AVS models: 1) attention dissipation, corresponding to the over-concentrated attention weights by Softmax within restricted frames, and 2) inefficient, burdensome transformer decoder, caused by narrow focus patterns in early stages. In this paper, we introduce AVESFormer, the first real-time Audio-Visual Efficient Segmentation transformer that achieves fast, efficient and light-weight simultaneously. Our model leverages an efficient prompt query generator to correct the behaviour of cross-attention. Additionally, we propose ELF decoder to bring greater efficiency by facilitating convolutions suitable for local features to reduce computational burdens. Extensiv",
    "link": "https://arxiv.org/abs/2408.01708",
    "context": "Title: AVESFormer: Efficient Transformer Design for Real-Time Audio-Visual Segmentation\nAbstract: arXiv:2408.01708v1 Announce Type: new  Abstract: Recently, transformer-based models have demonstrated remarkable performance on audio-visual segmentation (AVS) tasks. However, their expensive computational cost makes real-time inference impractical. By characterizing attention maps of the network, we identify two key obstacles in AVS models: 1) attention dissipation, corresponding to the over-concentrated attention weights by Softmax within restricted frames, and 2) inefficient, burdensome transformer decoder, caused by narrow focus patterns in early stages. In this paper, we introduce AVESFormer, the first real-time Audio-Visual Efficient Segmentation transformer that achieves fast, efficient and light-weight simultaneously. Our model leverages an efficient prompt query generator to correct the behaviour of cross-attention. Additionally, we propose ELF decoder to bring greater efficiency by facilitating convolutions suitable for local features to reduce computational burdens. Extensiv",
    "path": "papers/24/08/2408.01708.json",
    "total_tokens": 357,
    "tldr": "该文章提出了AVESFormer模型，这是一种高效的设计，用于实时音频视觉分割任务。通过分析注意力的损耗和注意力机制的不利影响，AVESFormer通过改进提示输入生成器和ELF解码器来减轻这些问题。这种改进不仅提高了性能，还降低了计算成本，使模型能够在保持高效的同时实现实时音频视觉分割。"
}