{
    "title": "MetaWearS: A Shortcut in Wearable Systems Lifecycle with Only a Few Shots",
    "abstract": "arXiv:2408.01988v1 Announce Type: cross  Abstract: Wearable systems provide continuous health monitoring and can lead to early detection of potential health issues. However, the lifecycle of wearable systems faces several challenges. First, effective model training for new wearable devices requires substantial labeled data from various subjects collected directly by the wearable. Second, subsequent model updates require further extensive labeled data for retraining. Finally, frequent model updating on the wearable device can decrease the battery life in long-term data monitoring. Addressing these challenges, in this paper, we propose MetaWearS, a meta-learning method to reduce the amount of initial data collection required. Moreover, our approach incorporates a prototypical updating mechanism, simplifying the update process by modifying the class prototype rather than retraining the entire model. We explore the performance of MetaWearS in two case studies, namely, the detection of epil",
    "link": "https://arxiv.org/abs/2408.01988",
    "context": "Title: MetaWearS: A Shortcut in Wearable Systems Lifecycle with Only a Few Shots\nAbstract: arXiv:2408.01988v1 Announce Type: cross  Abstract: Wearable systems provide continuous health monitoring and can lead to early detection of potential health issues. However, the lifecycle of wearable systems faces several challenges. First, effective model training for new wearable devices requires substantial labeled data from various subjects collected directly by the wearable. Second, subsequent model updates require further extensive labeled data for retraining. Finally, frequent model updating on the wearable device can decrease the battery life in long-term data monitoring. Addressing these challenges, in this paper, we propose MetaWearS, a meta-learning method to reduce the amount of initial data collection required. Moreover, our approach incorporates a prototypical updating mechanism, simplifying the update process by modifying the class prototype rather than retraining the entire model. We explore the performance of MetaWearS in two case studies, namely, the detection of epil",
    "path": "papers/24/08/2408.01988.json",
    "total_tokens": 596,
    "translated_title": "MetaWearS: 一种仅需少量快照的便携式系统生命周期快捷方式",
    "translated_abstract": "便携式系统能够提供连续的健康监测功能，并有可能在早期发现潜在的健康问题。然而，便携式系统的生命周期面临着一系列挑战。首先，对于新的便携式设备，有效的模型训练需要来自各种主题的大量标记数据，这些数据直接由便携式设备收集。其次，后继的模型更新需要进一步的大量标记数据来进行重新培训。最后，频繁地在便携式设备上更新模型可能会减少在长期数据监控中的电池寿命。为了解决这些问题，在本文中，我们提出了一种MetaWearS方法，这是一种元学习方法，可以减少所需的初始数据收集量。此外，我们的方法结合了一种原型更新机制，通过修改类原型而不是重新培训整个模型，简化了更新过程。我们在两个实际案例研究中探讨了MetaWearS的性能，即癫痫发作检测和智能手势识别。",
    "tldr": "本文提出MetaWearS方法，通过元学习减少便携式系统初始数据集的需求，并使用原型更新机制简化更新过程。"
}