{
    "title": "Advancing Mental Health Pre-Screening: A New Custom GPT for Psychological Distress Assessment",
    "abstract": "arXiv:2408.01614v1 Announce Type: cross  Abstract: This study introduces 'Psycho Analyst', a custom GPT model based on OpenAI's GPT-4, optimized for pre-screening mental health disorders. Enhanced with DSM-5, PHQ-8, detailed data descriptions, and extensive training data, the model adeptly decodes nuanced linguistic indicators of mental health disorders. It utilizes a dual-task framework that includes binary classification and a three-stage PHQ-8 score computation involving initial assessment, detailed breakdown, and independent assessment, showcasing refined analytic capabilities. Validation with the DAIC-WOZ dataset reveals F1 and Macro-F1 scores of 0.929 and 0.949, respectively, along with the lowest MAE and RMSE of 2.89 and 3.69 in PHQ-8 scoring. These results highlight the model's precision and transformative potential in enhancing public mental health support, improving accessibility, cost-effectiveness, and serving as a second opinion for professionals.",
    "link": "https://arxiv.org/abs/2408.01614",
    "context": "Title: Advancing Mental Health Pre-Screening: A New Custom GPT for Psychological Distress Assessment\nAbstract: arXiv:2408.01614v1 Announce Type: cross  Abstract: This study introduces 'Psycho Analyst', a custom GPT model based on OpenAI's GPT-4, optimized for pre-screening mental health disorders. Enhanced with DSM-5, PHQ-8, detailed data descriptions, and extensive training data, the model adeptly decodes nuanced linguistic indicators of mental health disorders. It utilizes a dual-task framework that includes binary classification and a three-stage PHQ-8 score computation involving initial assessment, detailed breakdown, and independent assessment, showcasing refined analytic capabilities. Validation with the DAIC-WOZ dataset reveals F1 and Macro-F1 scores of 0.929 and 0.949, respectively, along with the lowest MAE and RMSE of 2.89 and 3.69 in PHQ-8 scoring. These results highlight the model's precision and transformative potential in enhancing public mental health support, improving accessibility, cost-effectiveness, and serving as a second opinion for professionals.",
    "path": "papers/24/08/2408.01614.json",
    "total_tokens": 798,
    "translated_title": "改进心理健康预筛查：一种新型心理困扰评估GPT",
    "translated_abstract": "这项研究介绍了一种名为“心理分析师”的定制GPT模型，该模型基于OpenAI的GPT-4，优化用于心理健康障碍的预筛查。该模型以DSM-5、PHQ-8详细数据描述和大量训练数据为优化基础，擅长解码心理困扰的微妙语言指示。模型采用双任务框架，包括二元分类和PHQ-8评分的三阶段计算，包括初步评估、详细分析和独立评估，展示了其精细的分析能力。使用DAIC-WOZ数据集进行的验证显示了F1和宏观F1分数分别为0.929和0.949，并且在PHQ-8评分方面的最低MAE和RMSE分别为2.89和3.69。这些结果凸显了该模型的高准确性和在提高公众心理健康支持、提升可及性、成本效益和作为专业人士第二意见方面的变革潜力。",
    "tldr": "本研究提出了“心理分析师”，一种基于OpenAI GPT-4的定制模型，优化用于心理健康障碍的预筛查。该模型通过DSM-5、PHQ-8详细数据描述和大量训练数据的使用，在识别心理困扰方面表现出色，并显示出在预测PHQ-8评分方面的精确度。通过验证结果显示，该模型在改善心理健康支持和服务方面显示出巨大的潜力。",
    "en_tdlr": "This research introduces a custom GPT model named \"Psycho Analyst,\" optimized for pre-screening mental health disorders via detailed training data including DSM-5 and PHQ-8 descriptions. The model demonstrates proficiency in identifying mental health indicators and shows high precision in predicting PHQ-8 scores. Validation with the DAIC-WOZ dataset highlights its potential to transform public mental health support, improve accessibility, and reduce costs while serving as a valuable second opinion for professionals."
}