{
    "title": "Integrating ESG and AI: A Comprehensive Responsible AI Assessment Framework",
    "abstract": "arXiv:2408.00965v2 Announce Type: replace  Abstract: Artificial Intelligence (AI) is a widely developed and adopted technology across entire industry sectors. Integrating environmental, social, and governance (ESG) considerations with AI investments is crucial for ensuring ethical and sustainable technological advancement. Particularly from an investor perspective, this integration not only mitigates risks but also enhances long-term value creation by aligning AI initiatives with broader societal goals. Yet, this area has been less explored in both academia and industry. To bridge the gap, we introduce a novel ESG-AI framework, which is developed based on insights from engagements with 28 companies and comprises three key components. The framework provides a structured approach to this integration, developed in collaboration with industry practitioners. The ESG-AI framework provides an overview of the environmental and social impacts of AI applications, helping users such as investors ",
    "link": "https://arxiv.org/abs/2408.00965",
    "context": "Title: Integrating ESG and AI: A Comprehensive Responsible AI Assessment Framework\nAbstract: arXiv:2408.00965v2 Announce Type: replace  Abstract: Artificial Intelligence (AI) is a widely developed and adopted technology across entire industry sectors. Integrating environmental, social, and governance (ESG) considerations with AI investments is crucial for ensuring ethical and sustainable technological advancement. Particularly from an investor perspective, this integration not only mitigates risks but also enhances long-term value creation by aligning AI initiatives with broader societal goals. Yet, this area has been less explored in both academia and industry. To bridge the gap, we introduce a novel ESG-AI framework, which is developed based on insights from engagements with 28 companies and comprises three key components. The framework provides a structured approach to this integration, developed in collaboration with industry practitioners. The ESG-AI framework provides an overview of the environmental and social impacts of AI applications, helping users such as investors ",
    "path": "papers/24/08/2408.00965.json",
    "total_tokens": 330,
    "tldr": "该文章提出了一种将环境、社会和治理（ESG）因素与人工智能（AI）投资相结合的全面框架，旨在通过与28家公司合作开发的三个关键组件，帮助投资者评估AI应用的环境和社会影响，从而实现更可持续的AI发展。"
}