{
    "title": "Estimating Environmental Cost Throughout Model's Adaptive Life Cycle",
    "abstract": "arXiv:2408.01446v1 Announce Type: cross  Abstract: With the rapid increase in the research, development, and application of neural networks in the current era, there is a proportional increase in the energy needed to train and use models. Crucially, this is accompanied by the increase in carbon emissions into the environment. A sustainable and socially beneficial approach to reducing the carbon footprint and rising energy demands associated with the modern age of AI/deep learning is the adaptive and continuous reuse of models with regard to changes in the environment of model deployment or variations/changes in the input data. In this paper, we propose PreIndex, a predictive index to estimate the environmental and compute resources associated with model retraining to distributional shifts in data. PreIndex can be used to estimate environmental costs such as carbon emissions and energy usage when retraining from current data distribution to new data distribution. It also correlates with",
    "link": "https://arxiv.org/abs/2408.01446",
    "context": "Title: Estimating Environmental Cost Throughout Model's Adaptive Life Cycle\nAbstract: arXiv:2408.01446v1 Announce Type: cross  Abstract: With the rapid increase in the research, development, and application of neural networks in the current era, there is a proportional increase in the energy needed to train and use models. Crucially, this is accompanied by the increase in carbon emissions into the environment. A sustainable and socially beneficial approach to reducing the carbon footprint and rising energy demands associated with the modern age of AI/deep learning is the adaptive and continuous reuse of models with regard to changes in the environment of model deployment or variations/changes in the input data. In this paper, we propose PreIndex, a predictive index to estimate the environmental and compute resources associated with model retraining to distributional shifts in data. PreIndex can be used to estimate environmental costs such as carbon emissions and energy usage when retraining from current data distribution to new data distribution. It also correlates with",
    "path": "papers/24/08/2408.01446.json",
    "total_tokens": 335,
    "tldr": "该文章的重要创新和贡献在于提出了一种名为PreIndex的预测指标来估算模型因环境变化或输入数据分布的改变而需要重新训练时的环境成本，包括计算资源和碳排放。这有助于优化模型的适应性生命周期，实现更环保和可持续的AI/深度学习应用。"
}