{
    "title": "Is Generative Communication between Embodied Agents Good for Zero-Shot ObjectNav?",
    "abstract": "arXiv:2408.01877v1 Announce Type: new  Abstract: In Zero-Shot ObjectNav, an embodied ground agent is expected to navigate to a target object specified by a natural language label without any environment-specific fine-tuning. This is challenging, given the limited view of a ground agent and its independent exploratory behavior. To address these issues, we consider an assistive overhead agent with a bounded global view alongside the ground agent and present two coordinated navigation schemes for judicious exploration. We establish the influence of the Generative Communication (GC) between the embodied agents equipped with Vision-Language Models (VLMs) in improving zero-shot ObjectNav, achieving a 10% improvement in the ground agent's ability to find the target object in comparison with an unassisted setup in simulation. We further analyze the GC for unique traits quantifying the presence of hallucination and cooperation. In particular, we identify a unique trait of \"preemptive hallucinat",
    "link": "https://arxiv.org/abs/2408.01877",
    "context": "Title: Is Generative Communication between Embodied Agents Good for Zero-Shot ObjectNav?\nAbstract: arXiv:2408.01877v1 Announce Type: new  Abstract: In Zero-Shot ObjectNav, an embodied ground agent is expected to navigate to a target object specified by a natural language label without any environment-specific fine-tuning. This is challenging, given the limited view of a ground agent and its independent exploratory behavior. To address these issues, we consider an assistive overhead agent with a bounded global view alongside the ground agent and present two coordinated navigation schemes for judicious exploration. We establish the influence of the Generative Communication (GC) between the embodied agents equipped with Vision-Language Models (VLMs) in improving zero-shot ObjectNav, achieving a 10% improvement in the ground agent's ability to find the target object in comparison with an unassisted setup in simulation. We further analyze the GC for unique traits quantifying the presence of hallucination and cooperation. In particular, we identify a unique trait of \"preemptive hallucinat",
    "path": "papers/24/08/2408.01877.json",
    "total_tokens": 386,
    "tldr": "该文章探讨了在零 Shot ObjectNav 任务中，通过与具有一定全局视野的空中代理进行交互的主体代理，使用视觉语言模型进行生成式通信（GC）的情况。文章表明，这种通信方式能够帮助主体代理在没有环境特定微调的情况下提高寻找目标对象的能力。此外，研究分析了这种交互中出现的幻想和合作行为，并指出了一种特殊的幻想行为，这提高了主体代理找到目标对象的概率。"
}