{
    "title": "CommonUppRoad: A Framework of Formal Modelling, Verifying, Learning, and Visualisation of Autonomous Vehicles",
    "abstract": "arXiv:2408.01093v1 Announce Type: cross  Abstract: Combining machine learning and formal methods (FMs) provides a possible solution to overcome the safety issue of autonomous driving (AD) vehicles. However, there are gaps to be bridged before this combination becomes practically applicable and useful. In an attempt to facilitate researchers in both FMs and AD areas, this paper proposes a framework that combines two well-known tools, namely CommonRoad and UPPAAL. On the one hand, CommonRoad can be enhanced by the rigorous semantics of models in UPPAAL, which enables a systematic and comprehensive understanding of the AD system's behaviour and thus strengthens the safety of the system. On the other hand, controllers synthesised by UPPAAL can be visualised by CommonRoad in real-world road networks, which facilitates AD vehicle designers greatly adopting formal models in system design. In this framework, we provide automatic model conversions between CommonRoad and UPPAAL. Therefore, users",
    "link": "https://arxiv.org/abs/2408.01093",
    "context": "Title: CommonUppRoad: A Framework of Formal Modelling, Verifying, Learning, and Visualisation of Autonomous Vehicles\nAbstract: arXiv:2408.01093v1 Announce Type: cross  Abstract: Combining machine learning and formal methods (FMs) provides a possible solution to overcome the safety issue of autonomous driving (AD) vehicles. However, there are gaps to be bridged before this combination becomes practically applicable and useful. In an attempt to facilitate researchers in both FMs and AD areas, this paper proposes a framework that combines two well-known tools, namely CommonRoad and UPPAAL. On the one hand, CommonRoad can be enhanced by the rigorous semantics of models in UPPAAL, which enables a systematic and comprehensive understanding of the AD system's behaviour and thus strengthens the safety of the system. On the other hand, controllers synthesised by UPPAAL can be visualised by CommonRoad in real-world road networks, which facilitates AD vehicle designers greatly adopting formal models in system design. In this framework, we provide automatic model conversions between CommonRoad and UPPAAL. Therefore, users",
    "path": "papers/24/08/2408.01093.json",
    "total_tokens": 689,
    "translated_title": "论文标题：CommonUppRoad：自动驾驶车辆的形式建模、验证、学习和可视化框架",
    "translated_abstract": "论文摘要：arXiv:2408.01093v1 公告类型：交叉  摘要：机器学习和形式方法的结合提供了一种可能的方法来解决自动驾驶车辆的安全问题。然而，在这种方法成为实用和有用之前，需要跨过一些障碍。在本研究中，我们提出了一个框架，结合了两个众所周知的工具，即CommonRoad和UPPAAL。一方面，CommonRoad可以通过UPPAAL中的模型严格语义得到增强，这使得对自动驾驶系统行为有系统的和全面的了解，从而增强了系统的安全性。另一方面，UPPAAL合成的控制器可以通过CommonRoad在真实世界路网中可视化，这对于自动驾驶车辆的设计者来说，在系统设计中采用形式模型是一个巨大的便利。在这个框架中，我们提供了CommonRoad和UPPAAL之间自动的模型转换。因此，用户能够同时使用CommonRoad的模拟功能和UPPAAL的形式验证能力，来增强自动驾驶系统的安全性。",
    "tldr": "该框架通过结合CommonRoad的模拟功能和UPPAAL的形式验证能力，探索了提高自动驾驶车辆安全性的方法，并通过自动模型转换支持用户。",
    "en_tdlr": "This framework explores methods to enhance the safety of autonomous vehicles by combining the simulation features of CommonRoad with the formal verification capability of UPPAAL, and supports users through automatic model conversions."
}