{
    "title": "EVIT: Event-based Visual-Inertial Tracking in Semi-Dense Maps Using Windowed Nonlinear Optimization",
    "abstract": "arXiv:2408.01370v1 Announce Type: cross  Abstract: Event cameras are an interesting visual exteroceptive sensor that reacts to brightness changes rather than integrating absolute image intensities. Owing to this design, the sensor exhibits strong performance in situations of challenging dynamics and illumination conditions. While event-based simultaneous tracking and mapping remains a challenging problem, a number of recent works have pointed out the sensor's suitability for prior map-based tracking. By making use of cross-modal registration paradigms, the camera's ego-motion can be tracked across a large spectrum of illumination and dynamics conditions on top of accurate maps that have been created a priori by more traditional sensors. The present paper follows up on a recently introduced event-based geometric semi-dense tracking paradigm, and proposes the addition of inertial signals in order to robustify the estimation. More specifically, the added signals provide strong cues for po",
    "link": "https://arxiv.org/abs/2408.01370",
    "context": "Title: EVIT: Event-based Visual-Inertial Tracking in Semi-Dense Maps Using Windowed Nonlinear Optimization\nAbstract: arXiv:2408.01370v1 Announce Type: cross  Abstract: Event cameras are an interesting visual exteroceptive sensor that reacts to brightness changes rather than integrating absolute image intensities. Owing to this design, the sensor exhibits strong performance in situations of challenging dynamics and illumination conditions. While event-based simultaneous tracking and mapping remains a challenging problem, a number of recent works have pointed out the sensor's suitability for prior map-based tracking. By making use of cross-modal registration paradigms, the camera's ego-motion can be tracked across a large spectrum of illumination and dynamics conditions on top of accurate maps that have been created a priori by more traditional sensors. The present paper follows up on a recently introduced event-based geometric semi-dense tracking paradigm, and proposes the addition of inertial signals in order to robustify the estimation. More specifically, the added signals provide strong cues for po",
    "path": "papers/24/08/2408.01370.json",
    "total_tokens": 690,
    "translated_title": "EVIT: 基于事件的事件-惯性半密集地图跟踪方法使用窗限非线性优化",
    "translated_abstract": "arXiv:2408.01370v1 公告类型：交叉  摘要：事件摄像头是一种特殊的视觉外感官器，它对亮度变化做出反应，而不是整合绝对图像强度。由于这种设计，传感器在动态和照明条件恶劣的情况下显示出很强的性能。尽管事件驱动的同步跟踪和映射仍然是一个挑战性的问题，但最近的一些工作已经指出，传感器在基于先验创建的传统传感器地图的跟踪方面的适用性。通过使用跨模态注册范式，相机的大范围照明动态条件下的自我运动可以在准确创建的先验地图上得到跟踪。本文延续了最近介绍的事件驱动几何半密集跟踪范式，并提出了添加惯性信号以增强估计的鲁棒性。更具体地说，添加的信号提供了有关位置和速度的重要线索，这样可以增强对事件相机的精确自我运动估计。此外，结合了事件和惯性测量的多模态信息进一步增强了跟踪器的性能。",
    "tldr": "本文提出了一种结合事件和惯性传感器数据的多模态跟踪方法，通过使用基于窗口的非线性优化算法，实现了在动态和照明条件变化下的精确事件相机自我运动估计，增强了跟踪器的性能。"
}