{
    "title": "Configuring Safe Spiking Neural Controllers for Cyber-Physical Systems through Formal Verification",
    "abstract": "arXiv:2408.01996v1 Announce Type: new  Abstract: Spiking Neural Networks (SNNs) are a subclass of neuromorphic models that have great potential to be used as controllers in Cyber-Physical Systems (CPSs) due to their energy efficiency. They can benefit from the prevalent approach of first training an Artificial Neural Network (ANN) and then translating to an SNN with subsequent hyperparameter tuning. The tuning is required to ensure that the resulting SNN is accurate with respect to the ANN in terms of metrics like Mean Squared Error (MSE). However, SNN controllers for safety-critical CPSs must also satisfy safety specifications, which are not guaranteed by the conversion approach. In this paper, we propose a solution which tunes the $temporal$ $window$ hyperparameter of the translated SNN to ensure both accuracy and compliance with the safe range specification that requires the SNN outputs to remain within a safe range. The core verification problem is modelled using mixed-integer line",
    "link": "https://arxiv.org/abs/2408.01996",
    "context": "Title: Configuring Safe Spiking Neural Controllers for Cyber-Physical Systems through Formal Verification\nAbstract: arXiv:2408.01996v1 Announce Type: new  Abstract: Spiking Neural Networks (SNNs) are a subclass of neuromorphic models that have great potential to be used as controllers in Cyber-Physical Systems (CPSs) due to their energy efficiency. They can benefit from the prevalent approach of first training an Artificial Neural Network (ANN) and then translating to an SNN with subsequent hyperparameter tuning. The tuning is required to ensure that the resulting SNN is accurate with respect to the ANN in terms of metrics like Mean Squared Error (MSE). However, SNN controllers for safety-critical CPSs must also satisfy safety specifications, which are not guaranteed by the conversion approach. In this paper, we propose a solution which tunes the $temporal$ $window$ hyperparameter of the translated SNN to ensure both accuracy and compliance with the safe range specification that requires the SNN outputs to remain within a safe range. The core verification problem is modelled using mixed-integer line",
    "path": "papers/24/08/2408.01996.json",
    "total_tokens": 413,
    "tldr": "该文章提出了一种通过正式验证配置安全突触神经控制器以用于带入体系统的创新方法。论文中，研究者们关注了突触神经网络（SNNs）在安全关键的Cyber-Physical Systems（CPSs）中的应用，在保证模型精度同时，特别提出了一个优化方案，即通过调整SNN的“时间窗口”超参数以确保其输出保持在安全范围内的安全合规性要求。这一创新贡献对突触神经控制系统在复杂系统中的安全性、可靠性提供了新的理论支持和应用指导。"
}