{
    "title": "Generalized Gaussian Temporal Difference Error For Uncertainty-aware Reinforcement Learning",
    "abstract": "arXiv:2408.02295v1 Announce Type: cross  Abstract: Conventional uncertainty-aware temporal difference (TD) learning methods often rely on simplistic assumptions, typically including a zero-mean Gaussian distribution for TD errors. Such oversimplification can lead to inaccurate error representations and compromised uncertainty estimation. In this paper, we introduce a novel framework for generalized Gaussian error modeling in deep reinforcement learning, applicable to both discrete and continuous control settings. Our framework enhances the flexibility of error distribution modeling by incorporating higher-order moments, particularly kurtosis, thereby improving the estimation and mitigation of data-dependent noise, i.e., aleatoric uncertainty. We examine the influence of the shape parameter of the generalized Gaussian distribution (GGD) on aleatoric uncertainty and provide a closed-form expression that demonstrates an inverse relationship between uncertainty and the shape parameter. Add",
    "link": "https://arxiv.org/abs/2408.02295",
    "context": "Title: Generalized Gaussian Temporal Difference Error For Uncertainty-aware Reinforcement Learning\nAbstract: arXiv:2408.02295v1 Announce Type: cross  Abstract: Conventional uncertainty-aware temporal difference (TD) learning methods often rely on simplistic assumptions, typically including a zero-mean Gaussian distribution for TD errors. Such oversimplification can lead to inaccurate error representations and compromised uncertainty estimation. In this paper, we introduce a novel framework for generalized Gaussian error modeling in deep reinforcement learning, applicable to both discrete and continuous control settings. Our framework enhances the flexibility of error distribution modeling by incorporating higher-order moments, particularly kurtosis, thereby improving the estimation and mitigation of data-dependent noise, i.e., aleatoric uncertainty. We examine the influence of the shape parameter of the generalized Gaussian distribution (GGD) on aleatoric uncertainty and provide a closed-form expression that demonstrates an inverse relationship between uncertainty and the shape parameter. Add",
    "path": "papers/24/08/2408.02295.json",
    "total_tokens": 508,
    "translated_title": "关于鲁棒强化学习的广义高斯TD误差模型",
    "translated_abstract": "我们提出了一个在深度强化学习中基于广义高斯误差模型的新框架，适用于离散和连续的控制设置。我们的框架改进了对误差分布的灵活建模，通过包含更高阶的统计量（特别是峰度），提高了数据相关的噪声估计，即，误差的不确定性。我们研究了广义高斯分布的形状参数对误差不确定性的影响，并提供了闭合形式的表达式，这表明了不确定性与形状参数之间的关系。",
    "tldr": "研究提出了一种鲁棒的强化学习框架，通过广义高斯误差模型改进了数据的误差和不确定性估计。",
    "en_tdlr": "A novel framework for robust reinforcement learning proposes a generalized Gaussian error model to enhance data error and uncertainty estimation."
}