{
    "title": "Dense Feature Interaction Network for Image Inpainting Localization",
    "abstract": "arXiv:2408.02191v1 Announce Type: new  Abstract: Image inpainting, which is the task of filling in missing areas in an image, is a common image editing technique. Inpainting can be used to conceal or alter image contents in malicious manipulation of images, driving the need for research in image inpainting detection. Existing methods mostly rely on a basic encoder-decoder structure, which often results in a high number of false positives or misses the inpainted regions, especially when dealing with targets of varying semantics and scales. Additionally, the absence of an effective approach to capture boundary artifacts leads to less accurate edge localization. In this paper, we describe a new method for inpainting detection based on a Dense Feature Interaction Network (DeFI-Net). DeFI-Net uses a novel feature pyramid architecture to capture and amplify multi-scale representations across various stages, thereby improving the detection of image inpainting by better revealing feature-level",
    "link": "https://arxiv.org/abs/2408.02191",
    "context": "Title: Dense Feature Interaction Network for Image Inpainting Localization\nAbstract: arXiv:2408.02191v1 Announce Type: new  Abstract: Image inpainting, which is the task of filling in missing areas in an image, is a common image editing technique. Inpainting can be used to conceal or alter image contents in malicious manipulation of images, driving the need for research in image inpainting detection. Existing methods mostly rely on a basic encoder-decoder structure, which often results in a high number of false positives or misses the inpainted regions, especially when dealing with targets of varying semantics and scales. Additionally, the absence of an effective approach to capture boundary artifacts leads to less accurate edge localization. In this paper, we describe a new method for inpainting detection based on a Dense Feature Interaction Network (DeFI-Net). DeFI-Net uses a novel feature pyramid architecture to capture and amplify multi-scale representations across various stages, thereby improving the detection of image inpainting by better revealing feature-level",
    "path": "papers/24/08/2408.02191.json",
    "total_tokens": 394,
    "tldr": "该文章提出了一种名为Dense Feature Interaction Network（DeFI-Net）的新方法，用于提高图像修补检测的准确性。通过创新的特征金字塔架构，DeFI-Net能够捕捉和放大不同阶段的特征表示，特别是在多尺度特征交互方面，从而显著提升了对图像修补检测的敏感性和准确性。这种方法特别有助于揭示图像修补中的特征级别交互，即使在处理具有不同语义和尺度目标时，也能减少误报并提高边缘定位的准确性。"
}