{
    "title": "Preference-Based Abstract Argumentation for Case-Based Reasoning (with Appendix)",
    "abstract": "arXiv:2408.00108v2 Announce Type: replace  Abstract: In the pursuit of enhancing the efficacy and flexibility of interpretable, data-driven classification models, this work introduces a novel incorporation of user-defined preferences with Abstract Argumentation and Case-Based Reasoning (CBR). Specifically, we introduce Preference-Based Abstract Argumentation for Case-Based Reasoning (which we call AA-CBR-P), allowing users to define multiple approaches to compare cases with an ordering that specifies their preference over these comparison approaches. We prove that the model inherently follows these preferences when making predictions and show that previous abstract argumentation for case-based reasoning approaches are insufficient at expressing preferences over constituents of an argument. We then demonstrate how this can be applied to a real-world medical dataset sourced from a clinical trial evaluating differing assessment methods of patients with a primary brain tumour. We show empi",
    "link": "https://arxiv.org/abs/2408.00108",
    "context": "Title: Preference-Based Abstract Argumentation for Case-Based Reasoning (with Appendix)\nAbstract: arXiv:2408.00108v2 Announce Type: replace  Abstract: In the pursuit of enhancing the efficacy and flexibility of interpretable, data-driven classification models, this work introduces a novel incorporation of user-defined preferences with Abstract Argumentation and Case-Based Reasoning (CBR). Specifically, we introduce Preference-Based Abstract Argumentation for Case-Based Reasoning (which we call AA-CBR-P), allowing users to define multiple approaches to compare cases with an ordering that specifies their preference over these comparison approaches. We prove that the model inherently follows these preferences when making predictions and show that previous abstract argumentation for case-based reasoning approaches are insufficient at expressing preferences over constituents of an argument. We then demonstrate how this can be applied to a real-world medical dataset sourced from a clinical trial evaluating differing assessment methods of patients with a primary brain tumour. We show empi",
    "path": "papers/24/08/2408.00108.json",
    "total_tokens": 680,
    "translated_title": "基于偏好的抽象论证案例基于推理（附录版）",
    "translated_abstract": "在本文中，我们提出了一种名为AA-CBR-P的创新方法，它将用户定义的偏好与抽象论证和案例基于推理（CBR）相结合。具体来说，AA-CBR-P允许用户通过定义多个比较案例的方法来表达偏好，并按照特定的偏好顺序对这些比较方法进行排序。我们将证明，当模型进行预测时，它会毫无保留地遵守这些偏好，并展示出先前对于案例基于推理的抽象论证方法不能有效地表达对论证成分的偏好。此外，我们还展示了这种方法在临床测试中的实际应用，该测试评估了不同评估方法在头颅肿瘤患者诊断中的有效性。通过真实世界数据的呈现，我们揭示了AA-CBR-P如何可能被应用于医疗领域的实际案例中。",
    "tldr": "本文提出了AA-CBR-P（基于偏好的抽象论证案例基于推理），它允许用户根据特定偏好对案例进行排序，并证明了模型在遵循这些偏好时进行预测的能力。这种方法在评估头颅肿瘤患者不同评估方法的有效性上得到了实验验证。"
}