{
    "title": "A Survey and Evaluation of Adversarial Attacks for Object Detection",
    "abstract": "arXiv:2408.01934v1 Announce Type: new  Abstract: Deep learning models excel in various computer vision tasks but are susceptible to adversarial examples-subtle perturbations in input data that lead to incorrect predictions. This vulnerability poses significant risks in safety-critical applications such as autonomous vehicles, security surveillance, and aircraft health monitoring. While numerous surveys focus on adversarial attacks in image classification, the literature on such attacks in object detection is limited. This paper offers a comprehensive taxonomy of adversarial attacks specific to object detection, reviews existing adversarial robustness evaluation metrics, and systematically assesses open-source attack methods and model robustness. Key observations are provided to enhance the understanding of attack effectiveness and corresponding countermeasures. Additionally, we identify crucial research challenges to guide future efforts in securing automated object detection systems.",
    "link": "https://arxiv.org/abs/2408.01934",
    "context": "Title: A Survey and Evaluation of Adversarial Attacks for Object Detection\nAbstract: arXiv:2408.01934v1 Announce Type: new  Abstract: Deep learning models excel in various computer vision tasks but are susceptible to adversarial examples-subtle perturbations in input data that lead to incorrect predictions. This vulnerability poses significant risks in safety-critical applications such as autonomous vehicles, security surveillance, and aircraft health monitoring. While numerous surveys focus on adversarial attacks in image classification, the literature on such attacks in object detection is limited. This paper offers a comprehensive taxonomy of adversarial attacks specific to object detection, reviews existing adversarial robustness evaluation metrics, and systematically assesses open-source attack methods and model robustness. Key observations are provided to enhance the understanding of attack effectiveness and corresponding countermeasures. Additionally, we identify crucial research challenges to guide future efforts in securing automated object detection systems.",
    "path": "papers/24/08/2408.01934.json",
    "total_tokens": 490,
    "translated_title": "《对抗攻击在对象检测中的调查与评估》",
    "translated_abstract": "这篇论文对专门针对对象检测的对抗攻击进行了全面分类，并对现有的对抗攻击评价指标进行了回顾。系统地评估了开源攻击方法和模型的鲁棒性。并提供了一系列关键观察，以提高对攻击有效性和相应对策的理解。此外，我们还指出了用以指导未来安全自动化对象检测系统研究的关键挑战。",
    "tldr": "本文全面调查了专门针对对象检测的多种对抗攻击方法，提供了对现有攻击评价指标的回顾，并对多种开源攻击方法进行了系统性的评估。"
}