{
    "title": "Effect of Fog Particle Size Distribution on 3D Object Detection Under Adverse Weather Conditions",
    "abstract": "arXiv:2408.01085v1 Announce Type: new  Abstract: LiDAR-based sensors employing optical spectrum signals play a vital role in providing significant information about the target objects in autonomous driving vehicle systems. However, the presence of fog in the atmosphere severely degrades the overall system's performance. This manuscript analyzes the role of fog particle size distributions in 3D object detection under adverse weather conditions. We utilise Mie theory and meteorological optical range (MOR) to calculate the attenuation and backscattering coefficient values for point cloud generation and analyze the overall system's accuracy in Car, Cyclist, and Pedestrian case scenarios under easy, medium and hard detection difficulties. Gamma and Junge (Power-Law) distributions are employed to mathematically model the fog particle size distribution under strong and moderate advection fog environments. Subsequently, we modified the KITTI dataset based on the backscattering coefficient valu",
    "link": "https://arxiv.org/abs/2408.01085",
    "context": "Title: Effect of Fog Particle Size Distribution on 3D Object Detection Under Adverse Weather Conditions\nAbstract: arXiv:2408.01085v1 Announce Type: new  Abstract: LiDAR-based sensors employing optical spectrum signals play a vital role in providing significant information about the target objects in autonomous driving vehicle systems. However, the presence of fog in the atmosphere severely degrades the overall system's performance. This manuscript analyzes the role of fog particle size distributions in 3D object detection under adverse weather conditions. We utilise Mie theory and meteorological optical range (MOR) to calculate the attenuation and backscattering coefficient values for point cloud generation and analyze the overall system's accuracy in Car, Cyclist, and Pedestrian case scenarios under easy, medium and hard detection difficulties. Gamma and Junge (Power-Law) distributions are employed to mathematically model the fog particle size distribution under strong and moderate advection fog environments. Subsequently, we modified the KITTI dataset based on the backscattering coefficient valu",
    "path": "papers/24/08/2408.01085.json",
    "total_tokens": 676,
    "translated_title": "《气象条件下的雾粒径分布对三维物体检测的影响》",
    "translated_abstract": "arXiv:2408.01085v1 公告类型：新 Abstract: 激光雷达传感器使用光学频谱信号在自主驾驶车辆的系统中提供了关于目标对象的重要信息。然而，大气中雾的存在严重损害了整体系统的性能。本文分析了雾粒径分布在不良天气条件下对三维物体检测的影响。我们利用米氏理论和气象光学范围（MOR）来计算点云生成中的衰减和后向散射系数值，并分析了在易、中、难检测难度条件下自动驾驶车辆系统在汽车、自行车和行人情况下的总体准确性。在强的和温和的吹送雾环境中，我们使用了伽马分布和朱恩（幂律）分布来数学上模拟雾粒径分布。随后，我们根据后向散射系数值修改了KITTI数据集，并对实验结果进行了评估分析，以揭示雾粒径分布对三维物体检测的潜在影响。",
    "tldr": "研究探讨了雾粒径分布对自动驾驶车辆三维物体检测系统性能的影响，并通过计算和实验研究发现雾粒子的大小分布显著降低了系统的检测准确性。"
}