{
    "title": "PrivateGaze: Preserving User Privacy in Black-box Mobile Gaze Tracking Services",
    "abstract": "arXiv:2408.00950v1 Announce Type: new  Abstract: Eye gaze contains rich information about human attention and cognitive processes. This capability makes the underlying technology, known as gaze tracking, a critical enabler for many ubiquitous applications and has triggered the development of easy-to-use gaze estimation services. Indeed, by utilizing the ubiquitous cameras on tablets and smartphones, users can readily access many gaze estimation services. In using these services, users must provide their full-face images to the gaze estimator, which is often a black box. This poses significant privacy threats to the users, especially when a malicious service provider gathers a large collection of face images to classify sensitive user attributes. In this work, we present PrivateGaze, the first approach that can effectively preserve users' privacy in black-box gaze tracking services without compromising gaze estimation performance. Specifically, we proposed a novel framework to train a p",
    "link": "https://arxiv.org/abs/2408.00950",
    "context": "Title: PrivateGaze: Preserving User Privacy in Black-box Mobile Gaze Tracking Services\nAbstract: arXiv:2408.00950v1 Announce Type: new  Abstract: Eye gaze contains rich information about human attention and cognitive processes. This capability makes the underlying technology, known as gaze tracking, a critical enabler for many ubiquitous applications and has triggered the development of easy-to-use gaze estimation services. Indeed, by utilizing the ubiquitous cameras on tablets and smartphones, users can readily access many gaze estimation services. In using these services, users must provide their full-face images to the gaze estimator, which is often a black box. This poses significant privacy threats to the users, especially when a malicious service provider gathers a large collection of face images to classify sensitive user attributes. In this work, we present PrivateGaze, the first approach that can effectively preserve users' privacy in black-box gaze tracking services without compromising gaze estimation performance. Specifically, we proposed a novel framework to train a p",
    "path": "papers/24/08/2408.00950.json",
    "total_tokens": 667,
    "translated_title": "PrivateGaze：保护黑盒式移动眼动跟踪服务中用户隐私的方法",
    "translated_abstract": "arXiv:2408.00950v1 宣布类型：新 摘要：眼睛的视线包含有关人类注意力和认知过程的大量信息。这项能力使得基於视线跟踪的底层技术成为许多普及应用的关键推动者，并激发了视线估计服务的开发。确实，通过利用平板电脑和智能手机上无处不在的摄像头，用户可以轻松访问许多视线估计服务。在这些服务中，用户必须将他们的全脸图像提供给视线估算器，后者通常是黑匣子。这给用户带来了严重的隐私威胁，尤其是当一个恶意的服务提供商收集了大量面孔图像来分类敏感的用户属性时。在这次的工作中，我们提出了PrivateGaze，这是第一个能在黑盒式视线跟踪服务中有效保护用户隐私，同时又不 compromising视线估计性能的方法。特别是，我们提出了一种新的框架来培训一个能够生成高质量伪视线标记的生成模型，并通过这些标记来保护用户的隐私。与之前的保护隐私的技术相比，我们的方法能够在保持高准确性方面做得更好。",
    "tldr": "本研究提出了一种名为PrivateGaze的新方法，该方法能够在不损害视线估计性能的情况下，有效地保护用户在黑盒式移动眼动跟踪服务中的隐私。"
}