{
    "title": "CoBooM: Codebook Guided Bootstrapping for Medical Image Representation Learning",
    "abstract": "arXiv:2408.04262v1 Announce Type: new  Abstract: Self-supervised learning (SSL) has emerged as a promising paradigm for medical image analysis by harnessing unannotated data. Despite their potential, the existing SSL approaches overlook the high anatomical similarity inherent in medical images. This makes it challenging for SSL methods to capture diverse semantic content in medical images consistently. This work introduces a novel and generalized solution that implicitly exploits anatomical similarities by integrating codebooks in SSL. The codebook serves as a concise and informative dictionary of visual patterns, which not only aids in capturing nuanced anatomical details but also facilitates the creation of robust and generalized feature representations. In this context, we propose CoBooM, a novel framework for self-supervised medical image learning by integrating continuous and discrete representations. The continuous component ensures the preservation of fine-grained details, while",
    "link": "https://arxiv.org/abs/2408.04262",
    "context": "Title: CoBooM: Codebook Guided Bootstrapping for Medical Image Representation Learning\nAbstract: arXiv:2408.04262v1 Announce Type: new  Abstract: Self-supervised learning (SSL) has emerged as a promising paradigm for medical image analysis by harnessing unannotated data. Despite their potential, the existing SSL approaches overlook the high anatomical similarity inherent in medical images. This makes it challenging for SSL methods to capture diverse semantic content in medical images consistently. This work introduces a novel and generalized solution that implicitly exploits anatomical similarities by integrating codebooks in SSL. The codebook serves as a concise and informative dictionary of visual patterns, which not only aids in capturing nuanced anatomical details but also facilitates the creation of robust and generalized feature representations. In this context, we propose CoBooM, a novel framework for self-supervised medical image learning by integrating continuous and discrete representations. The continuous component ensures the preservation of fine-grained details, while",
    "path": "papers/24/08/2408.04262.json",
    "total_tokens": 341,
    "tldr": "该文章提出了CoBooM框架，这是针对医疗图像分析的自我监督学习方法的一个创新。CoBooM框架通过整合代码本与自我监督学习，有效利用了医疗图像中的内在解剖学相似性，从而在捕捉细致解剖学特征的同时，构建了强大而通用的特征表示。"
}