{
    "title": "Target Prompting for Information Extraction with Vision Language Model",
    "abstract": "arXiv:2408.03834v1 Announce Type: new  Abstract: The recent trend in the Large Vision and Language model has brought a new change in how information extraction systems are built. VLMs have set a new benchmark with their State-of-the-art techniques in understanding documents and building question-answering systems across various industries. They are significantly better at generating text from document images and providing accurate answers to questions. However, there are still some challenges in effectively utilizing these models to build a precise conversational system. General prompting techniques used with large language models are often not suitable for these specially designed vision language models. The output generated by such generic input prompts is ordinary and may contain information gaps when compared with the actual content of the document. To obtain more accurate and specific answers, a well-targeted prompt is required by the vision language model, along with the document",
    "link": "https://arxiv.org/abs/2408.03834",
    "context": "Title: Target Prompting for Information Extraction with Vision Language Model\nAbstract: arXiv:2408.03834v1 Announce Type: new  Abstract: The recent trend in the Large Vision and Language model has brought a new change in how information extraction systems are built. VLMs have set a new benchmark with their State-of-the-art techniques in understanding documents and building question-answering systems across various industries. They are significantly better at generating text from document images and providing accurate answers to questions. However, there are still some challenges in effectively utilizing these models to build a precise conversational system. General prompting techniques used with large language models are often not suitable for these specially designed vision language models. The output generated by such generic input prompts is ordinary and may contain information gaps when compared with the actual content of the document. To obtain more accurate and specific answers, a well-targeted prompt is required by the vision language model, along with the document",
    "path": "papers/24/08/2408.03834.json",
    "total_tokens": 316,
    "tldr": "该文章创新性地提出了针对信息提取的视觉语言模型的目标提示方法，以期解决传统通用提示在特定场合下的不足，通过针对性地设计提示，提高了视觉语言模型在文档生成和问答系统中的准确性。"
}