{
    "title": "SUSTechGAN: Image Generation for Object Recognition in Adverse Conditions of Autonomous Driving",
    "abstract": "arXiv:2408.01430v1 Announce Type: new  Abstract: Autonomous driving significantly benefits from data-driven deep neural networks. However, the data in autonomous driving typically fits the long-tailed distribution, in which the critical driving data in adverse conditions is hard to collect. Although generative adversarial networks (GANs) have been applied to augment data for autonomous driving, generating driving images in adverse conditions is still challenging. In this work, we propose a novel SUSTechGAN with dual attention modules and multi-scale generators to generate driving images for improving object recognition of autonomous driving in adverse conditions. We test the SUSTechGAN and the existing well-known GANs to generate driving images in adverse conditions of rain and night and apply the generated images to retrain object recognition networks. Specifically, we add generated images into the training datasets to retrain the well-known YOLOv5 and evaluate the improvement of the ",
    "link": "https://arxiv.org/abs/2408.01430",
    "context": "Title: SUSTechGAN: Image Generation for Object Recognition in Adverse Conditions of Autonomous Driving\nAbstract: arXiv:2408.01430v1 Announce Type: new  Abstract: Autonomous driving significantly benefits from data-driven deep neural networks. However, the data in autonomous driving typically fits the long-tailed distribution, in which the critical driving data in adverse conditions is hard to collect. Although generative adversarial networks (GANs) have been applied to augment data for autonomous driving, generating driving images in adverse conditions is still challenging. In this work, we propose a novel SUSTechGAN with dual attention modules and multi-scale generators to generate driving images for improving object recognition of autonomous driving in adverse conditions. We test the SUSTechGAN and the existing well-known GANs to generate driving images in adverse conditions of rain and night and apply the generated images to retrain object recognition networks. Specifically, we add generated images into the training datasets to retrain the well-known YOLOv5 and evaluate the improvement of the ",
    "path": "papers/24/08/2408.01430.json",
    "total_tokens": 387,
    "tldr": "该文章提出了一种名为SUSTechGAN的生成对抗网络，该网络通过引入双注意力模块和多尺度生成器来生成自动驾驶车辆在恶劣天气条件（如雨夜）下的驾驶图像，从而提高自动驾驶系统的目标识别能力。通过在YOLOv5目标识别网络模型上进行实验，证明在不增加新样本来扩大训练数据集的情况下，仅通过在训练中引入生成的标的图像，就能够显著提升其在恶劣天气条件下的目标识别性能。"
}