{
    "title": "Amman City, Jordan: Toward a Sustainable City from the Ground Up",
    "abstract": "arXiv:2408.01454v1 Announce Type: cross  Abstract: The idea of smart cities (SCs) has gained substantial attention in recent years. The SC paradigm aims to improve citizens' quality of life and protect the city's environment. As we enter the age of next-generation SCs, it is important to explore all relevant aspects of the SC paradigm. In recent years, the advancement of Information and Communication Technologies (ICT) has produced a trend of supporting daily objects with smartness, targeting to make human life easier and more comfortable. The paradigm of SCs appears as a response to the purpose of building the city of the future with advanced features. SCs still face many challenges in their implementation, but increasingly more studies regarding SCs are implemented. Nowadays, different cities are employing SC features to enhance services or the residents quality of life. This work provides readers with useful and important information about Amman Smart City.",
    "link": "https://arxiv.org/abs/2408.01454",
    "context": "Title: Amman City, Jordan: Toward a Sustainable City from the Ground Up\nAbstract: arXiv:2408.01454v1 Announce Type: cross  Abstract: The idea of smart cities (SCs) has gained substantial attention in recent years. The SC paradigm aims to improve citizens' quality of life and protect the city's environment. As we enter the age of next-generation SCs, it is important to explore all relevant aspects of the SC paradigm. In recent years, the advancement of Information and Communication Technologies (ICT) has produced a trend of supporting daily objects with smartness, targeting to make human life easier and more comfortable. The paradigm of SCs appears as a response to the purpose of building the city of the future with advanced features. SCs still face many challenges in their implementation, but increasingly more studies regarding SCs are implemented. Nowadays, different cities are employing SC features to enhance services or the residents quality of life. This work provides readers with useful and important information about Amman Smart City.",
    "path": "papers/24/08/2408.01454.json",
    "total_tokens": 579,
    "translated_title": "安曼城市，约旦：自下而上建设可持续城市",
    "translated_abstract": "arXiv:2408.01454v1 公告类型：交叉 摘要：近年来，智能城市（SCs）的理念受到了广泛关注。SCs的理念旨在提高市民的生活质量并保护城市环境。随着我们步入下一代智能城市时代，探索SC理念的所有相关方面变得至关重要。近年来，信息技术的发展促进了日常生活中物品智能化的趋势，旨在使人类生活更加便捷舒适。SCs的模式作为一个回应，旨在构建一个具有先进特征的未来城市。尽管SCs的实施仍面临许多挑战，但越来越多的研究开始关注这一领域。如今，不同城市正在采纳SCs的特点来提升服务和居民的生活质量。本工作为读者提供了关于安曼智慧城市的有用和重要信息。",
    "tldr": "安曼智慧城市项目介绍了如何通过创新技术改善市民生活质量和城市环境。"
}