{
    "title": "HyperSpaceX: Radial and Angular Exploration of HyperSpherical Dimensions",
    "abstract": "arXiv:2408.02494v1 Announce Type: new  Abstract: Traditional deep learning models rely on methods such as softmax cross-entropy and ArcFace loss for tasks like classification and face recognition. These methods mainly explore angular features in a hyperspherical space, often resulting in entangled inter-class features due to dense angular data across many classes. In this paper, a new field of feature exploration is proposed known as HyperSpaceX which enhances class discrimination by exploring both angular and radial dimensions in multi-hyperspherical spaces, facilitated by a novel DistArc loss. The proposed DistArc loss encompasses three feature arrangement components: two angular and one radial, enforcing intra-class binding and inter-class separation in multi-radial arrangement, improving feature discriminability. Evaluation of HyperSpaceX framework for the novel representation utilizes a proposed predictive measure that accounts for both angular and radial elements, providing a mor",
    "link": "https://arxiv.org/abs/2408.02494",
    "context": "Title: HyperSpaceX: Radial and Angular Exploration of HyperSpherical Dimensions\nAbstract: arXiv:2408.02494v1 Announce Type: new  Abstract: Traditional deep learning models rely on methods such as softmax cross-entropy and ArcFace loss for tasks like classification and face recognition. These methods mainly explore angular features in a hyperspherical space, often resulting in entangled inter-class features due to dense angular data across many classes. In this paper, a new field of feature exploration is proposed known as HyperSpaceX which enhances class discrimination by exploring both angular and radial dimensions in multi-hyperspherical spaces, facilitated by a novel DistArc loss. The proposed DistArc loss encompasses three feature arrangement components: two angular and one radial, enforcing intra-class binding and inter-class separation in multi-radial arrangement, improving feature discriminability. Evaluation of HyperSpaceX framework for the novel representation utilizes a proposed predictive measure that accounts for both angular and radial elements, providing a mor",
    "path": "papers/24/08/2408.02494.json",
    "total_tokens": 365,
    "tldr": "该文章提出了一个名为HyperSpaceX的框架，通过探索多 hyperspherical 空间中的角度和半径维度，极大地提高了分类任务中特征的区分度。这项创新采用了基于角度距离（DistArc）的损失函数，它结合了三个特征布局成分，实现了类内结合和类间分离的效果，并使用了一个新型的预测度量来评估特征的代表性，从而为特征表示带来了显著的改进。"
}