{
    "title": "A comparative study of generative adversarial networks for image recognition algorithms based on deep learning and traditional methods",
    "abstract": "arXiv:2408.03568v1 Announce Type: new  Abstract: In this paper, an image recognition algorithm based on the combination of deep learning and generative adversarial network (GAN) is studied, and compared with traditional image recognition methods. The purpose of this study is to evaluate the advantages and application prospects of deep learning technology, especially GAN, in the field of image recognition. Firstly, this paper reviews the basic principles and techniques of traditional image recognition methods, including the classical algorithms based on feature extraction such as SIFT, HOG and their combination with support vector machine (SVM), random forest, and other classifiers. Then, the working principle, network structure, and unique advantages of GAN in image generation and recognition are introduced. In order to verify the effectiveness of GAN in image recognition, a series of experiments are designed and carried out using multiple public image data sets for training and testin",
    "link": "https://arxiv.org/abs/2408.03568",
    "context": "Title: A comparative study of generative adversarial networks for image recognition algorithms based on deep learning and traditional methods\nAbstract: arXiv:2408.03568v1 Announce Type: new  Abstract: In this paper, an image recognition algorithm based on the combination of deep learning and generative adversarial network (GAN) is studied, and compared with traditional image recognition methods. The purpose of this study is to evaluate the advantages and application prospects of deep learning technology, especially GAN, in the field of image recognition. Firstly, this paper reviews the basic principles and techniques of traditional image recognition methods, including the classical algorithms based on feature extraction such as SIFT, HOG and their combination with support vector machine (SVM), random forest, and other classifiers. Then, the working principle, network structure, and unique advantages of GAN in image generation and recognition are introduced. In order to verify the effectiveness of GAN in image recognition, a series of experiments are designed and carried out using multiple public image data sets for training and testin",
    "path": "papers/24/08/2408.03568.json",
    "total_tokens": 337,
    "tldr": "该文章通过将深度学习与生成对抗网络（GAN）结合的创新方法，对比了传统图像识别方法在图像识别领域的应用，展示了GAN技术在图像生成和识别方面独特的优势，并通过对多个公共图像数据集的实验验证了GAN在图像识别中的有效性。"
}