{
    "title": "Decision Support System to triage of liver trauma",
    "abstract": "arXiv:2408.02012v1 Announce Type: cross  Abstract: Trauma significantly impacts global health, accounting for over 5 million deaths annually, which is comparable to mortality rates from diseases such as tuberculosis, AIDS, and malaria. In Iran, the financial repercussions of road traffic accidents represent approximately 2% of the nation's Gross National Product each year. Bleeding is the leading cause of mortality in trauma patients within the first 24 hours following an injury, making rapid diagnosis and assessment of severity crucial. Trauma patients require comprehensive scans of all organs, generating a large volume of data. Evaluating CT images for the entire body is time-consuming and requires significant expertise, underscoring the need for efficient time management in diagnosis. Efficient diagnostic processes can significantly reduce treatment costs and decrease the likelihood of secondary complications. In this context, the development of a reliable Decision Support System (D",
    "link": "https://arxiv.org/abs/2408.02012",
    "context": "Title: Decision Support System to triage of liver trauma\nAbstract: arXiv:2408.02012v1 Announce Type: cross  Abstract: Trauma significantly impacts global health, accounting for over 5 million deaths annually, which is comparable to mortality rates from diseases such as tuberculosis, AIDS, and malaria. In Iran, the financial repercussions of road traffic accidents represent approximately 2% of the nation's Gross National Product each year. Bleeding is the leading cause of mortality in trauma patients within the first 24 hours following an injury, making rapid diagnosis and assessment of severity crucial. Trauma patients require comprehensive scans of all organs, generating a large volume of data. Evaluating CT images for the entire body is time-consuming and requires significant expertise, underscoring the need for efficient time management in diagnosis. Efficient diagnostic processes can significantly reduce treatment costs and decrease the likelihood of secondary complications. In this context, the development of a reliable Decision Support System (D",
    "path": "papers/24/08/2408.02012.json",
    "total_tokens": 594,
    "translated_title": "肝脏创伤优先处理系统",
    "translated_abstract": "arXiv:2408.02012v1 公告类型：交叉 摘要：全球健康受到创伤的严重影响，每年超过500万人死于创伤，这与结核病、艾滋病和疟疾等疾病的死亡率相当。在伊朗，交通事故的经济后果每年约占国家国民生产总值（GNP）的2%。创伤患者在接受伤害后24小时内的出血是致死的主要原因，因此，迅速诊断和评估疾病的严重性至关重要。患者需要对所有器官进行全面的扫描，这会产生大量数据。对全身进行CT图像评估既耗时又需要大量的专业知识，这突显了在诊断过程中有效管理时间的重要性。高效的诊断流程能够在很大程度上减少治疗成本，并减少继发并发症的发生。在这种情况下，开发一个可靠的决策支持系统（D",
    "tldr": "本文提出了一种决策支持系统，用于高效地评估和优先处理肝脏创伤病例，以减少治疗成本和继发并发症的风险。"
}