{
    "title": "StoDIP: Efficient 3D MRF image reconstruction with deep image priors and stochastic iterations",
    "abstract": "arXiv:2408.02367v1 Announce Type: cross  Abstract: Magnetic Resonance Fingerprinting (MRF) is a time-efficient approach to quantitative MRI for multiparametric tissue mapping. The reconstruction of quantitative maps requires tailored algorithms for removing aliasing artefacts from the compressed sampled MRF acquisitions. Within approaches found in the literature, many focus solely on two-dimensional (2D) image reconstruction, neglecting the extension to volumetric (3D) scans despite their higher relevance and clinical value. A reason for this is that transitioning to 3D imaging without appropriate mitigations presents significant challenges, including increased computational cost and storage requirements, and the need for large amount of ground-truth (artefact-free) data for training. To address these issues, we introduce StoDIP, a new algorithm that extends the ground-truth-free Deep Image Prior (DIP) reconstruction to 3D MRF imaging. StoDIP employs memory-efficient stochastic updates",
    "link": "https://arxiv.org/abs/2408.02367",
    "context": "Title: StoDIP: Efficient 3D MRF image reconstruction with deep image priors and stochastic iterations\nAbstract: arXiv:2408.02367v1 Announce Type: cross  Abstract: Magnetic Resonance Fingerprinting (MRF) is a time-efficient approach to quantitative MRI for multiparametric tissue mapping. The reconstruction of quantitative maps requires tailored algorithms for removing aliasing artefacts from the compressed sampled MRF acquisitions. Within approaches found in the literature, many focus solely on two-dimensional (2D) image reconstruction, neglecting the extension to volumetric (3D) scans despite their higher relevance and clinical value. A reason for this is that transitioning to 3D imaging without appropriate mitigations presents significant challenges, including increased computational cost and storage requirements, and the need for large amount of ground-truth (artefact-free) data for training. To address these issues, we introduce StoDIP, a new algorithm that extends the ground-truth-free Deep Image Prior (DIP) reconstruction to 3D MRF imaging. StoDIP employs memory-efficient stochastic updates",
    "path": "papers/24/08/2408.02367.json",
    "total_tokens": 1001,
    "translated_title": "StoDIP: 通过深度图像先验和随机迭代高效的3D MRF图像重建",
    "translated_abstract": "arXiv:2408.02367v1 公告类型：交叉  摘要：磁共振指纹识别（MRF）是一种量化磁共振成像的方法，用于多参数组织映射，具有时间效率。定量映射重建要求去除压缩采样MRF采集中的伪影 artifacts。在已发表的方法中，许多方法仅关注二维（2D）图像重建，尽管它们在临床上的重要性更高，但忽视了向三维（3D）扫描的扩展。原因之一是在没有适当的缓解措施的情况下，向3D成像过渡会带来重大挑战，包括增加的计算成本和要求大量的ground-truth（无伪影）数据用于训练。为了解决这些问题，我们提出了StoDIP，一种新的算法，它将无ground-truth的Deep Image Prior（DIP）重建成用于3D MRF成像。StoDIP采用内存高效的随机更新方法，能够在不需要大量无伪影训练数据的情况下高效重建3D MRF数据。同时，该算法利用深度图像先验的强大能力，并结合随机迭代技术，能够在3D空间中捕获更多细节，有效地分离出不同类型的伪影。With the advancement of deep learning (DL), particularly in computer vision applications, the DIP approach gained attention for its ability to accurately reconstruct images by leveraging the inherent structures across a set of unlabeled images. However, despite its effectiveness in 2D image reconstruction, applying the DIP method to the 3D MRF imaging domain remained challenging due to the significant increase in data size and the computational complexity brought about by the transition to 3D.",
    "tldr": "该算法通过Deep Image Prior和随机迭代技术改进了3D MRF图像的准确重建，无需大量ground-truth数据即可进行高效的三维重建，克服了传统3D成像的挑战。"
}