{
    "title": "FORGE: Force-Guided Exploration for Robust Contact-Rich Manipulation under Uncertainty",
    "abstract": "arXiv:2408.04587v1 Announce Type: new  Abstract: We present FORGE, a method that enables sim-to-real transfer of contact-rich manipulation policies in the presence of significant pose uncertainty. FORGE combines a force threshold mechanism with a dynamics randomization scheme during policy learning in simulation, to enable the robust transfer of the learned policies to the real robot. At deployment, FORGE policies, conditioned on a maximum allowable force, adaptively perform contact-rich tasks while respecting the specified force threshold, regardless of the controller gains. Additionally, FORGE autonomously predicts a termination action once the task has succeeded. We demonstrate that FORGE can be used to learn a variety of robust contact-rich policies, enabling multi-stage assembly of a planetary gear system, which requires success across three assembly tasks: nut-threading, insertion, and gear meshing. Project website can be accessed at https://noseworm.github.io/forge/.",
    "link": "https://arxiv.org/abs/2408.04587",
    "context": "Title: FORGE: Force-Guided Exploration for Robust Contact-Rich Manipulation under Uncertainty\nAbstract: arXiv:2408.04587v1 Announce Type: new  Abstract: We present FORGE, a method that enables sim-to-real transfer of contact-rich manipulation policies in the presence of significant pose uncertainty. FORGE combines a force threshold mechanism with a dynamics randomization scheme during policy learning in simulation, to enable the robust transfer of the learned policies to the real robot. At deployment, FORGE policies, conditioned on a maximum allowable force, adaptively perform contact-rich tasks while respecting the specified force threshold, regardless of the controller gains. Additionally, FORGE autonomously predicts a termination action once the task has succeeded. We demonstrate that FORGE can be used to learn a variety of robust contact-rich policies, enabling multi-stage assembly of a planetary gear system, which requires success across three assembly tasks: nut-threading, insertion, and gear meshing. Project website can be accessed at https://noseworm.github.io/forge/.",
    "path": "papers/24/08/2408.04587.json",
    "total_tokens": 383,
    "tldr": "该文章介绍了一种名为FORGE的方法，该方法通过结合模拟中的力阈值机制和动态随机化方案，以及在现实机器人上利用最大允许力的参考，实现了即使在大幅度的姿态不确定性下也能保证接触密集型操作策略的可靠转移。这种方法不仅强化了学习策略的鲁棒性，同时还能基于任务成功自动预测出一个终止动作，展示了其在多阶段组装任务中的应用潜力。"
}