{
    "title": "Flexible Bayesian Last Layer Models Using Implicit Priors and Diffusion Posterior Sampling",
    "abstract": "arXiv:2408.03746v1 Announce Type: cross  Abstract: Bayesian Last Layer (BLL) models focus solely on uncertainty in the output layer of neural networks, demonstrating comparable performance to more complex Bayesian models. However, the use of Gaussian priors for last layer weights in Bayesian Last Layer (BLL) models limits their expressive capacity when faced with non-Gaussian, outlier-rich, or high-dimensional datasets. To address this shortfall, we introduce a novel approach that combines diffusion techniques and implicit priors for variational learning of Bayesian last layer weights. This method leverages implicit distributions for modeling weight priors in BLL, coupled with diffusion samplers for approximating true posterior predictions, thereby establishing a comprehensive Bayesian prior and posterior estimation strategy. By delivering an explicit and computationally efficient variational lower bound, our method aims to augment the expressive abilities of BLL models, enhancing mode",
    "link": "https://arxiv.org/abs/2408.03746",
    "context": "Title: Flexible Bayesian Last Layer Models Using Implicit Priors and Diffusion Posterior Sampling\nAbstract: arXiv:2408.03746v1 Announce Type: cross  Abstract: Bayesian Last Layer (BLL) models focus solely on uncertainty in the output layer of neural networks, demonstrating comparable performance to more complex Bayesian models. However, the use of Gaussian priors for last layer weights in Bayesian Last Layer (BLL) models limits their expressive capacity when faced with non-Gaussian, outlier-rich, or high-dimensional datasets. To address this shortfall, we introduce a novel approach that combines diffusion techniques and implicit priors for variational learning of Bayesian last layer weights. This method leverages implicit distributions for modeling weight priors in BLL, coupled with diffusion samplers for approximating true posterior predictions, thereby establishing a comprehensive Bayesian prior and posterior estimation strategy. By delivering an explicit and computationally efficient variational lower bound, our method aims to augment the expressive abilities of BLL models, enhancing mode",
    "path": "papers/24/08/2408.03746.json",
    "total_tokens": 375,
    "tldr": "该文章提供了一种新颖的方法，将扩散技术与隐式先验相结合，用于学习后验似然的变分法，以增强贝叶斯最后层模型（BLL）的表达能力，特别是在处理非正态分布、异常值丰富或高维数据集时。通过使用隐式分布来建模BLL的权重先验，并将扩散采样器用于近似真实的后验预测，本文提出的方法建立了一个全面的后验和先验估计策略。"
}