{
    "title": "Interplay between Foraging Choices and Population Growth Dynamics",
    "abstract": "arXiv:2408.02552v1 Announce Type: new  Abstract: In this study, we couple a population dynamics model with a model for optimal foraging to study the interdependence between individual-level cost-benefits and population-scale dynamics. Specifically, we study the logistic growth model, which provides insights into population dynamics under resource limitations. Unlike exponential growth, the logistic model incorporates the concept of carrying capacity, thus offering a more realistic depiction of biological populations as they near environmental limits. We aim to study the impact of individual-level incentives driving behavioral responses in a dynamic environment. Specifically, explore the coupled dynamics between population density and individuals' foraging times. Our results yield insights into the effects of population size on individuals' optimal foraging efforts, which impacts the population's size.",
    "link": "https://arxiv.org/abs/2408.02552",
    "context": "Title: Interplay between Foraging Choices and Population Growth Dynamics\nAbstract: arXiv:2408.02552v1 Announce Type: new  Abstract: In this study, we couple a population dynamics model with a model for optimal foraging to study the interdependence between individual-level cost-benefits and population-scale dynamics. Specifically, we study the logistic growth model, which provides insights into population dynamics under resource limitations. Unlike exponential growth, the logistic model incorporates the concept of carrying capacity, thus offering a more realistic depiction of biological populations as they near environmental limits. We aim to study the impact of individual-level incentives driving behavioral responses in a dynamic environment. Specifically, explore the coupled dynamics between population density and individuals' foraging times. Our results yield insights into the effects of population size on individuals' optimal foraging efforts, which impacts the population's size.",
    "path": "papers/24/08/2408.02552.json",
    "total_tokens": 322,
    "tldr": "创新贡献总结：本研究通过将优化觅食模型与生命体模型相结合，分析了个体觅食决策对种群规模增长动态的影响，揭示了个体内在动机在动态环境中的行为响应如何影响了种群增长模型中的“容纳量”概念，尤其是种群密度如何影响个体的觅食时间选择。这种耦合模型为理解种群在接近环境极限条件下的真实行为提供了新视角。"
}