{
    "title": "TGS: Trajectory Generation and Selection using Vision Language Models in Mapless Outdoor Environments",
    "abstract": "arXiv:2408.02454v1 Announce Type: new  Abstract: We present a multi-modal trajectory generation and selection algorithm for real-world mapless outdoor navigation in challenging scenarios with unstructured off-road features like buildings, grass, and curbs. Our goal is to compute suitable trajectories that (1) satisfy the environment-specific traversability constraints and (2) match human-like paths while navigating in crosswalks, sidewalks, etc. Our formulation uses a Conditional Variational Autoencoder (CVAE) generative model enhanced with traversability constraints to generate multiple candidate trajectories for global navigation. We use VLMs and a visual prompting approach with their zero-shot ability of semantic understanding and logical reasoning to choose the best trajectory given the contextual information about the task. We evaluate our methods in various outdoor scenes with wheeled robots and compare the performance with other global navigation algorithms. In practice, we obse",
    "link": "https://arxiv.org/abs/2408.02454",
    "context": "Title: TGS: Trajectory Generation and Selection using Vision Language Models in Mapless Outdoor Environments\nAbstract: arXiv:2408.02454v1 Announce Type: new  Abstract: We present a multi-modal trajectory generation and selection algorithm for real-world mapless outdoor navigation in challenging scenarios with unstructured off-road features like buildings, grass, and curbs. Our goal is to compute suitable trajectories that (1) satisfy the environment-specific traversability constraints and (2) match human-like paths while navigating in crosswalks, sidewalks, etc. Our formulation uses a Conditional Variational Autoencoder (CVAE) generative model enhanced with traversability constraints to generate multiple candidate trajectories for global navigation. We use VLMs and a visual prompting approach with their zero-shot ability of semantic understanding and logical reasoning to choose the best trajectory given the contextual information about the task. We evaluate our methods in various outdoor scenes with wheeled robots and compare the performance with other global navigation algorithms. In practice, we obse",
    "path": "papers/24/08/2408.02454.json",
    "total_tokens": 683,
    "translated_title": "TGS: 使用视觉语言模型在无图环境中的轨迹生成和选择方法",
    "translated_abstract": "我们提出了一个多模态轨迹生成和选择算法，用于在具有不规则户外特征的现实世界中进行无图导航，例如建筑物、草地和路沿。我们的目标是计算出满足环境特定可通行的约束且在行人横道、人行道等区域导航时表现出人类行为的路径。我们所提出的算法使用了一种受条件变分自动编码器（CVAE）启发的生成模型，该模型通过路径的局部依存性来增强，能够生成多条候选轨迹以供全局导航。我们还使用视觉提示和基于视觉语言模型（VLMs）的零样本能力来选择最合适的轨迹，该模型能够理解语义逻辑推理，并获取有关任务的关键上下文信息。我们已在各种户外场景中评估了我们的算法，并与使用其他全局导航算法的性能进行了比较。在实践中，我们对能够识别和规避障碍的轮式机器人进行了测试，结果显示我们的算法在轨迹选择方面拥有更强的适应能力和执行能力。",
    "tldr": "TGS算法通过结合CVAE模型和视觉语言模型的逻辑推理能力，在复杂无图环境中实现了更有效的轨迹生成和选择，帮助轮式机器人更好地避开障碍，适应复杂地面。",
    "en_tdlr": "Our TGS algorithm combines the trajectory generation capabilities of a CVAE model with the logical reasoning ability of visual language models to effectively select suitable trajectories for wheeled robots in challenging, map-less outdoor environments, enabling them to better navigate around obstacles and adapt to complex terrain."
}