{
    "title": "Weakly Contrastive Learning via Batch Instance Discrimination and Feature Clustering for Small Sample SAR ATR",
    "abstract": "arXiv:2408.03627v1 Announce Type: new  Abstract: In recent years, impressive performance of deep learning technology has been recognized in Synthetic Aperture Radar (SAR) Automatic Target Recognition (ATR). Since a large amount of annotated data is required in this technique, it poses a trenchant challenge to the issue of obtaining a high recognition rate through less labeled data. To overcome this problem, inspired by the contrastive learning, we proposed a novel framework named Batch Instance Discrimination and Feature Clustering (BIDFC). In this framework, different from that of the objective of general contrastive learning methods, embedding distance between samples should be moderate because of the high similarity between samples in the SAR images. Consequently, our flexible framework is equipped with adjustable distance between embedding, which we term as weakly contrastive learning. Technically, instance labels are assigned to the unlabeled data in per batch and random augmentat",
    "link": "https://arxiv.org/abs/2408.03627",
    "context": "Title: Weakly Contrastive Learning via Batch Instance Discrimination and Feature Clustering for Small Sample SAR ATR\nAbstract: arXiv:2408.03627v1 Announce Type: new  Abstract: In recent years, impressive performance of deep learning technology has been recognized in Synthetic Aperture Radar (SAR) Automatic Target Recognition (ATR). Since a large amount of annotated data is required in this technique, it poses a trenchant challenge to the issue of obtaining a high recognition rate through less labeled data. To overcome this problem, inspired by the contrastive learning, we proposed a novel framework named Batch Instance Discrimination and Feature Clustering (BIDFC). In this framework, different from that of the objective of general contrastive learning methods, embedding distance between samples should be moderate because of the high similarity between samples in the SAR images. Consequently, our flexible framework is equipped with adjustable distance between embedding, which we term as weakly contrastive learning. Technically, instance labels are assigned to the unlabeled data in per batch and random augmentat",
    "path": "papers/24/08/2408.03627.json",
    "total_tokens": 402,
    "tldr": "该文章提出了一种名为Batch Instance Discrimination and Feature Clustering（BIDFC）的框架，用于SAR自动目标识别。该框架对传统对比学习的目标进行了调整，旨在解决标注数据不足的问题。通过将数据划分为批次并赋予实例标签，文章提出了“弱对比学习”的概念，同时调整了嵌入距离，以应对SAR图像中样本的高相似性。此外，文中还提到了随机增强和特征聚类技术，以提高小样本学习下的识别效率。"
}