{
    "title": "IVISIT: An Interactive Visual Simulation Tool for system simulation, visualization, optimization, and parameter management",
    "abstract": "arXiv:2408.03341v1 Announce Type: cross  Abstract: IVISIT is a generic interactive visual simulation tool that is based on Python/Numpy and can be used for system simulation, parameter optimization, parameter management, and visualization of system dynamics as required, for example,for developing neural network simulations, machine learning applications, or computer vision systems. It provides classes for rapid prototyping of applications and visualization and manipulation of system properties using interactive GUI elements like sliders, images, textboxes, option lists, checkboxes and buttons based on Tkinter and Matplotlib. Parameters and simulation configurations can be stored and managed based on SQLite database functions. This technical report describes the main architecture and functions of IVISIT, and provides easy examples how to rapidly implement interactive applications and manage parameter settings.",
    "link": "https://arxiv.org/abs/2408.03341",
    "context": "Title: IVISIT: An Interactive Visual Simulation Tool for system simulation, visualization, optimization, and parameter management\nAbstract: arXiv:2408.03341v1 Announce Type: cross  Abstract: IVISIT is a generic interactive visual simulation tool that is based on Python/Numpy and can be used for system simulation, parameter optimization, parameter management, and visualization of system dynamics as required, for example,for developing neural network simulations, machine learning applications, or computer vision systems. It provides classes for rapid prototyping of applications and visualization and manipulation of system properties using interactive GUI elements like sliders, images, textboxes, option lists, checkboxes and buttons based on Tkinter and Matplotlib. Parameters and simulation configurations can be stored and managed based on SQLite database functions. This technical report describes the main architecture and functions of IVISIT, and provides easy examples how to rapidly implement interactive applications and manage parameter settings.",
    "path": "papers/24/08/2408.03341.json",
    "total_tokens": 362,
    "tldr": "该文章介绍了一种名为IVISIT的交互式可视化模拟工具，它基于Python/Numpy，用于系统模拟、参数优化、参数管理和系统动态可视化。IVISIT通过提供快速原型化工具、交互式GUI元素和SQLite数据库支持，极大地简化了系统属性可视化和管理的过程。这个工具为研究人员提供了一种便捷的方式来开发神经网络模拟、机器学习和计算机视觉系统，并通过实例展示如何快速实施交互式应用和参数设置管理。"
}