{
    "title": "The Harmonic Exponential Filter for Nonparametric Estimation on Motion Groups",
    "abstract": "arXiv:2408.00907v1 Announce Type: new  Abstract: Bayesian estimation is a vital tool in robotics as it allows systems to update the belief of the robot state using incomplete information from noisy sensors. To render the state estimation problem tractable, many systems assume that the motion and measurement noise, as well as the state distribution, are all unimodal and Gaussian. However, there are numerous scenarios and systems that do not comply with these assumptions. Existing non-parametric filters that are used to model multimodal distributions have drawbacks that limit their ability to represent a diverse set of distributions. In this paper, we introduce a novel approach to nonparametric Bayesian filtering to cope with multimodal distributions using harmonic exponential distributions. This approach leverages two key insights of harmonic exponential distributions: a) the product of two distributions can be expressed as the element-wise addition of their log-likelihood Fourier coeff",
    "link": "https://arxiv.org/abs/2408.00907",
    "context": "Title: The Harmonic Exponential Filter for Nonparametric Estimation on Motion Groups\nAbstract: arXiv:2408.00907v1 Announce Type: new  Abstract: Bayesian estimation is a vital tool in robotics as it allows systems to update the belief of the robot state using incomplete information from noisy sensors. To render the state estimation problem tractable, many systems assume that the motion and measurement noise, as well as the state distribution, are all unimodal and Gaussian. However, there are numerous scenarios and systems that do not comply with these assumptions. Existing non-parametric filters that are used to model multimodal distributions have drawbacks that limit their ability to represent a diverse set of distributions. In this paper, we introduce a novel approach to nonparametric Bayesian filtering to cope with multimodal distributions using harmonic exponential distributions. This approach leverages two key insights of harmonic exponential distributions: a) the product of two distributions can be expressed as the element-wise addition of their log-likelihood Fourier coeff",
    "path": "papers/24/08/2408.00907.json",
    "total_tokens": 780,
    "translated_title": "非参数估计在运动组上的调和指数滤波器",
    "translated_abstract": "arXiv:2408.00907v1 公告类型：新  翻译摘要: 贝叶斯估计是一个在机器人学中至关重要的工具，因为它是允许系统使用来自受噪声影响的传感器的不完全信息来更新机器人的状态信念。为了使状态估计问题变得可行，许多系统都假设运动和测量噪声，以及状态分布，都是单峰的，并且是高斯分布的。然而，有许多场景和系统不遵循这些假设。现有的非参数滤波器用于建模多模态分布，它们的缺点限制了它们代表多样化分布的能力。在本文中，我们介绍了一种新的非参数贝叶斯滤波方法，用于使用调和指数分布来处理多模态分布。这种方法利用了调和指数分布的两个关键见解：a) 两个分布的乘积可以表示为其对数似然傅里叶系数之间的元素级加法；以及b) 调和指数分布能够被分解成低维的调和算子和高维参数化的指数函数，后者提供了对函数空间中复杂分布的灵活描述。基于这些见解，我们提出了一种适用于多模态分布的新的滤波技术，该技术在理论上具有很好的收敛性，并且在实验上显示出优于现有方法的性能。我们的方法对于处理形状复杂的概率密度函数（如多峰分布）特别有用，并且可以用作现有机器学习技术如蒙特卡洛树搜索、强化学习和优化算法的补充，以便在各种应用中提高系统的鲁棒性和效率。",
    "tldr": "本文提出了一种新的非参数贝叶斯滤波方法，用于处理多模态分布，通过结合调和指数分布的特点，该方法能够有效地代表复杂分布，并在理论和实验上均表现出良好的性能，尤其是在处理多峰分布时。"
}