{
    "title": "Design and Implementation of Smart Infrastructures and Connected Vehicles in A Mini-city Platform",
    "abstract": "arXiv:2408.04195v1 Announce Type: new  Abstract: This paper presents a 1/10th scale mini-city platform used as a testing bed for evaluating autonomous and connected vehicles. Using the mini-city platform, we can evaluate different driving scenarios including human-driven and autonomous driving. We provide a unique, visual feature-rich environment for evaluating computer vision methods. The conducted experiments utilize onboard sensors mounted on a robotic platform we built, allowing them to navigate in a controlled real-world urban environment. The designed city is occupied by cars, stop signs, a variety of residential and business buildings, and complex intersections mimicking an urban area. Furthermore, We have designed an intelligent infrastructure at one of the intersections in the city which helps safer and more efficient navigation in the presence of multiple cars and pedestrians. We have used the mini-city platform for the analysis of three different applications: city mapping, ",
    "link": "https://arxiv.org/abs/2408.04195",
    "context": "Title: Design and Implementation of Smart Infrastructures and Connected Vehicles in A Mini-city Platform\nAbstract: arXiv:2408.04195v1 Announce Type: new  Abstract: This paper presents a 1/10th scale mini-city platform used as a testing bed for evaluating autonomous and connected vehicles. Using the mini-city platform, we can evaluate different driving scenarios including human-driven and autonomous driving. We provide a unique, visual feature-rich environment for evaluating computer vision methods. The conducted experiments utilize onboard sensors mounted on a robotic platform we built, allowing them to navigate in a controlled real-world urban environment. The designed city is occupied by cars, stop signs, a variety of residential and business buildings, and complex intersections mimicking an urban area. Furthermore, We have designed an intelligent infrastructure at one of the intersections in the city which helps safer and more efficient navigation in the presence of multiple cars and pedestrians. We have used the mini-city platform for the analysis of three different applications: city mapping, ",
    "path": "papers/24/08/2408.04195.json",
    "total_tokens": 367,
    "tldr": "该文章创新地设计并搭建了一个1/10th比例的Mini-city平台，用于模拟真实环境并测试自动驾驶和互联车辆的技术性能。通过在小尺度城市环境中进行实验，作者能够精确评估自动驾驶车辆的计算机视觉与传感器融合系统。文章还对智能交通系统在实际模拟城市中的应用进行了探索，特别是针对复杂交叉路口的设计，以提升车辆与行人的交通安全性。"
}