{
    "title": "Multiple Contexts and Frequencies Aggregation Network forDeepfake Detection",
    "abstract": "arXiv:2408.01668v1 Announce Type: new  Abstract: Deepfake detection faces increasing challenges since the fast growth of generative models in developing massive and diverse Deepfake technologies. Recent advances rely on introducing heuristic features from spatial or frequency domains rather than modeling general forgery features within backbones. To address this issue, we turn to the backbone design with two intuitive priors from spatial and frequency detectors, \\textit{i.e.,} learning robust spatial attributes and frequency distributions that are discriminative for real and fake samples. To this end, we propose an efficient network for face forgery detection named MkfaNet, which consists of two core modules. For spatial contexts, we design a Multi-Kernel Aggregator that adaptively selects organ features extracted by multiple convolutions for modeling subtle facial differences between real and fake faces. For the frequency components, we propose a Multi-Frequency Aggregator to process ",
    "link": "https://arxiv.org/abs/2408.01668",
    "context": "Title: Multiple Contexts and Frequencies Aggregation Network forDeepfake Detection\nAbstract: arXiv:2408.01668v1 Announce Type: new  Abstract: Deepfake detection faces increasing challenges since the fast growth of generative models in developing massive and diverse Deepfake technologies. Recent advances rely on introducing heuristic features from spatial or frequency domains rather than modeling general forgery features within backbones. To address this issue, we turn to the backbone design with two intuitive priors from spatial and frequency detectors, \\textit{i.e.,} learning robust spatial attributes and frequency distributions that are discriminative for real and fake samples. To this end, we propose an efficient network for face forgery detection named MkfaNet, which consists of two core modules. For spatial contexts, we design a Multi-Kernel Aggregator that adaptively selects organ features extracted by multiple convolutions for modeling subtle facial differences between real and fake faces. For the frequency components, we propose a Multi-Frequency Aggregator to process ",
    "path": "papers/24/08/2408.01668.json",
    "total_tokens": 680,
    "translated_title": "自适应多情境与频率聚合网络对于 deepfake 检测",
    "translated_abstract": "arXiv:2408.01668v1 公告类型：新摘要：随着生成模型的快速成长，深度造假检测面临越来越多的挑战，因为深度造假技术也在不断发展。最近的技术进步依赖于通过空间或频率域的手动特征而不是在主干网络中建模一般造假特征。为了解决这个问题，我们将注意力转向了空间和频率检测器的两个直观先验，即学习能够在主干网络中建模真实和假样本之间细微面部差异的稳健空间属性和频率分布。为此，我们提出了一个高效的面部造假检测网络 MkfaNet，它由两个核心模块组成。对于空间情境，我们设计了一个自适应多内核聚合器，它能够通过多种卷积提取的组织特征来适应性地选择建模真实和假人脸之间的细微面部差异。对于频率成分，我们提出了一种多频率聚合器，用于处理频率域的归一化和嵌入，从而提高了对深度造假样本的检测能力。总的来说，我们的模型通过联合多核纹理分析、多频率特征聚合以及端对端训练提升了深度假造检测的准确性和鲁棒性。",
    "tldr": "本文提出了一种名为 MkfaNet 的网络，通过自适应地聚合空间和频率域的特征，提升了深度假造检测的准确性和鲁棒性。"
}