{
    "title": "MS-Mapping: An Uncertainty-Aware Large-Scale Multi-Session LiDAR Mapping System",
    "abstract": "arXiv:2408.03723v1 Announce Type: new  Abstract: Large-scale multi-session LiDAR mapping is essential for a wide range of applications, including surveying, autonomous driving, crowdsourced mapping, and multi-agent navigation. However, existing approaches often struggle with data redundancy, robustness, and accuracy in complex environments. To address these challenges, we present MS-Mapping, an novel multi-session LiDAR mapping system that employs an incremental mapping scheme for robust and accurate map assembly in large-scale environments. Our approach introduces three key innovations: 1) A distribution-aware keyframe selection method that captures the subtle contributions of each point cloud frame to the map by analyzing the similarity of map distributions. This method effectively reduces data redundancy and pose graph size, while enhancing graph optimization speed; 2) An uncertainty model that automatically performs least-squares adjustments according to the covariance matrix durin",
    "link": "https://arxiv.org/abs/2408.03723",
    "context": "Title: MS-Mapping: An Uncertainty-Aware Large-Scale Multi-Session LiDAR Mapping System\nAbstract: arXiv:2408.03723v1 Announce Type: new  Abstract: Large-scale multi-session LiDAR mapping is essential for a wide range of applications, including surveying, autonomous driving, crowdsourced mapping, and multi-agent navigation. However, existing approaches often struggle with data redundancy, robustness, and accuracy in complex environments. To address these challenges, we present MS-Mapping, an novel multi-session LiDAR mapping system that employs an incremental mapping scheme for robust and accurate map assembly in large-scale environments. Our approach introduces three key innovations: 1) A distribution-aware keyframe selection method that captures the subtle contributions of each point cloud frame to the map by analyzing the similarity of map distributions. This method effectively reduces data redundancy and pose graph size, while enhancing graph optimization speed; 2) An uncertainty model that automatically performs least-squares adjustments according to the covariance matrix durin",
    "path": "papers/24/08/2408.03723.json",
    "total_tokens": 399,
    "tldr": "该文章创新性地提出MS-Mapping系统，用于解决大型多时段LiDAR地图构建问题，通过增量地图构建方案提高了复杂环境下的地图整合速度和准确性。此外，该系统还引入了关键帧选择方法，通过分析地图分布的相似性来筛选最有意义的帧，避免了数据冗余，优化了图优化速度。同时，文章介绍了一种基于协方差矩阵的自动最小二乘调整的 uncertainty模型，能够根据不确定性程度自动调整地图构建过程中的参数，提高了地图构建的鲁棒性和精确度。"
}