{
    "title": "Deep progressive reinforcement learning-based flexible resource scheduling framework for IRS and UAV-assisted MEC system",
    "abstract": "arXiv:2408.01248v1 Announce Type: cross  Abstract: The intelligent reflection surface (IRS) and unmanned aerial vehicle (UAV)-assisted mobile edge computing (MEC) system is widely used in temporary and emergency scenarios. Our goal is to minimize the energy consumption of the MEC system by jointly optimizing UAV locations, IRS phase shift, task offloading, and resource allocation with a variable number of UAVs. To this end, we propose a Flexible REsource Scheduling (FRES) framework by employing a novel deep progressive reinforcement learning which includes the following innovations: Firstly, a novel multi-task agent is presented to deal with the mixed integer nonlinear programming (MINLP) problem. The multi-task agent has two output heads designed for different tasks, in which a classified head is employed to make offloading decisions with integer variables while a fitting head is applied to solve resource allocation with continuous variables. Secondly, a progressive scheduler is intro",
    "link": "https://arxiv.org/abs/2408.01248",
    "context": "Title: Deep progressive reinforcement learning-based flexible resource scheduling framework for IRS and UAV-assisted MEC system\nAbstract: arXiv:2408.01248v1 Announce Type: cross  Abstract: The intelligent reflection surface (IRS) and unmanned aerial vehicle (UAV)-assisted mobile edge computing (MEC) system is widely used in temporary and emergency scenarios. Our goal is to minimize the energy consumption of the MEC system by jointly optimizing UAV locations, IRS phase shift, task offloading, and resource allocation with a variable number of UAVs. To this end, we propose a Flexible REsource Scheduling (FRES) framework by employing a novel deep progressive reinforcement learning which includes the following innovations: Firstly, a novel multi-task agent is presented to deal with the mixed integer nonlinear programming (MINLP) problem. The multi-task agent has two output heads designed for different tasks, in which a classified head is employed to make offloading decisions with integer variables while a fitting head is applied to solve resource allocation with continuous variables. Secondly, a progressive scheduler is intro",
    "path": "papers/24/08/2408.01248.json",
    "total_tokens": 736,
    "translated_title": "基于深度渐进强化学习的可变资源调度框架，用于IRS和UAV辅助的MEC系统",
    "translated_abstract": "arXiv:2408.01248v1 公告类型: 交叉 摘要：智能反射表面（IRS）和无人驾驶航空器（UAV）辅助的移动边缘计算（MEC）系统在临时和紧急场景中得到了广泛应用。我们的目标是通过共同优化UAV位置、IRS相位偏移、任务卸载和资源的分配来最小化MEC系统中的能耗。为此，我们提出了一个名为Flexible REsource Scheduling (FRES)的框架，通过采用一种新颖的深度渐进强化学习技术。该技术包括以下创新点：首先，我们提出了一个新型的多任务代理以解决混合整数非线性规划（MINLP）问题。多任务代理有两个输出头，分别用于不同的任务，其中一类头被用于带有整数变量的卸载决策，而另一类头则被用于带有连续变量的资源分配。其次，我们引入了一个渐进的时间调度器以优化任务学习过程。最终，通过逐步挖掘深度强化学习与风电耦合作用的内在逻辑，我们开发了一个新型的基于风电的MEC系统优化调度方法。",
    "tldr": "研究提出了一种基于深度渐进强化学习的可变资源调度框架，用于优化IRS和UAV辅助的MEC系统中的能耗，通过使用多任务代理和渐进时间调度器解决了混合整数非线性规划问题。"
}