{
    "title": "Fusing Forces: Deep-Human-Guided Refinement of Segmentation Masks",
    "abstract": "arXiv:2408.03304v1 Announce Type: new  Abstract: Etruscan mirrors constitute a significant category in Etruscan art, characterized by elaborate figurative illustrations featured on their backside. A laborious and costly aspect of their analysis and documentation is the task of manually tracing these illustrations. In previous work, a methodology has been proposed to automate this process, involving photometric-stereo scanning in combination with deep neural networks. While achieving quantitative performance akin to an expert annotator, some results still lack qualitative precision and, thus, require annotators for inspection and potential correction, maintaining resource intensity. In response, we propose a deep neural network trained to interactively refine existing annotations based on human guidance. Our human-in-the-loop approach streamlines annotation, achieving equal quality with up to 75% less manual input required. Moreover, during the refinement process, the relative improveme",
    "link": "https://arxiv.org/abs/2408.03304",
    "context": "Title: Fusing Forces: Deep-Human-Guided Refinement of Segmentation Masks\nAbstract: arXiv:2408.03304v1 Announce Type: new  Abstract: Etruscan mirrors constitute a significant category in Etruscan art, characterized by elaborate figurative illustrations featured on their backside. A laborious and costly aspect of their analysis and documentation is the task of manually tracing these illustrations. In previous work, a methodology has been proposed to automate this process, involving photometric-stereo scanning in combination with deep neural networks. While achieving quantitative performance akin to an expert annotator, some results still lack qualitative precision and, thus, require annotators for inspection and potential correction, maintaining resource intensity. In response, we propose a deep neural network trained to interactively refine existing annotations based on human guidance. Our human-in-the-loop approach streamlines annotation, achieving equal quality with up to 75% less manual input required. Moreover, during the refinement process, the relative improveme",
    "path": "papers/24/08/2408.03304.json",
    "total_tokens": 325,
    "tldr": "该文章提出了一种深度神经网络，该网络能够利用人类指导来改善现有的图像分割掩码。这种方法显著减少了手动输入的需求，使得手动标注的流程更加高效，同时保持了高质量的标注结果。"
}