{
    "title": "A Multi-Source Heterogeneous Knowledge Injected Prompt Learning Method for Legal Charge Prediction",
    "abstract": "arXiv:2408.02233v1 Announce Type: cross  Abstract: Legal charge prediction, an essential task in legal AI, seeks to assign accurate charge labels to case descriptions, attracting significant recent interest. Existing methods primarily employ diverse neural network structures for modeling case descriptions directly, failing to effectively leverage multi-source external knowledge. We propose a prompt learning framework-based method that simultaneously leverages multi-source heterogeneous external knowledge from a legal knowledge base, a conversational LLM, and related legal articles. Specifically, we match knowledge snippets in case descriptions via the legal knowledge base and encapsulate them into the input through a hard prompt template. Additionally, we retrieve legal articles related to a given case description through contrastive learning, and then obtain factual elements within the case description through a conversational LLM. We fuse the embedding vectors of soft prompt tokens w",
    "link": "https://arxiv.org/abs/2408.02233",
    "context": "Title: A Multi-Source Heterogeneous Knowledge Injected Prompt Learning Method for Legal Charge Prediction\nAbstract: arXiv:2408.02233v1 Announce Type: cross  Abstract: Legal charge prediction, an essential task in legal AI, seeks to assign accurate charge labels to case descriptions, attracting significant recent interest. Existing methods primarily employ diverse neural network structures for modeling case descriptions directly, failing to effectively leverage multi-source external knowledge. We propose a prompt learning framework-based method that simultaneously leverages multi-source heterogeneous external knowledge from a legal knowledge base, a conversational LLM, and related legal articles. Specifically, we match knowledge snippets in case descriptions via the legal knowledge base and encapsulate them into the input through a hard prompt template. Additionally, we retrieve legal articles related to a given case description through contrastive learning, and then obtain factual elements within the case description through a conversational LLM. We fuse the embedding vectors of soft prompt tokens w",
    "path": "papers/24/08/2408.02233.json",
    "total_tokens": 603,
    "translated_title": "多源异构知识注入的提示学习方法用于法律指控预测",
    "translated_abstract": "法律指控预测是法律人工智能中的一个重要任务，它旨在为案件描述准确地分配指控标签，吸引了大量的 recent 兴趣。现有的方法主要使用各种神经网络结构直接建模案件描述，未能有效地利用多源外部知识。我们提出了一种基于提示学习框架的方法，该方法同时利用了法律知识库、对话式LLM和相关法律文章的多源异构外部知识。具体来说，我们通过法律知识库与案件描述中的知识片段进行匹配，并通过硬提示模板将它们封装到输入中。此外，我们通过对比学习检索与给定案件描述相关联的法律文章，并通过对话式LLM获得案件描述中的事实元素。我们通过软提示词汇的嵌入向量融合来完成这项工作。",
    "tldr": "本论文提出了一个结合多源异构外源知识的方法，用于法律指控的预测，特别是通过法律知识库、对话式LLM和与之相关的法律文献，增强了预测模型。"
}