{
    "title": "Clustering and Mining Accented Speech for Inclusive and Fair Speech Recognition",
    "abstract": "arXiv:2408.02582v1 Announce Type: cross  Abstract: Modern automatic speech recognition (ASR) systems are typically trained on more than tens of thousands hours of speech data, which is one of the main factors for their great success. However, the distribution of such data is typically biased towards common accents or typical speech patterns. As a result, those systems often poorly perform on atypical accented speech. In this paper, we present accent clustering and mining schemes for fair speech recognition systems which can perform equally well on under-represented accented speech. For accent recognition, we applied three schemes to overcome limited size of supervised accent data: supervised or unsupervised pre-training, distributionally robust optimization (DRO) and unsupervised clustering. Three schemes can significantly improve the accent recognition model especially for unbalanced and small accented speech. Fine-tuning ASR on the mined Indian accent speech using the proposed superv",
    "link": "https://arxiv.org/abs/2408.02582",
    "context": "Title: Clustering and Mining Accented Speech for Inclusive and Fair Speech Recognition\nAbstract: arXiv:2408.02582v1 Announce Type: cross  Abstract: Modern automatic speech recognition (ASR) systems are typically trained on more than tens of thousands hours of speech data, which is one of the main factors for their great success. However, the distribution of such data is typically biased towards common accents or typical speech patterns. As a result, those systems often poorly perform on atypical accented speech. In this paper, we present accent clustering and mining schemes for fair speech recognition systems which can perform equally well on under-represented accented speech. For accent recognition, we applied three schemes to overcome limited size of supervised accent data: supervised or unsupervised pre-training, distributionally robust optimization (DRO) and unsupervised clustering. Three schemes can significantly improve the accent recognition model especially for unbalanced and small accented speech. Fine-tuning ASR on the mined Indian accent speech using the proposed superv",
    "path": "papers/24/08/2408.02582.json",
    "total_tokens": 364,
    "tldr": "该文章提出了通过聚类和挖掘语音数据的方法，用于创建包容性和公平的语音识别系统。对于不同的语音口音，该研究采用了三种不同的方法来改进语音口音识别模型，包括监督或无监督的预训练、分布性健壮优化以及无监督的聚类技术。通过这种方式，即使面对数据分布不平衡和小规模数据集的情况，也能显著提升语音识别系统的性能。"
}