{
    "title": "Guardians of Image Quality: Benchmarking Defenses Against Adversarial Attacks on Image Quality Metrics",
    "abstract": "arXiv:2408.01541v1 Announce Type: new  Abstract: In the field of Image Quality Assessment (IQA), the adversarial robustness of the metrics poses a critical concern. This paper presents a comprehensive benchmarking study of various defense mechanisms in response to the rise in adversarial attacks on IQA. We systematically evaluate 25 defense strategies, including adversarial purification, adversarial training, and certified robustness methods. We applied 14 adversarial attack algorithms of various types in both non-adaptive and adaptive settings and tested these defenses against them. We analyze the differences between defenses and their applicability to IQA tasks, considering that they should preserve IQA scores and image quality. The proposed benchmark aims to guide future developments and accepts submissions of new methods, with the latest results available online: https://videoprocessing.ai/benchmarks/iqa-defenses.html.",
    "link": "https://arxiv.org/abs/2408.01541",
    "context": "Title: Guardians of Image Quality: Benchmarking Defenses Against Adversarial Attacks on Image Quality Metrics\nAbstract: arXiv:2408.01541v1 Announce Type: new  Abstract: In the field of Image Quality Assessment (IQA), the adversarial robustness of the metrics poses a critical concern. This paper presents a comprehensive benchmarking study of various defense mechanisms in response to the rise in adversarial attacks on IQA. We systematically evaluate 25 defense strategies, including adversarial purification, adversarial training, and certified robustness methods. We applied 14 adversarial attack algorithms of various types in both non-adaptive and adaptive settings and tested these defenses against them. We analyze the differences between defenses and their applicability to IQA tasks, considering that they should preserve IQA scores and image quality. The proposed benchmark aims to guide future developments and accepts submissions of new methods, with the latest results available online: https://videoprocessing.ai/benchmarks/iqa-defenses.html.",
    "path": "papers/24/08/2408.01541.json",
    "total_tokens": 629,
    "translated_title": "守卫图像质量：对图像质量度量防御措施的对抗攻击基准测试",
    "translated_abstract": "在图像质量评估(IQA)领域，指标的对抗鲁棒性是一个关键问题。本文对对抗攻击下的IQA防御策略进行了全面的基准测试。我们系统地评估了25种防御策略，包括对抗纯净度、对抗训练和认证 robustness 方法。在非适应性和适应性设置中，我们应用了14种不同类型的对抗攻击算法，并对这些防御措施进行了测试。我们分析了防御措施之间的差异以及它们在IQA任务中的适用性，考虑到它们应该保持图像质量得分和图像质量。提出的基准测试旨在指导未来的发展，接受新方法的提交，最新的结果可通过在线:https://videoprocessing.ai/benchmarks/iqa-defenses.html获取。",
    "tldr": "本研究全面评估了25种防御策略，对其在对抗攻击下的表现进行了测试，并分析了对单个防御措施的差异。",
    "en_tdlr": "This study comprehensively evaluated 25 defense strategies against adversarial attacks on Image Quality Metrics (IQA) by systematically testing them with 14 adversarial attack algorithms in both non-adaptive and adaptive settings. Different strengths and weaknesses among the defenses were analyzed, offering guidance for future developments in the field."
}