{
    "title": "SuperSimpleNet: Unifying Unsupervised and Supervised Learning for Fast and Reliable Surface Defect Detection",
    "abstract": "arXiv:2408.03143v1 Announce Type: new  Abstract: The aim of surface defect detection is to identify and localise abnormal regions on the surfaces of captured objects, a task that's increasingly demanded across various industries. Current approaches frequently fail to fulfil the extensive demands of these industries, which encompass high performance, consistency, and fast operation, along with the capacity to leverage the entirety of the available training data. Addressing these gaps, we introduce SuperSimpleNet, an innovative discriminative model that evolved from SimpleNet. This advanced model significantly enhances its predecessor's training consistency, inference time, as well as detection performance. SuperSimpleNet operates in an unsupervised manner using only normal training images but also benefits from labelled abnormal training images when they are available. SuperSimpleNet achieves state-of-the-art results in both the supervised and the unsupervised settings, as demonstrated ",
    "link": "https://arxiv.org/abs/2408.03143",
    "context": "Title: SuperSimpleNet: Unifying Unsupervised and Supervised Learning for Fast and Reliable Surface Defect Detection\nAbstract: arXiv:2408.03143v1 Announce Type: new  Abstract: The aim of surface defect detection is to identify and localise abnormal regions on the surfaces of captured objects, a task that's increasingly demanded across various industries. Current approaches frequently fail to fulfil the extensive demands of these industries, which encompass high performance, consistency, and fast operation, along with the capacity to leverage the entirety of the available training data. Addressing these gaps, we introduce SuperSimpleNet, an innovative discriminative model that evolved from SimpleNet. This advanced model significantly enhances its predecessor's training consistency, inference time, as well as detection performance. SuperSimpleNet operates in an unsupervised manner using only normal training images but also benefits from labelled abnormal training images when they are available. SuperSimpleNet achieves state-of-the-art results in both the supervised and the unsupervised settings, as demonstrated ",
    "path": "papers/24/08/2408.03143.json",
    "total_tokens": 364,
    "tldr": "该文章介绍了一种名为SuperSimpleNet的创新模型，该模型根据SimpleNet模型演变而来，主要用于快速且可靠地识别物体表面的缺陷。SuperSimpleNet能够在仅使用正常训练图像的条件下进行自监督学习，并在有异常标签图像的情况下进一步提升性能。该模型在监督和无监督两种环境下均取得了领先的结果，展示了其在工业应用中具备的高性能、快速操作以及数据使用效率。"
}