{
    "title": "BPMP-Tracker: A Versatile Aerial Target Tracker Using Bernstein Polynomial Motion Primitives",
    "abstract": "arXiv:2408.04266v1 Announce Type: new  Abstract: This letter presents a versatile trajectory planning pipeline for aerial tracking. The proposed tracker is capable of handling various chasing settings such as complex unstructured environments, crowded dynamic obstacles and multiple-target following. Among the entire pipeline, we focus on developing a predictor for future target motion and a chasing trajectory planner. For rapid computation, we employ the sample-check-select strategy: modules sample a set of candidate movements, check multiple constraints, and then select the best trajectory. Also, we leverage the properties of Bernstein polynomials for quick calculations. The prediction module predicts the trajectories of the targets, which do not overlap with static and dynamic obstacles. Then the trajectory planner outputs a trajectory, ensuring various conditions such as occlusion and collision avoidance, the visibility of all targets within a camera image and dynamical limits. We f",
    "link": "https://arxiv.org/abs/2408.04266",
    "context": "Title: BPMP-Tracker: A Versatile Aerial Target Tracker Using Bernstein Polynomial Motion Primitives\nAbstract: arXiv:2408.04266v1 Announce Type: new  Abstract: This letter presents a versatile trajectory planning pipeline for aerial tracking. The proposed tracker is capable of handling various chasing settings such as complex unstructured environments, crowded dynamic obstacles and multiple-target following. Among the entire pipeline, we focus on developing a predictor for future target motion and a chasing trajectory planner. For rapid computation, we employ the sample-check-select strategy: modules sample a set of candidate movements, check multiple constraints, and then select the best trajectory. Also, we leverage the properties of Bernstein polynomials for quick calculations. The prediction module predicts the trajectories of the targets, which do not overlap with static and dynamic obstacles. Then the trajectory planner outputs a trajectory, ensuring various conditions such as occlusion and collision avoidance, the visibility of all targets within a camera image and dynamical limits. We f",
    "path": "papers/24/08/2408.04266.json",
    "total_tokens": 367,
    "tldr": "该文章提出了一种使用伯恩斯坦多项式运动原始的新型多用途空中目标探测器，能够处理多种追逐场景，使用样本-检查-选择策略进行快速计算，并结合伯恩斯坦多项式的特性，高效处理预测模块和追逐轨迹规划，保证了运动目标的预测轨迹与静态和动态障碍物不重叠，并确保了轨迹规划满足避免遮挡、碰撞、确保目标图像可见性和遵守动力学限制等多重条件。"
}