{
    "title": "Parkinson's Disease Detection from Resting State EEG using Multi-Head Graph Structure Learning with Gradient Weighted Graph Attention Explanations",
    "abstract": "arXiv:2408.00906v1 Announce Type: cross  Abstract: Parkinson's disease (PD) is a debilitating neurodegenerative disease that has severe impacts on an individual's quality of life. Compared with structural and functional MRI-based biomarkers for the disease, electroencephalography (EEG) can provide more accessible alternatives for clinical insights. While deep learning (DL) techniques have provided excellent outcomes, many techniques fail to model spatial information and dynamic brain connectivity, and face challenges in robust feature learning, limited data sizes, and poor explainability. To address these issues, we proposed a novel graph neural network (GNN) technique for explainable PD detection using resting state EEG. Specifically, we employ structured global convolutions with contrastive learning to better model complex features with limited data, a novel multi-head graph structure learner to capture the non-Euclidean structure of EEG data, and a head-wise gradient-weighted graph ",
    "link": "https://arxiv.org/abs/2408.00906",
    "context": "Title: Parkinson's Disease Detection from Resting State EEG using Multi-Head Graph Structure Learning with Gradient Weighted Graph Attention Explanations\nAbstract: arXiv:2408.00906v1 Announce Type: cross  Abstract: Parkinson's disease (PD) is a debilitating neurodegenerative disease that has severe impacts on an individual's quality of life. Compared with structural and functional MRI-based biomarkers for the disease, electroencephalography (EEG) can provide more accessible alternatives for clinical insights. While deep learning (DL) techniques have provided excellent outcomes, many techniques fail to model spatial information and dynamic brain connectivity, and face challenges in robust feature learning, limited data sizes, and poor explainability. To address these issues, we proposed a novel graph neural network (GNN) technique for explainable PD detection using resting state EEG. Specifically, we employ structured global convolutions with contrastive learning to better model complex features with limited data, a novel multi-head graph structure learner to capture the non-Euclidean structure of EEG data, and a head-wise gradient-weighted graph ",
    "path": "papers/24/08/2408.00906.json",
    "total_tokens": 726,
    "translated_title": "使用多头图结构学习与梯度加权图注意力解释的静息状态EEG多头图结构学习帕金森病检测",
    "translated_abstract": "arXiv:2408.00906v1 宣布类型: 交叉",
    "tldr": "本文提出了一种基于静息状态EEG的新方法，使用多层感知机和梯度加权图注意力解释来检测帕金森病，旨在提高模型的可解释性和对复杂大脑连接的建模能力。"
}