{
    "title": "Few-shot Scooping Under Domain Shift via Simulated Maximal Deployment Gaps",
    "abstract": "arXiv:2408.02949v1 Announce Type: new  Abstract: Autonomous lander missions on extraterrestrial bodies need to sample granular materials while coping with domain shifts, even when sampling strategies are extensively tuned on Earth. To tackle this challenge, this paper studies the few-shot scooping problem and proposes a vision-based adaptive scooping strategy that uses the deep kernel Gaussian process method trained with a novel meta-training strategy to learn online from very limited experience on out-of-distribution target terrains. Our Deep Kernel Calibration with Maximal Deployment Gaps (kCMD) strategy explicitly trains a deep kernel model to adapt to large domain shifts by creating simulated maximal deployment gaps from an offline training dataset and training models to overcome these deployment gaps during training. Employed in a Bayesian Optimization sequential decision-making framework, the proposed method allows the robot to perform high-quality scooping actions on out-of-dist",
    "link": "https://arxiv.org/abs/2408.02949",
    "context": "Title: Few-shot Scooping Under Domain Shift via Simulated Maximal Deployment Gaps\nAbstract: arXiv:2408.02949v1 Announce Type: new  Abstract: Autonomous lander missions on extraterrestrial bodies need to sample granular materials while coping with domain shifts, even when sampling strategies are extensively tuned on Earth. To tackle this challenge, this paper studies the few-shot scooping problem and proposes a vision-based adaptive scooping strategy that uses the deep kernel Gaussian process method trained with a novel meta-training strategy to learn online from very limited experience on out-of-distribution target terrains. Our Deep Kernel Calibration with Maximal Deployment Gaps (kCMD) strategy explicitly trains a deep kernel model to adapt to large domain shifts by creating simulated maximal deployment gaps from an offline training dataset and training models to overcome these deployment gaps during training. Employed in a Bayesian Optimization sequential decision-making framework, the proposed method allows the robot to perform high-quality scooping actions on out-of-dist",
    "path": "papers/24/08/2408.02949.json",
    "total_tokens": 371,
    "tldr": "该文章提出了一种使用深度核感知方法训练的新型元学习策略，用于在极端域偏移下的自主机械臂少样本采矿任务。该方法通过模拟最大部署间隙并在训练过程中专门训练模型以克服这些间隙，从而能够适应巨大的域偏移。在贝叶斯优化序贯决策框架中使用该方法，不仅提高了采矿任务的效率，还有效地提升了样本采掘的质量。"
}