{
    "title": "IncidentNet: Traffic Incident Detection, Localization and Severity Estimation with Sparse Sensing",
    "abstract": "arXiv:2408.00996v1 Announce Type: cross  Abstract: Prior art in traffic incident detection relies on high sensor coverage and is primarily based on decision-tree and random forest models that have limited representation capacity and, as a result, cannot detect incidents with high accuracy. This paper presents IncidentNet - a novel approach for classifying, localizing, and estimating the severity of traffic incidents using deep learning models trained on data captured from sparsely placed sensors in urban environments. Our model works on microscopic traffic data that can be collected using cameras installed at traffic intersections. Due to the unavailability of datasets that provide microscopic traffic details and traffic incident details simultaneously, we also present a methodology to generate a synthetic microscopic traffic dataset that matches given macroscopic traffic data. IncidentNet achieves a traffic incident detection rate of 98%, with false alarm rates of less than 7% in 197 ",
    "link": "https://arxiv.org/abs/2408.00996",
    "context": "Title: IncidentNet: Traffic Incident Detection, Localization and Severity Estimation with Sparse Sensing\nAbstract: arXiv:2408.00996v1 Announce Type: cross  Abstract: Prior art in traffic incident detection relies on high sensor coverage and is primarily based on decision-tree and random forest models that have limited representation capacity and, as a result, cannot detect incidents with high accuracy. This paper presents IncidentNet - a novel approach for classifying, localizing, and estimating the severity of traffic incidents using deep learning models trained on data captured from sparsely placed sensors in urban environments. Our model works on microscopic traffic data that can be collected using cameras installed at traffic intersections. Due to the unavailability of datasets that provide microscopic traffic details and traffic incident details simultaneously, we also present a methodology to generate a synthetic microscopic traffic dataset that matches given macroscopic traffic data. IncidentNet achieves a traffic incident detection rate of 98%, with false alarm rates of less than 7% in 197 ",
    "path": "papers/24/08/2408.00996.json",
    "total_tokens": 633,
    "translated_title": "《IncidentNet: 稀疏传感下的交通事件检测、定位和严重性估计》",
    "translated_abstract": "迄今为止，关于交通事件检测的研究主要依赖于大量的传感器覆盖，并且主要基于决策树和随机森林模型，这些模型在代表能力上有限，因此无法准确检测事件。本文介绍了IncidentNet——一种使用在城市环境中稀疏放置的传感器捕获的数据进行训练的深度学习模型，以分类、定位和估计交通事件的严重性。我们的模型建立在微观交通数据之上，该数据可以通过安装在交通交叉路口的摄像头收集。由于缺乏同时提供微观交通细节和交通事件细节的合成交通数据集，我们还在本文中提出了一个方法，该方法可以根据给定的宏观交通数据生成一个合成微观交通数据集。在使用IncidentNet技术时，检测出的事故率达到了98%，误报率低于7%，并且在197个测试案例中的准确率达到95%以上。",
    "tldr": "IncidentNet是一种通过训练稀疏放置在城市的传感器收集数据的深度学习模型，用于检测、定位和评估交通事件的严重性。"
}