{
    "title": "Non-maximizing policies that fulfill multi-criterion aspirations in expectation",
    "abstract": "arXiv:2408.04385v1 Announce Type: new  Abstract: In dynamic programming and reinforcement learning, the policy for the sequential decision making of an agent in a stochastic environment is usually determined by expressing the goal as a scalar reward function and seeking a policy that maximizes the expected total reward. However, many goals that humans care about naturally concern multiple aspects of the world, and it may not be obvious how to condense those into a single reward function. Furthermore, maximization suffers from specification gaming, where the obtained policy achieves a high expected total reward in an unintended way, often taking extreme or nonsensical actions.   Here we consider finite acyclic Markov Decision Processes with multiple distinct evaluation metrics, which do not necessarily represent quantities that the user wants to be maximized. We assume the task of the agent is to ensure that the vector of expected totals of the evaluation metrics falls into some given c",
    "link": "https://arxiv.org/abs/2408.04385",
    "context": "Title: Non-maximizing policies that fulfill multi-criterion aspirations in expectation\nAbstract: arXiv:2408.04385v1 Announce Type: new  Abstract: In dynamic programming and reinforcement learning, the policy for the sequential decision making of an agent in a stochastic environment is usually determined by expressing the goal as a scalar reward function and seeking a policy that maximizes the expected total reward. However, many goals that humans care about naturally concern multiple aspects of the world, and it may not be obvious how to condense those into a single reward function. Furthermore, maximization suffers from specification gaming, where the obtained policy achieves a high expected total reward in an unintended way, often taking extreme or nonsensical actions.   Here we consider finite acyclic Markov Decision Processes with multiple distinct evaluation metrics, which do not necessarily represent quantities that the user wants to be maximized. We assume the task of the agent is to ensure that the vector of expected totals of the evaluation metrics falls into some given c",
    "path": "papers/24/08/2408.04385.json",
    "total_tokens": 320,
    "tldr": "该文章提出了一种在期望中满足多准则期望的非最大化策略，即使在多个不同评估指标的情况下，这些指标不一定代表用户想最大化的事物，该策略也能够确保预期总和在给定的范围内。"
}