{
    "title": "MultiColor: Image Colorization by Learning from Multiple Color Spaces",
    "abstract": "arXiv:2408.04172v1 Announce Type: new  Abstract: Deep networks have shown impressive performance in the image restoration tasks, such as image colorization. However, we find that previous approaches rely on the digital representation from single color model with a specific mapping function, a.k.a., color space, during the colorization pipeline. In this paper, we first investigate the modeling of different color spaces, and find each of them exhibiting distinctive characteristics with unique distribution of colors. The complementarity among multiple color spaces leads to benefits for the image colorization task.   We present MultiColor, a new learning-based approach to automatically colorize grayscale images that combines clues from multiple color spaces. Specifically, we employ a set of dedicated colorization modules for individual color space. Within each module, a transformer decoder is first employed to refine color query embeddings and then a color mapper produces color channel pre",
    "link": "https://arxiv.org/abs/2408.04172",
    "context": "Title: MultiColor: Image Colorization by Learning from Multiple Color Spaces\nAbstract: arXiv:2408.04172v1 Announce Type: new  Abstract: Deep networks have shown impressive performance in the image restoration tasks, such as image colorization. However, we find that previous approaches rely on the digital representation from single color model with a specific mapping function, a.k.a., color space, during the colorization pipeline. In this paper, we first investigate the modeling of different color spaces, and find each of them exhibiting distinctive characteristics with unique distribution of colors. The complementarity among multiple color spaces leads to benefits for the image colorization task.   We present MultiColor, a new learning-based approach to automatically colorize grayscale images that combines clues from multiple color spaces. Specifically, we employ a set of dedicated colorization modules for individual color space. Within each module, a transformer decoder is first employed to refine color query embeddings and then a color mapper produces color channel pre",
    "path": "papers/24/08/2408.04172.json",
    "total_tokens": 364,
    "tldr": "该文章提出了MultiColor方法，这是一种新的学习型方法，旨在使用单个颜色模型对单色图像进行自动着色。通过结合多维颜色空间的信息，它利用了不同颜色空间互补的特点，为图像着色任务带来了益处。该方法包括多个专用的颜色空间着色组件，每个组件都由一个采用变换器解码器的模块组成，用于改进颜色查询嵌入并产生颜色图。"
}