{
    "title": "Mastering Agile Jumping Skills from Simple Practices with Iterative Learning Control",
    "abstract": "arXiv:2408.02619v1 Announce Type: new  Abstract: Achieving precise target jumping with legged robots poses a significant challenge due to the long flight phase and the uncertainties inherent in contact dynamics and hardware. Forcefully attempting these agile motions on hardware could result in severe failures and potential damage. Motivated by these challenging problems, we propose an Iterative Learning Control (ILC) approach that aims to learn and refine jumping skills from easy to difficult, instead of directly learning these challenging tasks. We verify that learning from simplicity can enhance safety and target jumping accuracy over trials. Compared to other ILC approaches for legged locomotion, our method can tackle the problem of a long flight phase where control input is not available. In addition, our approach allows the robot to apply what it learns from a simple jumping task to accomplish more challenging tasks within a few trials directly in hardware, instead of learning fro",
    "link": "https://arxiv.org/abs/2408.02619",
    "context": "Title: Mastering Agile Jumping Skills from Simple Practices with Iterative Learning Control\nAbstract: arXiv:2408.02619v1 Announce Type: new  Abstract: Achieving precise target jumping with legged robots poses a significant challenge due to the long flight phase and the uncertainties inherent in contact dynamics and hardware. Forcefully attempting these agile motions on hardware could result in severe failures and potential damage. Motivated by these challenging problems, we propose an Iterative Learning Control (ILC) approach that aims to learn and refine jumping skills from easy to difficult, instead of directly learning these challenging tasks. We verify that learning from simplicity can enhance safety and target jumping accuracy over trials. Compared to other ILC approaches for legged locomotion, our method can tackle the problem of a long flight phase where control input is not available. In addition, our approach allows the robot to apply what it learns from a simple jumping task to accomplish more challenging tasks within a few trials directly in hardware, instead of learning fro",
    "path": "papers/24/08/2408.02619.json",
    "total_tokens": 348,
    "tldr": "该文章提出了一种迭代学习控制方法，通过从简单任务开始逐步学习，而不是直接进行复杂跳跃，解决了腿部机器人精确跳跃的难题。这种方法提高了跳跃的安全性和准确性，并且能够处理长期飞行阶段中输入控制不可用的挑战，同时在硬件上仅需几轮试验就能将简单任务中学到的技能应用到更复杂的任务中。"
}