{
    "title": "Synchronous Multi-modal Semantic CommunicationSystem with Packet-level Coding",
    "abstract": "arXiv:2408.04535v1 Announce Type: cross  Abstract: Although the semantic communication with joint semantic-channel coding design has shown promising performance in transmitting data of different modalities over physical layer channels, the synchronization and packet-level forward error correction of multimodal semantics have not been well studied. Due to the independent design of semantic encoders, synchronizing multimodal features in both the semantic and time domains is a challenging problem. In this paper, we take the facial video and speech transmission as an example and propose a Synchronous Multimodal Semantic Communication System (SyncSC) with Packet-Level Coding. To achieve semantic and time synchronization, 3D Morphable Mode (3DMM) coefficients and text are transmitted as semantics, and we propose a semantic codec that achieves similar quality of reconstruction and synchronization with lower bandwidth, compared to traditional methods. To protect semantic packets under the eras",
    "link": "https://arxiv.org/abs/2408.04535",
    "context": "Title: Synchronous Multi-modal Semantic CommunicationSystem with Packet-level Coding\nAbstract: arXiv:2408.04535v1 Announce Type: cross  Abstract: Although the semantic communication with joint semantic-channel coding design has shown promising performance in transmitting data of different modalities over physical layer channels, the synchronization and packet-level forward error correction of multimodal semantics have not been well studied. Due to the independent design of semantic encoders, synchronizing multimodal features in both the semantic and time domains is a challenging problem. In this paper, we take the facial video and speech transmission as an example and propose a Synchronous Multimodal Semantic Communication System (SyncSC) with Packet-Level Coding. To achieve semantic and time synchronization, 3D Morphable Mode (3DMM) coefficients and text are transmitted as semantics, and we propose a semantic codec that achieves similar quality of reconstruction and synchronization with lower bandwidth, compared to traditional methods. To protect semantic packets under the eras",
    "path": "papers/24/08/2408.04535.json",
    "total_tokens": 423,
    "tldr": "该文章提出了一种具有包级编码的同步多模态语义通信系统，该系统能够在物理层通道上传输不同模态的数据，并通过联合语义信道编码设计显示出良好的性能。文章特别关注了多模态语义的同步和包级前向错误纠正，并通过以面部视频和语音传输为例，展示了如何通过3D可变形模型（3DMM）系数和文本的传输实现语义和时间的同步，同时提出了一种语义编解码器，该编解码器在降低带宽的同时提供了与传统方法相当的质量重建和同步效果。文章还介绍了如何在这种系统中保护语义包，使其在面对误差的情况下也能保持数据的完整性。"
}