{
    "title": "A Surprisingly Efficient Representation for Multi-Finger Grasping",
    "abstract": "arXiv:2408.02455v1 Announce Type: new  Abstract: The problem of grasping objects using a multi-finger hand has received significant attention in recent years. However, it remains challenging to handle a large number of unfamiliar objects in real and cluttered environments. In this work, we propose a representation that can be effectively mapped to the multi-finger grasp space. Based on this representation, we develop a simple decision model that generates accurate grasp quality scores for different multi-finger grasp poses using only hundreds to thousands of training samples. We demonstrate that our representation performs well on a real robot and achieves a success rate of 78.64% after training with only 500 real-world grasp attempts and 87% with 4500 grasp attempts. Additionally, we achieve a success rate of 84.51% in a dynamic human-robot handover scenario using a multi-finger hand.",
    "link": "https://arxiv.org/abs/2408.02455",
    "context": "Title: A Surprisingly Efficient Representation for Multi-Finger Grasping\nAbstract: arXiv:2408.02455v1 Announce Type: new  Abstract: The problem of grasping objects using a multi-finger hand has received significant attention in recent years. However, it remains challenging to handle a large number of unfamiliar objects in real and cluttered environments. In this work, we propose a representation that can be effectively mapped to the multi-finger grasp space. Based on this representation, we develop a simple decision model that generates accurate grasp quality scores for different multi-finger grasp poses using only hundreds to thousands of training samples. We demonstrate that our representation performs well on a real robot and achieves a success rate of 78.64% after training with only 500 real-world grasp attempts and 87% with 4500 grasp attempts. Additionally, we achieve a success rate of 84.51% in a dynamic human-robot handover scenario using a multi-finger hand.",
    "path": "papers/24/08/2408.02455.json",
    "total_tokens": 431,
    "tldr": "本文提出了一种高效的多种指尖抓取表示方法，该表示可以准确映射到多指尖抓取空间，仅需数百至数千个样本训练即可生成高质量的抓取分数。在真实机器人上验证了该方法的有效性，并且能在仅500次真实场景抓取训练后达到78.64%的成功率，在4500次训练后达到87%的成功率。此外，在多指尖抓取的人机交互抓取场景中，也能达到84.51%的成功率。"
}