{
    "title": "AggSS: An Aggregated Self-Supervised Approach for Class-Incremental Learning",
    "abstract": "arXiv:2408.04347v1 Announce Type: new  Abstract: This paper investigates the impact of self-supervised learning, specifically image rotations, on various class-incremental learning paradigms. Here, each image with a predefined rotation is considered as a new class for training. At inference, all image rotation predictions are aggregated for the final prediction, a strategy we term Aggregated Self-Supervision (AggSS). We observe a shift in the deep neural network's attention towards intrinsic object features as it learns through AggSS strategy. This learning approach significantly enhances class-incremental learning by promoting robust feature learning. AggSS serves as a plug-and-play module that can be seamlessly incorporated into any class-incremental learning framework, leveraging its powerful feature learning capabilities to enhance performance across various class-incremental learning approaches. Extensive experiments conducted on standard incremental learning datasets CIFAR-100 an",
    "link": "https://arxiv.org/abs/2408.04347",
    "context": "Title: AggSS: An Aggregated Self-Supervised Approach for Class-Incremental Learning\nAbstract: arXiv:2408.04347v1 Announce Type: new  Abstract: This paper investigates the impact of self-supervised learning, specifically image rotations, on various class-incremental learning paradigms. Here, each image with a predefined rotation is considered as a new class for training. At inference, all image rotation predictions are aggregated for the final prediction, a strategy we term Aggregated Self-Supervision (AggSS). We observe a shift in the deep neural network's attention towards intrinsic object features as it learns through AggSS strategy. This learning approach significantly enhances class-incremental learning by promoting robust feature learning. AggSS serves as a plug-and-play module that can be seamlessly incorporated into any class-incremental learning framework, leveraging its powerful feature learning capabilities to enhance performance across various class-incremental learning approaches. Extensive experiments conducted on standard incremental learning datasets CIFAR-100 an",
    "path": "papers/24/08/2408.04347.json",
    "total_tokens": 397,
    "tldr": "该文章提出了一种基于图像旋转的自监督学习方法，通过将每个图像定义的旋转视为新类进行训练，并在推断时聚合所有图像旋转预测结果，以此提高类增量学习中的性能。研究发现该方法能够促进神经网络对物体内部特征的关注，从而显著提高类增量学习中的特征学习效果。该研究进一步证明，这种方法可以集成到各种类增量学习框架中，作为一种可直接使用的模块，并且能够显著提升这些学习框架在不同类增量学习任务和数据集上的表现。"
}