{
    "title": "CMR-Agent: Learning a Cross-Modal Agent for Iterative Image-to-Point Cloud Registration",
    "abstract": "arXiv:2408.02394v1 Announce Type: cross  Abstract: Image-to-point cloud registration aims to determine the relative camera pose of an RGB image with respect to a point cloud. It plays an important role in camera localization within pre-built LiDAR maps. Despite the modality gaps, most learning-based methods establish 2D-3D point correspondences in feature space without any feedback mechanism for iterative optimization, resulting in poor accuracy and interpretability. In this paper, we propose to reformulate the registration procedure as an iterative Markov decision process, allowing for incremental adjustments to the camera pose based on each intermediate state. To achieve this, we employ reinforcement learning to develop a cross-modal registration agent (CMR-Agent), and use imitation learning to initialize its registration policy for stability and quick-start of the training. According to the cross-modal observations, we propose a 2D-3D hybrid state representation that fully exploits ",
    "link": "https://arxiv.org/abs/2408.02394",
    "context": "Title: CMR-Agent: Learning a Cross-Modal Agent for Iterative Image-to-Point Cloud Registration\nAbstract: arXiv:2408.02394v1 Announce Type: cross  Abstract: Image-to-point cloud registration aims to determine the relative camera pose of an RGB image with respect to a point cloud. It plays an important role in camera localization within pre-built LiDAR maps. Despite the modality gaps, most learning-based methods establish 2D-3D point correspondences in feature space without any feedback mechanism for iterative optimization, resulting in poor accuracy and interpretability. In this paper, we propose to reformulate the registration procedure as an iterative Markov decision process, allowing for incremental adjustments to the camera pose based on each intermediate state. To achieve this, we employ reinforcement learning to develop a cross-modal registration agent (CMR-Agent), and use imitation learning to initialize its registration policy for stability and quick-start of the training. According to the cross-modal observations, we propose a 2D-3D hybrid state representation that fully exploits ",
    "path": "papers/24/08/2408.02394.json",
    "total_tokens": 732,
    "translated_title": "CMR-Agent: 一种用于迭代图像到点云注册的跨媒体代理学习",
    "translated_abstract": "arXiv:2408.02394v1 公告类型: cross  摘要: 图像到点云注册旨在确定RGB图像相对于点云的相对相机姿态。它在预先构建的LiDAR地图中的相机定位中起着重要作用。尽管存在媒体类型差距，但大多数基于学习的 methods 方法在没有任何反馈机制的情况下在特征空间中建立二维到三维点对，没有进行任何迭代的优化，结果导致了低精度和平庸的可解释性。在本论文中，我们提出将注册过程重新格式化为一个迭代马尔可夫决策过程，允许根据每个中间状态进行渐进的相机姿势调整。为此，我们将使用强化学习来发展一种跨媒体注册代理（CMR-Agent），并使用模仿学习来为它的注册策略初始化稳定性，并为训练提供快速启动。 根据交叉媒体的观察，我们提出了一种2D-3D混合状态表示，它充分利用了2D图像和3D点云的特征。",
    "tldr": "研究提出了一种通过强化学习和模仿学习初始化的CMR-Agent，它可以实现迭代图像到点云注册。该方法通过提出2D-3D混合状态表示来充分利用2D图像和3D点云的特征，旨在提高注册精度和解释能力。"
}