{
    "title": "Amman City, Jordan: Toward a Sustainable City from the Ground Up",
    "abstract": "arXiv:2408.01454v1 Announce Type: cross  Abstract: The idea of smart cities (SCs) has gained substantial attention in recent years. The SC paradigm aims to improve citizens' quality of life and protect the city's environment. As we enter the age of next-generation SCs, it is important to explore all relevant aspects of the SC paradigm. In recent years, the advancement of Information and Communication Technologies (ICT) has produced a trend of supporting daily objects with smartness, targeting to make human life easier and more comfortable. The paradigm of SCs appears as a response to the purpose of building the city of the future with advanced features. SCs still face many challenges in their implementation, but increasingly more studies regarding SCs are implemented. Nowadays, different cities are employing SC features to enhance services or the residents quality of life. This work provides readers with useful and important information about Amman Smart City.",
    "link": "https://arxiv.org/abs/2408.01454",
    "context": "Title: Amman City, Jordan: Toward a Sustainable City from the Ground Up\nAbstract: arXiv:2408.01454v1 Announce Type: cross  Abstract: The idea of smart cities (SCs) has gained substantial attention in recent years. The SC paradigm aims to improve citizens' quality of life and protect the city's environment. As we enter the age of next-generation SCs, it is important to explore all relevant aspects of the SC paradigm. In recent years, the advancement of Information and Communication Technologies (ICT) has produced a trend of supporting daily objects with smartness, targeting to make human life easier and more comfortable. The paradigm of SCs appears as a response to the purpose of building the city of the future with advanced features. SCs still face many challenges in their implementation, but increasingly more studies regarding SCs are implemented. Nowadays, different cities are employing SC features to enhance services or the residents quality of life. This work provides readers with useful and important information about Amman Smart City.",
    "path": "papers/24/08/2408.01454.json",
    "total_tokens": 326,
    "tldr": "该文章论述了如何将智能城市技术应用于促进约旦安曼市的可持续发展和环境保护，强调了智能技术在城市规划和服务提供中的重要作用，以及在居民生活质量提升方面所面临的挑战和解决方案。"
}