{
    "title": "Incorporating Control Inputs in the Estimation of Continuous Mobile Robot Trajectories and Continuum Robot Shapes",
    "abstract": "arXiv:2408.01333v1 Announce Type: new  Abstract: Continuous-time batch state estimation using Gaussian processes is an efficient approach to estimate the trajectories of robots over time. In the past, relatively simple physics-motivated priors have been considered for such approaches, using assumptions such as constant velocity or acceleration. This paper presents an approach to incorporating exogenous control inputs, such as velocity or acceleration commands, into the continuous Gaussian process state-estimation framework. It is shown that this approach generalizes across different domains in robotics, making it applicable to both the estimation of continuous-time trajectories for mobile robots and continuum-robot shapes. Results show that incorporating control inputs leads to more informed priors, potentially requiring less measurements and estimation nodes to obtain accurate estimates. This makes the approach particularly useful in situations in which limited sensing is available.",
    "link": "https://arxiv.org/abs/2408.01333",
    "context": "Title: Incorporating Control Inputs in the Estimation of Continuous Mobile Robot Trajectories and Continuum Robot Shapes\nAbstract: arXiv:2408.01333v1 Announce Type: new  Abstract: Continuous-time batch state estimation using Gaussian processes is an efficient approach to estimate the trajectories of robots over time. In the past, relatively simple physics-motivated priors have been considered for such approaches, using assumptions such as constant velocity or acceleration. This paper presents an approach to incorporating exogenous control inputs, such as velocity or acceleration commands, into the continuous Gaussian process state-estimation framework. It is shown that this approach generalizes across different domains in robotics, making it applicable to both the estimation of continuous-time trajectories for mobile robots and continuum-robot shapes. Results show that incorporating control inputs leads to more informed priors, potentially requiring less measurements and estimation nodes to obtain accurate estimates. This makes the approach particularly useful in situations in which limited sensing is available.",
    "path": "papers/24/08/2408.01333.json",
    "total_tokens": 631,
    "translated_title": "连续移动机器人轨迹和连续机器人形状估计中结合控制输入",
    "translated_abstract": "arXiv:2408.01333v1 公告类型: 新  摘要: 使用高斯过程进行连续时间批量状态估计是一种有效的方法，用于估计随时间变化的机器人轨迹。在过去，这种方法考虑了相对简单的基于物理的先验，这些先验使用了恒定速度或加速度这样的假设。本文提出了一种将外部控制输入，如速度或加速度命令，纳入连续高斯过程状态估计框架的方法。展示这种方法在不同领域的机器人学中都有应用，使其不仅适用于移动机器人连续时间轨迹的估计，也适用于连续机器人形状的估计。结果表明，结合控制输入导致了更精确的先验，可能需要更少的测量和估计节点来获得准确的估计。这在传感受限的情况下特别有用。",
    "tldr": "该论文提出了一种结合控制输入的连续高斯过程状态估计框架，适用于移动机器人和连续机器人形状的轨迹估算，能够在减少测量和估计节点的情况下，提供更准确的估计。"
}