{
    "title": "Dialogue Ontology Relation Extraction via Constrained Chain-of-Thought Decoding",
    "abstract": "arXiv:2408.02361v1 Announce Type: cross  Abstract: State-of-the-art task-oriented dialogue systems typically rely on task-specific ontologies for fulfilling user queries. The majority of task-oriented dialogue data, such as customer service recordings, comes without ontology and annotation. Such ontologies are normally built manually, limiting the application of specialised systems. Dialogue ontology construction is an approach for automating that process and typically consists of two steps: term extraction and relation extraction. In this work, we focus on relation extraction in a transfer learning set-up. To improve the generalisation, we propose an extension to the decoding mechanism of large language models. We adapt Chain-of-Thought (CoT) decoding, recently developed for reasoning problems, to generative relation extraction. Here, we generate multiple branches in the decoding space and select the relations based on a confidence threshold. By constraining the decoding to ontology t",
    "link": "https://arxiv.org/abs/2408.02361",
    "context": "Title: Dialogue Ontology Relation Extraction via Constrained Chain-of-Thought Decoding\nAbstract: arXiv:2408.02361v1 Announce Type: cross  Abstract: State-of-the-art task-oriented dialogue systems typically rely on task-specific ontologies for fulfilling user queries. The majority of task-oriented dialogue data, such as customer service recordings, comes without ontology and annotation. Such ontologies are normally built manually, limiting the application of specialised systems. Dialogue ontology construction is an approach for automating that process and typically consists of two steps: term extraction and relation extraction. In this work, we focus on relation extraction in a transfer learning set-up. To improve the generalisation, we propose an extension to the decoding mechanism of large language models. We adapt Chain-of-Thought (CoT) decoding, recently developed for reasoning problems, to generative relation extraction. Here, we generate multiple branches in the decoding space and select the relations based on a confidence threshold. By constraining the decoding to ontology t",
    "path": "papers/24/08/2408.02361.json",
    "total_tokens": 377,
    "tldr": "该文章提出了一种通过受限的链式思考解码方法进行对话本体关系提取的创新方法，该方法旨在自动化任务导向对话系统的本体构建过程。通过将最近发展用于推理问题的链式思考解码机制扩展到生成关系提取上，文章提高了大规模语言模型的泛化能力。这种方法可以用于在没有标注本体数据的任务导向对话系统中，有效地实现关系提取，从而减少了对人工本体的依赖。"
}