{
    "title": "Towards Explainable Network Intrusion Detection using Large Language Models",
    "abstract": "arXiv:2408.04342v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have revolutionised natural language processing tasks, particularly as chat agents. However, their applicability to threat detection problems remains unclear. This paper examines the feasibility of employing LLMs as a Network Intrusion Detection System (NIDS), despite their high computational requirements, primarily for the sake of explainability. Furthermore, considerable resources have been invested in developing LLMs, and they may offer utility for NIDS. Current state-of-the-art NIDS rely on artificial benchmarking datasets, resulting in skewed performance when applied to real-world networking environments. Therefore, we compare the GPT-4 and LLama3 models against traditional architectures and transformer-based models to assess their ability to detect malicious NetFlows without depending on artificially skewed datasets, but solely on their vast pre-trained acquired knowledge. Our results reveal that, alt",
    "link": "https://arxiv.org/abs/2408.04342",
    "context": "Title: Towards Explainable Network Intrusion Detection using Large Language Models\nAbstract: arXiv:2408.04342v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have revolutionised natural language processing tasks, particularly as chat agents. However, their applicability to threat detection problems remains unclear. This paper examines the feasibility of employing LLMs as a Network Intrusion Detection System (NIDS), despite their high computational requirements, primarily for the sake of explainability. Furthermore, considerable resources have been invested in developing LLMs, and they may offer utility for NIDS. Current state-of-the-art NIDS rely on artificial benchmarking datasets, resulting in skewed performance when applied to real-world networking environments. Therefore, we compare the GPT-4 and LLama3 models against traditional architectures and transformer-based models to assess their ability to detect malicious NetFlows without depending on artificially skewed datasets, but solely on their vast pre-trained acquired knowledge. Our results reveal that, alt",
    "path": "papers/24/08/2408.04342.json",
    "total_tokens": 381,
    "tldr": "该文章提出并验证了使用大型语言模型（LLMs），如GPT-4和LLaMA 3，作为网络入侵检测系统（NIDS）的可行性，尤其是在提高检测结果的可解释性方面。通过对比传统架构和基于Transformer的模型，研究发现LLMs能够在无需依赖人工偏斜的基准测试数据集的情况下，仅依靠其大规模预训练的知识，有效地检测网络流中的恶意行为，展现了其在网络安全领域的潜在应用价值。"
}