{
    "title": "GazeXplain: Learning to Predict Natural Language Explanations of Visual Scanpaths",
    "abstract": "arXiv:2408.02788v1 Announce Type: new  Abstract: While exploring visual scenes, humans' scanpaths are driven by their underlying attention processes. Understanding visual scanpaths is essential for various applications. Traditional scanpath models predict the where and when of gaze shifts without providing explanations, creating a gap in understanding the rationale behind fixations. To bridge this gap, we introduce GazeXplain, a novel study of visual scanpath prediction and explanation. This involves annotating natural-language explanations for fixations across eye-tracking datasets and proposing a general model with an attention-language decoder that jointly predicts scanpaths and generates explanations. It integrates a unique semantic alignment mechanism to enhance the consistency between fixations and explanations, alongside a cross-dataset co-training approach for generalization. These novelties present a comprehensive and adaptable solution for explainable human visual scanpath pr",
    "link": "https://arxiv.org/abs/2408.02788",
    "context": "Title: GazeXplain: Learning to Predict Natural Language Explanations of Visual Scanpaths\nAbstract: arXiv:2408.02788v1 Announce Type: new  Abstract: While exploring visual scenes, humans' scanpaths are driven by their underlying attention processes. Understanding visual scanpaths is essential for various applications. Traditional scanpath models predict the where and when of gaze shifts without providing explanations, creating a gap in understanding the rationale behind fixations. To bridge this gap, we introduce GazeXplain, a novel study of visual scanpath prediction and explanation. This involves annotating natural-language explanations for fixations across eye-tracking datasets and proposing a general model with an attention-language decoder that jointly predicts scanpaths and generates explanations. It integrates a unique semantic alignment mechanism to enhance the consistency between fixations and explanations, alongside a cross-dataset co-training approach for generalization. These novelties present a comprehensive and adaptable solution for explainable human visual scanpath pr",
    "path": "papers/24/08/2408.02788.json",
    "total_tokens": 396,
    "tldr": "该文章提出了一种名为GazeXplain的方法，该方法通过学习来预测视觉扫描路径的自然语言解释，填补了传统扫描模型仅预测视线转移而不提供解释的空白。该方法包括对视线固定的人自然语言解释进行注释，并提出了一个包含注意力-语言解码器的通用模型，该模型能够同时预测扫描路径和生成解释。通过整合一种独特的语义对齐机制来提高解释与视线固定的一致性，以及一种跨数据集协同训练方法来提高泛化能力。这些创新为可解释的人类视觉扫描路径预测提供了一个全面的、可适应的解决方案。"
}