{
    "title": "Evaluating the Translation Performance of Large Language Models Based on Euas-20",
    "abstract": "arXiv:2408.03119v1 Announce Type: cross  Abstract: In recent years, with the rapid development of deep learning technology, large language models (LLMs) such as BERT and GPT have achieved breakthrough results in natural language processing tasks. Machine translation (MT), as one of the core tasks of natural language processing, has also benefited from the development of large language models and achieved a qualitative leap. Despite the significant progress in translation performance achieved by large language models, machine translation still faces many challenges. Therefore, in this paper, we construct the dataset Euas-20 to evaluate the performance of large language models on translation tasks, the translation ability on different languages, and the effect of pre-training data on the translation ability of LLMs for researchers and developers.",
    "link": "https://arxiv.org/abs/2408.03119",
    "context": "Title: Evaluating the Translation Performance of Large Language Models Based on Euas-20\nAbstract: arXiv:2408.03119v1 Announce Type: cross  Abstract: In recent years, with the rapid development of deep learning technology, large language models (LLMs) such as BERT and GPT have achieved breakthrough results in natural language processing tasks. Machine translation (MT), as one of the core tasks of natural language processing, has also benefited from the development of large language models and achieved a qualitative leap. Despite the significant progress in translation performance achieved by large language models, machine translation still faces many challenges. Therefore, in this paper, we construct the dataset Euas-20 to evaluate the performance of large language models on translation tasks, the translation ability on different languages, and the effect of pre-training data on the translation ability of LLMs for researchers and developers.",
    "path": "papers/24/08/2408.03119.json",
    "total_tokens": 301,
    "tldr": "该文章构建了名为Euas-20的机器翻译性能评估数据集，用以量化大型语言模型在不同语言上的翻译能力及预训练数据对其翻译性能的影响，为相关研究人员和开发者提供参考。"
}