{
    "title": "HOAA: Hybrid Overestimating Approximate Adder for Enhanced Performance Processing Engine",
    "abstract": "arXiv:2408.00806v1 Announce Type: cross  Abstract: This paper presents the Hybrid Overestimating Approximate Adder designed to enhance the performance in processing engines, specifically focused on edge AI applications. A novel Plus One Adder design is proposed as an incremental adder in the RCA chain, incorporating a Full Adder with an excess 1 alongside inputs A, B, and Cin. The design approximates outputs to 2 bit values to reduce hardware complexity and improve resource efficiency. The Plus One Adder is integrated into a dynamically reconfigurable HOAA, allowing runtime interchangeability between accurate and approximate overestimation modes. The proposed design is demonstrated for multiple applications, such as Twos complement subtraction and Rounding to even, and the Configurable Activation function, which are critical components of the Processing engine. Our approach shows 21 percent improvement in area efficiency and 33 percent reduction in power consumption, compared to state ",
    "link": "https://arxiv.org/abs/2408.00806",
    "context": "Title: HOAA: Hybrid Overestimating Approximate Adder for Enhanced Performance Processing Engine\nAbstract: arXiv:2408.00806v1 Announce Type: cross  Abstract: This paper presents the Hybrid Overestimating Approximate Adder designed to enhance the performance in processing engines, specifically focused on edge AI applications. A novel Plus One Adder design is proposed as an incremental adder in the RCA chain, incorporating a Full Adder with an excess 1 alongside inputs A, B, and Cin. The design approximates outputs to 2 bit values to reduce hardware complexity and improve resource efficiency. The Plus One Adder is integrated into a dynamically reconfigurable HOAA, allowing runtime interchangeability between accurate and approximate overestimation modes. The proposed design is demonstrated for multiple applications, such as Twos complement subtraction and Rounding to even, and the Configurable Activation function, which are critical components of the Processing engine. Our approach shows 21 percent improvement in area efficiency and 33 percent reduction in power consumption, compared to state ",
    "path": "papers/24/08/2408.00806.json",
    "total_tokens": 455,
    "tldr": "该文章提出的\"混合过度近似加法器（HOAA）\"通过在累加链中引入带有过剩1的全加器，结合输入A、B和Cin，实现了在边缘人工智能应用中处理引擎性能的增强。该设计通过将输出近似为2位值来降低硬件复杂性并提高资源效率。HOAA设计通过在准确度和过度近似模式之间进行可配置切换，从而实现 runtime 的灵活性。研究证明了多应用中使用Plus One Adder的优越性，这些应用包括二进制减法、四舍五入和可配置激活函数，这些均是处理引擎中的关键组成部分。该方案相较于现有方法在面积效率上提高了21%，在功率消耗上减少了33%。"
}