{
    "title": "A critical reassessment of \"Restricted Weyl Symmetry\"",
    "abstract": "arXiv:2408.02763v1 Announce Type: new  Abstract: A class of globally scale-invariant scalar-tensor theories have been proposed to be invariant under a larger class of transformations that take the form of local Weyl transformations supplemented by a restriction that the conformal factor satisfies a covariant Klein-Gordon equation. The action of these theories indeed seems to be invariant under such transformations up to boundary terms, this property being referred to as \"restricted Weyl symmetry\". However, we find that corresponding equations of motion are not invariant under these transformations. This is a paradox, that is explained by realizing that the restriction condition on the conformal factor forces the \"restricted Weyl transformation\" to be a nonlocal transformation. For nonlocal transformations would-be boundary terms cannot in general be discarded from the action. Moreover, variations of trajectories cannot be assumed to vanish at boundaries of the action when deriving equa",
    "link": "https://arxiv.org/abs/2408.02763",
    "context": "Title: A critical reassessment of \"Restricted Weyl Symmetry\"\nAbstract: arXiv:2408.02763v1 Announce Type: new  Abstract: A class of globally scale-invariant scalar-tensor theories have been proposed to be invariant under a larger class of transformations that take the form of local Weyl transformations supplemented by a restriction that the conformal factor satisfies a covariant Klein-Gordon equation. The action of these theories indeed seems to be invariant under such transformations up to boundary terms, this property being referred to as \"restricted Weyl symmetry\". However, we find that corresponding equations of motion are not invariant under these transformations. This is a paradox, that is explained by realizing that the restriction condition on the conformal factor forces the \"restricted Weyl transformation\" to be a nonlocal transformation. For nonlocal transformations would-be boundary terms cannot in general be discarded from the action. Moreover, variations of trajectories cannot be assumed to vanish at boundaries of the action when deriving equa",
    "path": "papers/24/08/2408.02763.json",
    "total_tokens": 418,
    "tldr": "该文章提出了一个对于“受限惠维尔对称性”的重新评估，指出一类在全局上保持标度不变性的标量-张量理论可以在一组更大的变换下保持不变，这些变换包含了局部的惠特尔变换以及对度规因子满足协变黎曼-哥本哈根方程这个限制。然而，文章发现这些理论的方程组并不在这些变换下保持不变，这一现象是因为我们发现限制条件对于度规因子使得受限惠特尔变换实际上是一个非局部变换。文章解释了对于非局部变换，从行动中消除边界项是不足以提供正确的物理结果的。此外，当从行动中导出方程组时，边界轨迹的变分并不总是零。"
}