{
    "title": "Deciphering Complexity: Machine Learning Insights into Chaotic Dynamical Systems",
    "abstract": "arXiv:2408.02005v1 Announce Type: new  Abstract: We introduce new machine-learning techniques for analyzing chaotic dynamical systems. The primary objectives of the study include the development of a new and simple method for calculating the Lyapunov exponent using only two trajectory data points unlike traditional methods that require an averaging procedure, the exploration of phase transition graphs from regular periodic to chaotic dynamics to identify \"almost integrable\" trajectories where conserved quantities deviate from whole numbers, and the identification of \"integrable regions\" within chaotic trajectories. These methods are applied and tested on two dynamical systems: \"Two objects moving on a rod\" and the \"Henon-Heiles\" systems.",
    "link": "https://arxiv.org/abs/2408.02005",
    "context": "Title: Deciphering Complexity: Machine Learning Insights into Chaotic Dynamical Systems\nAbstract: arXiv:2408.02005v1 Announce Type: new  Abstract: We introduce new machine-learning techniques for analyzing chaotic dynamical systems. The primary objectives of the study include the development of a new and simple method for calculating the Lyapunov exponent using only two trajectory data points unlike traditional methods that require an averaging procedure, the exploration of phase transition graphs from regular periodic to chaotic dynamics to identify \"almost integrable\" trajectories where conserved quantities deviate from whole numbers, and the identification of \"integrable regions\" within chaotic trajectories. These methods are applied and tested on two dynamical systems: \"Two objects moving on a rod\" and the \"Henon-Heiles\" systems.",
    "path": "papers/24/08/2408.02005.json",
    "total_tokens": 381,
    "tldr": "机器学习方法揭示复杂性：对混沌动力系统的新见解\n\n摘要：本文提出了新的机器学习技术，用于分析混沌动力系统。研究的主要目标包括开发一种新的、简单的方法，用于仅使用两个轨迹数据点计算李雅普诺夫指数，这与传统方法不同，传统方法需要一个平均过程。同时探索从规则周期到混沌动态的相变图，以识别“几乎可积”的轨迹，在这些轨迹中，守恒量的偏离不再是整数，并识别混沌轨迹内的“可积分区域”。这些方法被应用于并测试于两个动力系统：“两个物体在棒上的运动”和“Henon-Heiles”系统。"
}