{
    "title": "Improvement and Empirical Testing of a Novel Autonomous Microplastics-Collecting Semisubmersible",
    "abstract": "arXiv:2408.02162v1 Announce Type: new  Abstract: Since their invention, plastics have become ubiquitous in modern societies all around the world, and their impact on the environment has, in recent years, become nearly as well-known. Plastics produced by humans have reached nearly every corner of the world, and throughout their centuries-long lifetimes, plastics continually break down into smaller and smaller particles due to the physical stresses which they are subjected to. These stresses eventually, inevitably, break these plastics down into microplastics -pieces of plastic small enough to be consumed by organisms in bodies of water throughout the globe. These microplastics can very easily bioaccumulate, and have been found everywhere from the Great Lakes to the bloodstreams of humans. The effects of these plastics are poorly understood, however, they have been linked to infertility, halted growth, and a host of other maladies in aquatic organisms. Currently, removal of these plastic",
    "link": "https://arxiv.org/abs/2408.02162",
    "context": "Title: Improvement and Empirical Testing of a Novel Autonomous Microplastics-Collecting Semisubmersible\nAbstract: arXiv:2408.02162v1 Announce Type: new  Abstract: Since their invention, plastics have become ubiquitous in modern societies all around the world, and their impact on the environment has, in recent years, become nearly as well-known. Plastics produced by humans have reached nearly every corner of the world, and throughout their centuries-long lifetimes, plastics continually break down into smaller and smaller particles due to the physical stresses which they are subjected to. These stresses eventually, inevitably, break these plastics down into microplastics -pieces of plastic small enough to be consumed by organisms in bodies of water throughout the globe. These microplastics can very easily bioaccumulate, and have been found everywhere from the Great Lakes to the bloodstreams of humans. The effects of these plastics are poorly understood, however, they have been linked to infertility, halted growth, and a host of other maladies in aquatic organisms. Currently, removal of these plastic",
    "path": "papers/24/08/2408.02162.json",
    "total_tokens": 709,
    "translated_title": "论文标题：一种新型自主微塑料收集半潜式平台改进与实证测试",
    "translated_abstract": "arXiv:2408.02162v1 宣布类型：新摘要：自人类发明塑料以来，这种材料在世界各地的现代社会中无处不在，其对环境的影响在近年已成为众所周知的现象。人类生产的塑料几乎到达了世界的每一个角落，并且在其数百年甚至数千年的寿命中，由于所受到的物理压力，塑料不断分解成越来越小的颗粒。这种压力最终不可避免地将塑料分解成微塑料——可以由全球各种水源中的生物体摄入的小塑料块。微塑料能轻易地进行生物积累，已被发现存在于从五大湖区到人类的血液循环中。这些塑料的影响尚不清楚，但它们已被与生育问题、生长停滞和各种其他疾病联系在一起。目前，微塑料的去除主要基于机械过滤和海上搜集等策略，但这些方法无论在成本还是在有效性上都面临挑战。本文介绍了一项基于新型电子系统的自主微塑料收集半潜式平台的设计与实施，用于提高现有方法的效率和可行性。独立操作并配备先进传感器的半潜式平台可以更有效地寻找和收集水体中的微塑料，从而减少生态影响并提高塑料废弃物的再利用效率。",
    "tldr": "本文介绍了一项新型自主微塑料收集半潜式平台的设计与实施，旨在提高现有微塑料收集方法的效率和可行性。"
}