{
    "title": "Training-Free Condition Video Diffusion Models for single frame Spatial-Semantic Echocardiogram Synthesis",
    "abstract": "arXiv:2408.03035v1 Announce Type: cross  Abstract: Conditional video diffusion models (CDM) have shown promising results for video synthesis, potentially enabling the generation of realistic echocardiograms to address the problem of data scarcity. However, current CDMs require a paired segmentation map and echocardiogram dataset. We present a new method called Free-Echo for generating realistic echocardiograms from a single end-diastolic segmentation map without additional training data. Our method is based on the 3D-Unet with Temporal Attention Layers model and is conditioned on the segmentation map using a training-free conditioning method based on SDEdit. We evaluate our model on two public echocardiogram datasets, CAMUS and EchoNet-Dynamic. We show that our model can generate plausible echocardiograms that are spatially aligned with the input segmentation map, achieving performance comparable to training-based CDMs. Our work opens up new possibilities for generating echocardiograms",
    "link": "https://arxiv.org/abs/2408.03035",
    "context": "Title: Training-Free Condition Video Diffusion Models for single frame Spatial-Semantic Echocardiogram Synthesis\nAbstract: arXiv:2408.03035v1 Announce Type: cross  Abstract: Conditional video diffusion models (CDM) have shown promising results for video synthesis, potentially enabling the generation of realistic echocardiograms to address the problem of data scarcity. However, current CDMs require a paired segmentation map and echocardiogram dataset. We present a new method called Free-Echo for generating realistic echocardiograms from a single end-diastolic segmentation map without additional training data. Our method is based on the 3D-Unet with Temporal Attention Layers model and is conditioned on the segmentation map using a training-free conditioning method based on SDEdit. We evaluate our model on two public echocardiogram datasets, CAMUS and EchoNet-Dynamic. We show that our model can generate plausible echocardiograms that are spatially aligned with the input segmentation map, achieving performance comparable to training-based CDMs. Our work opens up new possibilities for generating echocardiograms",
    "path": "papers/24/08/2408.03035.json",
    "total_tokens": 413,
    "tldr": "该文章提出了一种名为Free-Echo的无训练条件视频扩散模型，用于从单个心动周期分割图合成具有空间-语义特性的超声心动图，无需额外的训练数据。该方法基于3D-Unet模型，使用训练自由的条件方法SDEdit对分割图进行条件约束，并在CAMUS和EchoNet-Dynamic两个公开的超声心动图数据集上取得了与训练依赖的CDM相当的性能。该方法为合成合乎实际的超声心动图开辟了新的可能性。"
}