{
    "title": "An Interactive Augmented Reality Interface for Personalized Proxemics Modeling",
    "abstract": "arXiv:2408.03453v1 Announce Type: new  Abstract: Understanding and respecting personal space preferences is essential for socially assistive robots designed for older adult users. This work introduces and evaluates a novel personalized context-aware method for modeling users' proxemics preferences during human-robot interactions. Using an interactive augmented reality interface, we collected a set of user-preferred distances from the robot and employed an active transfer learning approach to fine-tune a specialized deep learning model. We evaluated this approach through two user studies: 1) a convenience population study (N = 24) to validate the efficacy of the active transfer learning approach; and 2) a user study involving older adults (N = 15) to assess the system's usability. We compared the data collected with the augmented reality interface and with the physical robot to examine the relationship between proxemics preferences for a virtual robot versus a physically embodied robot.",
    "link": "https://arxiv.org/abs/2408.03453",
    "context": "Title: An Interactive Augmented Reality Interface for Personalized Proxemics Modeling\nAbstract: arXiv:2408.03453v1 Announce Type: new  Abstract: Understanding and respecting personal space preferences is essential for socially assistive robots designed for older adult users. This work introduces and evaluates a novel personalized context-aware method for modeling users' proxemics preferences during human-robot interactions. Using an interactive augmented reality interface, we collected a set of user-preferred distances from the robot and employed an active transfer learning approach to fine-tune a specialized deep learning model. We evaluated this approach through two user studies: 1) a convenience population study (N = 24) to validate the efficacy of the active transfer learning approach; and 2) a user study involving older adults (N = 15) to assess the system's usability. We compared the data collected with the augmented reality interface and with the physical robot to examine the relationship between proxemics preferences for a virtual robot versus a physically embodied robot.",
    "path": "papers/24/08/2408.03453.json",
    "total_tokens": 414,
    "tldr": "该文章通过引入一种交互式增强现实界面，开发了一种个性化的上下文感知方法来建模在人类-机器人交互中老年用户对个人空间的偏好。利用这种界面，文章运用了一种主动转移学习方法，对深度学习模型进行了定制化精调，该模型可以学习用户与其交互的机器人之间的理想距离。通过两个用户研究，文章验证了这种方法的有效性，并评估了系统在老年人身上使用的易用性。此外，文章还比较了使用这个增强现实界面所收集的数据与与物理机器人交互的数据，以探究虚拟机器人与物理实体机器人之间的个人空间偏好是否存在差异。"
}