{
    "title": "Concept Conductor: Orchestrating Multiple Personalized Concepts in Text-to-Image Synthesis",
    "abstract": "arXiv:2408.03632v1 Announce Type: new  Abstract: The customization of text-to-image models has seen significant advancements, yet generating multiple personalized concepts remains a challenging task. Current methods struggle with attribute leakage and layout confusion when handling multiple concepts, leading to reduced concept fidelity and semantic consistency. In this work, we introduce a novel training-free framework, Concept Conductor, designed to ensure visual fidelity and correct layout in multi-concept customization. Concept Conductor isolates the sampling processes of multiple custom models to prevent attribute leakage between different concepts and corrects erroneous layouts through self-attention-based spatial guidance. Additionally, we present a concept injection technique that employs shape-aware masks to specify the generation area for each concept. This technique injects the structure and appearance of personalized concepts through feature fusion in the attention layers, e",
    "link": "https://arxiv.org/abs/2408.03632",
    "context": "Title: Concept Conductor: Orchestrating Multiple Personalized Concepts in Text-to-Image Synthesis\nAbstract: arXiv:2408.03632v1 Announce Type: new  Abstract: The customization of text-to-image models has seen significant advancements, yet generating multiple personalized concepts remains a challenging task. Current methods struggle with attribute leakage and layout confusion when handling multiple concepts, leading to reduced concept fidelity and semantic consistency. In this work, we introduce a novel training-free framework, Concept Conductor, designed to ensure visual fidelity and correct layout in multi-concept customization. Concept Conductor isolates the sampling processes of multiple custom models to prevent attribute leakage between different concepts and corrects erroneous layouts through self-attention-based spatial guidance. Additionally, we present a concept injection technique that employs shape-aware masks to specify the generation area for each concept. This technique injects the structure and appearance of personalized concepts through feature fusion in the attention layers, e",
    "path": "papers/24/08/2408.03632.json",
    "total_tokens": 334,
    "tldr": "该文章提出了一种名为 Concept Conductor 的训练免费框架，能够确保在多概念定制下实现视觉真实感和正确布局，并通过自我注意为基础的空间指导纠正布局错误，通过特征融合和使用形状感知遮罩以指定每个概念的生成区域，从而在注意力层中注入个人化概念的结构和外观。"
}