{
    "title": "Exploring the extent of similarities in software failures across industries using LLMs",
    "abstract": "arXiv:2408.03528v1 Announce Type: cross  Abstract: The rapid evolution of software development necessitates enhanced safety measures. Extracting information about software failures from companies is becoming increasingly more available through news articles.   This research utilizes the Failure Analysis Investigation with LLMs (FAIL) model to extract industry-specific information. Although the FAIL model's database is rich in information, it could benefit from further categorization and industry-specific insights to further assist software engineers.   In previous work news articles were collected from reputable sources and categorized by incidents inside a database. Prompt engineering and Large Language Models (LLMs) were then applied to extract relevant information regarding the software failure. This research extends these methods by categorizing articles into specific domains and types of software failures. The results are visually represented through graphs.   The analysis shows t",
    "link": "https://arxiv.org/abs/2408.03528",
    "context": "Title: Exploring the extent of similarities in software failures across industries using LLMs\nAbstract: arXiv:2408.03528v1 Announce Type: cross  Abstract: The rapid evolution of software development necessitates enhanced safety measures. Extracting information about software failures from companies is becoming increasingly more available through news articles.   This research utilizes the Failure Analysis Investigation with LLMs (FAIL) model to extract industry-specific information. Although the FAIL model's database is rich in information, it could benefit from further categorization and industry-specific insights to further assist software engineers.   In previous work news articles were collected from reputable sources and categorized by incidents inside a database. Prompt engineering and Large Language Models (LLMs) were then applied to extract relevant information regarding the software failure. This research extends these methods by categorizing articles into specific domains and types of software failures. The results are visually represented through graphs.   The analysis shows t",
    "path": "papers/24/08/2408.03528.json",
    "total_tokens": 293,
    "tldr": "该文章通过利用人工智能技术，分析了不同行业软件失败案例的相似性，并发展了一种模型，以帮助提高软件开发的安全性。"
}