{
    "title": "Analyzing Cultural Representations of Emotions in LLMs through Mixed Emotion Survey",
    "abstract": "arXiv:2408.02143v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have gained widespread global adoption, showcasing advanced linguistic capabilities across multiple of languages. There is a growing interest in academia to use these models to simulate and study human behaviors. However, it is crucial to acknowledge that an LLM's proficiency in a specific language might not fully encapsulate the norms and values associated with its culture. Concerns have emerged regarding potential biases towards Anglo-centric cultures and values due to the predominance of Western and US-based training data. This study focuses on analyzing the cultural representations of emotions in LLMs, in the specific case of mixed-emotion situations. Our methodology is based on the studies of Miyamoto et al. (2010), which identified distinctive emotional indicators in Japanese and American human responses. We first administer their mixed emotion survey to five different LLMs and analyze their outputs. ",
    "link": "https://arxiv.org/abs/2408.02143",
    "context": "Title: Analyzing Cultural Representations of Emotions in LLMs through Mixed Emotion Survey\nAbstract: arXiv:2408.02143v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have gained widespread global adoption, showcasing advanced linguistic capabilities across multiple of languages. There is a growing interest in academia to use these models to simulate and study human behaviors. However, it is crucial to acknowledge that an LLM's proficiency in a specific language might not fully encapsulate the norms and values associated with its culture. Concerns have emerged regarding potential biases towards Anglo-centric cultures and values due to the predominance of Western and US-based training data. This study focuses on analyzing the cultural representations of emotions in LLMs, in the specific case of mixed-emotion situations. Our methodology is based on the studies of Miyamoto et al. (2010), which identified distinctive emotional indicators in Japanese and American human responses. We first administer their mixed emotion survey to five different LLMs and analyze their outputs. ",
    "path": "papers/24/08/2408.02143.json",
    "total_tokens": 322,
    "tldr": "该文章通过对中国文化中混合情感情况的分析，研究了大型语言模型在代表情感时的文化差异，并探讨了这些模型可能存在的文化偏见问题。"
}