{
    "title": "PINNs for Medical Image Analysis: A Survey",
    "abstract": "arXiv:2408.01026v1 Announce Type: cross  Abstract: The incorporation of physical information in machine learning frameworks is transforming medical image analysis (MIA). By integrating fundamental knowledge and governing physical laws, these models achieve enhanced robustness and interpretability. In this work, we explore the utility of physics-informed approaches for MIA (PIMIA) tasks such as registration, generation, classification, and reconstruction. We present a systematic literature review of over 80 papers on physics-informed methods dedicated to MIA. We propose a unified taxonomy to investigate what physics knowledge and processes are modelled, how they are represented, and the strategies to incorporate them into MIA models. We delve deep into a wide range of image analysis tasks, from imaging, generation, prediction, inverse imaging (super-resolution and reconstruction), registration, and image analysis (segmentation and classification). For each task, we thoroughly examine an",
    "link": "https://arxiv.org/abs/2408.01026",
    "context": "Title: PINNs for Medical Image Analysis: A Survey\nAbstract: arXiv:2408.01026v1 Announce Type: cross  Abstract: The incorporation of physical information in machine learning frameworks is transforming medical image analysis (MIA). By integrating fundamental knowledge and governing physical laws, these models achieve enhanced robustness and interpretability. In this work, we explore the utility of physics-informed approaches for MIA (PIMIA) tasks such as registration, generation, classification, and reconstruction. We present a systematic literature review of over 80 papers on physics-informed methods dedicated to MIA. We propose a unified taxonomy to investigate what physics knowledge and processes are modelled, how they are represented, and the strategies to incorporate them into MIA models. We delve deep into a wide range of image analysis tasks, from imaging, generation, prediction, inverse imaging (super-resolution and reconstruction), registration, and image analysis (segmentation and classification). For each task, we thoroughly examine an",
    "path": "papers/24/08/2408.01026.json",
    "total_tokens": 629,
    "translated_title": "论文标题：用于医学图像分析的物理信息网络：一个综述",
    "translated_abstract": "论文摘要：机器学习框架中物理信息的整合正在改变医学图像分析（MIA）。通过整合基本知识和指导物理定律，这些模型实现了增强的鲁棒性和可解释性。在这项工作中，我们对80多篇专注于医学图像分析（MIA）的物理信息方法进行了系统的文献综述。我们提出了一种统一的分类法，以调查用于MIA的物理知识以及用于建模的方式。我们将深入研究一系列图像分析任务，包括成像、生成、预测、逆成像（超分辨率和重建）、标定和图像分析（分割和分类）。对于每项任务，我们都详细检查了一个专注于医学图像分析的物理信息方法综述。",
    "tldr": "论文要点：本文综述了将物理信息集成到机器学习框架中的医学图像分析方法，探讨了用于MIA的物理知识、建模方式以及这些方法在实际图像分析任务中的应用。",
    "en_tdlr": "The paper provides a comprehensive review of the integration of physical information into machine learning frameworks for medical image analysis (MIA), explores different types of physical knowledge, modeling techniques, and their application in various image analysis tasks dedicated to MIA, including imaging, generation, prediction, inverse imaging, registration, and image analysis."
}