{
    "title": "ML-EAT: A Multilevel Embedding Association Test for Interpretable and Transparent Social Science",
    "abstract": "arXiv:2408.01966v1 Announce Type: cross  Abstract: This research introduces the Multilevel Embedding Association Test (ML-EAT), a method designed for interpretable and transparent measurement of intrinsic bias in language technologies. The ML-EAT addresses issues of ambiguity and difficulty in interpreting the traditional EAT measurement by quantifying bias at three levels of increasing granularity: the differential association between two target concepts with two attribute concepts; the individual effect size of each target concept with two attribute concepts; and the association between each individual target concept and each individual attribute concept. Using the ML-EAT, this research defines a taxonomy of EAT patterns describing the nine possible outcomes of an embedding association test, each of which is associated with a unique EAT-Map, a novel four-quadrant visualization for interpreting the ML-EAT. Empirical analysis of static and diachronic word embeddings, GPT-2 language mod",
    "link": "https://arxiv.org/abs/2408.01966",
    "context": "Title: ML-EAT: A Multilevel Embedding Association Test for Interpretable and Transparent Social Science\nAbstract: arXiv:2408.01966v1 Announce Type: cross  Abstract: This research introduces the Multilevel Embedding Association Test (ML-EAT), a method designed for interpretable and transparent measurement of intrinsic bias in language technologies. The ML-EAT addresses issues of ambiguity and difficulty in interpreting the traditional EAT measurement by quantifying bias at three levels of increasing granularity: the differential association between two target concepts with two attribute concepts; the individual effect size of each target concept with two attribute concepts; and the association between each individual target concept and each individual attribute concept. Using the ML-EAT, this research defines a taxonomy of EAT patterns describing the nine possible outcomes of an embedding association test, each of which is associated with a unique EAT-Map, a novel four-quadrant visualization for interpreting the ML-EAT. Empirical analysis of static and diachronic word embeddings, GPT-2 language mod",
    "path": "papers/24/08/2408.01966.json",
    "total_tokens": 494,
    "tldr": "该文章提出了一种名为ML-EAT的复杂层次嵌入关联测试方法，旨在为社会科学研究中语言技术的偏差提供可解释和透明的度量。这种方法通过在三级层次上（从宏观到微观）量化差异关联效应，解决了传统EAT（嵌入关联测试）方法在解释上的模糊性和难度，即：不同目标概念与不同属性概念的关联度；每个目标概念在不同属性概念中影响的个体效应大小；以及每个目标概念与每个属性概念之间的具体关联度。ML-EAT的创新之处在于它能够定义一个EAT模式税则，每个模式都有与之对应的EAT-Map，这是一种新型的四分槽图，用于解释ML-EAT结果。通过对静态和动态词嵌入的GPT-2语言模型进行实证分析，该研究展示了如何使用ML-EAT来揭示语言技术中的潜在偏见，并提供了一种新的分析和可视化工具，使社会科学家能够更好地理解并利用这些信息。"
}