{
    "title": "Towards an ontology of state actors in cyberspace",
    "abstract": "arXiv:2408.01787v1 Announce Type: cross  Abstract: To improve cyber threat analysis practices in cybersecurity, I present a plan to build a formal ontological representation of state actors in cyberspace and of cyber operations. I argue that modelling these phenomena via ontologies allows for coherent integration of data coming from diverse sources, automated reasoning over such data, as well as intelligence extraction and reuse from and of them. Existing ontological tools in cybersecurity can be ameliorated by connecting them to neighboring domains such as law, regulations, governmental institutions, and documents. In this paper, I propose metrics to evaluate currently existing ontological tools to create formal representations in the cybersecurity domain, and I provide a plan to develop and extend them when they are lacking.",
    "link": "https://arxiv.org/abs/2408.01787",
    "context": "Title: Towards an ontology of state actors in cyberspace\nAbstract: arXiv:2408.01787v1 Announce Type: cross  Abstract: To improve cyber threat analysis practices in cybersecurity, I present a plan to build a formal ontological representation of state actors in cyberspace and of cyber operations. I argue that modelling these phenomena via ontologies allows for coherent integration of data coming from diverse sources, automated reasoning over such data, as well as intelligence extraction and reuse from and of them. Existing ontological tools in cybersecurity can be ameliorated by connecting them to neighboring domains such as law, regulations, governmental institutions, and documents. In this paper, I propose metrics to evaluate currently existing ontological tools to create formal representations in the cybersecurity domain, and I provide a plan to develop and extend them when they are lacking.",
    "path": "papers/24/08/2408.01787.json",
    "total_tokens": 328,
    "tldr": "该文章提出构建一个正式概念框架，以实现对网络空间中官方行为体及其网络活动现象的定性建模，旨在增强网络安全威胁分析的科学性。此框架通过连接现有网络安全概念框架与法律法规、政府部门等周边领域，促进了多源数据的一致整合、自动化推理以及相关情报的自动提取和再利用，对于提升国家安全领域的情报收集和分析能力具有重要意义。"
}