{
    "title": "Lightweight Video Denoising Using a Classic Bayesian Backbone",
    "abstract": "arXiv:2408.03904v1 Announce Type: cross  Abstract: In recent years, state-of-the-art image and video denoising networks have become increasingly large, requiring millions of trainable parameters to achieve best-in-class performance. Improved denoising quality has come at the cost of denoising speed, where modern transformer networks are far slower to run than smaller denoising networks such as FastDVDnet and classic Bayesian denoisers such as the Wiener filter.   In this paper, we implement a hybrid Wiener filter which leverages small ancillary networks to increase the original denoiser performance, while retaining fast denoising speeds. These networks are used to refine the Wiener coring estimate, optimise windowing functions and estimate the unknown noise profile. Using these methods, we outperform several popular denoisers and remain within 0.2 dB, on average, of the popular VRT transformer. Our method was found to be over x10 faster than the transformer method, with a far lower par",
    "link": "https://arxiv.org/abs/2408.03904",
    "context": "Title: Lightweight Video Denoising Using a Classic Bayesian Backbone\nAbstract: arXiv:2408.03904v1 Announce Type: cross  Abstract: In recent years, state-of-the-art image and video denoising networks have become increasingly large, requiring millions of trainable parameters to achieve best-in-class performance. Improved denoising quality has come at the cost of denoising speed, where modern transformer networks are far slower to run than smaller denoising networks such as FastDVDnet and classic Bayesian denoisers such as the Wiener filter.   In this paper, we implement a hybrid Wiener filter which leverages small ancillary networks to increase the original denoiser performance, while retaining fast denoising speeds. These networks are used to refine the Wiener coring estimate, optimise windowing functions and estimate the unknown noise profile. Using these methods, we outperform several popular denoisers and remain within 0.2 dB, on average, of the popular VRT transformer. Our method was found to be over x10 faster than the transformer method, with a far lower par",
    "path": "papers/24/08/2408.03904.json",
    "total_tokens": 428,
    "tldr": "该文章提出了一种使用经典贝叶斯核的瘦视频去噪方法，通过小型辅助网络改进原始去噪器的性能，同时保持快速的去噪速度。这项研究采用了一种混合维纳滤波器，它使用小型辅助网络来改进维纳核估计、优化窗函数并估计未知噪声模式。通过这些方法，论文中提出的去噪器平均在0.2 dB左右优于流行的VRT变换器。这种方法比变换器方法快了超过10倍，同时还具有较低的参数数量和内存需求，提供了一种在速度和去噪效果之间取得平衡的有效视频去噪解决方案。"
}