{
    "title": "Towards AI-Safety-by-Design: A Taxonomy of Runtime Guardrails in Foundation Model based Systems",
    "abstract": "arXiv:2408.02205v1 Announce Type: cross  Abstract: The rapid advancement and widespread deployment of foundation model (FM) based systems have revolutionized numerous applications across various domains. However, the fast-growing capabilities and autonomy have also raised significant concerns about responsible AI and AI safety. Recently, there have been increasing attention toward implementing guardrails to ensure the runtime behavior of FM-based systems is safe and responsible. Given the early stage of FMs and their applications (such as agents), the design of guardrails have not yet been systematically studied. It remains underexplored which software qualities should be considered when designing guardrails and how these qualities can be ensured from a software architecture perspective. Therefore, in this paper, we present a taxonomy for guardrails to classify and compare the characteristics and design options of guardrails. Our taxonomy is organized into three main categories: the mo",
    "link": "https://arxiv.org/abs/2408.02205",
    "context": "Title: Towards AI-Safety-by-Design: A Taxonomy of Runtime Guardrails in Foundation Model based Systems\nAbstract: arXiv:2408.02205v1 Announce Type: cross  Abstract: The rapid advancement and widespread deployment of foundation model (FM) based systems have revolutionized numerous applications across various domains. However, the fast-growing capabilities and autonomy have also raised significant concerns about responsible AI and AI safety. Recently, there have been increasing attention toward implementing guardrails to ensure the runtime behavior of FM-based systems is safe and responsible. Given the early stage of FMs and their applications (such as agents), the design of guardrails have not yet been systematically studied. It remains underexplored which software qualities should be considered when designing guardrails and how these qualities can be ensured from a software architecture perspective. Therefore, in this paper, we present a taxonomy for guardrails to classify and compare the characteristics and design options of guardrails. Our taxonomy is organized into three main categories: the mo",
    "path": "papers/24/08/2408.02205.json",
    "total_tokens": 329,
    "tldr": "该文章提出了对基于基础模型（FM）系统的运行时保护措施的分类学，以组织和对比保护措施的特征和设计选项，旨在确保保护措施的设计既安全又负责。"
}