{
    "title": "Three-dimensional Morphological Reconstruction of Millimeter-Scale Soft Continuum Robots based on Dual Stereo Vision",
    "abstract": "arXiv:2408.01615v1 Announce Type: new  Abstract: Continuum robots can be miniaturized to just a few millimeters in diameter. Among these, notched tubular continuum robots (NTCR) show great potential in many delicate applications. Existing works in robotic modeling focus on kinematics and dynamics but still face challenges in reproducing the robot's morphology -- a significant factor that can expand the research landscape of continuum robots, especially for those with asymmetric continuum structures. This paper proposes a dual stereo vision-based method for the three-dimensional morphological reconstruction of millimeter-scale NTCRs. The method employs two oppositely located stationary binocular cameras to capture the point cloud of the NTCR, then utilizes predefined geometry as a reference for the KD tree method to relocate the capture point clouds, resulting in a morphologically correct NTCR despite the low-quality raw point cloud collection. The method has been proved feasible for an",
    "link": "https://arxiv.org/abs/2408.01615",
    "context": "Title: Three-dimensional Morphological Reconstruction of Millimeter-Scale Soft Continuum Robots based on Dual Stereo Vision\nAbstract: arXiv:2408.01615v1 Announce Type: new  Abstract: Continuum robots can be miniaturized to just a few millimeters in diameter. Among these, notched tubular continuum robots (NTCR) show great potential in many delicate applications. Existing works in robotic modeling focus on kinematics and dynamics but still face challenges in reproducing the robot's morphology -- a significant factor that can expand the research landscape of continuum robots, especially for those with asymmetric continuum structures. This paper proposes a dual stereo vision-based method for the three-dimensional morphological reconstruction of millimeter-scale NTCRs. The method employs two oppositely located stationary binocular cameras to capture the point cloud of the NTCR, then utilizes predefined geometry as a reference for the KD tree method to relocate the capture point clouds, resulting in a morphologically correct NTCR despite the low-quality raw point cloud collection. The method has been proved feasible for an",
    "path": "papers/24/08/2408.01615.json",
    "total_tokens": 658,
    "translated_title": "基于双目立体视觉的三维形态重建毫米级软体连续机器人",
    "translated_abstract": "arXiv:2408.01615v1 公告类型: 新  摘要: 连续机器人可以缩小到仅几毫米直径。在这些机器人中，具有切槽的管状连续机器人(NTCR)在许多精细操作方面显示出巨大的潜力。现有的机器人建模工作集中在动力学和动力学上，但仍然面临着再现机器人形态的挑战——这是一个可以在连续机器人，尤其是那些具有不对称连续结构的研究领域中扩展的重要因素。本文提出了一种基于双目立体视觉的方法，用于重建毫米级NTCR的三维形态。该方法使用两台相对固定的双目摄像头捕获NTCR的点云，然后利用预定义几何作为KD树方法的重定位参考，即使低质量的原始点云收集在无能为力的情况下，也导致了一个形态正确的NTCR。该方法已经证明对于一个具有不对称形态的NTCR来说是可以实施的。",
    "tldr": "本文提出了一种基于双目立体视觉的方法，用于重建毫米级NTCR的不对称形态，即使在低质量点云收集也存在难度的情况下。",
    "en_tdlr": "This paper presents a method based on dual stereo vision for reconstructing the asymmetrical morphology of millimeter-scale NTCRs, which has been proven feasible despite the challenges in collecting low-quality point clouds."
}