{
    "title": "Transferable Adversarial Facial Images for Privacy Protection",
    "abstract": "arXiv:2408.01428v1 Announce Type: new  Abstract: The success of deep face recognition (FR) systems has raised serious privacy concerns due to their ability to enable unauthorized tracking of users in the digital world. Previous studies proposed introducing imperceptible adversarial noises into face images to deceive those face recognition models, thus achieving the goal of enhancing facial privacy protection. Nevertheless, they heavily rely on user-chosen references to guide the generation of adversarial noises, and cannot simultaneously construct natural and highly transferable adversarial face images in black-box scenarios. In light of this, we present a novel face privacy protection scheme with improved transferability while maintain high visual quality. We propose shaping the entire face space directly instead of exploiting one kind of facial characteristic like makeup information to integrate adversarial noises. To achieve this goal, we first exploit global adversarial latent sear",
    "link": "https://arxiv.org/abs/2408.01428",
    "context": "Title: Transferable Adversarial Facial Images for Privacy Protection\nAbstract: arXiv:2408.01428v1 Announce Type: new  Abstract: The success of deep face recognition (FR) systems has raised serious privacy concerns due to their ability to enable unauthorized tracking of users in the digital world. Previous studies proposed introducing imperceptible adversarial noises into face images to deceive those face recognition models, thus achieving the goal of enhancing facial privacy protection. Nevertheless, they heavily rely on user-chosen references to guide the generation of adversarial noises, and cannot simultaneously construct natural and highly transferable adversarial face images in black-box scenarios. In light of this, we present a novel face privacy protection scheme with improved transferability while maintain high visual quality. We propose shaping the entire face space directly instead of exploiting one kind of facial characteristic like makeup information to integrate adversarial noises. To achieve this goal, we first exploit global adversarial latent sear",
    "path": "papers/24/08/2408.01428.json",
    "total_tokens": 646,
    "translated_title": "迁移式对抗性面部图像对隐私保护",
    "translated_abstract": "arXiv:2408.01428v1 宣布类型：新 摘要：由于深度人脸识别（FR）系统的成功，人们对使用这些系统在数字世界中追踪用户的能力给予了高度重视。之前的研究通过在面部图像中引入不可察觉的对抗性噪声来误导这些人脸识别模型，实现了增强面部隐私保护的目标。然而，他们高度依赖于用户选择的参考来指导对抗性噪声的生成，并且在黑盒场景中无法同时创建自然且高度可转移的对抗性面部图像。因此，我们提出了一个全新的面部隐私保护方案，该方案在保持高视觉质量的同时提高了转移能力。我们提议直接塑造整个面部空间，而不是利用类似于妆容信息的一种面部特征来整合对抗性噪声。为实现这一目标，我们首先利用全局对抗性潜变量搜索",
    "tldr": "本文提出了一种新的面部隐私保护方案，能在保持高视觉质量的同时提高转移能力。通过直接塑造整个面部空间，而不是仅利用妆容信息等一种特征来整合对抗性噪声，该方案能够在黑盒场景中生成自然且高度可转移的对抗性面部图像。",
    "en_tdlr": "This study introduces a novel facial privacy protection scheme that enhances transferability while maintaining high visual quality. The approach shapes the entire face space directly, rather than relying solely on makeup-like information to integrate adversarial noise, enabling the generation of natural, highly transferable adversarial face images in black-box scenarios."
}