{
    "title": "Deep Learning based Visually Rich Document Content Understanding: A Survey",
    "abstract": "arXiv:2408.01287v1 Announce Type: cross  Abstract: Visually Rich Documents (VRDs) are essential in academia, finance, medical fields, and marketing due to their multimodal information content. Traditional methods for extracting information from VRDs depend on expert knowledge and manual labor, making them costly and inefficient. The advent of deep learning has revolutionized this process, introducing models that leverage multimodal information vision, text, and layout along with pretraining tasks to develop comprehensive document representations. These models have achieved state-of-the-art performance across various downstream tasks, significantly enhancing the efficiency and accuracy of information extraction from VRDs. In response to the growing demands and rapid developments in Visually Rich Document Understanding (VRDU), this paper provides a comprehensive review of deep learning-based VRDU frameworks. We systematically survey and analyze existing methods and benchmark datasets, ca",
    "link": "https://arxiv.org/abs/2408.01287",
    "context": "Title: Deep Learning based Visually Rich Document Content Understanding: A Survey\nAbstract: arXiv:2408.01287v1 Announce Type: cross  Abstract: Visually Rich Documents (VRDs) are essential in academia, finance, medical fields, and marketing due to their multimodal information content. Traditional methods for extracting information from VRDs depend on expert knowledge and manual labor, making them costly and inefficient. The advent of deep learning has revolutionized this process, introducing models that leverage multimodal information vision, text, and layout along with pretraining tasks to develop comprehensive document representations. These models have achieved state-of-the-art performance across various downstream tasks, significantly enhancing the efficiency and accuracy of information extraction from VRDs. In response to the growing demands and rapid developments in Visually Rich Document Understanding (VRDU), this paper provides a comprehensive review of deep learning-based VRDU frameworks. We systematically survey and analyze existing methods and benchmark datasets, ca",
    "path": "papers/24/08/2408.01287.json",
    "total_tokens": 635,
    "translated_title": "基于深度学习的丰富视觉文档内容理解综述",
    "translated_abstract": "arXiv:2408.01287v1 公告类型：跨学科 Abstract: 丰富视觉文档（VRD）在学术、金融、医疗和营销等领域因其多模式信息内容而至关重要。传统的从VRD中提取信息的方法依赖于专家知识和人工劳动，这使得它们既昂贵又低效。深度学习的发展为这个过程带来了革命，它介绍了一系列模型，这些模型利用多模式信息包括视觉、文本和布局，以及预训练任务来发展全面的文档表示。这些模型在各种下游任务上实现了先进的性能，显著提高了从VRD提取信息的工作效率和准确性。鉴于对丰富视觉文档理解（VRDU）的需求增长和快速发展，本文提供了基于深度学习的VRDU框架的全面回顾。我们系统地调查和分析了现有的方法和基准数据集，讨论了当前面临的主要挑战和未来的研究方向，旨在为该领域的研究提供一个全面的视角，并促进新颖方法的发展。",
    "tldr": "本文综述了基于深度学习的丰富视觉文档内容理解框架，分析了现有方法、数据集，并指出了当前面临的主要挑战和未来的研究方向。",
    "en_tdlr": "This paper reviews deep learning-based frameworks for understanding visually rich document content, systematically analyzes existing methods and benchmark datasets, discusses current major challenges, and identifies future research directions."
}