{
    "title": "PsyDI: Towards a Personalized and Progressively In-depth Chatbot for Psychological Measurements",
    "abstract": "arXiv:2408.03337v1 Announce Type: cross  Abstract: In the field of psychology, the static nature and lack of customization of psychological test scales, along with the challenge of quantifying psychological indicators, have long been critical issues. Despite numerous attempts to use AI to address psychological challenges, a dynamically interactive psychological test has yet to emerge. In contrast to traditional psychological assessment methods, we propose PsyDI, a multi-modal, interactive, and customized chatbot for psychological assessments, using the Myers-Briggs Type Indicator (MBTI) as an example. PsyDI initiates with user-related multi-modal information, then engaging in customized interaction to discern the user's MBTI type based on their multiple rounds of responses. Despite these advancements, accurately quantifying absolute value of psychological indicators remains challenging. To tackle such difficulty, we introduce the PsyDI framework that trains LLMs to discern the relative",
    "link": "https://arxiv.org/abs/2408.03337",
    "context": "Title: PsyDI: Towards a Personalized and Progressively In-depth Chatbot for Psychological Measurements\nAbstract: arXiv:2408.03337v1 Announce Type: cross  Abstract: In the field of psychology, the static nature and lack of customization of psychological test scales, along with the challenge of quantifying psychological indicators, have long been critical issues. Despite numerous attempts to use AI to address psychological challenges, a dynamically interactive psychological test has yet to emerge. In contrast to traditional psychological assessment methods, we propose PsyDI, a multi-modal, interactive, and customized chatbot for psychological assessments, using the Myers-Briggs Type Indicator (MBTI) as an example. PsyDI initiates with user-related multi-modal information, then engaging in customized interaction to discern the user's MBTI type based on their multiple rounds of responses. Despite these advancements, accurately quantifying absolute value of psychological indicators remains challenging. To tackle such difficulty, we introduce the PsyDI framework that trains LLMs to discern the relative",
    "path": "papers/24/08/2408.03337.json",
    "total_tokens": 335,
    "tldr": "该文章提出了一种名为PsyDI的多模态交互式个性化心理评估聊天bot，它通过不断对话个性化心理测验，为用户提供个性化的心理类型评估，尽管在心理指标的定量评估上仍存在挑战。"
}