{
    "title": "Self-Supervised Depth Estimation Based on Camera Models",
    "abstract": "arXiv:2408.01565v1 Announce Type: new  Abstract: Depth estimationn is a critical topic for robotics and vision-related tasks. In monocular depth estimation, in comparison with supervised learning that requires expensive ground truth labeling, self-supervised methods possess great potential due to no labeling cost. However, self-supervised learning still has a large gap with supervised learning in depth estimation performance. Meanwhile, scaling is also a major issue for monocular unsupervised depth estimation, which commonly still needs ground truth scale from GPS, LiDAR, or existing maps to correct. In deep learning era, while existing methods mainly rely on the exploration of image relationships to train the unsupervised neural networks, fundamental information provided by the camera itself has been generally ignored, which can provide extensive supervision information for free, without the need for any extra equipment to provide supervision signals. Utilizing the camera itself's int",
    "link": "https://arxiv.org/abs/2408.01565",
    "context": "Title: Self-Supervised Depth Estimation Based on Camera Models\nAbstract: arXiv:2408.01565v1 Announce Type: new  Abstract: Depth estimationn is a critical topic for robotics and vision-related tasks. In monocular depth estimation, in comparison with supervised learning that requires expensive ground truth labeling, self-supervised methods possess great potential due to no labeling cost. However, self-supervised learning still has a large gap with supervised learning in depth estimation performance. Meanwhile, scaling is also a major issue for monocular unsupervised depth estimation, which commonly still needs ground truth scale from GPS, LiDAR, or existing maps to correct. In deep learning era, while existing methods mainly rely on the exploration of image relationships to train the unsupervised neural networks, fundamental information provided by the camera itself has been generally ignored, which can provide extensive supervision information for free, without the need for any extra equipment to provide supervision signals. Utilizing the camera itself's int",
    "path": "papers/24/08/2408.01565.json",
    "total_tokens": 698,
    "translated_title": "基于摄像机模型的自监督深度估计方法",
    "translated_abstract": "arXiv:2408.01565v1 公告类型：新 Abstract: 对于机器人学和与视觉相关的任务而言，深度估计是一个至关重要的课题。在单目深度估计中，相较于需要昂贵地面真实标签的有监督学习，由于不需要任何标签成本，自监督方法具有巨大的潜力。然而，自监督学习在深度估计性能上仍然存在较大差距。同时，对于单目无监督深度估计而言，尺度问题是另一个主要问题。通常情况下，为了纠正深度估计，单目无监督深度估计方法仍然需要来自GPS、LiDAR或其他现有地图的地面真实尺度数据。在深度学习时代，虽然现有的方法主要依赖于探索图像之间的关系，以训练无监督的神经网络，但摄像机自身提供的基本信息被普遍忽略，这可以为深度估计提供免费的监督信息，而不需要任何额外的设备提供监督信号。利用摄像机自身的内部结构，我们提出了一种新的深度估计方法，这种方法利用了摄像机模型的信息来改进深度估计的质量，无须额外的数据和成本。我们的方法通过对比不同场景下摄像机模型的预测与实际图像之间的关系，进行深度估计的学习和改进，从而在保持性能的同时降低了成本。此外，这种方法还可以应用于各种不同的场景，适用于复杂的真实世界环境。",
    "tldr": "该论文提出了一种基于摄像机模型的新方法，利用摄像机内部结构的信息来提高深度估计的质量，无需额外的数据和成本。"
}