{
    "title": "What Happens Without Background? Constructing Foreground-Only Data for Fine-Grained Tasks",
    "abstract": "arXiv:2408.01998v1 Announce Type: new  Abstract: Fine-grained recognition, a pivotal task in visual signal processing, aims to distinguish between similar subclasses based on discriminative information present in samples. However, prevailing methods often erroneously focus on background areas, neglecting the capture of genuinely effective discriminative information from the subject, thus impeding practical application. To facilitate research into the impact of background noise on models and enhance their ability to concentrate on the subject's discriminative features, we propose an engineered pipeline that leverages the capabilities of SAM and Detic to create fine-grained datasets with only foreground subjects, devoid of background. Extensive cross-experiments validate this approach as a preprocessing step prior to training, enhancing algorithmic performance and holding potential for further modal expansion of the data.",
    "link": "https://arxiv.org/abs/2408.01998",
    "context": "Title: What Happens Without Background? Constructing Foreground-Only Data for Fine-Grained Tasks\nAbstract: arXiv:2408.01998v1 Announce Type: new  Abstract: Fine-grained recognition, a pivotal task in visual signal processing, aims to distinguish between similar subclasses based on discriminative information present in samples. However, prevailing methods often erroneously focus on background areas, neglecting the capture of genuinely effective discriminative information from the subject, thus impeding practical application. To facilitate research into the impact of background noise on models and enhance their ability to concentrate on the subject's discriminative features, we propose an engineered pipeline that leverages the capabilities of SAM and Detic to create fine-grained datasets with only foreground subjects, devoid of background. Extensive cross-experiments validate this approach as a preprocessing step prior to training, enhancing algorithmic performance and holding potential for further modal expansion of the data.",
    "path": "papers/24/08/2408.01998.json",
    "total_tokens": 598,
    "translated_title": "没有背景会发生什么？为微细分任务构建仅包含前景的数据",
    "translated_abstract": "arXiv:2408.01998v1 新闻类型：新消息 摘要：在视觉信号处理中，微细分识别任务旨在根据样本中存在的鉴别性信息，区分相似的下位类。然而，现有的方法通常错误地关注背景区域，忽视了对主体有效鉴别信息的捕捉，这阻碍了其实际应用。为了促进对模型背景噪声影响的科学研究，并增强其对主体鉴别特征的集中能力，我们提出了一种工程化管道，它利用SAM和Detic的能力，创建了仅包含前景主题的数据集，不包含背景。广泛的交叉实验验证了这种方法作为一种训练前的预处理步骤的有效性，增强了算法性能，并为数据模式的进一步扩展奠定了潜力。",
    "tldr": "该研究提出了一种通过SAM和Detic技术创建仅包含前景数据的工程化管道，以促进微细分任务中忽视背景噪声影响的科学研究。",
    "en_tdlr": "The study proposes an engineered pipeline using SAM and Detic technologies to create foreground-only datasets for fine-grained tasks, aiming to promote research into the impact of ignoring background noise in models, thereby enhancing their ability to focus on discriminative features of the subject."
}