{
    "title": "Navigating the Human Maze: Real-Time Robot Pathfinding with Generative Imitation Learning",
    "abstract": "arXiv:2408.03807v1 Announce Type: new  Abstract: This paper addresses navigation in crowded environments by integrating goal-conditioned generative models with Sampling-based Model Predictive Control (SMPC). We introduce goal-conditioned autoregressive models to generate crowd behaviors, capturing intricate interactions among individuals. The model processes potential robot trajectory samples and predicts the reactions of surrounding individuals, enabling proactive robotic navigation in complex scenarios. Extensive experiments show that this algorithm enables real-time navigation, significantly reducing collision rates and path lengths, and outperforming selected baseline methods. The practical effectiveness of this algorithm is validated on an actual robotic platform, demonstrating its capability in dynamic settings.",
    "link": "https://arxiv.org/abs/2408.03807",
    "context": "Title: Navigating the Human Maze: Real-Time Robot Pathfinding with Generative Imitation Learning\nAbstract: arXiv:2408.03807v1 Announce Type: new  Abstract: This paper addresses navigation in crowded environments by integrating goal-conditioned generative models with Sampling-based Model Predictive Control (SMPC). We introduce goal-conditioned autoregressive models to generate crowd behaviors, capturing intricate interactions among individuals. The model processes potential robot trajectory samples and predicts the reactions of surrounding individuals, enabling proactive robotic navigation in complex scenarios. Extensive experiments show that this algorithm enables real-time navigation, significantly reducing collision rates and path lengths, and outperforming selected baseline methods. The practical effectiveness of this algorithm is validated on an actual robotic platform, demonstrating its capability in dynamic settings.",
    "path": "papers/24/08/2408.03807.json",
    "total_tokens": 284,
    "tldr": "该文章提出了一种结合目标条件生成模型和采样式模型预测控制的算法，实现了在拥挤环境中实时机器人的路径规划，通过预测周围人群的反应来减少碰撞风险并缩短路径长度，并在实际机器人平台上得到了验证。"
}