{
    "title": "TURTLMap: Real-time Localization and Dense Mapping of Low-texture Underwater Environments with a Low-cost Unmanned Underwater Vehicle",
    "abstract": "arXiv:2408.01569v1 Announce Type: new  Abstract: Significant work has been done on advancing localization and mapping in underwater environments. Still, state-of-the-art methods are challenged by low-texture environments, which is common for underwater settings. This makes it difficult to use existing methods in diverse, real-world scenes. In this paper, we present TURTLMap, a novel solution that focuses on textureless underwater environments through a real-time localization and mapping method. We show that this method is low-cost, and capable of tracking the robot accurately, while constructing a dense map of a low-textured environment in real-time. We evaluate the proposed method using real-world data collected in an indoor water tank with a motion capture system and ground truth reference map. Qualitative and quantitative results validate the proposed system achieves accurate and robust localization and precise dense mapping, even when subject to wave conditions. The project page fo",
    "link": "https://arxiv.org/abs/2408.01569",
    "context": "Title: TURTLMap: Real-time Localization and Dense Mapping of Low-texture Underwater Environments with a Low-cost Unmanned Underwater Vehicle\nAbstract: arXiv:2408.01569v1 Announce Type: new  Abstract: Significant work has been done on advancing localization and mapping in underwater environments. Still, state-of-the-art methods are challenged by low-texture environments, which is common for underwater settings. This makes it difficult to use existing methods in diverse, real-world scenes. In this paper, we present TURTLMap, a novel solution that focuses on textureless underwater environments through a real-time localization and mapping method. We show that this method is low-cost, and capable of tracking the robot accurately, while constructing a dense map of a low-textured environment in real-time. We evaluate the proposed method using real-world data collected in an indoor water tank with a motion capture system and ground truth reference map. Qualitative and quantitative results validate the proposed system achieves accurate and robust localization and precise dense mapping, even when subject to wave conditions. The project page fo",
    "path": "papers/24/08/2408.01569.json",
    "total_tokens": 400,
    "tldr": "该文章提出了TURTLMap，这是一种针对低纹理海底环境的实时定位和密集制图的解决方案，该方法使用了低价位的无人水下航行器。这项创新贡献在于能够准确地追踪航行器的位置并实时构建低纹理环境的高密度地图，即使在波浪等自然条件的影响下也能保持精度。在室内水槽中使用运动捕捉系统和真实地图作为参考，实证了该方法的准确性和鲁棒性。"
}