{
    "title": "Boosting Gaze Object Prediction via Pixel-level Supervision from Vision Foundation Model",
    "abstract": "arXiv:2408.01044v1 Announce Type: new  Abstract: Gaze object prediction (GOP) aims to predict the category and location of the object that a human is looking at. Previous methods utilized box-level supervision to identify the object that a person is looking at, but struggled with semantic ambiguity, ie, a single box may contain several items since objects are close together. The Vision foundation model (VFM) has improved in object segmentation using box prompts, which can reduce confusion by more precisely locating objects, offering advantages for fine-grained prediction of gaze objects. This paper presents a more challenging gaze object segmentation (GOS) task, which involves inferring the pixel-level mask corresponding to the object captured by human gaze behavior. In particular, we propose that the pixel-level supervision provided by VFM can be integrated into gaze object prediction to mitigate semantic ambiguity. This leads to our gaze object detection and segmentation framework th",
    "link": "https://arxiv.org/abs/2408.01044",
    "context": "Title: Boosting Gaze Object Prediction via Pixel-level Supervision from Vision Foundation Model\nAbstract: arXiv:2408.01044v1 Announce Type: new  Abstract: Gaze object prediction (GOP) aims to predict the category and location of the object that a human is looking at. Previous methods utilized box-level supervision to identify the object that a person is looking at, but struggled with semantic ambiguity, ie, a single box may contain several items since objects are close together. The Vision foundation model (VFM) has improved in object segmentation using box prompts, which can reduce confusion by more precisely locating objects, offering advantages for fine-grained prediction of gaze objects. This paper presents a more challenging gaze object segmentation (GOS) task, which involves inferring the pixel-level mask corresponding to the object captured by human gaze behavior. In particular, we propose that the pixel-level supervision provided by VFM can be integrated into gaze object prediction to mitigate semantic ambiguity. This leads to our gaze object detection and segmentation framework th",
    "path": "papers/24/08/2408.01044.json",
    "total_tokens": 493,
    "translated_title": "通过视觉基础模型像素级监督提升视线对象预测",
    "translated_abstract": "本文提出了一种新的挑战性任务——视线对象分割(GOS)，它旨在推断人类视线行为捕获的对象的像素级掩码。特别是，我们提出了一个视线对象检测和分割框架，该框架利用了来自VFM的像素级监督，这有助于减少由于对象靠得太近而产生的语义模糊性。通过这种方法，我们可以显著提高视线对象预测的准确性和效果。",
    "tldr": "本文提出了一种利用像素级监督的视线对象预测方法，通过与VFM的集成，显著提升了视线对象检测和分割的准确性。"
}