{
    "title": "HyperSpaceX: Radial and Angular Exploration of HyperSpherical Dimensions",
    "abstract": "arXiv:2408.02494v1 Announce Type: new  Abstract: Traditional deep learning models rely on methods such as softmax cross-entropy and ArcFace loss for tasks like classification and face recognition. These methods mainly explore angular features in a hyperspherical space, often resulting in entangled inter-class features due to dense angular data across many classes. In this paper, a new field of feature exploration is proposed known as HyperSpaceX which enhances class discrimination by exploring both angular and radial dimensions in multi-hyperspherical spaces, facilitated by a novel DistArc loss. The proposed DistArc loss encompasses three feature arrangement components: two angular and one radial, enforcing intra-class binding and inter-class separation in multi-radial arrangement, improving feature discriminability. Evaluation of HyperSpaceX framework for the novel representation utilizes a proposed predictive measure that accounts for both angular and radial elements, providing a mor",
    "link": "https://arxiv.org/abs/2408.02494",
    "context": "Title: HyperSpaceX: Radial and Angular Exploration of HyperSpherical Dimensions\nAbstract: arXiv:2408.02494v1 Announce Type: new  Abstract: Traditional deep learning models rely on methods such as softmax cross-entropy and ArcFace loss for tasks like classification and face recognition. These methods mainly explore angular features in a hyperspherical space, often resulting in entangled inter-class features due to dense angular data across many classes. In this paper, a new field of feature exploration is proposed known as HyperSpaceX which enhances class discrimination by exploring both angular and radial dimensions in multi-hyperspherical spaces, facilitated by a novel DistArc loss. The proposed DistArc loss encompasses three feature arrangement components: two angular and one radial, enforcing intra-class binding and inter-class separation in multi-radial arrangement, improving feature discriminability. Evaluation of HyperSpaceX framework for the novel representation utilizes a proposed predictive measure that accounts for both angular and radial elements, providing a mor",
    "path": "papers/24/08/2408.02494.json",
    "total_tokens": 732,
    "translated_title": "HyperSpaceX: 超球面维度径向和角向探索",
    "translated_abstract": "arXiv:2408.02494v1 公告类型：新 Abstract: 传统的深度学习模型依赖于诸如softmax交叉熵和ArcFace损失这种方法来处理分类和面部识别等任务。这些方法主要在超球形空间中探索角向特征，往往因为多个类别的密集角向数据而导致类内特征相互纠缠。在这篇论文中，提出了一种新的特征探索领域，称为HyperSpaceX，它通过一个新颖的DistArc损失函数增强了类区分度。所提出的DistArc损失函数包含了三个特征布局组件：两个角向和一个径向，强制实施类内绑定和类间分离在多径向安排中，改进了特征的区分度。对HyperSpaceX框架的新型表示进行了评估，采用了提出的预测度量，该度量兼顾了角向和径向元素，提供了更多关于特征分布的详细信息。在面部识别和动物纹理识别任务中进行的系统实验表明，与当前最佳的深度学习模型相比，HyperSpaceX架构能够在保持高分类准确性的同时，展现更强的类间区分能力。在进一步的工作中，研究团队计划扩展 HyperSpaceX 框架以支持更多类型的分类和识别任务，并探索其在其他数据集和现实世界场景中的有效性。",
    "tldr": "本文提出了一种名为 HyperSpaceX 的技术，通过探索多径向超球面空间中的角向和径向特征，使用了一种新型的 DistArc 损失函数来提高分类任务的类间区分度。"
}