{
    "title": "OpenOmni: A Collaborative Open Source Tool for Building Future-Ready Multimodal Conversational Agents",
    "abstract": "arXiv:2408.03047v1 Announce Type: cross  Abstract: Multimodal conversational agents are highly desirable because they offer natural and human-like interaction. However, there is a lack of comprehensive end-to-end solutions to support collaborative development and benchmarking. While proprietary systems like GPT-4o and Gemini demonstrating impressive integration of audio, video, and text with response times of 200-250ms, challenges remain in balancing latency, accuracy, cost, and data privacy. To better understand and quantify these issues, we developed OpenOmni, an open-source, end-to-end pipeline benchmarking tool that integrates advanced technologies such as Speech-to-Text, Emotion Detection, Retrieval Augmented Generation, Large Language Models, along with the ability to integrate customized models. OpenOmni supports local and cloud deployment, ensuring data privacy and supporting latency and accuracy benchmarking. This flexible framework allows researchers to customize the pipeline",
    "link": "https://arxiv.org/abs/2408.03047",
    "context": "Title: OpenOmni: A Collaborative Open Source Tool for Building Future-Ready Multimodal Conversational Agents\nAbstract: arXiv:2408.03047v1 Announce Type: cross  Abstract: Multimodal conversational agents are highly desirable because they offer natural and human-like interaction. However, there is a lack of comprehensive end-to-end solutions to support collaborative development and benchmarking. While proprietary systems like GPT-4o and Gemini demonstrating impressive integration of audio, video, and text with response times of 200-250ms, challenges remain in balancing latency, accuracy, cost, and data privacy. To better understand and quantify these issues, we developed OpenOmni, an open-source, end-to-end pipeline benchmarking tool that integrates advanced technologies such as Speech-to-Text, Emotion Detection, Retrieval Augmented Generation, Large Language Models, along with the ability to integrate customized models. OpenOmni supports local and cloud deployment, ensuring data privacy and supporting latency and accuracy benchmarking. This flexible framework allows researchers to customize the pipeline",
    "path": "papers/24/08/2408.03047.json",
    "total_tokens": 366,
    "tldr": "该文章介绍了OpenOmni，一个开源工具，旨在支持开发人员构建未来导向的多模态对话代理。该工具集成了多种技术，包括语音识别、情感分析、增强生成和大型语言模型，允许用户根据需要进行定制，并支持本地和云部署，以保证数据安全和优化性能。"
}