{
    "title": "Deep Reinforcement Learning for Robotics: A Survey of Real-World Successes",
    "abstract": "arXiv:2408.03539v1 Announce Type: new  Abstract: Reinforcement learning (RL), particularly its combination with deep neural networks referred to as deep RL (DRL), has shown tremendous promise across a wide range of applications, suggesting its potential for enabling the development of sophisticated robotic behaviors. Robotics problems, however, pose fundamental difficulties for the application of RL, stemming from the complexity and cost of interacting with the physical world. This article provides a modern survey of DRL for robotics, with a particular focus on evaluating the real-world successes achieved with DRL in realizing several key robotic competencies. Our analysis aims to identify the key factors underlying those exciting successes, reveal underexplored areas, and provide an overall characterization of the status of DRL in robotics. We highlight several important avenues for future work, emphasizing the need for stable and sample-efficient real-world RL paradigms, holistic app",
    "link": "https://arxiv.org/abs/2408.03539",
    "context": "Title: Deep Reinforcement Learning for Robotics: A Survey of Real-World Successes\nAbstract: arXiv:2408.03539v1 Announce Type: new  Abstract: Reinforcement learning (RL), particularly its combination with deep neural networks referred to as deep RL (DRL), has shown tremendous promise across a wide range of applications, suggesting its potential for enabling the development of sophisticated robotic behaviors. Robotics problems, however, pose fundamental difficulties for the application of RL, stemming from the complexity and cost of interacting with the physical world. This article provides a modern survey of DRL for robotics, with a particular focus on evaluating the real-world successes achieved with DRL in realizing several key robotic competencies. Our analysis aims to identify the key factors underlying those exciting successes, reveal underexplored areas, and provide an overall characterization of the status of DRL in robotics. We highlight several important avenues for future work, emphasizing the need for stable and sample-efficient real-world RL paradigms, holistic app",
    "path": "papers/24/08/2408.03539.json",
    "total_tokens": 362,
    "tldr": "该文章总结了深度强化学习（DRL）在机器人领域中的应用，特别是其在实现机器人多种关键技能方面的真实世界成功案例。文章强调了DRL在机器人技术中的潜力，并分析了实现这些成功的关键因素，以及未充分探索的领域。此外，文章还强调了未来研究中需要稳定、高效的真实世界RL模式的必要性，并提出了综合方法。"
}