{
    "title": "Survey on Emotion Recognition through Posture Detection and the possibility of its application in Virtual Reality",
    "abstract": "arXiv:2408.01728v1 Announce Type: new  Abstract: A survey is presented focused on using pose estimation techniques in Emotional recognition using various technologies normal cameras, and depth cameras for real-time, and the potential use of VR and inputs including images, videos, and 3-dimensional poses described in vector space. We discussed 19 research papers collected from selected journals and databases highlighting their methodology, classification algorithm, and the used datasets that relate to emotion recognition and pose estimation. A benchmark has been made according to their accuracy as it was the most common performance measurement metric used. We concluded that the multimodal Approaches overall made the best accuracy and then we mentioned futuristic concerns that can improve the development of this research topic.",
    "link": "https://arxiv.org/abs/2408.01728",
    "context": "Title: Survey on Emotion Recognition through Posture Detection and the possibility of its application in Virtual Reality\nAbstract: arXiv:2408.01728v1 Announce Type: new  Abstract: A survey is presented focused on using pose estimation techniques in Emotional recognition using various technologies normal cameras, and depth cameras for real-time, and the potential use of VR and inputs including images, videos, and 3-dimensional poses described in vector space. We discussed 19 research papers collected from selected journals and databases highlighting their methodology, classification algorithm, and the used datasets that relate to emotion recognition and pose estimation. A benchmark has been made according to their accuracy as it was the most common performance measurement metric used. We concluded that the multimodal Approaches overall made the best accuracy and then we mentioned futuristic concerns that can improve the development of this research topic.",
    "path": "papers/24/08/2408.01728.json",
    "total_tokens": 338,
    "tldr": "该文章对使用姿势检测技术进行情感识别进行了研究，并探讨了该技术在虚拟现实领域应用的潜力。通过调查19篇相关研究论文，本文总结了现有方法、分类算法以及所使用的数据集，并基于准确性这一标准性能指标进行了基准测试。研究得出，多模态方法在情感识别和姿势估计领域表现出最高的准确性。此外，文章还讨论了未来可能改进该研究领域的关键因素。"
}