{
    "title": "From Problem to Solution: Bio-inspired 3D Printing for Bonding Soft and Rigid Materials via Underextrusions",
    "abstract": "arXiv:2408.01210v1 Announce Type: new  Abstract: Vertebrate animals benefit from a combination of rigidity for structural support and softness for adaptation. Similarly, integrating rigidity and softness can enhance the versatility of soft robotics. However, the challenges associated with creating durable bonding interfaces between soft and rigid materials have limited the development of hybrid robots. Existing solutions require specialized machinery, such as polyjet 3D printers, which are not commonly available. In response to these challenges, we have developed a 3D printing technique that can be used with almost all commercially available FDM printers. This technique leverages the common issue of underextrusion to create a strong bond between soft and rigid materials. Underextrusion generates a porous structure, similar to fibrous connective tissues, that provides a robust interface with the rigid part through layer fusion, while the porosity enables interlocking with the soft mater",
    "link": "https://arxiv.org/abs/2408.01210",
    "context": "Title: From Problem to Solution: Bio-inspired 3D Printing for Bonding Soft and Rigid Materials via Underextrusions\nAbstract: arXiv:2408.01210v1 Announce Type: new  Abstract: Vertebrate animals benefit from a combination of rigidity for structural support and softness for adaptation. Similarly, integrating rigidity and softness can enhance the versatility of soft robotics. However, the challenges associated with creating durable bonding interfaces between soft and rigid materials have limited the development of hybrid robots. Existing solutions require specialized machinery, such as polyjet 3D printers, which are not commonly available. In response to these challenges, we have developed a 3D printing technique that can be used with almost all commercially available FDM printers. This technique leverages the common issue of underextrusion to create a strong bond between soft and rigid materials. Underextrusion generates a porous structure, similar to fibrous connective tissues, that provides a robust interface with the rigid part through layer fusion, while the porosity enables interlocking with the soft mater",
    "path": "papers/24/08/2408.01210.json",
    "total_tokens": 722,
    "translated_title": "生物启发的3D打印：通过欠挤实现软硬材料之间的牢固粘合",
    "translated_abstract": "arXiv:2408.01210v1 公告类型：新摘要：脊椎动物得益于其结构的刚性和适应性的柔软性。同样，将刚性和柔软性结合起来可以提高软体机器人的灵活性。然而，创建软硬材料粘合界面所面临的挑战限制了混合机器人技术的发展。现有的解决方案需要特殊的机器，例如专为软机器人设计的PolyJet 3D打印机，这些机器并不常见。为了应对这些挑战，我们开发了一种可以在几乎所有商业可用的FDM打印机上使用的3D打印技术。这项技术利用了欠挤这一常见问题，通过层融合为软硬材料之间的牢固粘合提供了强有力的接口。欠挤生成一种多孔结构，类似于纤维状结缔组织，它能与硬性部分通过层融合提供坚实的接口，而多孔性又允许与柔软材料之间的相互锁定。此外，这种方法允许通过简单的调整打印参数来控制粘合力的强度，并且我们展示了通过这种方法创建的结构在无法轻松应用传统粘合剂的环境中的实用性。通过实例验证了我们方法的实用性和有效性。",
    "tldr": "本文介绍了一种使用几乎所有标准FDM打印机的新型3D打印技术，通过利用欠挤这一常见问题，成功地实现了软硬材料之间的可靠粘合，解决了软硬材料粘合难的问题。",
    "en_tdlr": "A novel 3D printing technique has been developed that uses under-extrusion common in FDM printers to create a robust bond between soft and rigid materials, overcoming longstanding challenges in the field."
}