{
    "title": "Latency-Aware Resource Allocation for Mobile Edge Generation and Computing via Deep Reinforcement Learning",
    "abstract": "arXiv:2408.02047v1 Announce Type: cross  Abstract: Recently, the integration of mobile edge computing (MEC) and generative artificial intelligence (GAI) technology has given rise to a new area called mobile edge generation and computing (MEGC), which offers mobile users heterogeneous services such as task computing and content generation. In this letter, we investigate the joint communication, computation, and the AIGC resource allocation problem in an MEGC system. A latency minimization problem is first formulated to enhance the quality of service for mobile users. Due to the strong coupling of the optimization variables, we propose a new deep reinforcement learning-based algorithm to solve it efficiently. Numerical results demonstrate that the proposed algorithm can achieve lower latency than two baseline algorithms.",
    "link": "https://arxiv.org/abs/2408.02047",
    "context": "Title: Latency-Aware Resource Allocation for Mobile Edge Generation and Computing via Deep Reinforcement Learning\nAbstract: arXiv:2408.02047v1 Announce Type: cross  Abstract: Recently, the integration of mobile edge computing (MEC) and generative artificial intelligence (GAI) technology has given rise to a new area called mobile edge generation and computing (MEGC), which offers mobile users heterogeneous services such as task computing and content generation. In this letter, we investigate the joint communication, computation, and the AIGC resource allocation problem in an MEGC system. A latency minimization problem is first formulated to enhance the quality of service for mobile users. Due to the strong coupling of the optimization variables, we propose a new deep reinforcement learning-based algorithm to solve it efficiently. Numerical results demonstrate that the proposed algorithm can achieve lower latency than two baseline algorithms.",
    "path": "papers/24/08/2408.02047.json",
    "total_tokens": 530,
    "translated_title": "通过深度强化学习实现的移动边缘生成计算的感知性资源分配",
    "translated_abstract": "arXiv:2408.02047v1 公告类型：交叉 摘要：最近，移动边缘计算（MEC）和生成人工智能（GAI）技术的结合催生了一个新的领域，即移动边缘生成计算（MEGC），它为移动用户提供异构服务，如任务计算和内容生成。在这篇短文中，我们研究了MEGC系统中通信、计算和AI生成内容资源分配的联合问题。首先，我们制定了一个优化问题，以提高移动用户的服务质量。由于优化变量的强烈关联，我们提出了一个基于深度强化学习的算法来解决这个问题。数值结果表明，与两个基线算法相比，所提出的算法可以实现更低的延迟。",
    "tldr": "本文提出了一种基于深度强化学习的算法，用于解决移动边缘生成计算系统中通信、计算和AI生成内容资源的联合分配问题，以降低用户的服务延迟。"
}