{
    "title": "Adaptive traffic signal safety and efficiency improvement by multi objective deep reinforcement learning approach",
    "abstract": "arXiv:2408.00814v1 Announce Type: cross  Abstract: This research introduces an innovative method for adaptive traffic signal control (ATSC) through the utilization of multi-objective deep reinforcement learning (DRL) techniques. The proposed approach aims to enhance control strategies at intersections while simultaneously addressing safety, efficiency, and decarbonization objectives. Traditional ATSC methods typically prioritize traffic efficiency and often struggle to adapt to real-time dynamic traffic conditions. To address these challenges, the study suggests a DRL-based ATSC algorithm that incorporates the Dueling Double Deep Q Network (D3QN) framework. The performance of this algorithm is assessed using a simulated intersection in Changsha, China. Notably, the proposed ATSC algorithm surpasses both traditional ATSC and ATSC algorithms focused solely on efficiency optimization by achieving over a 16% reduction in traffic conflicts and a 4% decrease in carbon emissions. Regarding tr",
    "link": "https://arxiv.org/abs/2408.00814",
    "context": "Title: Adaptive traffic signal safety and efficiency improvement by multi objective deep reinforcement learning approach\nAbstract: arXiv:2408.00814v1 Announce Type: cross  Abstract: This research introduces an innovative method for adaptive traffic signal control (ATSC) through the utilization of multi-objective deep reinforcement learning (DRL) techniques. The proposed approach aims to enhance control strategies at intersections while simultaneously addressing safety, efficiency, and decarbonization objectives. Traditional ATSC methods typically prioritize traffic efficiency and often struggle to adapt to real-time dynamic traffic conditions. To address these challenges, the study suggests a DRL-based ATSC algorithm that incorporates the Dueling Double Deep Q Network (D3QN) framework. The performance of this algorithm is assessed using a simulated intersection in Changsha, China. Notably, the proposed ATSC algorithm surpasses both traditional ATSC and ATSC algorithms focused solely on efficiency optimization by achieving over a 16% reduction in traffic conflicts and a 4% decrease in carbon emissions. Regarding tr",
    "path": "papers/24/08/2408.00814.json",
    "total_tokens": 645,
    "translated_title": "通过多目标深度强化学习方法适应性交通信号安全与效率改进",
    "translated_abstract": "这项研究通过利用多目标深度强化学习技术提出了一种适应性交通信号控制（ATSC）的创新方法。该方案旨在提高路口控制策略的同时，同时解决安全性、效率和脱碳化三个目标。传统的ATSC方法通常优先考虑交通效率，并且在适应实时动态交通条件时往往遇到困难。为了解决这些问题，本研究提出了一种基于Dueling Double Deep Q Network（D3QN）框架的DRL-based ATSC算法。该算法在中国的长沙的一个模拟路口的表现被评估。值得注意的是，与传统的ATSC和单纯优化效率的ATSC算法相比，提出的ATSC算法通过实现交通事故减少了16%和二氧化碳排放减少了4%，突出了其优越性。此外，算法还能在变化多端的交通条件下保持稳定的性能，表明其有广泛的应用前景。",
    "tldr": "这项研究提出了一种新型的多目标深度强化学习方法，可以提高交通信号控制的安全性和效率，并减少碳排放，特别是在动态交通条件下性能更佳，显示了其广阔的实用前景。"
}