{
    "title": "AirSLAM: An Efficient and Illumination-Robust Point-Line Visual SLAM System",
    "abstract": "arXiv:2408.03520v1 Announce Type: new  Abstract: In this paper, we present an efficient visual SLAM system designed to tackle both short-term and long-term illumination challenges. Our system adopts a hybrid approach that combines deep learning techniques for feature detection and matching with traditional backend optimization methods. Specifically, we propose a unified convolutional neural network (CNN) that simultaneously extracts keypoints and structural lines. These features are then associated, matched, triangulated, and optimized in a coupled manner. Additionally, we introduce a lightweight relocalization pipeline that reuses the built map, where keypoints, lines, and a structure graph are used to match the query frame with the map. To enhance the applicability of the proposed system to real-world robots, we deploy and accelerate the feature detection and matching networks using C++ and NVIDIA TensorRT. Extensive experiments conducted on various datasets demonstrate that our syst",
    "link": "https://arxiv.org/abs/2408.03520",
    "context": "Title: AirSLAM: An Efficient and Illumination-Robust Point-Line Visual SLAM System\nAbstract: arXiv:2408.03520v1 Announce Type: new  Abstract: In this paper, we present an efficient visual SLAM system designed to tackle both short-term and long-term illumination challenges. Our system adopts a hybrid approach that combines deep learning techniques for feature detection and matching with traditional backend optimization methods. Specifically, we propose a unified convolutional neural network (CNN) that simultaneously extracts keypoints and structural lines. These features are then associated, matched, triangulated, and optimized in a coupled manner. Additionally, we introduce a lightweight relocalization pipeline that reuses the built map, where keypoints, lines, and a structure graph are used to match the query frame with the map. To enhance the applicability of the proposed system to real-world robots, we deploy and accelerate the feature detection and matching networks using C++ and NVIDIA TensorRT. Extensive experiments conducted on various datasets demonstrate that our syst",
    "path": "papers/24/08/2408.03520.json",
    "total_tokens": 411,
    "tldr": "该文章提出了一种名为AirSLAM的视觉SLAM系统，该系统能够高效地处理短期和长期的照明挑战。该系统采用混合方法，结合深度学习进行特征检测和匹配，以及传统优化算法。它使用一个统一的卷积神经网络同时提取关键点和结构线，并在耦合过程中进行关联、匹配和三角测量优化。此外，文章还介绍了一个轻量级的重新定位管线，该管线重用构建的地图，使用关键点、线和结构图来匹配查询帧与地图的匹配。通过在多个数据集上的广泛实验，证明了其系统的有效性。"
}