{
    "title": "Adaptive Planning with Generative Models under Uncertainty",
    "abstract": "arXiv:2408.01510v1 Announce Type: new  Abstract: Planning with generative models has emerged as an effective decision-making paradigm across a wide range of domains, including reinforcement learning and autonomous navigation. While continuous replanning at each timestep might seem intuitive because it allows decisions to be made based on the most recent environmental observations, it results in substantial computational challenges, primarily due to the complexity of the generative model's underlying deep learning architecture. Our work addresses this challenge by introducing a simple adaptive planning policy that leverages the generative model's ability to predict long-horizon state trajectories, enabling the execution of multiple actions consecutively without the need for immediate replanning. We propose to use the predictive uncertainty derived from a Deep Ensemble of inverse dynamics models to dynamically adjust the intervals between planning sessions. In our experiments conducted o",
    "link": "https://arxiv.org/abs/2408.01510",
    "context": "Title: Adaptive Planning with Generative Models under Uncertainty\nAbstract: arXiv:2408.01510v1 Announce Type: new  Abstract: Planning with generative models has emerged as an effective decision-making paradigm across a wide range of domains, including reinforcement learning and autonomous navigation. While continuous replanning at each timestep might seem intuitive because it allows decisions to be made based on the most recent environmental observations, it results in substantial computational challenges, primarily due to the complexity of the generative model's underlying deep learning architecture. Our work addresses this challenge by introducing a simple adaptive planning policy that leverages the generative model's ability to predict long-horizon state trajectories, enabling the execution of multiple actions consecutively without the need for immediate replanning. We propose to use the predictive uncertainty derived from a Deep Ensemble of inverse dynamics models to dynamically adjust the intervals between planning sessions. In our experiments conducted o",
    "path": "papers/24/08/2408.01510.json",
    "total_tokens": 342,
    "tldr": "我们提出了一种新型的自适应规划策略，结合了生成模型预测长期状态轨迹的能力，优化了连续决策过程中的计算复杂性。通过调整计划执行周期，以降低预测不确定性和提高环境适应性，从而提高系统的稳定性和效率。"
}