{
    "title": "Enhancing Heterogeneous Knowledge Graph Completion with a Novel GAT-based Approach",
    "abstract": "arXiv:2408.02456v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) play a vital role in enhancing search results and recommendation systems. With the rapid increase in the size of the KGs, they are becoming inaccuracy and incomplete. This problem can be solved by the knowledge graph completion methods, of which graph attention network (GAT)-based methods stand out since their superior performance. However, existing GAT-based knowledge graph completion methods often suffer from overfitting issues when dealing with heterogeneous knowledge graphs, primarily due to the unbalanced number of samples. Additionally, these methods demonstrate poor performance in predicting the tail (head) entity that shares the same relation and head (tail) entity with others. To solve these problems, we propose GATH, a novel GAT-based method designed for Heterogeneous KGs. GATH incorporates two separate attention network modules that work synergistically to predict the missing entities. We also introduc",
    "link": "https://arxiv.org/abs/2408.02456",
    "context": "Title: Enhancing Heterogeneous Knowledge Graph Completion with a Novel GAT-based Approach\nAbstract: arXiv:2408.02456v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) play a vital role in enhancing search results and recommendation systems. With the rapid increase in the size of the KGs, they are becoming inaccuracy and incomplete. This problem can be solved by the knowledge graph completion methods, of which graph attention network (GAT)-based methods stand out since their superior performance. However, existing GAT-based knowledge graph completion methods often suffer from overfitting issues when dealing with heterogeneous knowledge graphs, primarily due to the unbalanced number of samples. Additionally, these methods demonstrate poor performance in predicting the tail (head) entity that shares the same relation and head (tail) entity with others. To solve these problems, we propose GATH, a novel GAT-based method designed for Heterogeneous KGs. GATH incorporates two separate attention network modules that work synergistically to predict the missing entities. We also introduc",
    "path": "papers/24/08/2408.02456.json",
    "total_tokens": 376,
    "tldr": "该文章提出了一种基于新GAT（Graph Attention Network）的方法，用于增强异构知识图完成任务。通过整合两个单独的注意力网络模块，该方法能够在预测缺失实体时表现出更好的性能，有效解决现有GAT方法在处理异构知识图时遇到的不平衡样本数量问题以及预测与已有关系相关的尾（头）实体时的低性能问题。\n\n{{endoftext}}"
}