{
    "title": "RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with Structural Priors",
    "abstract": "arXiv:2408.02184v1 Announce Type: new  Abstract: Humans are capable of continuously manipulating a wide variety of deformable objects into complex shapes. This is made possible by our intuitive understanding of material properties and mechanics of the object, for reasoning about object states even when visual perception is occluded. These capabilities allow us to perform diverse tasks ranging from cooking with dough to expressing ourselves with pottery-making. However, developing robotic systems to robustly perform similar tasks remains challenging, as current methods struggle to effectively model volumetric deformable objects and reason about the complex behavior they typically exhibit. To study the robotic systems and algorithms capable of deforming volumetric objects, we introduce a novel robotics task of continuously deforming clay on a pottery wheel. We propose a pipeline for perception and pottery skill-learning, called RoPotter, wherein we demonstrate that structural priors spec",
    "link": "https://arxiv.org/abs/2408.02184",
    "context": "Title: RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with Structural Priors\nAbstract: arXiv:2408.02184v1 Announce Type: new  Abstract: Humans are capable of continuously manipulating a wide variety of deformable objects into complex shapes. This is made possible by our intuitive understanding of material properties and mechanics of the object, for reasoning about object states even when visual perception is occluded. These capabilities allow us to perform diverse tasks ranging from cooking with dough to expressing ourselves with pottery-making. However, developing robotic systems to robustly perform similar tasks remains challenging, as current methods struggle to effectively model volumetric deformable objects and reason about the complex behavior they typically exhibit. To study the robotic systems and algorithms capable of deforming volumetric objects, we introduce a novel robotics task of continuously deforming clay on a pottery wheel. We propose a pipeline for perception and pottery skill-learning, called RoPotter, wherein we demonstrate that structural priors spec",
    "path": "papers/24/08/2408.02184.json",
    "total_tokens": 832,
    "translated_title": "罗波特：基于结构先验的机器人陶艺和柔性物体操作研究",
    "translated_abstract": "arXiv:2408.02184v1 公告类型：新  摘要：人类能够连续地操纵各种各样的柔性物体进入复杂的形状。这要归功于我们对材料特性和物体机械性质的直观理解，即使物体被遮挡也能推理物体的状态。这些能力使我们能够执行从用面食烹饪到用陶艺表达自己的各种任务。然而，开发能够稳健地进行类似任务的机器人系统仍然具有挑战性，因为当前的方法难以有效地建模体积性柔性物体并对它们通常表现出的复杂行为进行推理。为了研究能够变形体积性物体的机器人系统和算法，我们介绍了一个全新的陶艺轮连续变形粘土的任务。我们提出了一种感知和陶艺技能学习的管道，称为RoPotter，我们在其中展示了具有结构先验的系统能够有效地学习和操作陶艺。在这个简单的任务上，神经网络能够快速学习如何操纵泥巴和轮盘的组合，通过观察来自车轮的不同角度的视频捕捉来观察它的行为，我们展示了使用单一视觉和轨迹预测的网络来指导轮盘的运动以获得理想的成品，这样可以在一定程度上减少视觉渗透带来的问题。虽然本研究主要侧重于单网格情况下陶艺的连续状态调整，但我们的方法为未来研究多网格情形下的陶艺连续状态调整提供了一个平台，该情形下机器人可以处理更为复杂并且具有层状变性的物体。通过在基础任务上的持续努力和优化过程，我们对将这种技术与逆向深度感知以及增强学习集成以实现完全自主的机器人陶艺持乐观态度。我们的团队期待着未来可以在更复杂的环境中进一步应用这些方法，并在机器人在陶艺和柔性物体操作方面取得进一步的发现。",
    "tldr": "该论文提出了一种名为RoPotter的管道，用于感知和陶艺技能学习，通过引入陶艺轮持续变形粘土的新任务，展示了结构先验在机器人陶艺中的有效应用。",
    "en_tdlr": "This paper proposes a pipeline called RoPotter for perception and pottery skill learning, showcasing the effective application of structural priors in robotic pottery through the introduction of a novel task of continuously deforming clay on a pottery wheel."
}