{
    "title": "Multi-Unit Floor Plan Recognition and Reconstruction Using Improved Semantic Segmentation of Raster-Wise Floor Plans",
    "abstract": "arXiv:2408.01526v1 Announce Type: new  Abstract: Digital twins have a major potential to form a significant part of urban management in emergency planning, as they allow more efficient designing of the escape routes, better orientation in exceptional situations, and faster rescue intervention. Nevertheless, creating the twins still remains a largely manual effort, due to a lack of 3D-representations, which are available only in limited amounts for some new buildings. Thus, in this paper we aim to synthesize 3D information from commonly available 2D architectural floor plans. We propose two novel pixel-wise segmentation methods based on the MDA-Unet and MACU-Net architectures with improved skip connections, an attention mechanism, and a training objective together with a reconstruction part of the pipeline, which vectorizes the segmented plans to create a 3D model. The proposed methods are compared with two other state-of-the-art techniques and several benchmark datasets. On the commonl",
    "link": "https://arxiv.org/abs/2408.01526",
    "context": "Title: Multi-Unit Floor Plan Recognition and Reconstruction Using Improved Semantic Segmentation of Raster-Wise Floor Plans\nAbstract: arXiv:2408.01526v1 Announce Type: new  Abstract: Digital twins have a major potential to form a significant part of urban management in emergency planning, as they allow more efficient designing of the escape routes, better orientation in exceptional situations, and faster rescue intervention. Nevertheless, creating the twins still remains a largely manual effort, due to a lack of 3D-representations, which are available only in limited amounts for some new buildings. Thus, in this paper we aim to synthesize 3D information from commonly available 2D architectural floor plans. We propose two novel pixel-wise segmentation methods based on the MDA-Unet and MACU-Net architectures with improved skip connections, an attention mechanism, and a training objective together with a reconstruction part of the pipeline, which vectorizes the segmented plans to create a 3D model. The proposed methods are compared with two other state-of-the-art techniques and several benchmark datasets. On the commonl",
    "path": "papers/24/08/2408.01526.json",
    "total_tokens": 468,
    "tldr": "该文章提出了一种基于改进的栅格式楼层平面图语义分割的多单元楼层平面识别与重构方法。通过使用具有改进跳链接、注意力机制和训练目标的多层降维U-Net（MDAU-Net）和多层注意力编码器-解码器网络（MACU-Net）架构，结合楼层平面图矢量化重构流程，成功将2D建筑平面图转换为3D模型。这种方法对于城市管理、紧急规划中的数字双胞胎的创建具有潜在价值，尤其是在形成紧急逃生路线、改善方向感以及加速救援干预方面。此外，其与当前最先进的算法相比，在多个基准数据集上的性能表现更为突出，为3D信息从2D平面图的自动化合成提供了有效的解决方案。"
}