{
    "title": "Is Large Language Model Good at Database Knob Tuning? A Comprehensive Experimental Evaluation",
    "abstract": "arXiv:2408.02213v1 Announce Type: cross  Abstract: Knob tuning plays a crucial role in optimizing databases by adjusting knobs to enhance database performance. However, traditional tuning methods often follow a Try-Collect-Adjust approach, proving inefficient and database-specific. Moreover, these methods are often opaque, making it challenging for DBAs to grasp the underlying decision-making process.   The emergence of large language models (LLMs) like GPT-4 and Claude-3 has excelled in complex natural language tasks, yet their potential in database knob tuning remains largely unexplored. This study harnesses LLMs as experienced DBAs for knob-tuning tasks with carefully designed prompts. We identify three key subtasks in the tuning system: knob pruning, model initialization, and knob recommendation, proposing LLM-driven solutions to replace conventional methods for each subtask.   We conduct extensive experiments to compare LLM-driven approaches against traditional methods across the ",
    "link": "https://arxiv.org/abs/2408.02213",
    "context": "Title: Is Large Language Model Good at Database Knob Tuning? A Comprehensive Experimental Evaluation\nAbstract: arXiv:2408.02213v1 Announce Type: cross  Abstract: Knob tuning plays a crucial role in optimizing databases by adjusting knobs to enhance database performance. However, traditional tuning methods often follow a Try-Collect-Adjust approach, proving inefficient and database-specific. Moreover, these methods are often opaque, making it challenging for DBAs to grasp the underlying decision-making process.   The emergence of large language models (LLMs) like GPT-4 and Claude-3 has excelled in complex natural language tasks, yet their potential in database knob tuning remains largely unexplored. This study harnesses LLMs as experienced DBAs for knob-tuning tasks with carefully designed prompts. We identify three key subtasks in the tuning system: knob pruning, model initialization, and knob recommendation, proposing LLM-driven solutions to replace conventional methods for each subtask.   We conduct extensive experiments to compare LLM-driven approaches against traditional methods across the ",
    "path": "papers/24/08/2408.02213.json",
    "total_tokens": 654,
    "translated_title": "大语言模型能否有效地进行数据库摇杆调整？全面实验评估",
    "translated_abstract": "arXiv:2408.02213v1 公告类型：交叉  摘要：数据库优化通过调整摇杆来增强数据库性能，摇杆调整扮演了重要角色。然而，传统的调整方法大多遵循“尝试-收集-调整”的过程，证明了其低效且特定于数据库。此外，这些方法往往不透明，使得数据库管理员（DBA）难以理解背后的决策过程。  大型语言模型（LLM），如GPT-4和Claude-3，已经在复杂的自然语言任务中表现出色，然而它们在数据库摇杆调整方面的潜力尚未得到充分探索。本研究利用LLM作为有经验的DBA进行摇杆调整任务，通过精心设计的提示。我们识别出系统调谐的三项关键子任务：摇杆修剪、模型初始化和摇杆建议，并对每项子任务提出了LLM驱动的解决方案来取代传统的方法。  我们开展了广泛的实验，将LLM驱动的方法与传统方法在不同数据库系统上的性能进行了比较，并通过实际应用验证了LLM方法的有效性，显示出LLM在数据库调优中的巨大潜力。",
    "tldr": "大语言模型能够有效协助Database管理员对数据库性能进行优化。"
}