{
    "title": "Tensorial template matching for fast cross-correlation with rotations and its application for tomography",
    "abstract": "arXiv:2408.02398v1 Announce Type: new  Abstract: Object detection is a main task in computer vision. Template matching is the reference method for detecting objects with arbitrary templates. However, template matching computational complexity depends on the rotation accuracy, being a limiting factor for large 3D images (tomograms). Here, we implement a new algorithm called tensorial template matching, based on a mathematical framework that represents all rotations of a template with a tensor field. Contrary to standard template matching, the computational complexity of the presented algorithm is independent of the rotation accuracy. Using both, synthetic and real data from tomography, we demonstrate that tensorial template matching is much faster than template matching and has the potential to improve its accuracy",
    "link": "https://arxiv.org/abs/2408.02398",
    "context": "Title: Tensorial template matching for fast cross-correlation with rotations and its application for tomography\nAbstract: arXiv:2408.02398v1 Announce Type: new  Abstract: Object detection is a main task in computer vision. Template matching is the reference method for detecting objects with arbitrary templates. However, template matching computational complexity depends on the rotation accuracy, being a limiting factor for large 3D images (tomograms). Here, we implement a new algorithm called tensorial template matching, based on a mathematical framework that represents all rotations of a template with a tensor field. Contrary to standard template matching, the computational complexity of the presented algorithm is independent of the rotation accuracy. Using both, synthetic and real data from tomography, we demonstrate that tensorial template matching is much faster than template matching and has the potential to improve its accuracy",
    "path": "papers/24/08/2408.02398.json",
    "total_tokens": 512,
    "translated_title": "张量模板匹配算法：快速检测旋转物体在三维成像中的应用",
    "translated_abstract": "本文提出了一种新的算法--张量模板匹配，它基于一种数学框架，该框架能够将物体的旋转通过张量场来表示。与传统的模板匹配方法相比，张量模板匹配的计算复杂度不依赖于旋转精度，这对于处理大量三维图像（断层扫描图像）具有重要意义。使用合成数据和从断层扫描中获取的真实数据，我们证明了张量模板匹配算法显著快于传统模板匹配算法，并且可以提高其检测精度。",
    "tldr": "本文通过张量模板匹配算法大幅提升了在三维图像中检测旋转物体的速度和精度。",
    "en_tdlr": "The paper presents a new algorithm, tensorial template matching, which significantly improves the speed and accuracy of object detection in tomography images by representing all rotations of an object through a tensor field, independent of the rotation accuracy."
}