{
    "title": "CMR-Agent: Learning a Cross-Modal Agent for Iterative Image-to-Point Cloud Registration",
    "abstract": "arXiv:2408.02394v1 Announce Type: cross  Abstract: Image-to-point cloud registration aims to determine the relative camera pose of an RGB image with respect to a point cloud. It plays an important role in camera localization within pre-built LiDAR maps. Despite the modality gaps, most learning-based methods establish 2D-3D point correspondences in feature space without any feedback mechanism for iterative optimization, resulting in poor accuracy and interpretability. In this paper, we propose to reformulate the registration procedure as an iterative Markov decision process, allowing for incremental adjustments to the camera pose based on each intermediate state. To achieve this, we employ reinforcement learning to develop a cross-modal registration agent (CMR-Agent), and use imitation learning to initialize its registration policy for stability and quick-start of the training. According to the cross-modal observations, we propose a 2D-3D hybrid state representation that fully exploits ",
    "link": "https://arxiv.org/abs/2408.02394",
    "context": "Title: CMR-Agent: Learning a Cross-Modal Agent for Iterative Image-to-Point Cloud Registration\nAbstract: arXiv:2408.02394v1 Announce Type: cross  Abstract: Image-to-point cloud registration aims to determine the relative camera pose of an RGB image with respect to a point cloud. It plays an important role in camera localization within pre-built LiDAR maps. Despite the modality gaps, most learning-based methods establish 2D-3D point correspondences in feature space without any feedback mechanism for iterative optimization, resulting in poor accuracy and interpretability. In this paper, we propose to reformulate the registration procedure as an iterative Markov decision process, allowing for incremental adjustments to the camera pose based on each intermediate state. To achieve this, we employ reinforcement learning to develop a cross-modal registration agent (CMR-Agent), and use imitation learning to initialize its registration policy for stability and quick-start of the training. According to the cross-modal observations, we propose a 2D-3D hybrid state representation that fully exploits ",
    "path": "papers/24/08/2408.02394.json",
    "total_tokens": 345,
    "tldr": "该文章提出了一个基于强化学习的跨模态注册代理（CMR-Agent），该代理能够通过迭代马尔可夫决策过程逐步调整相机姿态，从而提高了图像到点云注册的准确性并增强了结果的合理性。"
}