{
    "title": "Additional dimensions of space and time in the region of deep inelastic processes",
    "abstract": "arXiv:2408.02696v1 Announce Type: cross  Abstract: We prove that the well-known Heisenberg uncertainty relations and Landau-Peierls uncertainty relations implicitly contain ``hidden'' angular variables, which belong to new uncertainty relations. Based on the obtained relations, we derive a formula for estimating the speed $U^*$ of a virtual particle in indirect measurements. We applied the theory of indirect measurements and the derived formula to estimate the module of the group velocity of virtual photons from the DIS HERA data. The HERA data indicate that the speed of virtual photons exceeds the speed of light $c$ in free space, $U^*>c$. The properties of virtual photons and a hypothetical tachyon particle are almost identical. It is found that in the realm of particle interaction, the new angular parameters are closely related to the type of the phase-space geometry and dimensionality of the space-time continuum. It is suggested that the problem of the normalization condition $U^* ",
    "link": "https://arxiv.org/abs/2408.02696",
    "context": "Title: Additional dimensions of space and time in the region of deep inelastic processes\nAbstract: arXiv:2408.02696v1 Announce Type: cross  Abstract: We prove that the well-known Heisenberg uncertainty relations and Landau-Peierls uncertainty relations implicitly contain ``hidden'' angular variables, which belong to new uncertainty relations. Based on the obtained relations, we derive a formula for estimating the speed $U^*$ of a virtual particle in indirect measurements. We applied the theory of indirect measurements and the derived formula to estimate the module of the group velocity of virtual photons from the DIS HERA data. The HERA data indicate that the speed of virtual photons exceeds the speed of light $c$ in free space, $U^*>c$. The properties of virtual photons and a hypothetical tachyon particle are almost identical. It is found that in the realm of particle interaction, the new angular parameters are closely related to the type of the phase-space geometry and dimensionality of the space-time continuum. It is suggested that the problem of the normalization condition $U^* ",
    "path": "papers/24/08/2408.02696.json",
    "total_tokens": 456,
    "tldr": "该文章证明在深潜伏性过程区域，海森堡不确定性关系和朗德-佩尔尔斯不确定性关系中隐含存在“隐藏”的角变量，这些变量构成了新的不确定性关系。通过对间接测量理论的研究，文章推测在间接测量中虚拟粒子的速度存在一个估计公式，且应用于HERA实验数据时，发现虚拟光子的速度超过了自由空间中的光速，提出在粒子相互作用的领域，新的角度参数与相位空间的几何形态和时空连续体的维度紧密相关。文章进一步提出了在虚拟粒子速度的研究中存在一种类似类光速粒子的可能性，并提出了一种推测的理论框架来理解这种在时空问题中的极端现象。这项研究为进一步深化对粒子物理标准模型的理解，以及探索量子引力理论下时空结构的性质提供了新的见解。"
}