{
    "title": "NeurDB: On the Design and Implementation of an AI-powered Autonomous Database",
    "abstract": "arXiv:2408.03013v1 Announce Type: cross  Abstract: Databases are increasingly embracing AI to provide autonomous system optimization and intelligent in-database analytics, aiming to relieve end-user burdens across various industry sectors. Nonetheless, most existing approaches fail to account for the dynamic nature of databases, which renders them ineffective for real-world applications characterized by evolving data and workloads. This paper introduces NeurDB, an AI-powered autonomous database that deepens the fusion of AI and databases with adaptability to data and workload drift. NeurDB establishes a new in-database AI ecosystem that seamlessly integrates AI workflows within the database. This integration enables efficient and effective in-database AI analytics and fast-adaptive learned system components. Empirical evaluations demonstrate that NeurDB substantially outperforms existing solutions in managing AI analytics tasks, with the proposed learned components more effectively han",
    "link": "https://arxiv.org/abs/2408.03013",
    "context": "Title: NeurDB: On the Design and Implementation of an AI-powered Autonomous Database\nAbstract: arXiv:2408.03013v1 Announce Type: cross  Abstract: Databases are increasingly embracing AI to provide autonomous system optimization and intelligent in-database analytics, aiming to relieve end-user burdens across various industry sectors. Nonetheless, most existing approaches fail to account for the dynamic nature of databases, which renders them ineffective for real-world applications characterized by evolving data and workloads. This paper introduces NeurDB, an AI-powered autonomous database that deepens the fusion of AI and databases with adaptability to data and workload drift. NeurDB establishes a new in-database AI ecosystem that seamlessly integrates AI workflows within the database. This integration enables efficient and effective in-database AI analytics and fast-adaptive learned system components. Empirical evaluations demonstrate that NeurDB substantially outperforms existing solutions in managing AI analytics tasks, with the proposed learned components more effectively han",
    "path": "papers/24/08/2408.03013.json",
    "total_tokens": 332,
    "tldr": "该文章提出NeurDB，一个融合人工智能的自治数据库，通过在数据库内无缝集成AI工作流程，实现了对数据和工作量变化的快速适应性。这种创新使NeurDB在处理AI数据分析任务时显著优于现有系统，特别是在通过学习构建的组件的性能方面。"
}