{
    "title": "LF-3PM: a LiDAR-based Framework for Perception-aware Planning with Perturbation-induced Metric",
    "abstract": "arXiv:2408.01649v1 Announce Type: new  Abstract: Just as humans can become disoriented in featureless deserts or thick fogs, not all environments are conducive to the Localization Accuracy and Stability (LAS) of autonomous robots. This paper introduces an efficient framework designed to enhance LiDAR-based LAS through strategic trajectory generation, known as Perception-aware Planning. Unlike vision-based frameworks, the LiDAR-based requires different considerations due to unique sensor attributes. Our approach focuses on two main aspects: firstly, assessing the impact of LiDAR observations on LAS. We introduce a perturbation-induced metric to provide a comprehensive and reliable evaluation of LiDAR observations. Secondly, we aim to improve motion planning efficiency. By creating a Static Observation Loss Map (SOLM) as an intermediary, we logically separate the time-intensive evaluation and motion planning phases, significantly boosting the planning process. In the experimental section",
    "link": "https://arxiv.org/abs/2408.01649",
    "context": "Title: LF-3PM: a LiDAR-based Framework for Perception-aware Planning with Perturbation-induced Metric\nAbstract: arXiv:2408.01649v1 Announce Type: new  Abstract: Just as humans can become disoriented in featureless deserts or thick fogs, not all environments are conducive to the Localization Accuracy and Stability (LAS) of autonomous robots. This paper introduces an efficient framework designed to enhance LiDAR-based LAS through strategic trajectory generation, known as Perception-aware Planning. Unlike vision-based frameworks, the LiDAR-based requires different considerations due to unique sensor attributes. Our approach focuses on two main aspects: firstly, assessing the impact of LiDAR observations on LAS. We introduce a perturbation-induced metric to provide a comprehensive and reliable evaluation of LiDAR observations. Secondly, we aim to improve motion planning efficiency. By creating a Static Observation Loss Map (SOLM) as an intermediary, we logically separate the time-intensive evaluation and motion planning phases, significantly boosting the planning process. In the experimental section",
    "path": "papers/24/08/2408.01649.json",
    "total_tokens": 367,
    "tldr": "该文章提出了一个基于LiDAR的感知-感知规划框架LF-3PM，该框架通过创建静态感知损失图（SOLM）和应用扰动诱导度量来优化路径规划和提高感知稳定性，不仅有效提升了自主机器人在不利环境中的定位精度，而且大大加速了规划过程的执行效率。"
}