{
    "title": "Comparison of Embedded Spaces for Deep Learning Classification",
    "abstract": "arXiv:2408.01767v1 Announce Type: cross  Abstract: Embedded spaces are a key feature in deep learning. Good embedded spaces represent the data well to support classification and advanced techniques such as open-set recognition, few-short learning and explainability. This paper presents a compact overview of different techniques to design embedded spaces for classification. It compares different loss functions and constraints on the network parameters with respect to the achievable geometric structure of the embedded space. The techniques are demonstrated with two and three-dimensional embeddings for the MNIST, Fashion MNIST and CIFAR-10 datasets, allowing visual inspection of the embedded spaces.",
    "link": "https://arxiv.org/abs/2408.01767",
    "context": "Title: Comparison of Embedded Spaces for Deep Learning Classification\nAbstract: arXiv:2408.01767v1 Announce Type: cross  Abstract: Embedded spaces are a key feature in deep learning. Good embedded spaces represent the data well to support classification and advanced techniques such as open-set recognition, few-short learning and explainability. This paper presents a compact overview of different techniques to design embedded spaces for classification. It compares different loss functions and constraints on the network parameters with respect to the achievable geometric structure of the embedded space. The techniques are demonstrated with two and three-dimensional embeddings for the MNIST, Fashion MNIST and CIFAR-10 datasets, allowing visual inspection of the embedded spaces.",
    "path": "papers/24/08/2408.01767.json",
    "total_tokens": 486,
    "translated_title": "深度学习分类的不同嵌入空间比较",
    "translated_abstract": "arXiv:2408.01767v1 公告类型：cross  摘要：在深度学习中，嵌入空间是一个关键特性。良好的嵌入空间能有效地表示数据，以支持分类以及诸如开放式识别、小批量学习和可解释性等高级技术。本文提供了一个关于不同技术设计的嵌入空间用于分类的紧凑概述。它根据网络参数的损失函数和约束，对比了不同的嵌入空间的可达几何结构。这些技术在MNIST、Fashion MNIST和CIFAR-10数据集上进行了二维和三维嵌入的演示，允许检查嵌入空间的视觉表现。",
    "tldr": "本文对比了不同嵌入空间技术以设计用于深度学习分类的嵌入空间，提供了两种和三维嵌入技术的展示案例。",
    "en_tdlr": "This paper compares different embedded space techniques for deep learning classification, showcasing examples with two and three-dimensional embeddings."
}