{
    "title": "Robot-Enabled Machine Learning-Based Diagnosis of Gastric Cancer Polyps Using Partial Surface Tactile Imaging",
    "abstract": "arXiv:2408.01554v1 Announce Type: cross  Abstract: In this paper, to collectively address the existing limitations on endoscopic diagnosis of Advanced Gastric Cancer (AGC) Tumors, for the first time, we propose (i) utilization and evaluation of our recently developed Vision-based Tactile Sensor (VTS), and (ii) a complementary Machine Learning (ML) algorithm for classifying tumors using their textural features. Leveraging a seven DoF robotic manipulator and unique custom-designed and additively-manufactured realistic AGC tumor phantoms, we demonstrated the advantages of automated data collection using the VTS addressing the problem of data scarcity and biases encountered in traditional ML-based approaches. Our synthetic-data-trained ML model was successfully evaluated and compared with traditional ML models utilizing various statistical metrics even under mixed morphological characteristics and partial sensor contact.",
    "link": "https://arxiv.org/abs/2408.01554",
    "context": "Title: Robot-Enabled Machine Learning-Based Diagnosis of Gastric Cancer Polyps Using Partial Surface Tactile Imaging\nAbstract: arXiv:2408.01554v1 Announce Type: cross  Abstract: In this paper, to collectively address the existing limitations on endoscopic diagnosis of Advanced Gastric Cancer (AGC) Tumors, for the first time, we propose (i) utilization and evaluation of our recently developed Vision-based Tactile Sensor (VTS), and (ii) a complementary Machine Learning (ML) algorithm for classifying tumors using their textural features. Leveraging a seven DoF robotic manipulator and unique custom-designed and additively-manufactured realistic AGC tumor phantoms, we demonstrated the advantages of automated data collection using the VTS addressing the problem of data scarcity and biases encountered in traditional ML-based approaches. Our synthetic-data-trained ML model was successfully evaluated and compared with traditional ML models utilizing various statistical metrics even under mixed morphological characteristics and partial sensor contact.",
    "path": "papers/24/08/2408.01554.json",
    "total_tokens": 627,
    "translated_title": "使用部分表面触觉成像的机器人赋能机器学习方法诊断胃息肉的诊断",
    "translated_abstract": "本文旨在共同解决高级胃癌肿瘤的消化道诊断中的现有限制。首次，我们提出（i）使用并评估我们最近开发的光学触觉传感器（VTS），以及（ii）使用它们的纹理特征的补充机器学习（ML）算法进行分类。利用一个七自由度（DoF）的机器人机械手和独特的自定义设计并通过增材制造的方法制成的假肿瘤，我们证明了使用VTS进行数据自动收集的优势，解决了传统机器学习（ML）方法中遇到的稀缺数据和偏见问题。我们的合成数据训练的ML模型在混合形态特征和传感器不完全接触下的评估中也成功地进行了比较，并与使用各种统计指标的传统ML模型进行了比较。",
    "tldr": "该研究提出使用新型光学触觉传感器和机器学习算法，结合七自由度机器人和个性化、增材制造的胃癌肿瘤假体，进行胃息肉诊断。"
}