{
    "title": "Multiple Contexts and Frequencies Aggregation Network forDeepfake Detection",
    "abstract": "arXiv:2408.01668v1 Announce Type: new  Abstract: Deepfake detection faces increasing challenges since the fast growth of generative models in developing massive and diverse Deepfake technologies. Recent advances rely on introducing heuristic features from spatial or frequency domains rather than modeling general forgery features within backbones. To address this issue, we turn to the backbone design with two intuitive priors from spatial and frequency detectors, \\textit{i.e.,} learning robust spatial attributes and frequency distributions that are discriminative for real and fake samples. To this end, we propose an efficient network for face forgery detection named MkfaNet, which consists of two core modules. For spatial contexts, we design a Multi-Kernel Aggregator that adaptively selects organ features extracted by multiple convolutions for modeling subtle facial differences between real and fake faces. For the frequency components, we propose a Multi-Frequency Aggregator to process ",
    "link": "https://arxiv.org/abs/2408.01668",
    "context": "Title: Multiple Contexts and Frequencies Aggregation Network forDeepfake Detection\nAbstract: arXiv:2408.01668v1 Announce Type: new  Abstract: Deepfake detection faces increasing challenges since the fast growth of generative models in developing massive and diverse Deepfake technologies. Recent advances rely on introducing heuristic features from spatial or frequency domains rather than modeling general forgery features within backbones. To address this issue, we turn to the backbone design with two intuitive priors from spatial and frequency detectors, \\textit{i.e.,} learning robust spatial attributes and frequency distributions that are discriminative for real and fake samples. To this end, we propose an efficient network for face forgery detection named MkfaNet, which consists of two core modules. For spatial contexts, we design a Multi-Kernel Aggregator that adaptively selects organ features extracted by multiple convolutions for modeling subtle facial differences between real and fake faces. For the frequency components, we propose a Multi-Frequency Aggregator to process ",
    "path": "papers/24/08/2408.01668.json",
    "total_tokens": 371,
    "tldr": "该文章提出了一种名为MkfaNet的深度学习网络，它可以高效地检测伪造视频中的“deepfake”技术。该网络通过两个核心模块来工作：一是通过多核聚合器适应性地选取不同卷积提取的器官特征来建模真实与伪造面部之间的微妙差异，二是通过多频率聚合器处理高频成分，从而使得网络能够识别出视频中的伪造痕迹，提高了deepfake检测的准确性。"
}