{
    "title": "Multi-weather Cross-view Geo-localization Using Denoising Diffusion Models",
    "abstract": "arXiv:2408.02408v1 Announce Type: new  Abstract: Cross-view geo-localization in GNSS-denied environments aims to determine an unknown location by matching drone-view images with the correct geo-tagged satellite-view images from a large gallery. Recent research shows that learning discriminative image representations under specific weather conditions can significantly enhance performance. However, the frequent occurrence of unseen extreme weather conditions hinders progress. This paper introduces MCGF, a Multi-weather Cross-view Geo-localization Framework designed to dynamically adapt to unseen weather conditions. MCGF establishes a joint optimization between image restoration and geo-localization using denoising diffusion models. For image restoration, MCGF incorporates a shared encoder and a lightweight restoration module to help the backbone eliminate weather-specific information. For geo-localization, MCGF uses EVA-02 as a backbone for feature extraction, with cross-entropy loss for",
    "link": "https://arxiv.org/abs/2408.02408",
    "context": "Title: Multi-weather Cross-view Geo-localization Using Denoising Diffusion Models\nAbstract: arXiv:2408.02408v1 Announce Type: new  Abstract: Cross-view geo-localization in GNSS-denied environments aims to determine an unknown location by matching drone-view images with the correct geo-tagged satellite-view images from a large gallery. Recent research shows that learning discriminative image representations under specific weather conditions can significantly enhance performance. However, the frequent occurrence of unseen extreme weather conditions hinders progress. This paper introduces MCGF, a Multi-weather Cross-view Geo-localization Framework designed to dynamically adapt to unseen weather conditions. MCGF establishes a joint optimization between image restoration and geo-localization using denoising diffusion models. For image restoration, MCGF incorporates a shared encoder and a lightweight restoration module to help the backbone eliminate weather-specific information. For geo-localization, MCGF uses EVA-02 as a backbone for feature extraction, with cross-entropy loss for",
    "path": "papers/24/08/2408.02408.json",
    "total_tokens": 654,
    "translated_title": "使用去噪扩散模型进行多天气跨视角地理定位",
    "translated_abstract": "arXiv:2408.02408v1 公告类型: 新 Abstract: 跨视角地理定位在无GNSS信号的环境中旨在通过匹配无人机拍摄的图像与大量带有地理标签的卫星图像来确定未知位置。最近的研究表明，在特定天气条件下学习区分性图像表示可以显著提高性能。然而，不常见极端天气条件的频繁出现阻碍了进步。本文介绍了一个名为MCGF的多天气跨视角地理定位框架，它旨在使用去噪扩散模型动态适应未知天气条件。MCGF为图像恢复和地理定位建立了联合优化。为了图像恢复，MCGF引入了一个共享编码器和轻量级去噪模块来帮助主干消除与特定天气有关的信息。对于地理定位，MCGF使用EVA-02作为主干来提取特征，并使用交叉熵损失进行定位和天气调整。",
    "tldr": "论文提出 MCGF 多天气跨视角地理定位框架，通过使用去噪扩散模型动态适应未知天气条件，并采用联合优化方法提升跨视角地理定位的准确性。",
    "en_tdlr": "The paper introduces MCGF, a Multi-weather Cross-view Geo-localization Framework that uses denoising diffusion models to adapt to unknown weather conditions, and implements a joint optimization method to enhance the accuracy of cross-view geo-localization."
}