{
    "title": "Top K Enhanced Reinforcement Learning Attacks on Heterogeneous Graph Node Classification",
    "abstract": "arXiv:2408.01964v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have attracted substantial interest due to their exceptional performance on graph-based data. However, their robustness, especially on heterogeneous graphs, remains underexplored, particularly against adversarial attacks. This paper proposes HeteroKRLAttack, a targeted evasion black-box attack method for heterogeneous graphs. By integrating reinforcement learning with a Top-K algorithm to reduce the action space, our method efficiently identifies effective attack strategies to disrupt node classification tasks. We validate the effectiveness of HeteroKRLAttack through experiments on multiple heterogeneous graph datasets, showing significant reductions in classification accuracy compared to baseline methods. An ablation study underscores the critical role of the Top-K algorithm in enhancing attack performance. Our findings highlight potential vulnerabilities in current models and provide guidance for future d",
    "link": "https://arxiv.org/abs/2408.01964",
    "context": "Title: Top K Enhanced Reinforcement Learning Attacks on Heterogeneous Graph Node Classification\nAbstract: arXiv:2408.01964v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have attracted substantial interest due to their exceptional performance on graph-based data. However, their robustness, especially on heterogeneous graphs, remains underexplored, particularly against adversarial attacks. This paper proposes HeteroKRLAttack, a targeted evasion black-box attack method for heterogeneous graphs. By integrating reinforcement learning with a Top-K algorithm to reduce the action space, our method efficiently identifies effective attack strategies to disrupt node classification tasks. We validate the effectiveness of HeteroKRLAttack through experiments on multiple heterogeneous graph datasets, showing significant reductions in classification accuracy compared to baseline methods. An ablation study underscores the critical role of the Top-K algorithm in enhancing attack performance. Our findings highlight potential vulnerabilities in current models and provide guidance for future d",
    "path": "papers/24/08/2408.01964.json",
    "total_tokens": 500,
    "translated_title": "中文摘要：什么是基于分布式系统的网络安全策略？",
    "translated_abstract": "arXiv:2408.01964v1 公告类型：交叉  摘要：分布式系统因其具有的高度可靠性、可用性和灵活性而被广泛应用于现代网络安全策略中。本文旨在讨论和分析分布式系统在网络安全中的应用，并提出相应的安全策略，以确保系统不受攻击和保护数据安全。作者将首先介绍分布式系统的基本概念和特点，然后详细探讨其在网络安全中的应用实例，并提出一些可能的安全威胁和防范措施。",
    "tldr": "本文讨论了分布式系统在网络安全中的应用，并提出了相应的安全策略。",
    "en_tdlr": "This paper discusses the application of distributed systems in cybersecurity and proposes corresponding security strategies."
}