{
    "title": "Amodal Segmentation for Laparoscopic Surgery Video Instruments",
    "abstract": "arXiv:2408.01067v1 Announce Type: new  Abstract: Segmentation of surgical instruments is crucial for enhancing surgeon performance and ensuring patient safety. Conventional techniques such as binary, semantic, and instance segmentation share a common drawback: they do not accommodate the parts of instruments obscured by tissues or other instruments. Precisely predicting the full extent of these occluded instruments can significantly improve laparoscopic surgeries by providing critical guidance during operations and assisting in the analysis of potential surgical errors, as well as serving educational purposes. In this paper, we introduce Amodal Segmentation to the realm of surgical instruments in the medical field. This technique identifies both the visible and occluded parts of an object. To achieve this, we introduce a new Amoal Instruments Segmentation (AIS) dataset, which was developed by reannotating each instrument with its complete mask, utilizing the 2017 MICCAI EndoVis Robotic",
    "link": "https://arxiv.org/abs/2408.01067",
    "context": "Title: Amodal Segmentation for Laparoscopic Surgery Video Instruments\nAbstract: arXiv:2408.01067v1 Announce Type: new  Abstract: Segmentation of surgical instruments is crucial for enhancing surgeon performance and ensuring patient safety. Conventional techniques such as binary, semantic, and instance segmentation share a common drawback: they do not accommodate the parts of instruments obscured by tissues or other instruments. Precisely predicting the full extent of these occluded instruments can significantly improve laparoscopic surgeries by providing critical guidance during operations and assisting in the analysis of potential surgical errors, as well as serving educational purposes. In this paper, we introduce Amodal Segmentation to the realm of surgical instruments in the medical field. This technique identifies both the visible and occluded parts of an object. To achieve this, we introduce a new Amoal Instruments Segmentation (AIS) dataset, which was developed by reannotating each instrument with its complete mask, utilizing the 2017 MICCAI EndoVis Robotic",
    "path": "papers/24/08/2408.01067.json",
    "total_tokens": 634,
    "translated_title": "跨模态分割法在腹腔镜手术视频中的应用",
    "translated_abstract": "arXiv:2408.01067v1 公告类型：新 Abstract: 分割手术器械对于提高手术质量并确保患者安全至关重要。像二值、语义和实例分割这样的传统方法都有共同的问题：它们不能处理那些被组织或其它器械遮挡的器械部分。精确预测这些遮挡部分的全貌可以在多个方面显著提高腹腔镜手术，包括在手术过程中提供关键的指导、协助分析潜在的手术错误以及为教育目的提供服务。在本文中，我们将跨模态分割技术引入到医疗领域中的手术器械识别领域。这项技术能够识别物体的可见和遮挡部分。为了实现这一点，我们引入了一个新的跨模态器具分割（AIS）数据集，该数据集通过重新注释每个器械的全貌，利用了2017年MICCAI EndoVis Robotic手术视频。",
    "tldr": "本文提出了一种跨模态分割技术，可以识别出腹腔镜手术中器械的完整遮挡部分，提高了手术质量和安全性。",
    "en_tdlr": "This paper presents a technique for amodal segmentation, allowing for the accurate identification of the full occluded parts of surgical instruments in laparoscopic surgery, enhancing both surgical quality and patient safety."
}