{
    "title": "Advancing Green AI: Efficient and Accurate Lightweight CNNs for Rice Leaf Disease Identification",
    "abstract": "arXiv:2408.01752v1 Announce Type: new  Abstract: Rice plays a vital role as a primary food source for over half of the world's population, and its production is critical for global food security. Nevertheless, rice cultivation is frequently affected by various diseases that can severely decrease yield and quality. Therefore, early and accurate detection of rice diseases is necessary to prevent their spread and minimize crop losses. In this research, we explore three mobile-compatible CNN architectures, namely ShuffleNet, MobileNetV2, and EfficientNet-B0, for rice leaf disease classification. These models are selected due to their compatibility with mobile devices, as they demand less computational power and memory compared to other CNN models. To enhance the performance of the three models, we added two fully connected layers separated by a dropout layer. We used early stop creation to prevent the model from being overfiting. The results of the study showed that the best performance wa",
    "link": "https://arxiv.org/abs/2408.01752",
    "context": "Title: Advancing Green AI: Efficient and Accurate Lightweight CNNs for Rice Leaf Disease Identification\nAbstract: arXiv:2408.01752v1 Announce Type: new  Abstract: Rice plays a vital role as a primary food source for over half of the world's population, and its production is critical for global food security. Nevertheless, rice cultivation is frequently affected by various diseases that can severely decrease yield and quality. Therefore, early and accurate detection of rice diseases is necessary to prevent their spread and minimize crop losses. In this research, we explore three mobile-compatible CNN architectures, namely ShuffleNet, MobileNetV2, and EfficientNet-B0, for rice leaf disease classification. These models are selected due to their compatibility with mobile devices, as they demand less computational power and memory compared to other CNN models. To enhance the performance of the three models, we added two fully connected layers separated by a dropout layer. We used early stop creation to prevent the model from being overfiting. The results of the study showed that the best performance wa",
    "path": "papers/24/08/2408.01752.json",
    "total_tokens": 367,
    "tldr": "该文章提出了三种适用于移动设备的轻量级卷积神经网络架构——ShuffleNet、MobileNetV2和EfficientNet-B0——用于精确识别和诊断水稻叶片疾病，这些模型能有效减少计算资源消耗，并且通过添加全连接层和使用早停策略，显著提高了模型的准确率，为全球粮食安全做出了重要贡献。"
}