{
    "title": "Automatic rating of incomplete hippocampal inversions evaluated across multiple cohorts",
    "abstract": "arXiv:2408.02496v1 Announce Type: cross  Abstract: Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal malrotation, is an atypical anatomical pattern of the hippocampus found in about 20% of the general population. IHI can be visually assessed on coronal slices of T1 weighted MR images, using a composite score that combines four anatomical criteria. IHI has been associated with several brain disorders (epilepsy, schizophrenia). However, these studies were based on small samples. Furthermore, the factors (genetic or environmental) that contribute to the genesis of IHI are largely unknown. Large-scale studies are thus needed to further understand IHI and their potential relationships to neurological and psychiatric disorders. However, visual evaluation is long and tedious, justifying the need for an automatic method. In this paper, we propose, for the first time, to automatically rate IHI. We proceed by predicting four anatomical criteria, which are then summed up to for",
    "link": "https://arxiv.org/abs/2408.02496",
    "context": "Title: Automatic rating of incomplete hippocampal inversions evaluated across multiple cohorts\nAbstract: arXiv:2408.02496v1 Announce Type: cross  Abstract: Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal malrotation, is an atypical anatomical pattern of the hippocampus found in about 20% of the general population. IHI can be visually assessed on coronal slices of T1 weighted MR images, using a composite score that combines four anatomical criteria. IHI has been associated with several brain disorders (epilepsy, schizophrenia). However, these studies were based on small samples. Furthermore, the factors (genetic or environmental) that contribute to the genesis of IHI are largely unknown. Large-scale studies are thus needed to further understand IHI and their potential relationships to neurological and psychiatric disorders. However, visual evaluation is long and tedious, justifying the need for an automatic method. In this paper, we propose, for the first time, to automatically rate IHI. We proceed by predicting four anatomical criteria, which are then summed up to for",
    "path": "papers/24/08/2408.02496.json",
    "total_tokens": 359,
    "tldr": "该文章提出了一种自动评估不完全海马反转（IHI）的方法。通过预测四个解剖学特征，该方法能够自动对海马反转程度进行评分，从而减轻手动评估的繁琐性，提高大规模研究的效率。"
}