{
    "title": "Accelerating Domain-Aware Electron Microscopy Analysis Using Deep Learning Models with Synthetic Data and Image-Wide Confidence Scoring",
    "abstract": "arXiv:2408.01558v1 Announce Type: new  Abstract: The integration of machine learning (ML) models enhances the efficiency, affordability, and reliability of feature detection in microscopy, yet their development and applicability are hindered by the dependency on scarce and often flawed manually labeled datasets and a lack of domain awareness. We addressed these challenges by creating a physics-based synthetic image and data generator, resulting in a machine learning model that achieves comparable precision (0.86), recall (0.63), F1 scores (0.71), and engineering property predictions (R2=0.82) to a model trained on human-labeled data. We enhanced both models by using feature prediction confidence scores to derive an image-wide confidence metric, enabling simple thresholding to eliminate ambiguous and out-of-domain images resulting in performance boosts of 5-30% with a filtering-out rate of 25%. Our study demonstrates that synthetic data can eliminate human reliance in ML and provides a ",
    "link": "https://arxiv.org/abs/2408.01558",
    "context": "Title: Accelerating Domain-Aware Electron Microscopy Analysis Using Deep Learning Models with Synthetic Data and Image-Wide Confidence Scoring\nAbstract: arXiv:2408.01558v1 Announce Type: new  Abstract: The integration of machine learning (ML) models enhances the efficiency, affordability, and reliability of feature detection in microscopy, yet their development and applicability are hindered by the dependency on scarce and often flawed manually labeled datasets and a lack of domain awareness. We addressed these challenges by creating a physics-based synthetic image and data generator, resulting in a machine learning model that achieves comparable precision (0.86), recall (0.63), F1 scores (0.71), and engineering property predictions (R2=0.82) to a model trained on human-labeled data. We enhanced both models by using feature prediction confidence scores to derive an image-wide confidence metric, enabling simple thresholding to eliminate ambiguous and out-of-domain images resulting in performance boosts of 5-30% with a filtering-out rate of 25%. Our study demonstrates that synthetic data can eliminate human reliance in ML and provides a ",
    "path": "papers/24/08/2408.01558.json",
    "total_tokens": 411,
    "tldr": "该文章研究了一种通过使用合成数据和基于图像的全局置信度评分来加速基于域意识的电子显微镜分析的方法。通过创建一个基于物理图像和数据的模拟器，研究者开发了一个深度学习模型，它在性能上与使用人工标注数据训练的同类模型相当，并能够通过使用特征预测的置信度分数来提高图像的全局置信度，从而提高了性能并降低了人为数据的需求。"
}