{
    "title": "MaFreeI2P: A Matching-Free Image-to-Point Cloud Registration Paradigm with Active Camera Pose Retrieval",
    "abstract": "arXiv:2408.02392v1 Announce Type: new  Abstract: Image-to-point cloud registration seeks to estimate their relative camera pose, which remains an open question due to the data modality gaps. The recent matching-based methods tend to tackle this by building 2D-3D correspondences. In this paper, we reveal the information loss inherent in these methods and propose a matching-free paradigm, named MaFreeI2P. Our key insight is to actively retrieve the camera pose in SE(3) space by contrasting the geometric features between the point cloud and the query image. To achieve this, we first sample a set of candidate camera poses and construct their cost volume using the cross-modal features. Superior to matching, cost volume can preserve more information and its feature similarity implicitly reflects the confidence level of the sampled poses. Afterwards, we employ a convolutional network to adaptively formulate a similarity assessment function, where the input cost volume is further improved by f",
    "link": "https://arxiv.org/abs/2408.02392",
    "context": "Title: MaFreeI2P: A Matching-Free Image-to-Point Cloud Registration Paradigm with Active Camera Pose Retrieval\nAbstract: arXiv:2408.02392v1 Announce Type: new  Abstract: Image-to-point cloud registration seeks to estimate their relative camera pose, which remains an open question due to the data modality gaps. The recent matching-based methods tend to tackle this by building 2D-3D correspondences. In this paper, we reveal the information loss inherent in these methods and propose a matching-free paradigm, named MaFreeI2P. Our key insight is to actively retrieve the camera pose in SE(3) space by contrasting the geometric features between the point cloud and the query image. To achieve this, we first sample a set of candidate camera poses and construct their cost volume using the cross-modal features. Superior to matching, cost volume can preserve more information and its feature similarity implicitly reflects the confidence level of the sampled poses. Afterwards, we employ a convolutional network to adaptively formulate a similarity assessment function, where the input cost volume is further improved by f",
    "path": "papers/24/08/2408.02392.json",
    "total_tokens": 401,
    "tldr": "该文章提出了一种名为MaFreeI2P的无匹配图像到点云注册方法，该方法通过主动检索相机姿态来解决两者之间的数据模式差异。通过对比点云和查询图像的几何特征，该方法能够在SE(3)空间中精确地确定相机位置。通过采样一系列候选相机姿态并构建成本体积，成本体积利用跨模态特征，从而保留更多信息并且通过相似性评估函数，该方法能够更准确地评估相机姿态的可靠性。"
}