{
    "title": "A dual-task mutual learning framework for predicting post-thrombectomy cerebral hemorrhage",
    "abstract": "arXiv:2408.00940v1 Announce Type: cross  Abstract: Ischemic stroke is a severe condition caused by the blockage of brain blood vessels, and can lead to the death of brain tissue due to oxygen deprivation. Thrombectomy has become a common treatment choice for ischemic stroke due to its immediate effectiveness. But, it carries the risk of postoperative cerebral hemorrhage. Clinically, multiple CT scans within 0-72 hours post-surgery are used to monitor for hemorrhage. However, this approach exposes radiation dose to patients, and may delay the detection of cerebral hemorrhage. To address this dilemma, we propose a novel prediction framework for measuring postoperative cerebral hemorrhage using only the patient's initial CT scan. Specifically, we introduce a dual-task mutual learning framework to takes the initial CT scan as input and simultaneously estimates both the follow-up CT scan and prognostic label to predict the occurrence of postoperative cerebral hemorrhage. Our proposed framew",
    "link": "https://arxiv.org/abs/2408.00940",
    "context": "Title: A dual-task mutual learning framework for predicting post-thrombectomy cerebral hemorrhage\nAbstract: arXiv:2408.00940v1 Announce Type: cross  Abstract: Ischemic stroke is a severe condition caused by the blockage of brain blood vessels, and can lead to the death of brain tissue due to oxygen deprivation. Thrombectomy has become a common treatment choice for ischemic stroke due to its immediate effectiveness. But, it carries the risk of postoperative cerebral hemorrhage. Clinically, multiple CT scans within 0-72 hours post-surgery are used to monitor for hemorrhage. However, this approach exposes radiation dose to patients, and may delay the detection of cerebral hemorrhage. To address this dilemma, we propose a novel prediction framework for measuring postoperative cerebral hemorrhage using only the patient's initial CT scan. Specifically, we introduce a dual-task mutual learning framework to takes the initial CT scan as input and simultaneously estimates both the follow-up CT scan and prognostic label to predict the occurrence of postoperative cerebral hemorrhage. Our proposed framew",
    "path": "papers/24/08/2408.00940.json",
    "total_tokens": 724,
    "translated_title": "双任务互惠学习框架用于预测血栓切除术后脑出血",
    "translated_abstract": "梗死性卒中有可能导致脑组织缺氧死亡。血栓切除术因其即时效用已成为治疗梗死性卒中的常用选择。然而，血栓切除术存在术后脑出血的风险。在临床上，术后0至72小时内的多次CT扫描用于监测脑出血。然而，这种方法增加了患者的辐射剂量，并可能导致脑出血检测延迟。为了解决这一难题，我们提出了一个仅使用患者初始CT扫描预测术后脑出血的预测框架。特别是，我们引入了一种双任务互惠学习框架，该框架以初始CT扫描为输入，同时估计后续CT扫描和预测标签，以预测术后脑出血的发生。我们提出的框架通过结合多模态数据的互补信息，以及通过自监督学习机制预测病变的发展，提高了预测的准确性。我们的模型不仅可以预测术后CT图像中的出血情况，还可以预测脑损伤程度和不稳定的可能性，这对于提高术后监测的精确性具有重要意义。",
    "tldr": "本文提出了一种双任务互惠学习框架，用于仅基于患者的初始CT扫描预测血栓切除术后的脑出血。该框架结合多模态数据的互补信息，并通过自监督学习机制提高预测准确性，具有重要的临床意义。"
}