{
    "title": "Building Machines that Learn and Think with People",
    "abstract": "arXiv:2408.03943v1 Announce Type: cross  Abstract: What do we want from machine intelligence? We envision machines that are not just tools for thought, but partners in thought: reasonable, insightful, knowledgeable, reliable, and trustworthy systems that think with us. Current artificial intelligence (AI) systems satisfy some of these criteria, some of the time. In this Perspective, we show how the science of collaborative cognition can be put to work to engineer systems that really can be called ``thought partners,'' systems built to meet our expectations and complement our limitations. We lay out several modes of collaborative thought in which humans and AI thought partners can engage and propose desiderata for human-compatible thought partnerships. Drawing on motifs from computational cognitive science, we motivate an alternative scaling path for the design of thought partners and ecosystems around their use through a Bayesian lens, whereby the partners we construct actively build a",
    "link": "https://arxiv.org/abs/2408.03943",
    "context": "Title: Building Machines that Learn and Think with People\nAbstract: arXiv:2408.03943v1 Announce Type: cross  Abstract: What do we want from machine intelligence? We envision machines that are not just tools for thought, but partners in thought: reasonable, insightful, knowledgeable, reliable, and trustworthy systems that think with us. Current artificial intelligence (AI) systems satisfy some of these criteria, some of the time. In this Perspective, we show how the science of collaborative cognition can be put to work to engineer systems that really can be called ``thought partners,'' systems built to meet our expectations and complement our limitations. We lay out several modes of collaborative thought in which humans and AI thought partners can engage and propose desiderata for human-compatible thought partnerships. Drawing on motifs from computational cognitive science, we motivate an alternative scaling path for the design of thought partners and ecosystems around their use through a Bayesian lens, whereby the partners we construct actively build a",
    "path": "papers/24/08/2408.03943.json",
    "total_tokens": 371,
    "tldr": "该文章提出了构建能够与人协作思考的机器，旨在让机器不仅仅是思考的工具，而是与人共同思考的伙伴。这种伙伴式的思考关系要求机器满足合理性、洞察力、知识性、可靠性和信任度等多方面要求。文章提出了一系列人类与机器伙伴协作思考的模式，并提出了人机兼容的思考伙伴应具备的要素。同时，文章还介绍了通过贝叶斯视角和计算认知科学的一些理念来设计和构建这样的伙伴机器的新设计路径。"
}