{
    "title": "Re-ENACT: Reinforcement Learning for Emotional Speech Generation using Actor-Critic Strategy",
    "abstract": "arXiv:2408.01892v1 Announce Type: cross  Abstract: In this paper, we propose the first method to modify the prosodic features of a given speech signal using actor-critic reinforcement learning strategy. Our approach uses a Bayesian framework to identify contiguous segments of importance that links segments of the given utterances to perception of emotions in humans. We train a neural network to produce the variational posterior of a collection of Bernoulli random variables; our model applies a Markov prior on it to ensure continuity. A sample from this distribution is used for downstream emotion prediction. Further, we train the neural network to predict a soft assignment over emotion categories as the target variable. In the next step, we modify the prosodic features (pitch, intensity, and rhythm) of the masked segment to increase the score of target emotion. We employ an actor-critic reinforcement learning to train the prosody modifier by discretizing the space of modifications. Furt",
    "link": "https://arxiv.org/abs/2408.01892",
    "context": "Title: Re-ENACT: Reinforcement Learning for Emotional Speech Generation using Actor-Critic Strategy\nAbstract: arXiv:2408.01892v1 Announce Type: cross  Abstract: In this paper, we propose the first method to modify the prosodic features of a given speech signal using actor-critic reinforcement learning strategy. Our approach uses a Bayesian framework to identify contiguous segments of importance that links segments of the given utterances to perception of emotions in humans. We train a neural network to produce the variational posterior of a collection of Bernoulli random variables; our model applies a Markov prior on it to ensure continuity. A sample from this distribution is used for downstream emotion prediction. Further, we train the neural network to predict a soft assignment over emotion categories as the target variable. In the next step, we modify the prosodic features (pitch, intensity, and rhythm) of the masked segment to increase the score of target emotion. We employ an actor-critic reinforcement learning to train the prosody modifier by discretizing the space of modifications. Furt",
    "path": "papers/24/08/2408.01892.json",
    "total_tokens": 405,
    "tldr": "该文章提出了一种使用演员-批评者策略的强化学习方法，以修改给定语音信号的调值特征，并使用贝叶斯框架来识别重要性相关的连续段，以链接到人类的情感感知。这种方法通过训练一个神经网络产生一组二项分布随机变量的变分后验，并应用一个马尔科夫先验以确保连续性，从而预测情感类别。通过修改被遮挡部分的调值特征来提高目标情感的评分，该方法还通过将修改的空间进行离散化来训练一个演员-批评者强化学习模型。"
}