{
    "title": "Dual-View Pyramid Pooling in Deep Neural Networks for Improved Medical Image Classification and Confidence Calibration",
    "abstract": "arXiv:2408.02906v1 Announce Type: new  Abstract: Spatial pooling (SP) and cross-channel pooling (CCP) operators have been applied to aggregate spatial features and pixel-wise features from feature maps in deep neural networks (DNNs), respectively. Their main goal is to reduce computation and memory overhead without visibly weakening the performance of DNNs. However, SP often faces the problem of losing the subtle feature representations, while CCP has a high possibility of ignoring salient feature representations, which may lead to both miscalibration of confidence issues and suboptimal medical classification results. To address these problems, we propose a novel dual-view framework, the first to systematically investigate the relative roles of SP and CCP by analyzing the difference between spatial features and pixel-wise features. Based on this framework, we propose a new pooling method, termed dual-view pyramid pooling (DVPP), to aggregate multi-scale dual-view features. DVPP aims to",
    "link": "https://arxiv.org/abs/2408.02906",
    "context": "Title: Dual-View Pyramid Pooling in Deep Neural Networks for Improved Medical Image Classification and Confidence Calibration\nAbstract: arXiv:2408.02906v1 Announce Type: new  Abstract: Spatial pooling (SP) and cross-channel pooling (CCP) operators have been applied to aggregate spatial features and pixel-wise features from feature maps in deep neural networks (DNNs), respectively. Their main goal is to reduce computation and memory overhead without visibly weakening the performance of DNNs. However, SP often faces the problem of losing the subtle feature representations, while CCP has a high possibility of ignoring salient feature representations, which may lead to both miscalibration of confidence issues and suboptimal medical classification results. To address these problems, we propose a novel dual-view framework, the first to systematically investigate the relative roles of SP and CCP by analyzing the difference between spatial features and pixel-wise features. Based on this framework, we propose a new pooling method, termed dual-view pyramid pooling (DVPP), to aggregate multi-scale dual-view features. DVPP aims to",
    "path": "papers/24/08/2408.02906.json",
    "total_tokens": 397,
    "tldr": "该文章提出了一个名为“双视图金字塔池化”（Dual-View Pyramid Pooling，DVPP）的方法，旨在对深度神经网络中的空间特征和像素级特征进行全面的聚合，以提高医学图像分类的准确性并校准分类器的信心。通过分析空间特征和像素级特征的区别，该研究来解决传统池化方法在特征表达和分类精度上存在的问题，从而提供更好的医学图像分类结果。"
}