{
    "title": "Comparative Evaluation of the Proximate and Cytogenotoxicity of Ash and Rice Chips Used as Mango Fruit Artificial Ripening Agents in Birnin Kebbi, Nigeria",
    "abstract": "arXiv:2408.01425v1 Announce Type: new  Abstract: The high demand for mango (Mangifera indica L.) fruits has led sellers to employ ripening agents. However, concerns are growing regarding the potential toxicities of induced ripening, emphasizing the need for scientific investigation. Samples of artificially and naturally ripened mangoes were analyzed for proximate composition using standard protocols. Cytogenotoxicity was then assessed using the Allium cepa L. toxicity test. Twenty (20)A. cepa (onion) bulbs were used, with 5 ripened naturally, 5 with wood ash, 5 with herbaceous ash, and 5 with rice chips, all grown over tap water for five days. The root tips of the bulbs were assayed and examined for chromosomal aberrations. The results revealed a significant (P<0.05) increase in moisture, protein, and ash content of mangoes as ripening agents were introduced. Mangoes ripened with wood ash exhibited the highest moisture content (81%), while those ripened with rice chips had the highest ",
    "link": "https://arxiv.org/abs/2408.01425",
    "context": "Title: Comparative Evaluation of the Proximate and Cytogenotoxicity of Ash and Rice Chips Used as Mango Fruit Artificial Ripening Agents in Birnin Kebbi, Nigeria\nAbstract: arXiv:2408.01425v1 Announce Type: new  Abstract: The high demand for mango (Mangifera indica L.) fruits has led sellers to employ ripening agents. However, concerns are growing regarding the potential toxicities of induced ripening, emphasizing the need for scientific investigation. Samples of artificially and naturally ripened mangoes were analyzed for proximate composition using standard protocols. Cytogenotoxicity was then assessed using the Allium cepa L. toxicity test. Twenty (20)A. cepa (onion) bulbs were used, with 5 ripened naturally, 5 with wood ash, 5 with herbaceous ash, and 5 with rice chips, all grown over tap water for five days. The root tips of the bulbs were assayed and examined for chromosomal aberrations. The results revealed a significant (P<0.05) increase in moisture, protein, and ash content of mangoes as ripening agents were introduced. Mangoes ripened with wood ash exhibited the highest moisture content (81%), while those ripened with rice chips had the highest ",
    "path": "papers/24/08/2408.01425.json",
    "total_tokens": 382,
    "tldr": "研究对比了用于尼日利亚比尔宁·凯比的芒果果实人工催熟剂的木灰、草灰和米片在物理和细胞核毒性方面的差异。"
}