{
    "title": "More Than Positive and Negative: Communicating Fine Granularity in Medical Diagnosis",
    "abstract": "arXiv:2408.02214v1 Announce Type: new  Abstract: With the advance of deep learning, much progress has been made in building powerful artificial intelligence (AI) systems for automatic Chest X-ray (CXR) analysis. Most existing AI models are trained to be a binary classifier with the aim of distinguishing positive and negative cases. However, a large gap exists between the simple binary setting and complicated real-world medical scenarios. In this work, we reinvestigate the problem of automatic radiology diagnosis. We first observe that there is considerable diversity among cases within the positive class, which means simply classifying them as positive loses many important details. This motivates us to build AI models that can communicate fine-grained knowledge from medical images like human experts. To this end, we first propose a new benchmark on fine granularity learning from medical images. Specifically, we devise a division rule based on medical knowledge to divide positive cases i",
    "link": "https://arxiv.org/abs/2408.02214",
    "context": "Title: More Than Positive and Negative: Communicating Fine Granularity in Medical Diagnosis\nAbstract: arXiv:2408.02214v1 Announce Type: new  Abstract: With the advance of deep learning, much progress has been made in building powerful artificial intelligence (AI) systems for automatic Chest X-ray (CXR) analysis. Most existing AI models are trained to be a binary classifier with the aim of distinguishing positive and negative cases. However, a large gap exists between the simple binary setting and complicated real-world medical scenarios. In this work, we reinvestigate the problem of automatic radiology diagnosis. We first observe that there is considerable diversity among cases within the positive class, which means simply classifying them as positive loses many important details. This motivates us to build AI models that can communicate fine-grained knowledge from medical images like human experts. To this end, we first propose a new benchmark on fine granularity learning from medical images. Specifically, we devise a division rule based on medical knowledge to divide positive cases i",
    "path": "papers/24/08/2408.02214.json",
    "total_tokens": 335,
    "tldr": "该文章提出了一种新的医学图像精细粒度学习基准，并开发了AI模型以传达类似于人类专家的从医学图像中获取的精细粒度知识，克服了现有AI模型在正样本内部缺乏差异性所带来的问题。"
}