{
    "title": "Quantifying the Impact of Population Shift Across Age and Sex for Abdominal Organ Segmentation",
    "abstract": "arXiv:2408.04610v1 Announce Type: cross  Abstract: Deep learning-based medical image segmentation has seen tremendous progress over the last decade, but there is still relatively little transfer into clinical practice. One of the main barriers is the challenge of domain generalisation, which requires segmentation models to maintain high performance across a wide distribution of image data. This challenge is amplified by the many factors that contribute to the diverse appearance of medical images, such as acquisition conditions and patient characteristics. The impact of shifting patient characteristics such as age and sex on segmentation performance remains relatively under-studied, especially for abdominal organs, despite that this is crucial for ensuring the fairness of the segmentation model. We perform the first study to determine the impact of population shift with respect to age and sex on abdominal CT image segmentation, by leveraging two large public datasets, and introduce a no",
    "link": "https://arxiv.org/abs/2408.04610",
    "context": "Title: Quantifying the Impact of Population Shift Across Age and Sex for Abdominal Organ Segmentation\nAbstract: arXiv:2408.04610v1 Announce Type: cross  Abstract: Deep learning-based medical image segmentation has seen tremendous progress over the last decade, but there is still relatively little transfer into clinical practice. One of the main barriers is the challenge of domain generalisation, which requires segmentation models to maintain high performance across a wide distribution of image data. This challenge is amplified by the many factors that contribute to the diverse appearance of medical images, such as acquisition conditions and patient characteristics. The impact of shifting patient characteristics such as age and sex on segmentation performance remains relatively under-studied, especially for abdominal organs, despite that this is crucial for ensuring the fairness of the segmentation model. We perform the first study to determine the impact of population shift with respect to age and sex on abdominal CT image segmentation, by leveraging two large public datasets, and introduce a no",
    "path": "papers/24/08/2408.04610.json",
    "total_tokens": 304,
    "tldr": "该文章研究了年龄和性别等人口变化如何影响腹部CT图像的分割，提出了一个评估这一影响的框架，并利用大型公开数据集进行了首次分析。"
}