{
    "title": "RHiOTS: A Framework for Evaluating Hierarchical Time Series Forecasting Algorithms",
    "abstract": "arXiv:2408.03399v1 Announce Type: cross  Abstract: We introduce the Robustness of Hierarchically Organized Time Series (RHiOTS) framework, designed to assess the robustness of hierarchical time series forecasting models and algorithms on real-world datasets. Hierarchical time series, where lower-level forecasts must sum to upper-level ones, are prevalent in various contexts, such as retail sales across countries. Current empirical evaluations of forecasting methods are often limited to a small set of benchmark datasets, offering a narrow view of algorithm behavior. RHiOTS addresses this gap by systematically altering existing datasets and modifying the characteristics of individual series and their interrelations. It uses a set of parameterizable transformations to simulate those changes in the data distribution. Additionally, RHiOTS incorporates an innovative visualization component, turning complex, multidimensional robustness evaluation results into intuitive, easily interpretable v",
    "link": "https://arxiv.org/abs/2408.03399",
    "context": "Title: RHiOTS: A Framework for Evaluating Hierarchical Time Series Forecasting Algorithms\nAbstract: arXiv:2408.03399v1 Announce Type: cross  Abstract: We introduce the Robustness of Hierarchically Organized Time Series (RHiOTS) framework, designed to assess the robustness of hierarchical time series forecasting models and algorithms on real-world datasets. Hierarchical time series, where lower-level forecasts must sum to upper-level ones, are prevalent in various contexts, such as retail sales across countries. Current empirical evaluations of forecasting methods are often limited to a small set of benchmark datasets, offering a narrow view of algorithm behavior. RHiOTS addresses this gap by systematically altering existing datasets and modifying the characteristics of individual series and their interrelations. It uses a set of parameterizable transformations to simulate those changes in the data distribution. Additionally, RHiOTS incorporates an innovative visualization component, turning complex, multidimensional robustness evaluation results into intuitive, easily interpretable v",
    "path": "papers/24/08/2408.03399.json",
    "total_tokens": 393,
    "tldr": "该文章提出了一种名为RHiOTS的框架，用于评估具有层次结构的时间序列预测算法的稳健性，尤其是对于在诸如零售销售这类现实世界情境中的应用。透過对现有数据集的系统化改变和个体系列以及它们之间关系的特性调整，RHiOTS框架提供了一种多样化的数据分布模拟方法。此外，RHiOTS框架还包含一个创新的视觉化工具，将复杂的、多维度稳健性评估结果转化为直观、易于理解的图表，从而为研究者和实践者提供了一个评估和比较时间序列预测算法的有效工具。"
}