{
    "title": "Deep Learning for identifying systolic complexes in SCG traces: a cross-dataset analysis",
    "abstract": "arXiv:2408.04439v1 Announce Type: new  Abstract: The seismocardiographic signal is a promising alternative to the traditional ECG in the analysis of the cardiac activity. In particular, the systolic complex is known to be the most informative part of the seismocardiogram, thus requiring further analysis. State-of-art solutions to detect the systolic complex are based on Deep Learning models, which have been proven effective in pioneering studies. However, these solutions have only been tested in a controlled scenario considering only clean signals acquired from users maintained still in supine position. On top of that, all these studies consider data coming from a single dataset, ignoring the benefits and challenges related to a cross-dataset scenario. In this work, a cross-dataset experimental analysis was performed considering also data from a real-world scenario. Our findings prove the effectiveness of a deep learning solution, while showing the importance of a personalization step ",
    "link": "https://arxiv.org/abs/2408.04439",
    "context": "Title: Deep Learning for identifying systolic complexes in SCG traces: a cross-dataset analysis\nAbstract: arXiv:2408.04439v1 Announce Type: new  Abstract: The seismocardiographic signal is a promising alternative to the traditional ECG in the analysis of the cardiac activity. In particular, the systolic complex is known to be the most informative part of the seismocardiogram, thus requiring further analysis. State-of-art solutions to detect the systolic complex are based on Deep Learning models, which have been proven effective in pioneering studies. However, these solutions have only been tested in a controlled scenario considering only clean signals acquired from users maintained still in supine position. On top of that, all these studies consider data coming from a single dataset, ignoring the benefits and challenges related to a cross-dataset scenario. In this work, a cross-dataset experimental analysis was performed considering also data from a real-world scenario. Our findings prove the effectiveness of a deep learning solution, while showing the importance of a personalization step ",
    "path": "papers/24/08/2408.04439.json",
    "total_tokens": 345,
    "tldr": "该文章通过深度学习方法，对心音图信号中的收缩期波形进行了跨数据集分析，证明了在真实世界条件下，通过对模型进行个性化调整，能够有效识别出收缩期波形，提高了心音图信号分析的准确性。"
}