{
    "title": "AMES: Asymmetric and Memory-Efficient Similarity Estimation for Instance-level Retrieval",
    "abstract": "arXiv:2408.03282v1 Announce Type: new  Abstract: This work investigates the problem of instance-level image retrieval re-ranking with the constraint of memory efficiency, ultimately aiming to limit memory usage to 1KB per image. Departing from the prevalent focus on performance enhancements, this work prioritizes the crucial trade-off between performance and memory requirements. The proposed model uses a transformer-based architecture designed to estimate image-to-image similarity by capturing interactions within and across images based on their local descriptors. A distinctive property of the model is the capability for asymmetric similarity estimation. Database images are represented with a smaller number of descriptors compared to query images, enabling performance improvements without increasing memory consumption. To ensure adaptability across different applications, a universal model is introduced that adjusts to a varying number of local descriptors during the testing phase. Res",
    "link": "https://arxiv.org/abs/2408.03282",
    "context": "Title: AMES: Asymmetric and Memory-Efficient Similarity Estimation for Instance-level Retrieval\nAbstract: arXiv:2408.03282v1 Announce Type: new  Abstract: This work investigates the problem of instance-level image retrieval re-ranking with the constraint of memory efficiency, ultimately aiming to limit memory usage to 1KB per image. Departing from the prevalent focus on performance enhancements, this work prioritizes the crucial trade-off between performance and memory requirements. The proposed model uses a transformer-based architecture designed to estimate image-to-image similarity by capturing interactions within and across images based on their local descriptors. A distinctive property of the model is the capability for asymmetric similarity estimation. Database images are represented with a smaller number of descriptors compared to query images, enabling performance improvements without increasing memory consumption. To ensure adaptability across different applications, a universal model is introduced that adjusts to a varying number of local descriptors during the testing phase. Res",
    "path": "papers/24/08/2408.03282.json",
    "total_tokens": 414,
    "tldr": "该文章提出了一个名为AMES的模型，该模型采用了一种新颖的异步和记忆高效的相似性估计方法，用于解决实例级别图像检索中的内存问题。通过设计一个基于transformer的架构，该模型能够在保持较低内存消耗（每个图像仅使用1KB）的同时，有效地估计图像之间的相似性。此外，AMES模型还具有一个独特的能力，即进行异步相似性估计，这是通过使用不同的本地描述符数量来实现的，从而在保持性能的同时不增加内存消耗。文章还介绍了一种可适应不同应用需求的通用模型，该模型在测试阶段能够灵活调整以适应不同的本地描述符数量。](/backtranslated)"
}