{
    "title": "A Comprehensive Review of Multimodal Large Language Models: Performance and Challenges Across Different Tasks",
    "abstract": "arXiv:2408.01319v1 Announce Type: new  Abstract: In an era defined by the explosive growth of data and rapid technological advancements, Multimodal Large Language Models (MLLMs) stand at the forefront of artificial intelligence (AI) systems. Designed to seamlessly integrate diverse data types-including text, images, videos, audio, and physiological sequences-MLLMs address the complexities of real-world applications far beyond the capabilities of single-modality systems. In this paper, we systematically sort out the applications of MLLM in multimodal tasks such as natural language, vision, and audio. We also provide a comparative analysis of the focus of different MLLMs in the tasks, and provide insights into the shortcomings of current MLLMs, and suggest potential directions for future research. Through these discussions, this paper hopes to provide valuable insights for the further development and application of MLLM.",
    "link": "https://arxiv.org/abs/2408.01319",
    "context": "Title: A Comprehensive Review of Multimodal Large Language Models: Performance and Challenges Across Different Tasks\nAbstract: arXiv:2408.01319v1 Announce Type: new  Abstract: In an era defined by the explosive growth of data and rapid technological advancements, Multimodal Large Language Models (MLLMs) stand at the forefront of artificial intelligence (AI) systems. Designed to seamlessly integrate diverse data types-including text, images, videos, audio, and physiological sequences-MLLMs address the complexities of real-world applications far beyond the capabilities of single-modality systems. In this paper, we systematically sort out the applications of MLLM in multimodal tasks such as natural language, vision, and audio. We also provide a comparative analysis of the focus of different MLLMs in the tasks, and provide insights into the shortcomings of current MLLMs, and suggest potential directions for future research. Through these discussions, this paper hopes to provide valuable insights for the further development and application of MLLM.",
    "path": "papers/24/08/2408.01319.json",
    "total_tokens": 576,
    "translated_title": "全面回顾多模态大型语言模型：不同任务上的性能与挑战",
    "translated_abstract": "在这个数据爆炸和科技快速发展的时代，多模态大型语言模型（MLLMs）处于人工智能（AI）系统的前沿。这种模型设计用于无缝整合多样化的数据类型，包括文本、图像、视频、音频和生理序列，远超单一模式系统的复杂应用。在本文中，我们对MLLM在多模态任务中的应用进行了系统的梳理，例如自然语言处理、视觉识别和音频分析。我们还提供了不同MLLM在特定任务之间的重点比较分析，并指出了现有MLLM的不足之处，并提出了未来研究的方向。通过这些讨论，本文希望能够为MLLM的未来发展和应用提供宝贵的见解。",
    "tldr": "本文全面综述了多模态大型语言模型在多种任务中的性能与挑战，并指出了未来研究的方向。en_tldr: This paper provides a comprehensive review of the performance and challenges of multimodal large language models across various tasks, suggesting future research directions."
}