{
    "title": "Cluster-Wide Task Slowdown Detection in Cloud System",
    "abstract": "arXiv:2408.04236v1 Announce Type: cross  Abstract: Slow task detection is a critical problem in cloud operation and maintenance since it is highly related to user experience and can bring substantial liquidated damages. Most anomaly detection methods detect it from a single-task aspect. However, considering millions of concurrent tasks in large-scale cloud computing clusters, it becomes impractical and inefficient. Moreover, single-task slowdowns are very common and do not necessarily indicate a malfunction of a cluster due to its violent fluctuation nature in a virtual environment. Thus, we shift our attention to cluster-wide task slowdowns by utilizing the duration time distribution of tasks across a cluster, so that the computation complexity is not relevant to the number of tasks.   The task duration time distribution often exhibits compound periodicity and local exceptional fluctuations over time. Though transformer-based methods are one of the most powerful methods to capture the",
    "link": "https://arxiv.org/abs/2408.04236",
    "context": "Title: Cluster-Wide Task Slowdown Detection in Cloud System\nAbstract: arXiv:2408.04236v1 Announce Type: cross  Abstract: Slow task detection is a critical problem in cloud operation and maintenance since it is highly related to user experience and can bring substantial liquidated damages. Most anomaly detection methods detect it from a single-task aspect. However, considering millions of concurrent tasks in large-scale cloud computing clusters, it becomes impractical and inefficient. Moreover, single-task slowdowns are very common and do not necessarily indicate a malfunction of a cluster due to its violent fluctuation nature in a virtual environment. Thus, we shift our attention to cluster-wide task slowdowns by utilizing the duration time distribution of tasks across a cluster, so that the computation complexity is not relevant to the number of tasks.   The task duration time distribution often exhibits compound periodicity and local exceptional fluctuations over time. Though transformer-based methods are one of the most powerful methods to capture the",
    "path": "papers/24/08/2408.04236.json",
    "total_tokens": 345,
    "tldr": "该文章创新性地提出了一种全新的方法来检测云系统中的集群级任务延迟，这种方法通过对集群中任务执行时间的分布进行分析，绕开了传统单一任务检测方法因任务数量巨大而导致的高计算复杂性问题。通过这种方法，即使在大规模云计算集群中，也能有效且高效地发现可能导致用户体验下降的集群级任务延迟问题。"
}