{
    "title": "Large-scale Deployment of Vision-based Tactile Sensors on Multi-fingered Grippers",
    "abstract": "arXiv:2408.02206v1 Announce Type: new  Abstract: Vision-based Tactile Sensors (VBTSs) show significant promise in that they can leverage image measurements to provide high-spatial-resolution human-like performance. However, current VBTS designs, typically confined to the fingertips of robotic grippers, prove somewhat inadequate, as many grasping and manipulation tasks require multiple contact points with the object. With an end goal of enabling large-scale, multi-surface tactile sensing via VBTSs, our research (i) develops a synchronized image acquisition system with minimal latency,(ii) proposes a modularized VBTS design for easy integration into finger phalanges, and (iii) devises a zero-shot calibration approach to improve data efficiency in the simultaneous calibration of multiple VBTSs. In validating the system within a miniature 3-fingered robotic gripper equipped with 7 VBTSs we demonstrate improved tactile perception performance by covering the contact surfaces of both gripper ",
    "link": "https://arxiv.org/abs/2408.02206",
    "context": "Title: Large-scale Deployment of Vision-based Tactile Sensors on Multi-fingered Grippers\nAbstract: arXiv:2408.02206v1 Announce Type: new  Abstract: Vision-based Tactile Sensors (VBTSs) show significant promise in that they can leverage image measurements to provide high-spatial-resolution human-like performance. However, current VBTS designs, typically confined to the fingertips of robotic grippers, prove somewhat inadequate, as many grasping and manipulation tasks require multiple contact points with the object. With an end goal of enabling large-scale, multi-surface tactile sensing via VBTSs, our research (i) develops a synchronized image acquisition system with minimal latency,(ii) proposes a modularized VBTS design for easy integration into finger phalanges, and (iii) devises a zero-shot calibration approach to improve data efficiency in the simultaneous calibration of multiple VBTSs. In validating the system within a miniature 3-fingered robotic gripper equipped with 7 VBTSs we demonstrate improved tactile perception performance by covering the contact surfaces of both gripper ",
    "path": "papers/24/08/2408.02206.json",
    "total_tokens": 425,
    "tldr": "我们的研究开发了一个低延迟的同步图像采集系统，提出了用于简单集成到手指骨的关键设计的模块化视觉触觉传感器（VBTSs），以及一种零样本校准方法以提高多VBTS同时校准的数据效率。在为一个小型三指机器人夹爪配备7个VBTS之后，我们通过覆盖夹爪的所有接触表面，验证了该系统，并展示了改进的触觉感知性能。"
}