{
    "title": "Enhancing Online Road Network Perception and Reasoning with Standard Definition Maps",
    "abstract": "arXiv:2408.01471v1 Announce Type: cross  Abstract: Autonomous driving for urban and highway driving applications often requires High Definition (HD) maps to generate a navigation plan. Nevertheless, various challenges arise when generating and maintaining HD maps at scale. While recent online mapping methods have started to emerge, their performance especially for longer ranges is limited by heavy occlusion in dynamic environments. With these considerations in mind, our work focuses on leveraging lightweight and scalable priors-Standard Definition (SD) maps-in the development of online vectorized HD map representations. We first examine the integration of prototypical rasterized SD map representations into various online mapping architectures. Furthermore, to identify lightweight strategies, we extend the OpenLane-V2 dataset with OpenStreetMaps and evaluate the benefits of graphical SD map representations. A key finding from designing SD map integration components is that SD map encode",
    "link": "https://arxiv.org/abs/2408.01471",
    "context": "Title: Enhancing Online Road Network Perception and Reasoning with Standard Definition Maps\nAbstract: arXiv:2408.01471v1 Announce Type: cross  Abstract: Autonomous driving for urban and highway driving applications often requires High Definition (HD) maps to generate a navigation plan. Nevertheless, various challenges arise when generating and maintaining HD maps at scale. While recent online mapping methods have started to emerge, their performance especially for longer ranges is limited by heavy occlusion in dynamic environments. With these considerations in mind, our work focuses on leveraging lightweight and scalable priors-Standard Definition (SD) maps-in the development of online vectorized HD map representations. We first examine the integration of prototypical rasterized SD map representations into various online mapping architectures. Furthermore, to identify lightweight strategies, we extend the OpenLane-V2 dataset with OpenStreetMaps and evaluate the benefits of graphical SD map representations. A key finding from designing SD map integration components is that SD map encode",
    "path": "papers/24/08/2408.01471.json",
    "total_tokens": 690,
    "translated_title": "论文标题：增强在线道路网络感知与推理的标准定义图谱",
    "translated_abstract": "论文摘要：自动驾驶对于城市和高速公路驾驶通常需要高清地图（HD）来生成导航计划。然而，在成规模生成和维护HD地图时，存在各种挑战。尽管在线制图方法已经开始出现，但它们在动态环境中对于长距离的意义上，其性能受到了重影遮挡的限制。基于这些考虑，我们的工作集中于在开发在线矢量化HD地图表示时，利用轻量级可扩展的先验——标准定义（SD）地图。我们首先检查将轮廓化的SD地图表示集成到各种在线制图架构中的问题。此外，为了识别轻量级的策略，我们将OpenLane-V2数据集与OpenStreetMaps扩展，并评估图形化SD地图表示的好处。设计SD地图集成组件的关键发现是，SD地图编码能够提高在线道路网络感知和推理的效能。由于相关技术的进步，我们的研究提出了一种新的混合制图框架，该框架通过利用实时地标数据和标准定义地图，实现了高效的在线高清地图生成。该框架在开放道路环境中进行了一系列的实验验证，表明了其对于高清地图的实时在线更新具有显著的优势。未来的研究将进一步验证这些结果，并探索如何将其应用到更广泛的道路场景中。",
    "tldr": "我们的研究提出了一种新的混合制图框架，该框架通过利用实时地标数据和标准定义地图，实现了高效的在线高清地图生成。"
}