{
    "title": "High-Throughput Phenotyping of Clinical Text Using Large Language Models",
    "abstract": "arXiv:2408.01214v1 Announce Type: cross  Abstract: High-throughput phenotyping automates the mapping of patient signs to standardized ontology concepts and is essential for precision medicine. This study evaluates the automation of phenotyping of clinical summaries from the Online Mendelian Inheritance in Man (OMIM) database using large language models. Due to their rich phenotype data, these summaries can be surrogates for physician notes. We conduct a performance comparison of GPT-4 and GPT-3.5-Turbo. Our results indicate that GPT-4 surpasses GPT-3.5-Turbo in identifying, categorizing, and normalizing signs, achieving concordance with manual annotators comparable to inter-rater agreement. Despite some limitations in sign normalization, the extensive pre-training of GPT-4 results in high performance and generalizability across several phenotyping tasks while obviating the need for manually annotated training data. Large language models are expected to be the dominant method for automa",
    "link": "https://arxiv.org/abs/2408.01214",
    "context": "Title: High-Throughput Phenotyping of Clinical Text Using Large Language Models\nAbstract: arXiv:2408.01214v1 Announce Type: cross  Abstract: High-throughput phenotyping automates the mapping of patient signs to standardized ontology concepts and is essential for precision medicine. This study evaluates the automation of phenotyping of clinical summaries from the Online Mendelian Inheritance in Man (OMIM) database using large language models. Due to their rich phenotype data, these summaries can be surrogates for physician notes. We conduct a performance comparison of GPT-4 and GPT-3.5-Turbo. Our results indicate that GPT-4 surpasses GPT-3.5-Turbo in identifying, categorizing, and normalizing signs, achieving concordance with manual annotators comparable to inter-rater agreement. Despite some limitations in sign normalization, the extensive pre-training of GPT-4 results in high performance and generalizability across several phenotyping tasks while obviating the need for manually annotated training data. Large language models are expected to be the dominant method for automa",
    "path": "papers/24/08/2408.01214.json",
    "total_tokens": 683,
    "translated_title": "使用大型语言模型的高通量临床文本表型分析",
    "translated_abstract": "arXiv:2408.01214v1 公告类型: 交叉  摘要: 高通量表型自动化自动将患者症状映射到标准化概念 ontology，这对于精确医学至关重要。这项研究评估了使用大型语言模型自动化在线孟德尔遗传（OMIM）数据库中临床总结表型的能力。鉴于它们丰富的表型数据，这些总结可以作为医生记录的替代品。我们进行了 GPT-4 和 GPT-3.5-Turbo 之间的性能对比。我们的结果显示，在识别、分类和标准化症状方面，GPT-4超过了 GPT-3.5-Turbo，实现了与人工注释者的一致性，与内部评分者的共识相当。尽管在症状标准化方面存在一些限制，但 GPT-4 的广泛预训练在跨多个表型任务实现高性能和普遍适用性方面取得了成功，同时避免了手动注释训练数据的需求。大型语言模型预计将成为自动化临床文本表型分析的主导方法。",
    "tldr": "本研究证实了 GPT-4 在自动化临床文本表型分析方面超越了 GPT-3.5-Turbo，为精确医学提供了一种高效工具。",
    "en_tdlr": "This study demonstrates that GPT-4 surpasses GPT-3.5-Turbo in automating clinical text phenotyping, offering an efficient tool for precision medicine."
}