{
    "title": "Reporting and Analysing the Environmental Impact of Language Models on the Example of Commonsense Question Answering with External Knowledge",
    "abstract": "arXiv:2408.01453v1 Announce Type: cross  Abstract: Human-produced emissions are growing at an alarming rate, causing already observable changes in the climate and environment in general. Each year global carbon dioxide emissions hit a new record, and it is reported that 0.5% of total US greenhouse gas emissions are attributed to data centres as of 2021. The release of ChatGPT in late 2022 sparked social interest in Large Language Models (LLMs), the new generation of Language Models with a large number of parameters and trained on massive amounts of data. Currently, numerous companies are releasing products featuring various LLMs, with many more models in development and awaiting release. Deep Learning research is a competitive field, with only models that reach top performance attracting attention and being utilized. Hence, achieving better accuracy and results is often the first priority, while the model's efficiency and the environmental impact of the study are neglected. However, LL",
    "link": "https://arxiv.org/abs/2408.01453",
    "context": "Title: Reporting and Analysing the Environmental Impact of Language Models on the Example of Commonsense Question Answering with External Knowledge\nAbstract: arXiv:2408.01453v1 Announce Type: cross  Abstract: Human-produced emissions are growing at an alarming rate, causing already observable changes in the climate and environment in general. Each year global carbon dioxide emissions hit a new record, and it is reported that 0.5% of total US greenhouse gas emissions are attributed to data centres as of 2021. The release of ChatGPT in late 2022 sparked social interest in Large Language Models (LLMs), the new generation of Language Models with a large number of parameters and trained on massive amounts of data. Currently, numerous companies are releasing products featuring various LLMs, with many more models in development and awaiting release. Deep Learning research is a competitive field, with only models that reach top performance attracting attention and being utilized. Hence, achieving better accuracy and results is often the first priority, while the model's efficiency and the environmental impact of the study are neglected. However, LL",
    "path": "papers/24/08/2408.01453.json",
    "total_tokens": 653,
    "translated_title": "环境影响报告与语言模型在常识问答中的分析 - 以外部知识为例子",
    "translated_abstract": "本文首先介绍了常识问答中的外部知识应用，通过分析语言模型对环境的潜在影响。全球碳排放正在以惊人的速度增长，造成了气候和环境的变化。全球数据中心的碳排放估计占美国2021年温室气体排放的0.5%。2022年底，大型语言模型（LLMs）的问世引起了社会对这类新型语言模型的极大兴趣。目前，许多公司已推出包含不同LLM的产品，而更多的模型正在开发中。在深度学习领域，只有达到最佳性能的模型才会获得关注和应用。然而，高效和研究的环境影响常常被忽视。本文旨在探讨和分析构建和发展此类模型对环境可能造成的负面影响，并提出一些解决方案以缓解负面影响。通过对案例的详细调查，本文计划展示了执行人工智能任务的实际情况，并对如何减少这些任务的环境足迹进行了讨论。最后，本文提出了严格要求的环境评估标准，并致力于减少在开发和使用LLMs的过程中对环境的破坏。",
    "tldr": "本文研究了语言模型在常识问答中应用的环境影响，强调了减少人工智能任务对环境影响的重要性。",
    "en_tdlr": "This paper examines the environmental impact of language models in commonsense question answering and highlights the importance of reducing the environmental footprint of artificial intelligence tasks."
}