{
    "title": "Cross-Domain Semantic Segmentation on Inconsistent Taxonomy using VLMs",
    "abstract": "arXiv:2408.02261v1 Announce Type: new  Abstract: The challenge of semantic segmentation in Unsupervised Domain Adaptation (UDA) emerges not only from domain shifts between source and target images but also from discrepancies in class taxonomies across domains. Traditional UDA research assumes consistent taxonomy between the source and target domains, thereby limiting their ability to recognize and adapt to the taxonomy of the target domain. This paper introduces a novel approach, Cross-Domain Semantic Segmentation on Inconsistent Taxonomy using Vision Language Models (CSI), which effectively performs domain-adaptive semantic segmentation even in situations of source-target class mismatches. CSI leverages the semantic generalization potential of Visual Language Models (VLMs) to create synergy with previous UDA methods. It leverages segment reasoning obtained through traditional UDA methods, combined with the rich semantic knowledge embedded in VLMs, to relabel new classes in the target ",
    "link": "https://arxiv.org/abs/2408.02261",
    "context": "Title: Cross-Domain Semantic Segmentation on Inconsistent Taxonomy using VLMs\nAbstract: arXiv:2408.02261v1 Announce Type: new  Abstract: The challenge of semantic segmentation in Unsupervised Domain Adaptation (UDA) emerges not only from domain shifts between source and target images but also from discrepancies in class taxonomies across domains. Traditional UDA research assumes consistent taxonomy between the source and target domains, thereby limiting their ability to recognize and adapt to the taxonomy of the target domain. This paper introduces a novel approach, Cross-Domain Semantic Segmentation on Inconsistent Taxonomy using Vision Language Models (CSI), which effectively performs domain-adaptive semantic segmentation even in situations of source-target class mismatches. CSI leverages the semantic generalization potential of Visual Language Models (VLMs) to create synergy with previous UDA methods. It leverages segment reasoning obtained through traditional UDA methods, combined with the rich semantic knowledge embedded in VLMs, to relabel new classes in the target ",
    "path": "papers/24/08/2408.02261.json",
    "total_tokens": 382,
    "tldr": "该文章提出了一种名为CSI（Cross-Domain Semantic Segmentation on Inconsistent Taxonomy using Vision Language Models）的方法，该方法利用了视觉语言模型（VLMs）的语义泛化能力，即使在源目标类存在不匹配的情况下，也能有效地执行跨域自适应语义分割。通过结合传统的跨域自适应语义分割方法和VLMs中丰富的语义知识，CSI能够为目标域的新类别进行重新标注。"
}