{
    "title": "ML-EAT: A Multilevel Embedding Association Test for Interpretable and Transparent Social Science",
    "abstract": "arXiv:2408.01966v1 Announce Type: cross  Abstract: This research introduces the Multilevel Embedding Association Test (ML-EAT), a method designed for interpretable and transparent measurement of intrinsic bias in language technologies. The ML-EAT addresses issues of ambiguity and difficulty in interpreting the traditional EAT measurement by quantifying bias at three levels of increasing granularity: the differential association between two target concepts with two attribute concepts; the individual effect size of each target concept with two attribute concepts; and the association between each individual target concept and each individual attribute concept. Using the ML-EAT, this research defines a taxonomy of EAT patterns describing the nine possible outcomes of an embedding association test, each of which is associated with a unique EAT-Map, a novel four-quadrant visualization for interpreting the ML-EAT. Empirical analysis of static and diachronic word embeddings, GPT-2 language mod",
    "link": "https://arxiv.org/abs/2408.01966",
    "context": "Title: ML-EAT: A Multilevel Embedding Association Test for Interpretable and Transparent Social Science\nAbstract: arXiv:2408.01966v1 Announce Type: cross  Abstract: This research introduces the Multilevel Embedding Association Test (ML-EAT), a method designed for interpretable and transparent measurement of intrinsic bias in language technologies. The ML-EAT addresses issues of ambiguity and difficulty in interpreting the traditional EAT measurement by quantifying bias at three levels of increasing granularity: the differential association between two target concepts with two attribute concepts; the individual effect size of each target concept with two attribute concepts; and the association between each individual target concept and each individual attribute concept. Using the ML-EAT, this research defines a taxonomy of EAT patterns describing the nine possible outcomes of an embedding association test, each of which is associated with a unique EAT-Map, a novel four-quadrant visualization for interpreting the ML-EAT. Empirical analysis of static and diachronic word embeddings, GPT-2 language mod",
    "path": "papers/24/08/2408.01966.json",
    "total_tokens": 641,
    "translated_title": "ML-EAT：社会科学研究中的多层次嵌入关联测试，以可解释和透明的语言技术",
    "translated_abstract": "本文介绍了一种多层次嵌入关联测试（ML-EAT）方法，旨在对社会科学研究中语言技术的固有偏见进行可解释和透明的度量。ML-EAT通过量化三个不同层次的偏差——两个目标概念与两个属性概念之间的差异化关联；两个属性概念中每个目标概念的个体效应大小；以及每个个体目标概念与每个个体属性概念之间的关联——解决了传统EAT测量的模糊性和易理解性问题。使用ML-EAT，本文定义了一个EAT模式 taxonomy，描述了一个嵌入关联测试的九种可能结果，每种结果都与一个独特的EAT-Map相关联，这是一个新型的四象限可视化工具，用于解释ML-EAT。对静态和历时单词嵌入以及GPT-2语言模型的实证分析显示，ML-EAT能够揭示嵌入细节和泛化性能的差异。",
    "tldr": "ML-EAT是一种量度语言技术固有偏见的工具，采用多层次方法进行可解释和透明的分析。"
}