{
    "title": "Stimulating Imagination: Towards General-purpose Object Rearrangement",
    "abstract": "arXiv:2408.01655v1 Announce Type: new  Abstract: General-purpose object placement is a fundamental capability of an intelligent generalist robot, i.e., being capable of rearranging objects following human instructions even in novel environments. To achieve this, we break the rearrangement down into three parts, including object localization, goal imagination and robot control, and propose a framework named SPORT. SPORT leverages pre-trained large vision models for broad semantic reasoning about objects, and learns a diffusion-based 3D pose estimator to ensure physically-realistic results. Only object types (to be moved or reference) are communicated between these two parts, which brings two benefits. One is that we can fully leverage the powerful ability of open-set object localization and recognition since no specific fine-tuning is needed for robotic scenarios. Furthermore, the diffusion-based estimator only need to \"imagine\" the poses of the moving and reference objects after the pl",
    "link": "https://arxiv.org/abs/2408.01655",
    "context": "Title: Stimulating Imagination: Towards General-purpose Object Rearrangement\nAbstract: arXiv:2408.01655v1 Announce Type: new  Abstract: General-purpose object placement is a fundamental capability of an intelligent generalist robot, i.e., being capable of rearranging objects following human instructions even in novel environments. To achieve this, we break the rearrangement down into three parts, including object localization, goal imagination and robot control, and propose a framework named SPORT. SPORT leverages pre-trained large vision models for broad semantic reasoning about objects, and learns a diffusion-based 3D pose estimator to ensure physically-realistic results. Only object types (to be moved or reference) are communicated between these two parts, which brings two benefits. One is that we can fully leverage the powerful ability of open-set object localization and recognition since no specific fine-tuning is needed for robotic scenarios. Furthermore, the diffusion-based estimator only need to \"imagine\" the poses of the moving and reference objects after the pl",
    "path": "papers/24/08/2408.01655.json",
    "total_tokens": 420,
    "tldr": "该文章提出的SPORT框架通过将物体重新排列分为物体定位、目标想象和机器人控制三个部分，以及利用预训练的大型视觉模型进行物体空间识别的策略，并结合基于扩散的3D姿态估计器以确保物理上的合理性。通过仅在物体类型的定义之间进行交流，SPORT框架能够在不需要特定精调的情况下，充分地利用开放环境物体定位和识别的能力，并且仅需要“想象”物体相对于参考物体的姿态。这种策略使得机器人能够在没有特定任务定制的情况下，在通用环境中准确地重新排列物体，从而为实现通用目的的物体重新排列提供了有效的方法。"
}