{
    "title": "Multi-weather Cross-view Geo-localization Using Denoising Diffusion Models",
    "abstract": "arXiv:2408.02408v1 Announce Type: new  Abstract: Cross-view geo-localization in GNSS-denied environments aims to determine an unknown location by matching drone-view images with the correct geo-tagged satellite-view images from a large gallery. Recent research shows that learning discriminative image representations under specific weather conditions can significantly enhance performance. However, the frequent occurrence of unseen extreme weather conditions hinders progress. This paper introduces MCGF, a Multi-weather Cross-view Geo-localization Framework designed to dynamically adapt to unseen weather conditions. MCGF establishes a joint optimization between image restoration and geo-localization using denoising diffusion models. For image restoration, MCGF incorporates a shared encoder and a lightweight restoration module to help the backbone eliminate weather-specific information. For geo-localization, MCGF uses EVA-02 as a backbone for feature extraction, with cross-entropy loss for",
    "link": "https://arxiv.org/abs/2408.02408",
    "context": "Title: Multi-weather Cross-view Geo-localization Using Denoising Diffusion Models\nAbstract: arXiv:2408.02408v1 Announce Type: new  Abstract: Cross-view geo-localization in GNSS-denied environments aims to determine an unknown location by matching drone-view images with the correct geo-tagged satellite-view images from a large gallery. Recent research shows that learning discriminative image representations under specific weather conditions can significantly enhance performance. However, the frequent occurrence of unseen extreme weather conditions hinders progress. This paper introduces MCGF, a Multi-weather Cross-view Geo-localization Framework designed to dynamically adapt to unseen weather conditions. MCGF establishes a joint optimization between image restoration and geo-localization using denoising diffusion models. For image restoration, MCGF incorporates a shared encoder and a lightweight restoration module to help the backbone eliminate weather-specific information. For geo-localization, MCGF uses EVA-02 as a backbone for feature extraction, with cross-entropy loss for",
    "path": "papers/24/08/2408.02408.json",
    "total_tokens": 379,
    "tldr": "该文章提出了一种名为MCGF的多天气跨视角地理定位框架，该框架使用 denoising diffusion 模型结合了图像无损恢复和地理定位技术的研究，能够有效适配和识别未知的极端天气现象，通过共享的编码器和轻量级的恢复模块来清除影响定位的天气信息，并使用 EVA-02 作为特征提取的骨干网络，通过交叉熵损失函数提高了地理定位技术的准确性和鲁棒性。"
}