{
    "title": "Enhancing Heterogeneous Knowledge Graph Completion with a Novel GAT-based Approach",
    "abstract": "arXiv:2408.02456v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) play a vital role in enhancing search results and recommendation systems. With the rapid increase in the size of the KGs, they are becoming inaccuracy and incomplete. This problem can be solved by the knowledge graph completion methods, of which graph attention network (GAT)-based methods stand out since their superior performance. However, existing GAT-based knowledge graph completion methods often suffer from overfitting issues when dealing with heterogeneous knowledge graphs, primarily due to the unbalanced number of samples. Additionally, these methods demonstrate poor performance in predicting the tail (head) entity that shares the same relation and head (tail) entity with others. To solve these problems, we propose GATH, a novel GAT-based method designed for Heterogeneous KGs. GATH incorporates two separate attention network modules that work synergistically to predict the missing entities. We also introduc",
    "link": "https://arxiv.org/abs/2408.02456",
    "context": "Title: Enhancing Heterogeneous Knowledge Graph Completion with a Novel GAT-based Approach\nAbstract: arXiv:2408.02456v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) play a vital role in enhancing search results and recommendation systems. With the rapid increase in the size of the KGs, they are becoming inaccuracy and incomplete. This problem can be solved by the knowledge graph completion methods, of which graph attention network (GAT)-based methods stand out since their superior performance. However, existing GAT-based knowledge graph completion methods often suffer from overfitting issues when dealing with heterogeneous knowledge graphs, primarily due to the unbalanced number of samples. Additionally, these methods demonstrate poor performance in predicting the tail (head) entity that shares the same relation and head (tail) entity with others. To solve these problems, we propose GATH, a novel GAT-based method designed for Heterogeneous KGs. GATH incorporates two separate attention network modules that work synergistically to predict the missing entities. We also introduc",
    "path": "papers/24/08/2408.02456.json",
    "total_tokens": 754,
    "translated_title": "使用新颖的GAT（Graph Attention Network）方法增强异构知识图 completion",
    "translated_abstract": "知识图（KG）在提高搜索结果和推荐系统的效率中起到了重要作用。随着KG大小的迅速增长，它们变得不准确且不完整。这个问题可以通过知识图 completion方法来解决，其中基于GAT的方法因其卓越的性能而脱颖而出。然而，现有的基于GAT的知识图 completion方法在处理异构知识图时经常遭受过拟合问题，这主要是因为样本数量不平衡。此外，这些方法在预测共享同一路径和头部（尾部）实体的尾（头）实体方面的表现不佳。为了解决这些问题，我们提出了GATH（Graph Attention Transformation for Heterogeneous KGs），一种专为异构KG设计的新颖基于GAT的方法。GATH包含两个单独的注意力网络模块，它们协同工作来预测缺失实体。我们还引入了一种自适应采样策略，在不同的实体中自动调整难易程度，以便网络能够更好地学习重要节点和边的相关性。通过在多个基准异构KG数据集上的广泛实验，我们证明了GATH在提高异构KG的完备性方面的有效性和优越性能。",
    "tldr": "本文提出了GATH，一种用于增强异构知识图完备性的新型基于GAT的方法。通过整合两个独立的注意力模型来预测缺失实体，并采用自适应采样策略以提高模型对重要节点和边相关性的学习能力。"
}