{
    "title": "Towards AI-Safety-by-Design: A Taxonomy of Runtime Guardrails in Foundation Model based Systems",
    "abstract": "arXiv:2408.02205v1 Announce Type: cross  Abstract: The rapid advancement and widespread deployment of foundation model (FM) based systems have revolutionized numerous applications across various domains. However, the fast-growing capabilities and autonomy have also raised significant concerns about responsible AI and AI safety. Recently, there have been increasing attention toward implementing guardrails to ensure the runtime behavior of FM-based systems is safe and responsible. Given the early stage of FMs and their applications (such as agents), the design of guardrails have not yet been systematically studied. It remains underexplored which software qualities should be considered when designing guardrails and how these qualities can be ensured from a software architecture perspective. Therefore, in this paper, we present a taxonomy for guardrails to classify and compare the characteristics and design options of guardrails. Our taxonomy is organized into three main categories: the mo",
    "link": "https://arxiv.org/abs/2408.02205",
    "context": "Title: Towards AI-Safety-by-Design: A Taxonomy of Runtime Guardrails in Foundation Model based Systems\nAbstract: arXiv:2408.02205v1 Announce Type: cross  Abstract: The rapid advancement and widespread deployment of foundation model (FM) based systems have revolutionized numerous applications across various domains. However, the fast-growing capabilities and autonomy have also raised significant concerns about responsible AI and AI safety. Recently, there have been increasing attention toward implementing guardrails to ensure the runtime behavior of FM-based systems is safe and responsible. Given the early stage of FMs and their applications (such as agents), the design of guardrails have not yet been systematically studied. It remains underexplored which software qualities should be considered when designing guardrails and how these qualities can be ensured from a software architecture perspective. Therefore, in this paper, we present a taxonomy for guardrails to classify and compare the characteristics and design options of guardrails. Our taxonomy is organized into three main categories: the mo",
    "path": "papers/24/08/2408.02205.json",
    "total_tokens": 463,
    "translated_title": "朝向安全设计的AI：基于基础模型的系统中的运行时护栏分类",
    "translated_abstract": "论文讨论了基础模型（FM）在现代应用中的广泛应用和安全性的问题。论文提出了一种分类系统，系统地将运行时护栏作为一种技术手段来确保FM系统的安全性。我们还讨论了设计护栏时应考虑的软件特性和从软件架构角度确保这些特性的方法。",
    "tldr": "该论文提出的护栏分类系统旨在确保基础模型系统在运行时的安全性。"
}