{
    "title": "Chatbot-Based Ontology Interaction Using Large Language Models and Domain-Specific Standards",
    "abstract": "arXiv:2408.00800v1 Announce Type: cross  Abstract: The following contribution introduces a concept that employs Large Language Models (LLMs) and a chatbot interface to enhance SPARQL query generation for ontologies, thereby facilitating intuitive access to formalized knowledge. Utilizing natural language inputs, the system converts user inquiries into accurate SPARQL queries that strictly query the factual content of the ontology, effectively preventing misinformation or fabrication by the LLM. To enhance the quality and precision of outcomes, additional textual information from established domain-specific standards is integrated into the ontology for precise descriptions of its concepts and relationships. An experimental study assesses the accuracy of generated SPARQL queries, revealing significant benefits of using LLMs for querying ontologies and highlighting areas for future research.",
    "link": "https://arxiv.org/abs/2408.00800",
    "context": "Title: Chatbot-Based Ontology Interaction Using Large Language Models and Domain-Specific Standards\nAbstract: arXiv:2408.00800v1 Announce Type: cross  Abstract: The following contribution introduces a concept that employs Large Language Models (LLMs) and a chatbot interface to enhance SPARQL query generation for ontologies, thereby facilitating intuitive access to formalized knowledge. Utilizing natural language inputs, the system converts user inquiries into accurate SPARQL queries that strictly query the factual content of the ontology, effectively preventing misinformation or fabrication by the LLM. To enhance the quality and precision of outcomes, additional textual information from established domain-specific standards is integrated into the ontology for precise descriptions of its concepts and relationships. An experimental study assesses the accuracy of generated SPARQL queries, revealing significant benefits of using LLMs for querying ontologies and highlighting areas for future research.",
    "path": "papers/24/08/2408.00800.json",
    "total_tokens": 583,
    "translated_title": "使用大型语言模型和领域特定标准的大语言模型对话式本体交互",
    "translated_abstract": "本贡献介绍了一种概念，它使用大型语言模型（LLMs）和聊天机器人界面来增强本体论的SPARQL查询生成，从而为正式知识提供直观的访问途径。用户通过自然语言输入提问，系统将这些提问转换成准确的SPARQL查询，这些查询严格查询本体论的内容，防止由LLM带来的虚假信息或虚构内容。为了提高结果的质量和准确性，将来自领域特定标准的额外文本信息整合到本体论中，以便对它的概念和关系进行精确描述。一项实验研究评估了生成的SPARQL查询的准确性，揭示了使用LLMs查询本体论的显著优势，并强调了未来研究的重点领域。",
    "tldr": "本研究提出了一个使用大型语言模型和领域特定标准的大语言模型对话式本体交互概念，能够将用户提问准确转化为SPARQL查询，有效防止了虚假信息的产生。"
}