{
    "title": "LEGO: Self-Supervised Representation Learning for Scene Text Images",
    "abstract": "arXiv:2408.02036v1 Announce Type: new  Abstract: In recent years, significant progress has been made in scene text recognition by data-driven methods. However, due to the scarcity of annotated real-world data, the training of these methods predominantly relies on synthetic data. The distribution gap between synthetic and real data constrains the further performance improvement of these methods in real-world applications. To tackle this problem, a highly promising approach is to utilize massive amounts of unlabeled real data for self-supervised training, which has been widely proven effective in many NLP and CV tasks. Nevertheless, generic self-supervised methods are unsuitable for scene text images due to their sequential nature. To address this issue, we propose a Local Explicit and Global Order-aware self-supervised representation learning method (LEGO) that accounts for the characteristics of scene text images. Inspired by the human cognitive process of learning words, which involve",
    "link": "https://arxiv.org/abs/2408.02036",
    "context": "Title: LEGO: Self-Supervised Representation Learning for Scene Text Images\nAbstract: arXiv:2408.02036v1 Announce Type: new  Abstract: In recent years, significant progress has been made in scene text recognition by data-driven methods. However, due to the scarcity of annotated real-world data, the training of these methods predominantly relies on synthetic data. The distribution gap between synthetic and real data constrains the further performance improvement of these methods in real-world applications. To tackle this problem, a highly promising approach is to utilize massive amounts of unlabeled real data for self-supervised training, which has been widely proven effective in many NLP and CV tasks. Nevertheless, generic self-supervised methods are unsuitable for scene text images due to their sequential nature. To address this issue, we propose a Local Explicit and Global Order-aware self-supervised representation learning method (LEGO) that accounts for the characteristics of scene text images. Inspired by the human cognitive process of learning words, which involve",
    "path": "papers/24/08/2408.02036.json",
    "total_tokens": 334,
    "tldr": "该文章提出了一种名为LEGO的局部显式和全局顺序自监督学习方法，旨在解决场景文本图像数据集分布差异问题，通过对大量未标注的真实世界图像数据进行自监督训练，有效提升了场景文本识别方法在实际应用中的性能。"
}