{
    "title": "Closed-Loop Magnetic Control of Medical Soft Continuum Robots for Deflection",
    "abstract": "arXiv:2408.03017v1 Announce Type: new  Abstract: Magnetic soft continuum robots (MSCRs) have emerged as powerful devices in endovascular interventions owing to their hyperelastic fibre matrix and enhanced magnetic manipulability. Effective closed-loop control of tethered magnetic devices contributes to the achievement of autonomous vascular robotic surgery. In this article, we employ a magnetic actuation system equipped with a single rotatable permanent magnet to achieve closed-loop deflection control of the MSCR. To this end, we establish a differential kinematic model of MSCRs exposed to non-uniform magnetic fields. The relationship between the existence and uniqueness of Jacobian and the geometric position between robots is deduced. The accurate control direction induced by Jacobian is demonstrated to be crucial in simulations. Then, the corresponding quasi-static control (QSC) framework integrates a linear extended state observer to estimate model uncertainties. Finally, the effect",
    "link": "https://arxiv.org/abs/2408.03017",
    "context": "Title: Closed-Loop Magnetic Control of Medical Soft Continuum Robots for Deflection\nAbstract: arXiv:2408.03017v1 Announce Type: new  Abstract: Magnetic soft continuum robots (MSCRs) have emerged as powerful devices in endovascular interventions owing to their hyperelastic fibre matrix and enhanced magnetic manipulability. Effective closed-loop control of tethered magnetic devices contributes to the achievement of autonomous vascular robotic surgery. In this article, we employ a magnetic actuation system equipped with a single rotatable permanent magnet to achieve closed-loop deflection control of the MSCR. To this end, we establish a differential kinematic model of MSCRs exposed to non-uniform magnetic fields. The relationship between the existence and uniqueness of Jacobian and the geometric position between robots is deduced. The accurate control direction induced by Jacobian is demonstrated to be crucial in simulations. Then, the corresponding quasi-static control (QSC) framework integrates a linear extended state observer to estimate model uncertainties. Finally, the effect",
    "path": "papers/24/08/2408.03017.json",
    "total_tokens": 408,
    "tldr": "该文章展示了通过一个单一旋转的永久磁铁所装备的磁性驱动系统，实现了对磁性软连续体机器人（MSCRs）的闭环偏转控制。通过建立非均匀磁场中MSCR的不同态动态模型，文章推导出了机器人几何位置与雅可比矩阵存在唯一性的关系，并证明了雅可比矩阵准确的控制方向在模拟中至关重要。此外，文章还介绍了相应的准静态控制（QSC）框架，该框架结合了一个线性扩展状态观测器以估计模型不确定性。最后，文章讨论了该方法在实际应用中的影响。"
}