{
    "title": "PC$^2$: Pseudo-Classification Based Pseudo-Captioning for Noisy Correspondence Learning in Cross-Modal Retrieval",
    "abstract": "arXiv:2408.01349v1 Announce Type: cross  Abstract: In the realm of cross-modal retrieval, seamlessly integrating diverse modalities within multimedia remains a formidable challenge, especially given the complexities introduced by noisy correspondence learning (NCL). Such noise often stems from mismatched data pairs, which is a significant obstacle distinct from traditional noisy labels. This paper introduces Pseudo-Classification based Pseudo-Captioning (PC$^2$) framework to address this challenge. PC$^2$ offers a threefold strategy: firstly, it establishes an auxiliary \"pseudo-classification\" task that interprets captions as categorical labels, steering the model to learn image-text semantic similarity through a non-contrastive mechanism. Secondly, unlike prevailing margin-based techniques, capitalizing on PC$^2$'s pseudo-classification capability, we generate pseudo-captions to provide more informative and tangible supervision for each mismatched pair. Thirdly, the oscillation of pse",
    "link": "https://arxiv.org/abs/2408.01349",
    "context": "Title: PC$^2$: Pseudo-Classification Based Pseudo-Captioning for Noisy Correspondence Learning in Cross-Modal Retrieval\nAbstract: arXiv:2408.01349v1 Announce Type: cross  Abstract: In the realm of cross-modal retrieval, seamlessly integrating diverse modalities within multimedia remains a formidable challenge, especially given the complexities introduced by noisy correspondence learning (NCL). Such noise often stems from mismatched data pairs, which is a significant obstacle distinct from traditional noisy labels. This paper introduces Pseudo-Classification based Pseudo-Captioning (PC$^2$) framework to address this challenge. PC$^2$ offers a threefold strategy: firstly, it establishes an auxiliary \"pseudo-classification\" task that interprets captions as categorical labels, steering the model to learn image-text semantic similarity through a non-contrastive mechanism. Secondly, unlike prevailing margin-based techniques, capitalizing on PC$^2$'s pseudo-classification capability, we generate pseudo-captions to provide more informative and tangible supervision for each mismatched pair. Thirdly, the oscillation of pse",
    "path": "papers/24/08/2408.01349.json",
    "total_tokens": 739,
    "translated_title": "PC²：基于伪分类的伪描述生成方法在跨模态检索中的噪声对应学习",
    "translated_abstract": "在这篇论文中，我们探讨了跨模态检索中不同模态数据的无缝集成问题，尤其是对于噪声对应学习(NCL)所带来的复杂性。这种噪声通常源于数据对的错配，这是与传统有噪声标签问题相比的一个显著障碍。我们提出了一个基于伪分类的伪描述生成方法(PC²)框架来应对这一挑战。PC²提供了一个三重策略：首先，我们建立了一个辅助的“伪分类”任务，将描述解释为分类标签，通过非对比机制引导模型学习图像-文本语义相似性。其次，与现有的基于边际的技术不同，我们利用PC²的伪分类能力，生成伪描述，为每个错配对提供更具有信息和直观的监督。最后，我们通过伪描述的振荡来进一步增加损失函数的复杂性，以提升学习效率和模型性能。通过在多个具有挑战性的零样本和少样本检索任务上进行广泛的实验验证，我们的方法优于最先进的同类方法。",
    "tldr": "本文提出PC²框架，融合了伪分类和伪描述的方法，用于解决跨模态检索中的噪声对应学习问题。通过对描述进行分类，并为每个错配对生成伪描述，来提供更具有信息和直观的监督，提高学习效率和模型性能。"
}