{
    "title": "On the Resilience of Multi-Agent Systems with Malicious Agents",
    "abstract": "arXiv:2408.00989v1 Announce Type: new  Abstract: Multi-agent systems, powered by large language models, have shown great abilities across various tasks due to the collaboration of expert agents, each focusing on a specific domain. However, when agents are deployed separately, there is a risk that malicious users may introduce malicious agents who generate incorrect or irrelevant results that are too stealthy to be identified by other non-specialized agents. Therefore, this paper investigates two essential questions: (1) What is the resilience of various multi-agent system structures (e.g., A$\\rightarrow$B$\\rightarrow$C, A$\\leftrightarrow$B$\\leftrightarrow$C) under malicious agents, on different downstream tasks? (2) How can we increase system resilience to defend against malicious agents? To simulate malicious agents, we devise two methods, AutoTransform and AutoInject, to transform any agent into a malicious one while preserving its functional integrity. We run comprehensive experimen",
    "link": "https://arxiv.org/abs/2408.00989",
    "context": "Title: On the Resilience of Multi-Agent Systems with Malicious Agents\nAbstract: arXiv:2408.00989v1 Announce Type: new  Abstract: Multi-agent systems, powered by large language models, have shown great abilities across various tasks due to the collaboration of expert agents, each focusing on a specific domain. However, when agents are deployed separately, there is a risk that malicious users may introduce malicious agents who generate incorrect or irrelevant results that are too stealthy to be identified by other non-specialized agents. Therefore, this paper investigates two essential questions: (1) What is the resilience of various multi-agent system structures (e.g., A$\\rightarrow$B$\\rightarrow$C, A$\\leftrightarrow$B$\\leftrightarrow$C) under malicious agents, on different downstream tasks? (2) How can we increase system resilience to defend against malicious agents? To simulate malicious agents, we devise two methods, AutoTransform and AutoInject, to transform any agent into a malicious one while preserving its functional integrity. We run comprehensive experimen",
    "path": "papers/24/08/2408.00989.json",
    "total_tokens": 717,
    "translated_title": "具有恶意代理的multi-agent系统的弹性研究",
    "translated_abstract": "arXiv:2408.00989v1 公告类型: 新摘要：多代理系统，依靠大型语言模型，在各种任务中展示了强大的能力，因为专家代理专注于特定的领域。然而，当代理被单独部署时，存在一个风险，即恶意用户可能会引入恶意代理，这些代理生成的结果是错误的或不相关的，以至于其他非专门代理难以识别。因此，本文探讨了两个基本问题：（1）在不同类型的多代理系统结构（例如A->B->C，A<->B<->C）下，面对恶意代理时，各种下游任务的弹性是多少？（2）我们如何能增加系统抵御恶意代理的能力？为了模拟恶意代理，我们设计了两种方法，AutoTransform和AutoInject，将任何代理转换成恶意代理，同时保持其功能完整性。我们在多种下游任务上进行了全面实验，包括自然语言处理、知识抽取和文本生成任务，并与真实世界数据集进行了比较分析，以评估系统在面对恶意代理时的表现。我们发现，尽管multi-agent系统在面对恶意代理时表现出一定程度的脆弱性，但通过适当的结构设计和防御策略的制定，系统的整体性能是可以得到增强的。我们的工作不仅揭示了multi-agent系统在面对恶意攻击时的抗性，也为构建更安全、更健壮的协作系统提供了新的见解和策略。",
    "tldr": "本文研究了面对恶意代理时multi-agent系统的弹性，并探讨了增加系统抵御能力的方法。",
    "en_tdlr": "This paper investigates the resilience of multi-agent systems against malicious agents and explores strategies to enhance system defenses."
}