{
    "title": "Histopathology image embedding based on foundation models features aggregation for patient treatment response prediction",
    "abstract": "arXiv:2408.03954v1 Announce Type: new  Abstract: Predicting the response of a patient to a cancer treatment is of high interest. Nonetheless, this task is still challenging from a medical point of view due to the complexity of the interaction between the patient organism and the considered treatment. Recent works on foundation models pre-trained with self-supervised learning on large-scale unlabeled histopathology datasets have opened a new direction towards the development of new methods for cancer diagnosis related tasks. In this article, we propose a novel methodology for predicting Diffuse Large B-Cell Lymphoma patients treatment response from Whole Slide Images. Our method exploits several foundation models as feature extractors to obtain a local representation of the image corresponding to a small region of the tissue, then, a global representation of the image is obtained by aggregating these local representations using attention-based Multiple Instance Learning. Our experimenta",
    "link": "https://arxiv.org/abs/2408.03954",
    "context": "Title: Histopathology image embedding based on foundation models features aggregation for patient treatment response prediction\nAbstract: arXiv:2408.03954v1 Announce Type: new  Abstract: Predicting the response of a patient to a cancer treatment is of high interest. Nonetheless, this task is still challenging from a medical point of view due to the complexity of the interaction between the patient organism and the considered treatment. Recent works on foundation models pre-trained with self-supervised learning on large-scale unlabeled histopathology datasets have opened a new direction towards the development of new methods for cancer diagnosis related tasks. In this article, we propose a novel methodology for predicting Diffuse Large B-Cell Lymphoma patients treatment response from Whole Slide Images. Our method exploits several foundation models as feature extractors to obtain a local representation of the image corresponding to a small region of the tissue, then, a global representation of the image is obtained by aggregating these local representations using attention-based Multiple Instance Learning. Our experimenta",
    "path": "papers/24/08/2408.03954.json",
    "total_tokens": 327,
    "tldr": "该文章提出了一种利用基于大规模未标注病理图像预训练的基准模型特征聚合的方法，用于预测患者对癌症治疗的响应，该方法通过自监督学习在大型数据集上训练，旨在提高癌症诊断相关任务的效果。"
}