{
    "title": "Relevance meets Diversity: A User-Centric Framework for Knowledge Exploration through Recommendations",
    "abstract": "arXiv:2408.03772v1 Announce Type: cross  Abstract: Providing recommendations that are both relevant and diverse is a key consideration of modern recommender systems. Optimizing both of these measures presents a fundamental trade-off, as higher diversity typically comes at the cost of relevance, resulting in lower user engagement. Existing recommendation algorithms try to resolve this trade-off by combining the two measures, relevance and diversity, into one aim and then seeking recommendations that optimize the combined objective, for a given number of items to recommend. Traditional approaches, however, do not consider the user interaction with the recommended items.   In this paper, we put the user at the central stage, and build on the interplay between relevance, diversity, and user behavior. In contrast to applications where the goal is solely to maximize engagement, we focus on scenarios aiming at maximizing the total amount of knowledge encountered by the user. We use diversity ",
    "link": "https://arxiv.org/abs/2408.03772",
    "context": "Title: Relevance meets Diversity: A User-Centric Framework for Knowledge Exploration through Recommendations\nAbstract: arXiv:2408.03772v1 Announce Type: cross  Abstract: Providing recommendations that are both relevant and diverse is a key consideration of modern recommender systems. Optimizing both of these measures presents a fundamental trade-off, as higher diversity typically comes at the cost of relevance, resulting in lower user engagement. Existing recommendation algorithms try to resolve this trade-off by combining the two measures, relevance and diversity, into one aim and then seeking recommendations that optimize the combined objective, for a given number of items to recommend. Traditional approaches, however, do not consider the user interaction with the recommended items.   In this paper, we put the user at the central stage, and build on the interplay between relevance, diversity, and user behavior. In contrast to applications where the goal is solely to maximize engagement, we focus on scenarios aiming at maximizing the total amount of knowledge encountered by the user. We use diversity ",
    "path": "papers/24/08/2408.03772.json",
    "total_tokens": 311,
    "tldr": "该文章提出了一种新的用户中心化的知识探索推荐框架，通过考虑用户的交互行为，提高了推荐系统的多样性和用户的知识获取量。"
}