{
    "title": "MMSummary: Multimodal Summary Generation for Fetal Ultrasound Video",
    "abstract": "arXiv:2408.03761v1 Announce Type: new  Abstract: We present the first automated multimodal summary generation system, MMSummary, for medical imaging video, particularly with a focus on fetal ultrasound analysis. Imitating the examination process performed by a human sonographer, MMSummary is designed as a three-stage pipeline, progressing from keyframe detection to keyframe captioning and finally anatomy segmentation and measurement. In the keyframe detection stage, an innovative automated workflow is proposed to progressively select a concise set of keyframes, preserving sufficient video information without redundancy. Subsequently, we adapt a large language model to generate meaningful captions for fetal ultrasound keyframes in the keyframe captioning stage. If a keyframe is captioned as fetal biometry, the segmentation and measurement stage estimates biometric parameters by segmenting the region of interest according to the textual prior. The MMSummary system provides comprehensive ",
    "link": "https://arxiv.org/abs/2408.03761",
    "context": "Title: MMSummary: Multimodal Summary Generation for Fetal Ultrasound Video\nAbstract: arXiv:2408.03761v1 Announce Type: new  Abstract: We present the first automated multimodal summary generation system, MMSummary, for medical imaging video, particularly with a focus on fetal ultrasound analysis. Imitating the examination process performed by a human sonographer, MMSummary is designed as a three-stage pipeline, progressing from keyframe detection to keyframe captioning and finally anatomy segmentation and measurement. In the keyframe detection stage, an innovative automated workflow is proposed to progressively select a concise set of keyframes, preserving sufficient video information without redundancy. Subsequently, we adapt a large language model to generate meaningful captions for fetal ultrasound keyframes in the keyframe captioning stage. If a keyframe is captioned as fetal biometry, the segmentation and measurement stage estimates biometric parameters by segmenting the region of interest according to the textual prior. The MMSummary system provides comprehensive ",
    "path": "papers/24/08/2408.03761.json",
    "total_tokens": 399,
    "tldr": "该文章创新地提出了一种名为MMSummary的自动多模态摘要生成系统，用于胎儿超声视频分析，它模仿了人类超声医生进行检查的过程。系统中包含了三个阶段：关键帧检测、关键帧自动描述文本生成和关键帧中的解剖结构分割与测量。通过调整大型语言模型来为胎儿超声关键帧生成描述性文本，并对关键帧中的生物尺寸指标进行估计。这项技术为胎儿超声影像提供了全面的摘要和关键信息的精确提取，对医疗影像分析和医学教育具有重要意义。"
}