{
    "title": "Joint-Motion Mutual Learning for Pose Estimation in Videos",
    "abstract": "arXiv:2408.02285v1 Announce Type: new  Abstract: Human pose estimation in videos has long been a compelling yet challenging task within the realm of computer vision. Nevertheless, this task remains difficult because of the complex video scenes, such as video defocus and self-occlusion. Recent methods strive to integrate multi-frame visual features generated by a backbone network for pose estimation. However, they often ignore the useful joint information encoded in the initial heatmap, which is a by-product of the backbone generation. Comparatively, methods that attempt to refine the initial heatmap fail to consider any spatio-temporal motion features. As a result, the performance of existing methods for pose estimation falls short due to the lack of ability to leverage both local joint (heatmap) information and global motion (feature) dynamics.   To address this problem, we propose a novel joint-motion mutual learning framework for pose estimation, which effectively concentrates on bo",
    "link": "https://arxiv.org/abs/2408.02285",
    "context": "Title: Joint-Motion Mutual Learning for Pose Estimation in Videos\nAbstract: arXiv:2408.02285v1 Announce Type: new  Abstract: Human pose estimation in videos has long been a compelling yet challenging task within the realm of computer vision. Nevertheless, this task remains difficult because of the complex video scenes, such as video defocus and self-occlusion. Recent methods strive to integrate multi-frame visual features generated by a backbone network for pose estimation. However, they often ignore the useful joint information encoded in the initial heatmap, which is a by-product of the backbone generation. Comparatively, methods that attempt to refine the initial heatmap fail to consider any spatio-temporal motion features. As a result, the performance of existing methods for pose estimation falls short due to the lack of ability to leverage both local joint (heatmap) information and global motion (feature) dynamics.   To address this problem, we propose a novel joint-motion mutual learning framework for pose estimation, which effectively concentrates on bo",
    "path": "papers/24/08/2408.02285.json",
    "total_tokens": 607,
    "translated_title": "视频中姿态估计的联合运动互学习方法",
    "translated_abstract": "视频中的人脸姿态估计一直是在计算机视觉领域中既引人入胜又极具挑战性的任务。然而，由于复杂视频场景中的视频模糊和自我遮挡等原因，该任务仍然非常困难。最近的方法试图整合由骨干网络生成的多帧视觉特征来进行姿态估计。然而，它们常常忽视初始热图中的有用关节信息，热图是骨干生成的副产品。相比之下，试图细化初始热图的方法没有考虑任何空间和时间运动特征。因此，现有方法在姿态估计方面的性能不足，因为它们缺乏利用局部关节（热图）信息和全局运动（特征）动态的能力。为了解决这个问题，我们提出了一种新的用于姿态估计的联合运动互学习框架，该框架有效地集中在同时利用原始关节信息和运动特征动态上，从而显著提高了视频中姿态估计的准确性。",
    "tldr": "本文提出了一种新的视频姿态估计学习框架，通过结合原始关节信息和运动特征动态，有效提高了姿态估计的准确性。"
}