{
    "title": "Personalizing Federated Instrument Segmentation with Visual Trait Priors in Robotic Surgery",
    "abstract": "arXiv:2408.03208v1 Announce Type: cross  Abstract: Personalized federated learning (PFL) for surgical instrument segmentation (SIS) is a promising approach. It enables multiple clinical sites to collaboratively train a series of models in privacy, with each model tailored to the individual distribution of each site. Existing PFL methods rarely consider the personalization of multi-headed self-attention, and do not account for appearance diversity and instrument shape similarity, both inherent in surgical scenes. We thus propose PFedSIS, a novel PFL method with visual trait priors for SIS, incorporating global-personalized disentanglement (GPD), appearance-regulation personalized enhancement (APE), and shape-similarity global enhancement (SGE), to boost SIS performance in each site. GPD represents the first attempt at head-wise assignment for multi-headed self-attention personalization. To preserve the unique appearance representation of each site and gradually leverage the inter-site d",
    "link": "https://arxiv.org/abs/2408.03208",
    "context": "Title: Personalizing Federated Instrument Segmentation with Visual Trait Priors in Robotic Surgery\nAbstract: arXiv:2408.03208v1 Announce Type: cross  Abstract: Personalized federated learning (PFL) for surgical instrument segmentation (SIS) is a promising approach. It enables multiple clinical sites to collaboratively train a series of models in privacy, with each model tailored to the individual distribution of each site. Existing PFL methods rarely consider the personalization of multi-headed self-attention, and do not account for appearance diversity and instrument shape similarity, both inherent in surgical scenes. We thus propose PFedSIS, a novel PFL method with visual trait priors for SIS, incorporating global-personalized disentanglement (GPD), appearance-regulation personalized enhancement (APE), and shape-similarity global enhancement (SGE), to boost SIS performance in each site. GPD represents the first attempt at head-wise assignment for multi-headed self-attention personalization. To preserve the unique appearance representation of each site and gradually leverage the inter-site d",
    "path": "papers/24/08/2408.03208.json",
    "total_tokens": 401,
    "tldr": "该文章提出了一种名为PFedSIS的联邦学习方法，用于个性化手术器械分割。该方法通过引入视觉先验，结合全局个性化 disentanglement、外观调节个性化增强和形状相似性全局增强机制，解决了现有方法未能充分考虑多头自我注意力个性化的问题，并且能够捕捉手术场景中的外观多样性与器械形状相似性。通过对多头自我注意力的头权重个性化，该方法实现了对单个训练站点特征的精确适应，提高了在多个独立站点上的器械分割性能。"
}