{
    "title": "Domain penalisation for improved Out-of-Distribution Generalisation",
    "abstract": "arXiv:2408.01746v1 Announce Type: new  Abstract: In the field of object detection, domain generalisation (DG) aims to ensure robust performance across diverse and unseen target domains by learning the robust domain-invariant features corresponding to the objects of interest across multiple source domains. While there are many approaches established for performing DG for the task of classification, there has been a very little focus on object detection. In this paper, we propose a domain penalisation (DP) framework for the task of object detection, where the data is assumed to be sampled from multiple source domains and tested on completely unseen test domains. We assign penalisation weights to each domain, with the values updated based on the detection networks performance on the respective source domains. By prioritising the domains that needs more attention, our approach effectively balances the training process. We evaluate our solution on the GWHD 2021 dataset, a component of the W",
    "link": "https://arxiv.org/abs/2408.01746",
    "context": "Title: Domain penalisation for improved Out-of-Distribution Generalisation\nAbstract: arXiv:2408.01746v1 Announce Type: new  Abstract: In the field of object detection, domain generalisation (DG) aims to ensure robust performance across diverse and unseen target domains by learning the robust domain-invariant features corresponding to the objects of interest across multiple source domains. While there are many approaches established for performing DG for the task of classification, there has been a very little focus on object detection. In this paper, we propose a domain penalisation (DP) framework for the task of object detection, where the data is assumed to be sampled from multiple source domains and tested on completely unseen test domains. We assign penalisation weights to each domain, with the values updated based on the detection networks performance on the respective source domains. By prioritising the domains that needs more attention, our approach effectively balances the training process. We evaluate our solution on the GWHD 2021 dataset, a component of the W",
    "path": "papers/24/08/2408.01746.json",
    "total_tokens": 685,
    "translated_title": "域惩罚改进的界限泛化",
    "translated_abstract": "arXiv:2408.01746v1 公告类型：新  翻译摘要：在对象检测领域，域泛化（DG）旨在通过学习对应于感兴趣对象的多个源域中固有的稳健域不变特征，确保在不同和未知的目标域中表现出健壮性能。尽管对于分类任务已经有许多基于DG的方法，但对于对象检测领域，相关工作却相当少。在这篇论文中，我们提出了一种域惩罚（DP）框架，用于对象检测任务。在这种框架下，数据是从多个源域中抽取的，并且在完全未知的目标测试域中进行验证。我们为每个域分配惩罚权重，这些权重将根据检测网络在各自源域上的性能进行更新。通过优先考虑需要更多关注的域，我们的方法有效地平衡了训练过程。我们在GWHD 2021数据集上评估了我们的解决方案，它是Wathlon Object Detection Challenge的一部分。我们的方法在目标检测任务中成功地减少了源域和目标域之间的差距，实现了数据增强，同时最大限度地减少了过拟合的风险，最终实现了性能上的提升。",
    "tldr": "本文提出了一种域惩罚框架，用于平衡多源域数据集中对象检测的训练过程，解决了域泛化问题，并在GWHD 2021数据集上取得了提升。"
}