{
    "title": "Self-Emotion Blended Dialogue Generation in Social Simulation Agents",
    "abstract": "arXiv:2408.01633v1 Announce Type: cross  Abstract: When engaging in conversations, dialogue agents in a virtual simulation environment may exhibit their own emotional states that are unrelated to the immediate conversational context, a phenomenon known as self-emotion. This study explores how such self-emotion affects the agents' behaviors in dialogue strategies and decision-making within a large language model (LLM)-driven simulation framework. In a dialogue strategy prediction experiment, we analyze the dialogue strategy choices employed by agents both with and without self-emotion, comparing them to those of humans. The results show that incorporating self-emotion helps agents exhibit more human-like dialogue strategies. In an independent experiment comparing the performance of models fine-tuned on GPT-4 generated dialogue datasets, we demonstrate that self-emotion can lead to better overall naturalness and humanness. Finally, in a virtual simulation environment where agents have di",
    "link": "https://arxiv.org/abs/2408.01633",
    "context": "Title: Self-Emotion Blended Dialogue Generation in Social Simulation Agents\nAbstract: arXiv:2408.01633v1 Announce Type: cross  Abstract: When engaging in conversations, dialogue agents in a virtual simulation environment may exhibit their own emotional states that are unrelated to the immediate conversational context, a phenomenon known as self-emotion. This study explores how such self-emotion affects the agents' behaviors in dialogue strategies and decision-making within a large language model (LLM)-driven simulation framework. In a dialogue strategy prediction experiment, we analyze the dialogue strategy choices employed by agents both with and without self-emotion, comparing them to those of humans. The results show that incorporating self-emotion helps agents exhibit more human-like dialogue strategies. In an independent experiment comparing the performance of models fine-tuned on GPT-4 generated dialogue datasets, we demonstrate that self-emotion can lead to better overall naturalness and humanness. Finally, in a virtual simulation environment where agents have di",
    "path": "papers/24/08/2408.01633.json",
    "total_tokens": 427,
    "tldr": "该文章研究了在虚拟仿真环境中，对话代理在未受当前对话直接影响的情况下表现出其自身情感状态的现象，并探讨了这种\"自我情感\"对其对话策略和决策行为的影响。研究通过实验比较了带有和没有自我情感的代理的对话策略选择，以及与人类的选择对比，结果表明包含自我情感有助于代理人展现出更接近人类的对话策略。此外，研究还通过比较在拥有自我情感的对话代理数据集上进行微调的模型与未微调模型的性能，证明自我情感有助于提升对话的自然度和真实性。最后，研究在一个代理人拥有不同自我情感的虚拟仿真环境中，展示了自我情感如何影响代理人的交互行为和环境内的社交模拟过程。"
}