{
    "title": "RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with Structural Priors",
    "abstract": "arXiv:2408.02184v1 Announce Type: new  Abstract: Humans are capable of continuously manipulating a wide variety of deformable objects into complex shapes. This is made possible by our intuitive understanding of material properties and mechanics of the object, for reasoning about object states even when visual perception is occluded. These capabilities allow us to perform diverse tasks ranging from cooking with dough to expressing ourselves with pottery-making. However, developing robotic systems to robustly perform similar tasks remains challenging, as current methods struggle to effectively model volumetric deformable objects and reason about the complex behavior they typically exhibit. To study the robotic systems and algorithms capable of deforming volumetric objects, we introduce a novel robotics task of continuously deforming clay on a pottery wheel. We propose a pipeline for perception and pottery skill-learning, called RoPotter, wherein we demonstrate that structural priors spec",
    "link": "https://arxiv.org/abs/2408.02184",
    "context": "Title: RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with Structural Priors\nAbstract: arXiv:2408.02184v1 Announce Type: new  Abstract: Humans are capable of continuously manipulating a wide variety of deformable objects into complex shapes. This is made possible by our intuitive understanding of material properties and mechanics of the object, for reasoning about object states even when visual perception is occluded. These capabilities allow us to perform diverse tasks ranging from cooking with dough to expressing ourselves with pottery-making. However, developing robotic systems to robustly perform similar tasks remains challenging, as current methods struggle to effectively model volumetric deformable objects and reason about the complex behavior they typically exhibit. To study the robotic systems and algorithms capable of deforming volumetric objects, we introduce a novel robotics task of continuously deforming clay on a pottery wheel. We propose a pipeline for perception and pottery skill-learning, called RoPotter, wherein we demonstrate that structural priors spec",
    "path": "papers/24/08/2408.02184.json",
    "total_tokens": 328,
    "tldr": "该文章提出了一种名为RoPotter的机器人技术，用于处理具有结构先验的连续可变形物体（如陶土）的操纵，为实现机器人手工艺技能和感知学习提供了新方法。"
}