{
    "title": "Can multivariate Granger causality detect directed connectivity of a multistable and dynamic biological decision network model?",
    "abstract": "arXiv:2408.01528v1 Announce Type: new  Abstract: Extracting causal connections can advance interpretable AI and machine learning. Granger causality (GC) is a robust statistical method for estimating directed influences (DC) between signals. While GC has been widely applied to analysing neuronal signals in biological neural networks and other domains, its application to complex, nonlinear, and multistable neural networks is less explored. In this study, we applied time-domain multi-variate Granger causality (MVGC) to the time series neural activity of all nodes in a trained multistable biologically based decision neural network model with real-time decision uncertainty monitoring. Our analysis demonstrated that challenging two-choice decisions, where input signals could be closely matched, and the appropriate application of fine-grained sliding time windows, could readily reveal the original model's DC. Furthermore, the identified DC varied based on whether the network had correct or er",
    "link": "https://arxiv.org/abs/2408.01528",
    "context": "Title: Can multivariate Granger causality detect directed connectivity of a multistable and dynamic biological decision network model?\nAbstract: arXiv:2408.01528v1 Announce Type: new  Abstract: Extracting causal connections can advance interpretable AI and machine learning. Granger causality (GC) is a robust statistical method for estimating directed influences (DC) between signals. While GC has been widely applied to analysing neuronal signals in biological neural networks and other domains, its application to complex, nonlinear, and multistable neural networks is less explored. In this study, we applied time-domain multi-variate Granger causality (MVGC) to the time series neural activity of all nodes in a trained multistable biologically based decision neural network model with real-time decision uncertainty monitoring. Our analysis demonstrated that challenging two-choice decisions, where input signals could be closely matched, and the appropriate application of fine-grained sliding time windows, could readily reveal the original model's DC. Furthermore, the identified DC varied based on whether the network had correct or er",
    "path": "papers/24/08/2408.01528.json",
    "total_tokens": 313,
    "tldr": "研究展示了多变量Granger因果分析能够检测具有实时决策不确定监控的生物性决策网络模型的复杂多稳态神经网络中节点的时间序列活动之间的直接影响。"
}