{
    "title": "Hybrid Deep Learning Framework for Enhanced Melanoma Detection",
    "abstract": "arXiv:2408.00772v1 Announce Type: cross  Abstract: Cancer is a leading cause of death worldwide, necessitating advancements in early detection and treatment technologies. In this paper, we present a novel and highly efficient melanoma detection framework that synergistically combines the strengths of U-Net for segmentation and EfficientNet for the classification of skin images. The primary objective of our study is to enhance the accuracy and efficiency of melanoma detection through an innovative hybrid approach. We utilized the HAM10000 dataset to meticulously train the U-Net model, enabling it to precisely segment cancerous regions. Concurrently, we employed the ISIC 2020 dataset to train the EfficientNet model, optimizing it for the binary classification of skin cancer. Our hybrid model demonstrates a significant improvement in performance, achieving a remarkable accuracy of 99.01% on the ISIC 2020 dataset. This exceptional result underscores the superiority of our approach compared",
    "link": "https://arxiv.org/abs/2408.00772",
    "context": "Title: Hybrid Deep Learning Framework for Enhanced Melanoma Detection\nAbstract: arXiv:2408.00772v1 Announce Type: cross  Abstract: Cancer is a leading cause of death worldwide, necessitating advancements in early detection and treatment technologies. In this paper, we present a novel and highly efficient melanoma detection framework that synergistically combines the strengths of U-Net for segmentation and EfficientNet for the classification of skin images. The primary objective of our study is to enhance the accuracy and efficiency of melanoma detection through an innovative hybrid approach. We utilized the HAM10000 dataset to meticulously train the U-Net model, enabling it to precisely segment cancerous regions. Concurrently, we employed the ISIC 2020 dataset to train the EfficientNet model, optimizing it for the binary classification of skin cancer. Our hybrid model demonstrates a significant improvement in performance, achieving a remarkable accuracy of 99.01% on the ISIC 2020 dataset. This exceptional result underscores the superiority of our approach compared",
    "path": "papers/24/08/2408.00772.json",
    "total_tokens": 640,
    "translated_title": "混合深度学习框架在增强黑色素瘤检测中的应用",
    "translated_abstract": "在癌症已经成为全球死亡的主要原因之一的情况下，迫切需要改进早期检测和治疗技术。在这篇论文中，我们提出了一种新型的、高效的黑色素瘤检测框架，该框架结合了U-Net分割模型和EfficientNet皮肤图像分类模型的独特优势。我们的研究主要目标是通过创新的融合方法提高黑色素瘤的准确性和效率。我们利用HAM10000数据集精心训练了U-Net模型，使其能够精确地分割出癌性区域。同时，我们使用ISIC 2020数据集对EfficientNet模型进行训练，优化了它对皮肤癌症的二元分类。我们的混合模型在ISIC 2020数据集上的表现显著提高，达到了惊人的99.01%的准确性。这一卓越的结果表明，我们的方法在性能上比现有的方法有了很大的提升。",
    "tldr": "本文提出了一种结合U-Net分割和EfficientNet分类的混合深度学习框架，显著提高了黑色素瘤检测的准确率。",
    "en_tdlr": "This paper presents a novel hybrid deep learning framework that combines the strengths of U-Net for segmentation and EfficientNet for skin image classification to significantly enhance the accuracy of melanoma detection."
}