{
    "title": "A Jellyfish Cyborg: Exploiting Natural Embodied Intelligence as Soft Robots",
    "abstract": "arXiv:2408.01941v1 Announce Type: new  Abstract: In the advanced field of bio-inspired robotics, the emergence of cyborgs represents the successful integration of engineering and biological systems. Building on previous research that showed how electrical stimuli could initiate and speed up a jellyfish's movement, this study presents a groundbreaking approach that explores how the natural embodied intelligence of the animal can be harnessed to address pivotal challenges such as spontaneous exploration, navigation in various environments, control of whole-body motion, and real-time predictions of behavior. We have developed a comprehensive data acquisition system and a unique setup for stimulating jellyfish, allowing for a detailed study of their movements. Through careful analysis of both spontaneous behaviors and behaviors induced by targeted stimulation, we have identified subtle differences between natural and induced motion patterns. By using a machine learning method called physic",
    "link": "https://arxiv.org/abs/2408.01941",
    "context": "Title: A Jellyfish Cyborg: Exploiting Natural Embodied Intelligence as Soft Robots\nAbstract: arXiv:2408.01941v1 Announce Type: new  Abstract: In the advanced field of bio-inspired robotics, the emergence of cyborgs represents the successful integration of engineering and biological systems. Building on previous research that showed how electrical stimuli could initiate and speed up a jellyfish's movement, this study presents a groundbreaking approach that explores how the natural embodied intelligence of the animal can be harnessed to address pivotal challenges such as spontaneous exploration, navigation in various environments, control of whole-body motion, and real-time predictions of behavior. We have developed a comprehensive data acquisition system and a unique setup for stimulating jellyfish, allowing for a detailed study of their movements. Through careful analysis of both spontaneous behaviors and behaviors induced by targeted stimulation, we have identified subtle differences between natural and induced motion patterns. By using a machine learning method called physic",
    "path": "papers/24/08/2408.01941.json",
    "total_tokens": 575,
    "translated_title": "章鱼智能体：利用自然生命体智能软机器人",
    "translated_abstract": "论文研究了生物启发机器人领域中生物机器人的新兴趋势，特别是如何将工程技术与生物系统成功整合。研究团队在这篇论文中展示了人工能够赋能自然动物生命的智能，比如通过电信号促进海龟速度，进一步开拓了生命体智能在各种环境下的自主探索，导航控制与实时行为预测领域的应用。论文详细介绍了研究团队开发的生理数据收集系统与刺激海龟的无害人工环境与方法。通过精细分析自然行为与通过刺激条件诱导的行为模式，揭示了自然与人工行为模式之间差异。应用了机器学习算法分析注射后的行为模式，并对未来的海龟智能体应用提出了展望。",
    "tldr": "基于电刺激技术，研究团队开发了一种人工赋能自然动物智能的软机器人，有望用于环境自主探索、导航以及实时行为预测。"
}