{
    "title": "Structure from Motion-based Motion Estimation and 3D Reconstruction of Unknown Shaped Space Debris",
    "abstract": "arXiv:2408.01035v1 Announce Type: new  Abstract: With the boost in the number of spacecraft launches in the current decades, the space debris problem is daily becoming significantly crucial. For sustainable space utilization, the continuous removal of space debris is the most severe problem for humanity. To maximize the reliability of the debris capture mission in orbit, accurate motion estimation of the target is essential. Space debris has lost its attitude and orbit control capabilities, and its shape is unknown due to the break. This paper proposes the Structure from Motion-based algorithm to perform unknown shaped space debris motion estimation with limited resources, where only 2D images are required as input. The method then outputs the reconstructed shape of the unknown object and the relative pose trajectory between the target and the camera simultaneously, which are exploited to estimate the target's motion. The method is quantitatively validated with the realistic image data",
    "link": "https://arxiv.org/abs/2408.01035",
    "context": "Title: Structure from Motion-based Motion Estimation and 3D Reconstruction of Unknown Shaped Space Debris\nAbstract: arXiv:2408.01035v1 Announce Type: new  Abstract: With the boost in the number of spacecraft launches in the current decades, the space debris problem is daily becoming significantly crucial. For sustainable space utilization, the continuous removal of space debris is the most severe problem for humanity. To maximize the reliability of the debris capture mission in orbit, accurate motion estimation of the target is essential. Space debris has lost its attitude and orbit control capabilities, and its shape is unknown due to the break. This paper proposes the Structure from Motion-based algorithm to perform unknown shaped space debris motion estimation with limited resources, where only 2D images are required as input. The method then outputs the reconstructed shape of the unknown object and the relative pose trajectory between the target and the camera simultaneously, which are exploited to estimate the target's motion. The method is quantitatively validated with the realistic image data",
    "path": "papers/24/08/2408.01035.json",
    "total_tokens": 643,
    "translated_title": "基于运动结构的全动态估计和未知形状空间碎片的三维重建",
    "translated_abstract": "arXiv:2408.01035v1 公告类型：新  摘要：随着近年来 spacecraft 发射数量的增加，空间碎片问题日益成为人类必须面对的关键问题。为了实现空间利用的可持续性，在轨的碎片清除任务可靠性是其面临的主要问题之一。为了提高在轨清除任务的成功率，目标的高精度动量估计至关重要。由于碎片失掉了姿态和轨道控制能力，以及形状因破碎不明，因此本文提出了一种基于运动结构的算法，它使用有限资源来执行不明形状空间碎片的运动估计，仅需要二维图像作为输入。该方法输出物体的不明形状和目标与摄像机之间的相对姿态轨迹，这些信息被用来估计目标的运动。该方法在现实图像数据上进行了定量的验证。",
    "tldr": "本研究提出了一种基于运动结构的算法，能够利用有限的资源和对未知形状的空间碎片进行运动估计，并同时输出物体的不明形状和相关摄像机的相对姿态轨迹，这些信息用于精确估计目标的运动状态。",
    "en_tdlr": "This study proposes an algorithm based on Motion Structure that can estimate the motion of unknown-shaped space debris with limited resources, concurrently outputting the unknown shape of the object and relative pose trajectories between the target and the camera, which are used to accurately estimate the motion state of the target."
}