{
    "title": "A Decomposition of Interaction Force for Multi-Agent Co-Manipulation",
    "abstract": "arXiv:2408.01543v1 Announce Type: new  Abstract: Multi-agent human-robot co-manipulation is a poorly understood process with many inputs that potentially affect agent behavior. This paper explores one such input known as interaction force. Interaction force is potentially a primary component in communication that occurs during co-manipulation. There are, however, many different perspectives and definitions of interaction force in the literature. Therefore, a decomposition of interaction force is proposed that provides a consistent way of ascertaining the state of an agent relative to the group for multi-agent co-manipulation. This proposed method extends a current definition from one to four degrees of freedom, does not rely on a predefined object path, and is independent of the number of agents acting on the system and their locations and input wrenches (forces and torques). In addition, all of the necessary measures can be obtained by a self-contained robotic system, allowing for a m",
    "link": "https://arxiv.org/abs/2408.01543",
    "context": "Title: A Decomposition of Interaction Force for Multi-Agent Co-Manipulation\nAbstract: arXiv:2408.01543v1 Announce Type: new  Abstract: Multi-agent human-robot co-manipulation is a poorly understood process with many inputs that potentially affect agent behavior. This paper explores one such input known as interaction force. Interaction force is potentially a primary component in communication that occurs during co-manipulation. There are, however, many different perspectives and definitions of interaction force in the literature. Therefore, a decomposition of interaction force is proposed that provides a consistent way of ascertaining the state of an agent relative to the group for multi-agent co-manipulation. This proposed method extends a current definition from one to four degrees of freedom, does not rely on a predefined object path, and is independent of the number of agents acting on the system and their locations and input wrenches (forces and torques). In addition, all of the necessary measures can be obtained by a self-contained robotic system, allowing for a m",
    "path": "papers/24/08/2408.01543.json",
    "total_tokens": 361,
    "tldr": "该文章提出了一种多Agent协同操作中交互力的新分解方法，能够确定代理相对于群体的状态，并扩展了定义以包含四个自由度，不需要预定物体路径，且不依赖于代理数量、位置或输入力矩。该方法能够通过自包含的机器人系统实现，为协同操作中的通信机制提供了新的理解。"
}