{
    "title": "Training a multilayer dynamical spintronic network with standard machine learning tools to perform time series classification",
    "abstract": "arXiv:2408.02835v1 Announce Type: cross  Abstract: The ability to process time-series at low energy cost is critical for many applications. Recurrent neural network, which can perform such tasks, are computationally expensive when implementing in software on conventional computers. Here we propose to implement a recurrent neural network in hardware using spintronic oscillators as dynamical neurons. Using numerical simulations, we build a multi-layer network and demonstrate that we can use backpropagation through time (BPTT) and standard machine learning tools to train this network. Leveraging the transient dynamics of the spintronic oscillators, we solve the sequential digits classification task with $89.83\\pm2.91~\\%$ accuracy, as good as the equivalent software network. We devise guidelines on how to choose the time constant of the oscillators as well as hyper-parameters of the network to adapt to different input time scales.",
    "link": "https://arxiv.org/abs/2408.02835",
    "context": "Title: Training a multilayer dynamical spintronic network with standard machine learning tools to perform time series classification\nAbstract: arXiv:2408.02835v1 Announce Type: cross  Abstract: The ability to process time-series at low energy cost is critical for many applications. Recurrent neural network, which can perform such tasks, are computationally expensive when implementing in software on conventional computers. Here we propose to implement a recurrent neural network in hardware using spintronic oscillators as dynamical neurons. Using numerical simulations, we build a multi-layer network and demonstrate that we can use backpropagation through time (BPTT) and standard machine learning tools to train this network. Leveraging the transient dynamics of the spintronic oscillators, we solve the sequential digits classification task with $89.83\\pm2.91~\\%$ accuracy, as good as the equivalent software network. We devise guidelines on how to choose the time constant of the oscillators as well as hyper-parameters of the network to adapt to different input time scales.",
    "path": "papers/24/08/2408.02835.json",
    "total_tokens": 402,
    "tldr": "该文章提出使用标准机器学习工具在硬件上实现 recurrent neural network，通过在 spintronic oscillator 上构建多层网络，并通过 backpropagation through time（BPTT）进行训练，从而可以在低能源成本下处理时间序列数据。文章通过模拟证明了该方法的有效性，并在解决序列数字分类任务时取得了与软件网络相当的 $89.83\\pm2.91~\\%$ 准确率。文章还提供了关于如何选择振荡器的时间常数以及网络超参数的指导，以便适应不同的输入时间尺度。"
}