{
    "title": "Scenario-based Thermal Management Parametrization Through Deep Reinforcement Learning",
    "abstract": "arXiv:2408.02022v1 Announce Type: cross  Abstract: The thermal system of battery electric vehicles demands advanced control. Its thermal management needs to effectively control active components across varying operating conditions. While robust control function parametrization is required, current methodologies show significant drawbacks. They consume considerable time, human effort, and extensive real-world testing. Consequently, there is a need for innovative and intelligent solutions that are capable of autonomously parametrizing embedded controllers. Addressing this issue, our paper introduces a learning-based tuning approach. We propose a methodology that benefits from automated scenario generation for increased robustness across vehicle usage scenarios. Our deep reinforcement learning agent processes the tuning task context and incorporates an image-based interpretation of embedded parameter sets. We demonstrate its applicability to a valve controller parametrization task and ver",
    "link": "https://arxiv.org/abs/2408.02022",
    "context": "Title: Scenario-based Thermal Management Parametrization Through Deep Reinforcement Learning\nAbstract: arXiv:2408.02022v1 Announce Type: cross  Abstract: The thermal system of battery electric vehicles demands advanced control. Its thermal management needs to effectively control active components across varying operating conditions. While robust control function parametrization is required, current methodologies show significant drawbacks. They consume considerable time, human effort, and extensive real-world testing. Consequently, there is a need for innovative and intelligent solutions that are capable of autonomously parametrizing embedded controllers. Addressing this issue, our paper introduces a learning-based tuning approach. We propose a methodology that benefits from automated scenario generation for increased robustness across vehicle usage scenarios. Our deep reinforcement learning agent processes the tuning task context and incorporates an image-based interpretation of embedded parameter sets. We demonstrate its applicability to a valve controller parametrization task and ver",
    "path": "papers/24/08/2408.02022.json",
    "total_tokens": 306,
    "tldr": "该文章提出了一种利用深度强化学习算法进行场景驱动的电池电动车辆热管理系统参数优化的方法。这种方法能够自动生成热管理场景，并通过图像来表示嵌入式参数集，从而使参数调整更加高效和适应多种车辆使用情况。"
}