{
    "title": "Categorical generalization of BF theory coupled to gravity",
    "abstract": "arXiv:2408.02889v1 Announce Type: new  Abstract: We present a thorough introduction to the tools of category theory required for formulating gauge theories based on 2-connections. We provide a detailed construction of the categorical generalization of BF theory, dubbed BFCG, also known as 2BF. Similar to BF gravity, it is known that BFCG can be deformed to give general relativity. Here, we obtain an alternative relation between BFCG and gravity, which consists of coupling general relativity and BFCG by means of the volume form constructed out of the BFCG connections. The resulting theory, closely related to unimodular gravity, is a generalization of BF sequestered gravity not only in the sense that it adds new fields but also in that it allows for new choices for the volume form that is coupled to gravity. Furthermore, we show that BF sequestered gravity in the abelian case is recovered for a specific choice of the 2-group.",
    "link": "https://arxiv.org/abs/2408.02889",
    "context": "Title: Categorical generalization of BF theory coupled to gravity\nAbstract: arXiv:2408.02889v1 Announce Type: new  Abstract: We present a thorough introduction to the tools of category theory required for formulating gauge theories based on 2-connections. We provide a detailed construction of the categorical generalization of BF theory, dubbed BFCG, also known as 2BF. Similar to BF gravity, it is known that BFCG can be deformed to give general relativity. Here, we obtain an alternative relation between BFCG and gravity, which consists of coupling general relativity and BFCG by means of the volume form constructed out of the BFCG connections. The resulting theory, closely related to unimodular gravity, is a generalization of BF sequestered gravity not only in the sense that it adds new fields but also in that it allows for new choices for the volume form that is coupled to gravity. Furthermore, we show that BF sequestered gravity in the abelian case is recovered for a specific choice of the 2-group.",
    "path": "papers/24/08/2408.02889.json",
    "total_tokens": 422,
    "tldr": "该文章详细介绍了用于制定基于2连结的gauge理论的范畴论工具，并提供了范畴化BF理论（称为BFCG，也被称为2BF）的详尽构造。文章还展示了如何通过使用BFCG连接构造的体积形式将广义相对论与BFCG耦合起来，从而获得了一种与不变引力相关的不同关系。这种理论是BF隔离引力的一个范畴化推广，它不仅在新字段方面有所扩展，而且在体积形式的选择上也提供了一些新的可能性。此外，文章还展示了在abelian情形下，对于特定2群的选取，可以恢复BFCG的abelian版本。"
}