{
    "title": "Y Social: an LLM-powered Social Media Digital Twin",
    "abstract": "arXiv:2408.00818v1 Announce Type: new  Abstract: In this paper we introduce Y, a new-generation digital twin designed to replicate an online social media platform. Digital twins are virtual replicas of physical systems that allow for advanced analyses and experimentation. In the case of social media, a digital twin such as Y provides a powerful tool for researchers to simulate and understand complex online interactions. {\\tt Y} leverages state-of-the-art Large Language Models (LLMs) to replicate sophisticated agent behaviors, enabling accurate simulations of user interactions, content dissemination, and network dynamics. By integrating these aspects, Y offers valuable insights into user engagement, information spread, and the impact of platform policies. Moreover, the integration of LLMs allows Y to generate nuanced textual content and predict user responses, facilitating the study of emergent phenomena in online environments.   To better characterize the proposed digital twin, in this",
    "link": "https://arxiv.org/abs/2408.00818",
    "context": "Title: Y Social: an LLM-powered Social Media Digital Twin\nAbstract: arXiv:2408.00818v1 Announce Type: new  Abstract: In this paper we introduce Y, a new-generation digital twin designed to replicate an online social media platform. Digital twins are virtual replicas of physical systems that allow for advanced analyses and experimentation. In the case of social media, a digital twin such as Y provides a powerful tool for researchers to simulate and understand complex online interactions. {\\tt Y} leverages state-of-the-art Large Language Models (LLMs) to replicate sophisticated agent behaviors, enabling accurate simulations of user interactions, content dissemination, and network dynamics. By integrating these aspects, Y offers valuable insights into user engagement, information spread, and the impact of platform policies. Moreover, the integration of LLMs allows Y to generate nuanced textual content and predict user responses, facilitating the study of emergent phenomena in online environments.   To better characterize the proposed digital twin, in this",
    "path": "papers/24/08/2408.00818.json",
    "total_tokens": 593,
    "translated_title": "Y 社交：基于 LLMs 的社交媒体数字双胞胎",
    "translated_abstract": "我们介绍了一个新的数字双胞胎 Y，它旨在模拟一个在线社交平台。数字双胞胎是物理系统的虚拟复制品，用于进行高级分析和实验。在社交媒体的情况下，像 Y 这样的数字双胞胎提供了一种强大的工具，让研究人员能够模拟和理解复杂在线互动。Y 通过使用最先进的自然语言处理技术，可以复现复杂的用户行为，并准确地模拟用户互动、内容传播和网络动态。通过整合这些方面，Y 提供有关用户参与度、信息传播和平台政策影响的宝贵见解。此外，通过集成 LLMs，Y 能够生成复杂的文本内容和预测用户反应，有助于研究在线环境中的新兴现象。",
    "tldr": "Y 社交是一个使用最新自然语言处理技术的社交媒体数字双胞胎，它能够模拟复杂的用户行为和在线平台的动态，为研究人员提供了宝贵的分析工具。"
}