{
    "title": "Unveiling Hidden Visual Information: A Reconstruction Attack Against Adversarial Visual Information Hiding",
    "abstract": "arXiv:2408.04261v1 Announce Type: new  Abstract: This paper investigates the security vulnerabilities of adversarial-example-based image encryption by executing data reconstruction (DR) attacks on encrypted images. A representative image encryption method is the adversarial visual information hiding (AVIH), which uses type-I adversarial example training to protect gallery datasets used in image recognition tasks. In the AVIH method, the type-I adversarial example approach creates images that appear completely different but are still recognized by machines as the original ones. Additionally, the AVIH method can restore encrypted images to their original forms using a predefined private key generative model. For the best security, assigning a unique key to each image is recommended; however, storage limitations may necessitate some images sharing the same key model. This raises a crucial security question for AVIH: How many images can safely share the same key model without being comprom",
    "link": "https://arxiv.org/abs/2408.04261",
    "context": "Title: Unveiling Hidden Visual Information: A Reconstruction Attack Against Adversarial Visual Information Hiding\nAbstract: arXiv:2408.04261v1 Announce Type: new  Abstract: This paper investigates the security vulnerabilities of adversarial-example-based image encryption by executing data reconstruction (DR) attacks on encrypted images. A representative image encryption method is the adversarial visual information hiding (AVIH), which uses type-I adversarial example training to protect gallery datasets used in image recognition tasks. In the AVIH method, the type-I adversarial example approach creates images that appear completely different but are still recognized by machines as the original ones. Additionally, the AVIH method can restore encrypted images to their original forms using a predefined private key generative model. For the best security, assigning a unique key to each image is recommended; however, storage limitations may necessitate some images sharing the same key model. This raises a crucial security question for AVIH: How many images can safely share the same key model without being comprom",
    "path": "papers/24/08/2408.04261.json",
    "total_tokens": 330,
    "tldr": "该文章提出了一种针对对抗式视觉信息隐藏(AVIH)的攻击，揭示了隐藏在加密图像中的隐藏信息，并讨论了AVIH方法中使用的独特密钥模型在实际应用中的安全和效率问题。"
}