{
    "title": "Past Movements-Guided Motion Representation Learning for Human Motion Prediction",
    "abstract": "arXiv:2408.02091v1 Announce Type: new  Abstract: Human motion prediction based on 3D skeleton is a significant challenge in computer vision, primarily focusing on the effective representation of motion. In this paper, we propose a self-supervised learning framework designed to enhance motion representation. This framework consists of two stages: first, the network is pretrained through the self-reconstruction of past sequences, and the guided reconstruction of future sequences based on past movements. We design a velocity-based mask strategy to focus on the joints with large-scale moving. Subsequently, the pretrained network undergoes finetuning for specific tasks. Self-reconstruction, guided by patterns of past motion, substantially improves the model's ability to represent the spatiotemporal relationships among joints but also captures the latent relationships between past and future sequences. This capability is crucial for motion prediction tasks that solely depend on historical mo",
    "link": "https://arxiv.org/abs/2408.02091",
    "context": "Title: Past Movements-Guided Motion Representation Learning for Human Motion Prediction\nAbstract: arXiv:2408.02091v1 Announce Type: new  Abstract: Human motion prediction based on 3D skeleton is a significant challenge in computer vision, primarily focusing on the effective representation of motion. In this paper, we propose a self-supervised learning framework designed to enhance motion representation. This framework consists of two stages: first, the network is pretrained through the self-reconstruction of past sequences, and the guided reconstruction of future sequences based on past movements. We design a velocity-based mask strategy to focus on the joints with large-scale moving. Subsequently, the pretrained network undergoes finetuning for specific tasks. Self-reconstruction, guided by patterns of past motion, substantially improves the model's ability to represent the spatiotemporal relationships among joints but also captures the latent relationships between past and future sequences. This capability is crucial for motion prediction tasks that solely depend on historical mo",
    "path": "papers/24/08/2408.02091.json",
    "total_tokens": 381,
    "tldr": "该文章提出了一种结合历史动作模式的自监督学习框架，旨在通过自我复现过去序列和未来序列的引导复现，有效提升3D骨骼动作用户输入内容中的创新和贡献体现在其框架能够通过模仿过去动作模式来增强动作表示，并在此基础上进行未来的动作预测。通过一个用于关注显著运动关节的加权策略，文章增强了模型对空间和时间关系的理解和潜在的过去与未来关系的捕获，这对于仅依赖历史动作数据的动作预测至关重要。"
}