{
    "title": "Soft-Hard Attention U-Net Model and Benchmark Dataset for Multiscale Image Shadow Removal",
    "abstract": "arXiv:2408.03734v1 Announce Type: new  Abstract: Effective shadow removal is pivotal in enhancing the visual quality of images in various applications, ranging from computer vision to digital photography. During the last decades physics and machine learning -based methodologies have been proposed; however, most of them have limited capacity in capturing complex shadow patterns due to restrictive model assumptions, neglecting the fact that shadows usually appear at different scales. Also, current datasets used for benchmarking shadow removal are composed of a limited number of images with simple scenes containing mainly uniform shadows cast by single objects, whereas only a few of them include both manual shadow annotations and paired shadow-free images. Aiming to address all these limitations in the context of natural scene imaging, including urban environments with complex scenes, the contribution of this study is twofold: a) it proposes a novel deep learning architecture, named Soft-",
    "link": "https://arxiv.org/abs/2408.03734",
    "context": "Title: Soft-Hard Attention U-Net Model and Benchmark Dataset for Multiscale Image Shadow Removal\nAbstract: arXiv:2408.03734v1 Announce Type: new  Abstract: Effective shadow removal is pivotal in enhancing the visual quality of images in various applications, ranging from computer vision to digital photography. During the last decades physics and machine learning -based methodologies have been proposed; however, most of them have limited capacity in capturing complex shadow patterns due to restrictive model assumptions, neglecting the fact that shadows usually appear at different scales. Also, current datasets used for benchmarking shadow removal are composed of a limited number of images with simple scenes containing mainly uniform shadows cast by single objects, whereas only a few of them include both manual shadow annotations and paired shadow-free images. Aiming to address all these limitations in the context of natural scene imaging, including urban environments with complex scenes, the contribution of this study is twofold: a) it proposes a novel deep learning architecture, named Soft-",
    "path": "papers/24/08/2408.03734.json",
    "total_tokens": 384,
    "tldr": "该文章提出了一种名为Soft-Hard Attention U-Net的深度学习模型，旨在增强多尺度图像中去阴影的效果，并建立了一个包含手动阴影标注和配对无阴影图像的基准数据集，以应对现有去阴影方法的限制，如模型假设的限制性、复杂阴影模式的忽视、以及仅包含简单场景的现有数据集问题。通过这个模型和数据集，研究者能够更有效地处理多样化的阴影场景，这对于提高图像质量和提升计算机视觉和数字摄影等领域的应用效率至关重要。"
}