{
    "title": "Automatic identification of the area covered by acorn trees in the dehesa (pastureland) Extremadura of Spain",
    "abstract": "arXiv:2408.03542v1 Announce Type: new  Abstract: The acorn is the fruit of the oak and is an important crop in the Spanish dehesa extreme\\~na, especially for the value it provides in the Iberian pig food to obtain the \"acorn\" certification. For this reason, we want to maximise the production of Iberian pigs with the appropriate weight. Hence the need to know the area covered by the crowns of the acorn trees, to determine the covered wooded area (CWA, from the Spanish Superficie Arbolada Cubierta SAC) and thereby estimate the number of Iberian pigs that can be released per hectare, as indicated by the royal decree 4/2014. In this work, we propose the automatic estimation of the CWA, through aerial digital images (orthophotos) of the pastureland of Extremadura, and with this, to offer the possibility of determining the number of Iberian pigs to be released in a specific plot of land. Among the main issues for automatic detection are, first, the correct identification of acorn trees, seco",
    "link": "https://arxiv.org/abs/2408.03542",
    "context": "Title: Automatic identification of the area covered by acorn trees in the dehesa (pastureland) Extremadura of Spain\nAbstract: arXiv:2408.03542v1 Announce Type: new  Abstract: The acorn is the fruit of the oak and is an important crop in the Spanish dehesa extreme\\~na, especially for the value it provides in the Iberian pig food to obtain the \"acorn\" certification. For this reason, we want to maximise the production of Iberian pigs with the appropriate weight. Hence the need to know the area covered by the crowns of the acorn trees, to determine the covered wooded area (CWA, from the Spanish Superficie Arbolada Cubierta SAC) and thereby estimate the number of Iberian pigs that can be released per hectare, as indicated by the royal decree 4/2014. In this work, we propose the automatic estimation of the CWA, through aerial digital images (orthophotos) of the pastureland of Extremadura, and with this, to offer the possibility of determining the number of Iberian pigs to be released in a specific plot of land. Among the main issues for automatic detection are, first, the correct identification of acorn trees, seco",
    "path": "papers/24/08/2408.03542.json",
    "total_tokens": 419,
    "tldr": "该文章提出了通过自动估计覆盖面积（SAC）来最大化西班牙Extremadura地区橡树林下放养的伊比利亚猪的数量的方法。使用遥感技术，作者旨在通过自动检测技术来确定橡树的冠层覆盖面积，以及估算在特定土地上可以放养的伊比利亚猪的数量。"
}