{
    "title": "Resilience and Security of Deep Neural Networks Against Intentional and Unintentional Perturbations: Survey and Research Challenges",
    "abstract": "arXiv:2408.00193v2 Announce Type: replace-cross  Abstract: In order to deploy deep neural networks (DNNs) in high-stakes scenarios, it is imperative that DNNs provide inference robust to external perturbations - both intentional and unintentional. Although the resilience of DNNs to intentional and unintentional perturbations has been widely investigated, a unified vision of these inherently intertwined problem domains is still missing. In this work, we fill this gap by providing a survey of the state of the art and highlighting the similarities of the proposed approaches.We also analyze the research challenges that need to be addressed to deploy resilient and secure DNNs. As there has not been any such survey connecting the resilience of DNNs to intentional and unintentional perturbations, we believe this work can help advance the frontier in both domains by enabling the exchange of ideas between the two communities.",
    "link": "https://arxiv.org/abs/2408.00193",
    "context": "Title: Resilience and Security of Deep Neural Networks Against Intentional and Unintentional Perturbations: Survey and Research Challenges\nAbstract: arXiv:2408.00193v2 Announce Type: replace-cross  Abstract: In order to deploy deep neural networks (DNNs) in high-stakes scenarios, it is imperative that DNNs provide inference robust to external perturbations - both intentional and unintentional. Although the resilience of DNNs to intentional and unintentional perturbations has been widely investigated, a unified vision of these inherently intertwined problem domains is still missing. In this work, we fill this gap by providing a survey of the state of the art and highlighting the similarities of the proposed approaches.We also analyze the research challenges that need to be addressed to deploy resilient and secure DNNs. As there has not been any such survey connecting the resilience of DNNs to intentional and unintentional perturbations, we believe this work can help advance the frontier in both domains by enabling the exchange of ideas between the two communities.",
    "path": "papers/24/08/2408.00193.json",
    "total_tokens": 373,
    "tldr": "该文章对于深层神经网络在应对有意和无意的系统干扰下的韧性及安全性进行了综合性的调查，强调了研究方法间的相似性，并指出了在部署可靠的深层神经网络时必须解决的研究挑战。这篇工作不仅是首个将深层神经网络对有意和无意干扰的韧性进行综合调查的论文，而且覆盖了深层神经网络在不同干扰情况下的相似研究，促进了相关社区之间研究的融合与发展。"
}