{
    "title": "Walk Wisely on Graph: Knowledge Graph Reasoning with Dual Agents via Efficient Guidance-Exploration",
    "abstract": "arXiv:2408.01880v1 Announce Type: new  Abstract: Recent years, multi-hop reasoning has been widely studied for knowledge graph (KG) reasoning due to its efficacy and interpretability. However, previous multi-hop reasoning approaches are subject to two primary shortcomings. First, agents struggle to learn effective and robust policies at the early phase due to sparse rewards. Second, these approaches often falter on specific datasets like sparse knowledge graphs, where agents are required to traverse lengthy reasoning paths. To address these problems, we propose a multi-hop reasoning model with dual agents based on hierarchical reinforcement learning (HRL), which is named FULORA. FULORA tackles the above reasoning challenges by eFficient GUidance-ExpLORAtion between dual agents. The high-level agent walks on the simplified knowledge graph to provide stage-wise hints for the low-level agent walking on the original knowledge graph. In this framework, the low-level agent optimizes a value ",
    "link": "https://arxiv.org/abs/2408.01880",
    "context": "Title: Walk Wisely on Graph: Knowledge Graph Reasoning with Dual Agents via Efficient Guidance-Exploration\nAbstract: arXiv:2408.01880v1 Announce Type: new  Abstract: Recent years, multi-hop reasoning has been widely studied for knowledge graph (KG) reasoning due to its efficacy and interpretability. However, previous multi-hop reasoning approaches are subject to two primary shortcomings. First, agents struggle to learn effective and robust policies at the early phase due to sparse rewards. Second, these approaches often falter on specific datasets like sparse knowledge graphs, where agents are required to traverse lengthy reasoning paths. To address these problems, we propose a multi-hop reasoning model with dual agents based on hierarchical reinforcement learning (HRL), which is named FULORA. FULORA tackles the above reasoning challenges by eFficient GUidance-ExpLORAtion between dual agents. The high-level agent walks on the simplified knowledge graph to provide stage-wise hints for the low-level agent walking on the original knowledge graph. In this framework, the low-level agent optimizes a value ",
    "path": "papers/24/08/2408.01880.json",
    "total_tokens": 768,
    "translated_title": "《双人赛跑在图表上：通过有效指引-探索的代理双人知识图推理》",
    "translated_abstract": "最近几年，多跳推理在知识图（KG）推理领域得到了广泛的研究，原因在于其有效性和可解释性。然而，由于奖励稀疏，先前的大多跳推理方法存在两个主要缺陷。首先，代理在早期阶段难以学会有效的、稳健的政策。其次，这些方法通常在一些特定的数据集上表现不佳，如稀疏知识图，在这些数据集中，代理需要走过长路径进行推理。为了解决这些问题，我们提出了一个基于层次强化学习（HRL）的代理双人知识图推理模型，名为FULORA。FULORA通过高效指引-探索的双人代理来应对上述推理挑战。高级代理在简化后的知识图上行走，为低级代理在原始知识图上的行走提供阶段引导。在这个框架中，低级代理优化一个价值，以便选择适当的边缘来导航知识图以到达目标实体。在这种方式中，高级代理通过提供阶段性指引来增强低级代理的经验积累，使得低级代理可以从高级代理的指导下快速收敛到最佳策略，而无需代理从头开始在原始知识图上进行探索。这一过程有效地加速了推理学习过程，提升了代理在许多不同类型知识图上的推理性能。试验结果表明，与现有方法相比，FULORA在错误率和其他效果指标上均表现出优越性能，尤其是在稀疏和大规模知识图推理任务中。",
    "tldr": "本文提出了一种名为FULORA的代理双人知识图推理模型，该模型利用层次强化学习中的高效指引-探索策略来克服多跳推理中的奖励稀疏和训练难题。通过高级代理提供阶段指引，低级代理能够快速收敛到最佳策略，并且在多个知识图推理任务中展现出优越性能。"
}