{
    "title": "Integrated Intention Prediction and Decision-Making with Spectrum Attention Net and Proximal Policy Optimization",
    "abstract": "arXiv:2408.03191v1 Announce Type: new  Abstract: For autonomous driving in highly dynamic environments, it is anticipated to predict the future behaviors of surrounding vehicles (SVs) and make safe and effective decisions. However, modeling the inherent coupling effect between the prediction and decision-making modules has been a long-standing challenge, especially when there is a need to maintain appropriate computational efficiency. To tackle these problems, we propose a novel integrated intention prediction and decision-making approach, which explicitly models the coupling relationship and achieves efficient computation. Specifically, a spectrum attention net is designed to predict the intentions of SVs by capturing the trends of each frequency component over time and their interrelations. Fast computation of the intention prediction module is attained as the predicted intentions are not decoded to trajectories in the executing process. Furthermore, the proximal policy optimization ",
    "link": "https://arxiv.org/abs/2408.03191",
    "context": "Title: Integrated Intention Prediction and Decision-Making with Spectrum Attention Net and Proximal Policy Optimization\nAbstract: arXiv:2408.03191v1 Announce Type: new  Abstract: For autonomous driving in highly dynamic environments, it is anticipated to predict the future behaviors of surrounding vehicles (SVs) and make safe and effective decisions. However, modeling the inherent coupling effect between the prediction and decision-making modules has been a long-standing challenge, especially when there is a need to maintain appropriate computational efficiency. To tackle these problems, we propose a novel integrated intention prediction and decision-making approach, which explicitly models the coupling relationship and achieves efficient computation. Specifically, a spectrum attention net is designed to predict the intentions of SVs by capturing the trends of each frequency component over time and their interrelations. Fast computation of the intention prediction module is attained as the predicted intentions are not decoded to trajectories in the executing process. Furthermore, the proximal policy optimization ",
    "path": "papers/24/08/2408.03191.json",
    "total_tokens": 358,
    "tldr": "该文章提出了一种结合频谱注意力网络和近端策略优化的方法，旨在自动驾驶中实现对周围车辆意图的高效预测和决策制定。该方法通过捕捉频率成分随时间的变化趋势和它们的相互关系，预测周围车辆的意图，同时避免了在执行过程中将预测的意图解码成轨迹，从而提高了意图预测模块的计算效率。此外，通过近端策略优化，该方法实现了安全有效的决策制定。"
}