{
    "title": "Deep Learning Meets OBIA: Tasks, Challenges, Strategies, and Perspectives",
    "abstract": "arXiv:2408.01607v1 Announce Type: new  Abstract: Deep learning has gained significant attention in remote sensing, especially in pixel- or patch-level applications. Despite initial attempts to integrate deep learning into object-based image analysis (OBIA), its full potential remains largely unexplored. In this article, as OBIA usage becomes more widespread, we conducted a comprehensive review and expansion of its task subdomains, with or without the integration of deep learning. Furthermore, we have identified and summarized five prevailing strategies to address the challenge of deep learning's limitations in directly processing unstructured object data within OBIA, and this review also recommends some important future research directions. Our goal with these endeavors is to inspire more exploration in this fascinating yet overlooked area and facilitate the integration of deep learning into OBIA processing workflows.",
    "link": "https://arxiv.org/abs/2408.01607",
    "context": "Title: Deep Learning Meets OBIA: Tasks, Challenges, Strategies, and Perspectives\nAbstract: arXiv:2408.01607v1 Announce Type: new  Abstract: Deep learning has gained significant attention in remote sensing, especially in pixel- or patch-level applications. Despite initial attempts to integrate deep learning into object-based image analysis (OBIA), its full potential remains largely unexplored. In this article, as OBIA usage becomes more widespread, we conducted a comprehensive review and expansion of its task subdomains, with or without the integration of deep learning. Furthermore, we have identified and summarized five prevailing strategies to address the challenge of deep learning's limitations in directly processing unstructured object data within OBIA, and this review also recommends some important future research directions. Our goal with these endeavors is to inspire more exploration in this fascinating yet overlooked area and facilitate the integration of deep learning into OBIA processing workflows.",
    "path": "papers/24/08/2408.01607.json",
    "total_tokens": 588,
    "translated_title": "深度学习与OBIA的结合：任务、挑战、策略和视野",
    "translated_abstract": "arXiv:2408.01607v1 公告类型：新  摘要：在遥感领域，特别是像素级或块级应用中，深度学习取得了显著的关注。尽管已经尝试将深度学习融入到对象为基础图像分析（OBIA）中，但它的潜力尚未完全开发。本文对遥感领域中OBIA的使用日益广泛，我们进行了全面的研究和拓展，包括其任务子领域，无论是否整合了深度学习。此外，我们已识别和总结了五种流行的策略来应对在OBIA中直接处理对象数据的挑战，本文的回顾还提出了未来值得注意的研究方向。我们的目标是激发在这个有趣的但被忽视的领域中更多的探索，并促进深度学习在OBIA处理流程中更加广泛的使用。",
    "tldr": "本文详细阐述了深度学习在遥感领域中的OBIA任务、面临的挑战以及应对策略，并提出了未来的研究方向。",
    "en_tdlr": "This paper comprehensively discusses the tasks, challenges, and strategies for integrating deep learning into OBIA in the field of remote sensing, and proposes future research directions."
}