{
    "title": "Dise\\~no de sonido para producciones audiovisuales e historias sonoras en el aula. Hacia una docencia creativa mediante el uso de herramientas inteligentes",
    "abstract": "arXiv:2408.02113v1 Announce Type: cross  Abstract: This study aims to share a teaching experience teaching sound design for audiovisual productions and compares different projects tackled by students. It is not intended to be a comparative analysis of different types of teaching but rather an analysis of different problems observed in different profiles of students of the subject who study it in different grades. The world of audio can be very interesting for a large part of the students, both those with creative and technical inclinations. Musical creation and production, synchronization with images, dubbing, etc. They are disciplines that are generally interesting but can have a very high barrier to entry due to their great technical complexity. Sometimes it can take weeks or even months for the uninitiated to begin to use audio editing programs with the necessary ease, which are not always particularly intuitive for students. Learning through the use of PBL methodologies generates, ",
    "link": "https://arxiv.org/abs/2408.02113",
    "context": "Title: Dise\\~no de sonido para producciones audiovisuales e historias sonoras en el aula. Hacia una docencia creativa mediante el uso de herramientas inteligentes\nAbstract: arXiv:2408.02113v1 Announce Type: cross  Abstract: This study aims to share a teaching experience teaching sound design for audiovisual productions and compares different projects tackled by students. It is not intended to be a comparative analysis of different types of teaching but rather an analysis of different problems observed in different profiles of students of the subject who study it in different grades. The world of audio can be very interesting for a large part of the students, both those with creative and technical inclinations. Musical creation and production, synchronization with images, dubbing, etc. They are disciplines that are generally interesting but can have a very high barrier to entry due to their great technical complexity. Sometimes it can take weeks or even months for the uninitiated to begin to use audio editing programs with the necessary ease, which are not always particularly intuitive for students. Learning through the use of PBL methodologies generates, ",
    "path": "papers/24/08/2408.02113.json",
    "total_tokens": 789,
    "translated_title": "音频视觉作品声音设计的教学设计探索：通过智能工具实现创新教学",
    "translated_abstract": "arXiv:2408.02113v1 公告类型：交叉 Abstract: 本研究旨在分享传授音频视觉作品声音设计的教学经验，并与不同项目下的学生进行比较。本研究的目的并非对不同类型的教学进行比较，而更侧重于分析在不同年级学习该课程的不同学生的个性化问题。对于很大一部分学生来说，音频世界可能非常有趣，无论是那些具有创造性和技术倾向的学生。音乐创作和制作、音频与图像的同步、配音等学科通常对学生很有吸引力，但由于其极高的技术复杂性，它们有时可能成为入门的一个非常高的门槛，特别是对于不熟悉音频编辑软件的学生来说，他们可能需要几周甚至几个月的时间来熟练使用这些软件，而这些软件并非总对学生用户特别直观。通过采用项目式学习（PBL）方法论的学习可以显著提高学生的专业实践能力，有效的学习策略和资源能够使学生在较短的时间内掌握专业知识，从而推动学习效率的提升。此外，构建一个包容和互动的课堂环境对于鼓励学生在实践中勇于尝试和犯错至关重要，教师需要根据学生的实际情况提供个性化的支持和指导。对于高校教师来说，了解学生的学习偏好和学习风格对于设计有效教学方法和策略至关重要。",
    "tldr": "本研究通过智能工具进行创新教学，探索了音频视觉作品声音设计的教学方法，强调了项目式学习在提升学生音频技术实践能力中的作用，同时突出了创建包容性和互动性的学习环境的重要性，以及教师对学生个性化支持与指导的必要性。",
    "en_tdlr": "This study explores innovative teaching methods for sound design in audiovisual productions using intelligent tools, emphasizing the role of project-based learning in enhancing students' practical skills in audio technology. It also highlights the importance of creating an inclusive and interactive learning environment, as well as the need for personalized support and guidance from teachers."
}