{
    "title": "Trainable Pointwise Decoder Module for Point Cloud Segmentation",
    "abstract": "arXiv:2408.01548v1 Announce Type: new  Abstract: Point cloud segmentation (PCS) aims to make per-point predictions and enables robots and autonomous driving cars to understand the environment. The range image is a dense representation of a large-scale outdoor point cloud, and segmentation models built upon the image commonly execute efficiently. However, the projection of the point cloud onto the range image inevitably leads to dropping points because, at each image coordinate, only one point is kept despite multiple points being projected onto the same location. More importantly, it is challenging to assign correct predictions to the dropped points that belong to the classes different from the kept point class. Besides, existing post-processing methods, such as K-nearest neighbor (KNN) search and kernel point convolution (KPConv), cannot be trained with the models in an end-to-end manner or cannot process varying-density outdoor point clouds well, thereby enabling the models to achiev",
    "link": "https://arxiv.org/abs/2408.01548",
    "context": "Title: Trainable Pointwise Decoder Module for Point Cloud Segmentation\nAbstract: arXiv:2408.01548v1 Announce Type: new  Abstract: Point cloud segmentation (PCS) aims to make per-point predictions and enables robots and autonomous driving cars to understand the environment. The range image is a dense representation of a large-scale outdoor point cloud, and segmentation models built upon the image commonly execute efficiently. However, the projection of the point cloud onto the range image inevitably leads to dropping points because, at each image coordinate, only one point is kept despite multiple points being projected onto the same location. More importantly, it is challenging to assign correct predictions to the dropped points that belong to the classes different from the kept point class. Besides, existing post-processing methods, such as K-nearest neighbor (KNN) search and kernel point convolution (KPConv), cannot be trained with the models in an end-to-end manner or cannot process varying-density outdoor point clouds well, thereby enabling the models to achiev",
    "path": "papers/24/08/2408.01548.json",
    "total_tokens": 347,
    "tldr": "该文章提出了一种可训练的点权解码器模块，用于点云分割任务。这种模块能够解决点云投影过程中丢失点的问题，同时在保持点云原有密度的同时，还能对缺失的点进行正确的类别预测，为机器人和自动驾驶车辆提供了更好的环境理解能力。"
}