{
    "title": "SiCo: A Size-Controllable Virtual Try-On Approach for Informed Decision-Making",
    "abstract": "arXiv:2408.02803v1 Announce Type: cross  Abstract: Virtual try-on (VTO) applications aim to improve the online shopping experience by allowing users to preview garments, before making purchase decisions. However, many VTO tools fail to consider the crucial relationship between a garment's size and the user's body size, often employing a one-size-fits-all approach when visualizing a clothing item. This results in poor size recommendations and purchase decisions leading to increased return rates. To address this limitation, we introduce SiCo, an online VTO system, where users can upload images of themselves and visualize how different sizes of clothing would look on their body to help make better-informed purchase decisions. Our user study shows SiCo's superiority over baseline VTO. The results indicate that our approach significantly enhances user ability to gauge the appearance of outfits on their bodies and boosts their confidence in selecting clothing sizes that match desired goals. ",
    "link": "https://arxiv.org/abs/2408.02803",
    "context": "Title: SiCo: A Size-Controllable Virtual Try-On Approach for Informed Decision-Making\nAbstract: arXiv:2408.02803v1 Announce Type: cross  Abstract: Virtual try-on (VTO) applications aim to improve the online shopping experience by allowing users to preview garments, before making purchase decisions. However, many VTO tools fail to consider the crucial relationship between a garment's size and the user's body size, often employing a one-size-fits-all approach when visualizing a clothing item. This results in poor size recommendations and purchase decisions leading to increased return rates. To address this limitation, we introduce SiCo, an online VTO system, where users can upload images of themselves and visualize how different sizes of clothing would look on their body to help make better-informed purchase decisions. Our user study shows SiCo's superiority over baseline VTO. The results indicate that our approach significantly enhances user ability to gauge the appearance of outfits on their bodies and boosts their confidence in selecting clothing sizes that match desired goals. ",
    "path": "papers/24/08/2408.02803.json",
    "total_tokens": 338,
    "tldr": "该文章描述了一种名为SiCo的虚拟试衣新方法，它通过考虑用户的身体尺寸和衣物尺寸之间的相互作用，为用户提供了更准确的衣物展示效果，从而帮助用户做出更有信息支持的购买决策。"
}