{
    "title": "Respiratory Subtraction for Pulmonary Microwave Ablation Evaluation",
    "abstract": "arXiv:2408.04299v1 Announce Type: new  Abstract: Currently, lung cancer is a leading cause of global cancer mortality, often necessitating minimally invasive interventions. Microwave ablation (MWA) is extensively utilized for both primary and secondary lung tumors. Although numerous clinical guidelines and standards for MWA have been established, the clinical evaluation of ablation surgery remains challenging and requires long-term patient follow-up for confirmation. In this paper, we propose a method termed respiratory subtraction to evaluate lung tumor ablation therapy performance based on pre- and post-operative image guidance. Initially, preoperative images undergo coarse rigid registration to their corresponding postoperative positions, followed by further non-rigid registration. Subsequently, subtraction images are generated by subtracting the registered preoperative images from the postoperative ones. Furthermore, to enhance the clinical assessment of MWA treatment performance, ",
    "link": "https://arxiv.org/abs/2408.04299",
    "context": "Title: Respiratory Subtraction for Pulmonary Microwave Ablation Evaluation\nAbstract: arXiv:2408.04299v1 Announce Type: new  Abstract: Currently, lung cancer is a leading cause of global cancer mortality, often necessitating minimally invasive interventions. Microwave ablation (MWA) is extensively utilized for both primary and secondary lung tumors. Although numerous clinical guidelines and standards for MWA have been established, the clinical evaluation of ablation surgery remains challenging and requires long-term patient follow-up for confirmation. In this paper, we propose a method termed respiratory subtraction to evaluate lung tumor ablation therapy performance based on pre- and post-operative image guidance. Initially, preoperative images undergo coarse rigid registration to their corresponding postoperative positions, followed by further non-rigid registration. Subsequently, subtraction images are generated by subtracting the registered preoperative images from the postoperative ones. Furthermore, to enhance the clinical assessment of MWA treatment performance, ",
    "path": "papers/24/08/2408.04299.json",
    "total_tokens": 336,
    "tldr": "该文章提出了一种名为呼吸运动减去的图像处理方法，用于评估肺肿瘤微波消融治疗的疗效。该方法通过精炼的刚性配准和进一步的非刚性配准技术，结合术前和术后的影像资料，生成减影图像，以增强对微波消融治疗效果的临床评估。"
}