{
    "title": "Positive-Unlabeled Constraint Learning (PUCL) for Inferring Nonlinear Continuous Constraints Functions from Expert Demonstrations",
    "abstract": "arXiv:2408.01622v1 Announce Type: new  Abstract: Planning for a wide range of real-world robotic tasks necessitates to know and write all constraints. However, instances exist where these constraints are either unknown or challenging to specify accurately. A possible solution is to infer the unknown constraints from expert demonstration. This paper presents a novel Positive-Unlabeled Constraint Learning (PUCL) algorithm to infer a continuous arbitrary constraint function from demonstration, without requiring prior knowledge of the true constraint parameterization or environmental model as existing works. Within our framework, we treat all data in demonstrations as positive (feasible) data, and learn a control policy to generate potentially infeasible trajectories, which serve as unlabeled data. In each iteration, we first update the policy and then a two-step positive-unlabeled learning procedure is applied, where it first identifies reliable infeasible data using a distance metric, an",
    "link": "https://arxiv.org/abs/2408.01622",
    "context": "Title: Positive-Unlabeled Constraint Learning (PUCL) for Inferring Nonlinear Continuous Constraints Functions from Expert Demonstrations\nAbstract: arXiv:2408.01622v1 Announce Type: new  Abstract: Planning for a wide range of real-world robotic tasks necessitates to know and write all constraints. However, instances exist where these constraints are either unknown or challenging to specify accurately. A possible solution is to infer the unknown constraints from expert demonstration. This paper presents a novel Positive-Unlabeled Constraint Learning (PUCL) algorithm to infer a continuous arbitrary constraint function from demonstration, without requiring prior knowledge of the true constraint parameterization or environmental model as existing works. Within our framework, we treat all data in demonstrations as positive (feasible) data, and learn a control policy to generate potentially infeasible trajectories, which serve as unlabeled data. In each iteration, we first update the policy and then a two-step positive-unlabeled learning procedure is applied, where it first identifies reliable infeasible data using a distance metric, an",
    "path": "papers/24/08/2408.01622.json",
    "total_tokens": 708,
    "translated_title": "基于专家演示的非线性连续约束学习算法 (PUCL)",
    "translated_abstract": "论文介绍了一种新型的“正负未标注约束学习”(PUCL)算法，用于从专家演示中推断非线性连续约束函数，而不需要预先知道真实的约束参数化或者环境模型。在我们的框架中，我们把所有的演示数据都视为正样例（可行的）数据，并且在学习策略时创造潜在的不可行轨迹作为未标注的数据。在每次迭代中，首先更新策略，然后应用一个两步的正负未标注学习过程，其中首先使用距离度量来确定可靠的不可行数据，随后使用正负未标注数据学习一个确定性约束函数，它代表了一个有界集上的近似，并且在可行域的相邻区域内。通过这样的迭代过程，我们可以优化策略以提高数据集的质量并减弱策略的不确定性，最终学习到更精确的约束函数。本算法在机器人任务的规划和复杂环境中具有潜在的应用价值，那里完整的约束可能既未知也不易准确表达。",
    "tldr": "本论文提出了一个名为PUCL的新算法，用于从专家演示中推断未知连续约束函数，无需事先了解约束参数化和环境模型。算法通过训练策略从可行和不可行路径中提取信息，逐步优化约束函数。",
    "en_tdlr": "This paper introduces a novel Positive-Unlabeled Constraint Learning (PUCL) algorithm capable of inferring arbitrary continuous constraint functions from expert demonstrations without prior knowledge of their parameterization or environmental models. The approach updates a policy iteratively, leveraging both positive (feasible) and potentially infeasible trajectories to infer a more accurate constraint function, suitable for complex robotic planning tasks."
}