{
    "title": "Focal Depth Estimation: A Calibration-Free, Subject- and Daytime Invariant Approach",
    "abstract": "arXiv:2408.03591v1 Announce Type: new  Abstract: In an era where personalized technology is increasingly intertwined with daily life, traditional eye-tracking systems and autofocal glasses face a significant challenge: the need for frequent, user-specific calibration, which impedes their practicality. This study introduces a groundbreaking calibration-free method for estimating focal depth, leveraging machine learning techniques to analyze eye movement features within short sequences. Our approach, distinguished by its innovative use of LSTM networks and domain-specific feature engineering, achieves a mean absolute error (MAE) of less than 10 cm, setting a new focal depth estimation accuracy standard. This advancement promises to enhance the usability of autofocal glasses and pave the way for their seamless integration into extended reality environments, marking a significant leap forward in personalized visual technology.",
    "link": "https://arxiv.org/abs/2408.03591",
    "context": "Title: Focal Depth Estimation: A Calibration-Free, Subject- and Daytime Invariant Approach\nAbstract: arXiv:2408.03591v1 Announce Type: new  Abstract: In an era where personalized technology is increasingly intertwined with daily life, traditional eye-tracking systems and autofocal glasses face a significant challenge: the need for frequent, user-specific calibration, which impedes their practicality. This study introduces a groundbreaking calibration-free method for estimating focal depth, leveraging machine learning techniques to analyze eye movement features within short sequences. Our approach, distinguished by its innovative use of LSTM networks and domain-specific feature engineering, achieves a mean absolute error (MAE) of less than 10 cm, setting a new focal depth estimation accuracy standard. This advancement promises to enhance the usability of autofocal glasses and pave the way for their seamless integration into extended reality environments, marking a significant leap forward in personalized visual technology.",
    "path": "papers/24/08/2408.03591.json",
    "total_tokens": 312,
    "tldr": "该文章提出了一种无需用户特定校准的眼球追踪系统，通过深度学习模型分析眼球运动特征，实现了厘米级别的焦点距离估算精度，为提高个性化视觉技术和增强现实应用的集成水平做出了贡献。"
}