{
    "title": "Semantic Skill Grounding for Embodied Instruction-Following in Cross-Domain Environments",
    "abstract": "arXiv:2408.01024v1 Announce Type: new  Abstract: In embodied instruction-following (EIF), the integration of pretrained language models (LMs) as task planners emerges as a significant branch, where tasks are planned at the skill level by prompting LMs with pretrained skills and user instructions. However, grounding these pretrained skills in different domains remains challenging due to their intricate entanglement with the domain-specific knowledge. To address this challenge, we present a semantic skill grounding (SemGro) framework that leverages the hierarchical nature of semantic skills. SemGro recognizes the broad spectrum of these skills, ranging from short-horizon low-semantic skills that are universally applicable across domains to long-horizon rich-semantic skills that are highly specialized and tailored for particular domains. The framework employs an iterative skill decomposition approach, starting from the higher levels of semantic skill hierarchy and then moving downwards, s",
    "link": "https://arxiv.org/abs/2408.01024",
    "context": "Title: Semantic Skill Grounding for Embodied Instruction-Following in Cross-Domain Environments\nAbstract: arXiv:2408.01024v1 Announce Type: new  Abstract: In embodied instruction-following (EIF), the integration of pretrained language models (LMs) as task planners emerges as a significant branch, where tasks are planned at the skill level by prompting LMs with pretrained skills and user instructions. However, grounding these pretrained skills in different domains remains challenging due to their intricate entanglement with the domain-specific knowledge. To address this challenge, we present a semantic skill grounding (SemGro) framework that leverages the hierarchical nature of semantic skills. SemGro recognizes the broad spectrum of these skills, ranging from short-horizon low-semantic skills that are universally applicable across domains to long-horizon rich-semantic skills that are highly specialized and tailored for particular domains. The framework employs an iterative skill decomposition approach, starting from the higher levels of semantic skill hierarchy and then moving downwards, s",
    "path": "papers/24/08/2408.01024.json",
    "total_tokens": 659,
    "translated_title": "跨域环境中基于身体指令遵循的语义技能接地",
    "translated_abstract": "arXiv:2408.01024v1 新闻类型：新消息 摘要：在基于身体指令遵循（EIF）中，作为任务规划器整合预训练语言模型（LMs）的出现是一个重要的分支，任务在技能层级上被预训练技能和用户指令提示的语言模型所规划。然而，在不同领域中接地这些预训练技能仍然是一个挑战，因为它们与特定领域的知识紧密纠缠。为了解决这一挑战，我们提出了一个语义技能接地（SemGro）框架，该框架利用了语义技能的层次性。SemGro认识到了这些技能的广泛范围，从在不同领域都普遍适用的低语义技能到高度专门化和特定于某一领域的长期前景丰富语义技能。该框架采用了迭代的技能分解方法，从具有较高语义技能层次的更广泛范围开始，然后再逐步向下，将语义技能分解为更为细粒度的组成部分，以准确地规划出适应于特定领域的指令遵循任务。",
    "tldr": "本文提出了一个SemGro框架，通过迭代分解技能，使预训练的语言模型能够针对不同领域规划指令遵循任务。",
    "en_tdlr": "This paper introduces the SemGro framework, capable of planning instruction-following tasks for different domains using iterative skill decomposition with pretrained language models."
}