{
    "title": "Underwater litter monitoring using consumer-grade aerial-aquatic speedy scanner (AASS) and deep learning based super-resolution reconstruction and detection network",
    "abstract": "arXiv:2408.03564v1 Announce Type: new  Abstract: Underwater litter is widely spread across aquatic environments such as lakes, rivers, and oceans, significantly impacting natural ecosystems. Current monitoring technologies for detecting underwater litter face limitations in survey efficiency, cost, and environmental conditions, highlighting the need for efficient, consumer-grade technologies for automatic detection. This research introduces the Aerial-Aquatic Speedy Scanner (AASS) combined with Super-Resolution Reconstruction (SRR) and an improved YOLOv8 detection network. AASS enhances data acquisition efficiency over traditional methods, capturing high-quality images that accurately identify underwater waste. SRR improves image-resolution by mitigating motion blur and insufficient resolution, thereby enhancing detection tasks. Specifically, the RCAN model achieved the highest mean average precision (mAP) of 78.6% for detection accuracy on reconstructed images among the tested SRR mod",
    "link": "https://arxiv.org/abs/2408.03564",
    "context": "Title: Underwater litter monitoring using consumer-grade aerial-aquatic speedy scanner (AASS) and deep learning based super-resolution reconstruction and detection network\nAbstract: arXiv:2408.03564v1 Announce Type: new  Abstract: Underwater litter is widely spread across aquatic environments such as lakes, rivers, and oceans, significantly impacting natural ecosystems. Current monitoring technologies for detecting underwater litter face limitations in survey efficiency, cost, and environmental conditions, highlighting the need for efficient, consumer-grade technologies for automatic detection. This research introduces the Aerial-Aquatic Speedy Scanner (AASS) combined with Super-Resolution Reconstruction (SRR) and an improved YOLOv8 detection network. AASS enhances data acquisition efficiency over traditional methods, capturing high-quality images that accurately identify underwater waste. SRR improves image-resolution by mitigating motion blur and insufficient resolution, thereby enhancing detection tasks. Specifically, the RCAN model achieved the highest mean average precision (mAP) of 78.6% for detection accuracy on reconstructed images among the tested SRR mod",
    "path": "papers/24/08/2408.03564.json",
    "total_tokens": 401,
    "tldr": "该文章提出了使用消费级无人机搭载快速扫描仪（Aerial-Aquatic Speedy Scanner, AASS）和深度学习超分辨率重建与检测网络对水下垃圾进行监测的创新方法。通过提高数据采集效率，AASS能够捕获高质量图像，结合超分辨率重建（SRR）技术，尤其是在重建后的图像上使用RCAN模型，提高了检测任务的准确率。这样的系统有望提高水下垃圾监测的效率和准确性，有助于改善水体生态环境。"
}