{
    "title": "A New Clustering-based View Planning Method for Building Inspection with Drone",
    "abstract": "arXiv:2408.01435v1 Announce Type: cross  Abstract: With the rapid development of drone technology, the application of drones equipped with visual sensors for building inspection and surveillance has attracted much attention. View planning aims to find a set of near-optimal viewpoints for vision-related tasks to achieve the vision coverage goal. This paper proposes a new clustering-based two-step computational method using spectral clustering, local potential field method, and hyper-heuristic algorithm to find near-optimal views to cover the target building surface. In the first step, the proposed method generates candidate viewpoints based on spectral clustering and corrects the positions of candidate viewpoints based on our newly proposed local potential field method. In the second step, the optimization problem is converted into a Set Covering Problem (SCP), and the optimal viewpoint subset is solved using our proposed hyper-heuristic algorithm. Experimental results show that the pro",
    "link": "https://arxiv.org/abs/2408.01435",
    "context": "Title: A New Clustering-based View Planning Method for Building Inspection with Drone\nAbstract: arXiv:2408.01435v1 Announce Type: cross  Abstract: With the rapid development of drone technology, the application of drones equipped with visual sensors for building inspection and surveillance has attracted much attention. View planning aims to find a set of near-optimal viewpoints for vision-related tasks to achieve the vision coverage goal. This paper proposes a new clustering-based two-step computational method using spectral clustering, local potential field method, and hyper-heuristic algorithm to find near-optimal views to cover the target building surface. In the first step, the proposed method generates candidate viewpoints based on spectral clustering and corrects the positions of candidate viewpoints based on our newly proposed local potential field method. In the second step, the optimization problem is converted into a Set Covering Problem (SCP), and the optimal viewpoint subset is solved using our proposed hyper-heuristic algorithm. Experimental results show that the pro",
    "path": "papers/24/08/2408.01435.json",
    "total_tokens": 656,
    "translated_title": "基于聚类的新建筑检查无人机视角规划方法",
    "translated_abstract": "arXiv:2408.01435v1 公告类型: 交叉 上线的摘要: 随着无人机技术的迅速发展，配备视觉传感器的无人机在建筑检查和监控方面的应用引起了许多关注。视角规划旨在为基于视线的任务找到一组近似最优的视角，以实现视野覆盖目标。本文提出了一种新的基于聚类的方法，该方法使用谱聚类、局部潜在场方法和超遗传算法来找到覆盖目标建筑表面的近似最优视角。在第一步，该提议的方法基于谱聚类生成候选视角，并基于我们提出的新型局部潜在场方法纠正候选视角的位置。在第二部，我们将优化问题转换为Set Covering Problem (SCP)，并使用我们提出的超遗传算法来解决最佳视角子集的问题。实验结果表明，该减少规划步骤的数量并提高效率的新方法，在建筑检查任务中具有实用性。",
    "tldr": "本文提出了一种基于聚类的两步计算方法，使用谱聚类、局部潜在场方法和超遗传算法来为无人机建筑检查找到近似最优视角。",
    "en_tdlr": "This paper introduces a new clustering-based two-step computational approach employing spectral clustering, a local potential field method, and a hyper-heuristic algorithm to identify near-optimal views for drone-based building inspection, aiming to achieve better coverage of the target building surface through fewer planning steps and improved efficiency."
}