{
    "title": "Force-Motion Control For A Six Degree-Of-Freedom Robotic Manipulator",
    "abstract": "arXiv:2408.04106v1 Announce Type: new  Abstract: This paper presents a unified algorithm for motion and force control for a six degree-of-freedom spatial manipulator. The motion-force controller performs trajectory tracking, maneuvering the manipulator's end-effector through desired position, orientations and rates. When contacting an obstacle or target object, the force module of the controller restricts the manipulator movements with a novel force exertion method, which prevents damage to the manipulator, the end-effector, and the objects during the contact or collision. The core strategy presented in this paper is to design the linear acceleration for the end-effector which ensures both trajectory tracking and restriction of any contact force at the end-effector. The design of the controller is validated through numerical simulations and digital twin validation.",
    "link": "https://arxiv.org/abs/2408.04106",
    "context": "Title: Force-Motion Control For A Six Degree-Of-Freedom Robotic Manipulator\nAbstract: arXiv:2408.04106v1 Announce Type: new  Abstract: This paper presents a unified algorithm for motion and force control for a six degree-of-freedom spatial manipulator. The motion-force controller performs trajectory tracking, maneuvering the manipulator's end-effector through desired position, orientations and rates. When contacting an obstacle or target object, the force module of the controller restricts the manipulator movements with a novel force exertion method, which prevents damage to the manipulator, the end-effector, and the objects during the contact or collision. The core strategy presented in this paper is to design the linear acceleration for the end-effector which ensures both trajectory tracking and restriction of any contact force at the end-effector. The design of the controller is validated through numerical simulations and digital twin validation.",
    "path": "papers/24/08/2408.04106.json",
    "total_tokens": 402,
    "tldr": "该文章提出了一种对六度自由度空间机械臂进行统一运动与力控制的新算法。该算法能够执行轨迹跟踪任务，精确引导机械臂末端执行器通过预定的位置、姿态和运动速度。当末端执行器与障碍物或目标物体接触时，力控制模块通过一种新颖的力施加方法限制机械臂的运动，以防止在接触或碰撞过程中对机械臂、末端执行器和物体造成损坏。核心策略是设计末端执行器的线加速度，确保既能实现轨迹跟踪，又能限制末端执行器上的任何接触力，并通过数值模拟和数字孪生验证了控制器设计的有效性。"
}