{
    "title": "From Recognition to Prediction: Leveraging Sequence Reasoning for Action Anticipation",
    "abstract": "arXiv:2408.02769v1 Announce Type: new  Abstract: The action anticipation task refers to predicting what action will happen based on observed videos, which requires the model to have a strong ability to summarize the present and then reason about the future. Experience and common sense suggest that there is a significant correlation between different actions, which provides valuable prior knowledge for the action anticipation task. However, previous methods have not effectively modeled this underlying statistical relationship. To address this issue, we propose a novel end-to-end video modeling architecture that utilizes attention mechanisms, named Anticipation via Recognition and Reasoning (ARR). ARR decomposes the action anticipation task into action recognition and sequence reasoning tasks, and effectively learns the statistical relationship between actions by next action prediction (NAP). In comparison to existing temporal aggregation strategies, ARR is able to extract more effective",
    "link": "https://arxiv.org/abs/2408.02769",
    "context": "Title: From Recognition to Prediction: Leveraging Sequence Reasoning for Action Anticipation\nAbstract: arXiv:2408.02769v1 Announce Type: new  Abstract: The action anticipation task refers to predicting what action will happen based on observed videos, which requires the model to have a strong ability to summarize the present and then reason about the future. Experience and common sense suggest that there is a significant correlation between different actions, which provides valuable prior knowledge for the action anticipation task. However, previous methods have not effectively modeled this underlying statistical relationship. To address this issue, we propose a novel end-to-end video modeling architecture that utilizes attention mechanisms, named Anticipation via Recognition and Reasoning (ARR). ARR decomposes the action anticipation task into action recognition and sequence reasoning tasks, and effectively learns the statistical relationship between actions by next action prediction (NAP). In comparison to existing temporal aggregation strategies, ARR is able to extract more effective",
    "path": "papers/24/08/2408.02769.json",
    "total_tokens": 349,
    "tldr": "该文章提出了一种名为\"Anticipation via Recognition and Reasoning (ARR)\"的全新端到端视频建模架构，它通过分解动作预测任务为动作识别和序列推理任务，并结合下一步动作预测（NAP）方法，有效学习了不同动作之间的统计关系。与现有基于时间聚合的方法相比，ARR能够在学习动作之间的统计联系方面表现得更为有效。"
}