{
    "title": "MeshAnything V2: Artist-Created Mesh Generation With Adjacent Mesh Tokenization",
    "abstract": "arXiv:2408.02555v1 Announce Type: new  Abstract: We introduce MeshAnything V2, an autoregressive transformer that generates Artist-Created Meshes (AM) aligned to given shapes. It can be integrated with various 3D asset production pipelines to achieve high-quality, highly controllable AM generation. MeshAnything V2 surpasses previous methods in both efficiency and performance using models of the same size. These improvements are due to our newly proposed mesh tokenization method: Adjacent Mesh Tokenization (AMT). Different from previous methods that represent each face with three vertices, AMT uses a single vertex whenever possible. Compared to previous methods, AMT requires about half the token sequence length to represent the same mesh in average. Furthermore, the token sequences from AMT are more compact and well-structured, fundamentally benefiting AM generation. Our extensive experiments show that AMT significantly improves the efficiency and performance of AM generation. Project P",
    "link": "https://arxiv.org/abs/2408.02555",
    "context": "Title: MeshAnything V2: Artist-Created Mesh Generation With Adjacent Mesh Tokenization\nAbstract: arXiv:2408.02555v1 Announce Type: new  Abstract: We introduce MeshAnything V2, an autoregressive transformer that generates Artist-Created Meshes (AM) aligned to given shapes. It can be integrated with various 3D asset production pipelines to achieve high-quality, highly controllable AM generation. MeshAnything V2 surpasses previous methods in both efficiency and performance using models of the same size. These improvements are due to our newly proposed mesh tokenization method: Adjacent Mesh Tokenization (AMT). Different from previous methods that represent each face with three vertices, AMT uses a single vertex whenever possible. Compared to previous methods, AMT requires about half the token sequence length to represent the same mesh in average. Furthermore, the token sequences from AMT are more compact and well-structured, fundamentally benefiting AM generation. Our extensive experiments show that AMT significantly improves the efficiency and performance of AM generation. Project P",
    "path": "papers/24/08/2408.02555.json",
    "total_tokens": 446,
    "tldr": "该文章推出了MeshAnything V2，这是一项艺术家创建的网格生成技术，它能够利用相邻网格tokenization方法实现高效和高质量的生成。与之前的模型相比，MeshAnything V2在尺寸相同的情况下实现了更高的效率和性能。这种改进归功于一种新的网格tokenization方法——Adjacent Mesh Tokenization（AMT），该方法对于可能的情况只使用单个顶点而不是三个顶点来表示每个面，从而平均情况下将序列长度缩短了一半，使得生成的token序列更加紧凑和结构化，从而对艺术家创建的网格生成产生了根本性的改进。实验结果表明，使用AMT方法显著提高了艺术家创建的网格生成效率和性能。"
}