{
    "title": "Cross-View Meets Diffusion: Aerial Image Synthesis with Geometry and Text Guidance",
    "abstract": "arXiv:2408.04224v1 Announce Type: new  Abstract: Aerial imagery analysis is critical for many research fields. However, obtaining frequent high-quality aerial images is not always accessible due to its high effort and cost requirements. One solution is to use the Ground-to-Aerial (G2A) technique to synthesize aerial images from easily collectible ground images. However, G2A is rarely studied, because of its challenges, including but not limited to, the drastic view changes, occlusion, and range of visibility. In this paper, we present a novel Geometric Preserving Ground-to-Aerial (G2A) image synthesis (GPG2A) model that can generate realistic aerial images from ground images. GPG2A consists of two stages. The first stage predicts the Bird's Eye View (BEV) segmentation (referred to as the BEV layout map) from the ground image. The second stage synthesizes the aerial image from the predicted BEV layout map and text descriptions of the ground image. To train our model, we present a new mu",
    "link": "https://arxiv.org/abs/2408.04224",
    "context": "Title: Cross-View Meets Diffusion: Aerial Image Synthesis with Geometry and Text Guidance\nAbstract: arXiv:2408.04224v1 Announce Type: new  Abstract: Aerial imagery analysis is critical for many research fields. However, obtaining frequent high-quality aerial images is not always accessible due to its high effort and cost requirements. One solution is to use the Ground-to-Aerial (G2A) technique to synthesize aerial images from easily collectible ground images. However, G2A is rarely studied, because of its challenges, including but not limited to, the drastic view changes, occlusion, and range of visibility. In this paper, we present a novel Geometric Preserving Ground-to-Aerial (G2A) image synthesis (GPG2A) model that can generate realistic aerial images from ground images. GPG2A consists of two stages. The first stage predicts the Bird's Eye View (BEV) segmentation (referred to as the BEV layout map) from the ground image. The second stage synthesizes the aerial image from the predicted BEV layout map and text descriptions of the ground image. To train our model, we present a new mu",
    "path": "papers/24/08/2408.04224.json",
    "total_tokens": 429,
    "tldr": "该文章提出了一种名为GPG2A的模型，该模型通过预测地面图像的鸟瞰视图分割（BEV布局图）来生成真实的空中图像。GPG2A模型包括两个阶段，第一阶段从地面图像预测BEV分割，第二阶段使用文本描述和预测的BEV布局图合成空中图像。通过这种方式，GPG2A模型有效地解决了地面到空中图像合成中遇到的各种挑战，如视角变化、遮挡和视距范围等问题。"
}