{
    "title": "Active Inference in Contextual Multi-Armed Bandits for Autonomous Robotic Exploration",
    "abstract": "arXiv:2408.04119v1 Announce Type: new  Abstract: Autonomous selection of optimal options for data collection from multiple alternatives is challenging in uncertain environments. When secondary information about options is accessible, such problems can be framed as contextual multi-armed bandits (CMABs). Neuro-inspired active inference has gained interest for its ability to balance exploration and exploitation using the expected free energy objective function. Unlike previous studies that showed the effectiveness of active inference based strategy for CMABs using synthetic data, this study aims to apply active inference to realistic scenarios, using a simulated mineralogical survey site selection problem. Hyperspectral data from AVIRIS-NG at Cuprite, Nevada, serves as contextual information for predicting outcome probabilities, while geologists' mineral labels represent outcomes. Monte Carlo simulations assess the robustness of active inference against changing expert preferences. Resul",
    "link": "https://arxiv.org/abs/2408.04119",
    "context": "Title: Active Inference in Contextual Multi-Armed Bandits for Autonomous Robotic Exploration\nAbstract: arXiv:2408.04119v1 Announce Type: new  Abstract: Autonomous selection of optimal options for data collection from multiple alternatives is challenging in uncertain environments. When secondary information about options is accessible, such problems can be framed as contextual multi-armed bandits (CMABs). Neuro-inspired active inference has gained interest for its ability to balance exploration and exploitation using the expected free energy objective function. Unlike previous studies that showed the effectiveness of active inference based strategy for CMABs using synthetic data, this study aims to apply active inference to realistic scenarios, using a simulated mineralogical survey site selection problem. Hyperspectral data from AVIRIS-NG at Cuprite, Nevada, serves as contextual information for predicting outcome probabilities, while geologists' mineral labels represent outcomes. Monte Carlo simulations assess the robustness of active inference against changing expert preferences. Resul",
    "path": "papers/24/08/2408.04119.json",
    "total_tokens": 322,
    "tldr": "该文章提出了一种基于主动互信息的上下文多臂博弈算法，并在现实场景中应用了该算法，成功地解决了不确定环境中的自动数据收集问题，展现出主动互信息在自动化探索过程中的有效性和鲁棒性。"
}