{
    "title": "Granting GPT-4 License and Opportunity: Enhancing Accuracy and Confidence Estimation for Few-Shot Event Detection",
    "abstract": "arXiv:2408.00914v1 Announce Type: new  Abstract: Large Language Models (LLMs) such as GPT-4 have shown enough promise in the few-shot learning context to suggest use in the generation of \"silver\" data and refinement of new ontologies through iterative application and review. Such workflows become more effective with reliable confidence estimation. Unfortunately, confidence estimation is a documented weakness of models such as GPT-4, and established methods to compensate require significant additional complexity and computation. The present effort explores methods for effective confidence estimation with GPT-4 with few-shot learning for event detection in the BETTER ontology as a vehicle. The key innovation is expanding the prompt and task presented to GPT-4 to provide License to speculate when unsure and Opportunity to quantify and explain its uncertainty (L&O). This approach improves accuracy and provides usable confidence measures (0.759 AUC) with no additional machinery.",
    "link": "https://arxiv.org/abs/2408.00914",
    "context": "Title: Granting GPT-4 License and Opportunity: Enhancing Accuracy and Confidence Estimation for Few-Shot Event Detection\nAbstract: arXiv:2408.00914v1 Announce Type: new  Abstract: Large Language Models (LLMs) such as GPT-4 have shown enough promise in the few-shot learning context to suggest use in the generation of \"silver\" data and refinement of new ontologies through iterative application and review. Such workflows become more effective with reliable confidence estimation. Unfortunately, confidence estimation is a documented weakness of models such as GPT-4, and established methods to compensate require significant additional complexity and computation. The present effort explores methods for effective confidence estimation with GPT-4 with few-shot learning for event detection in the BETTER ontology as a vehicle. The key innovation is expanding the prompt and task presented to GPT-4 to provide License to speculate when unsure and Opportunity to quantify and explain its uncertainty (L&O). This approach improves accuracy and provides usable confidence measures (0.759 AUC) with no additional machinery.",
    "path": "papers/24/08/2408.00914.json",
    "total_tokens": 701,
    "translated_title": "授予 GPT-4 许可证和机会：增强少样本事件检测的准确性和置信度估计",
    "translated_abstract": "arXiv:2408.00914v1 公告类型：新  翻译：大型语言模型（LLM），如 GPT-4，在少样本学习环境中显示出足够的潜力，可以用于生成“银色”数据和新知识库的改进。通过迭代应用和审查，这样的工作流程变得更加有效。可靠的置信度估计是此类模型如 GPT-4的已报告弱点，而补偿的方法则需要大量的额外复杂性和计算资源。目前的研究探讨了 GPT-4在基于 BETTER 知识库的事件检测中的少样本学习有效置信度估计的方法。关键创新是将提供给 GPT-4的提示和任务扩展为提供一个允许猜测而不确定的许可证和量化并解释不确定性的机会（L&O）。这种方法无额外设备即可提高准确性，提供可用的置信度指标（0.759 AUC）。",
    "tldr": "本研究通过在事件检测中使用GPT-4的少样本学习方法，实现了增强的准确性和置信度估计，通过为GPT-4提供的“许可证和机会”（L&O），实现了0.759 AUC的置信度指标。"
}