{
    "title": "OPENGRASP-LITE Version 1.0: A Tactile Artificial Hand with a Compliant Linkage Mechanism",
    "abstract": "arXiv:2408.02293v1 Announce Type: new  Abstract: Recent research has seen notable progress in the development of linkage-based artificial hands. While previous designs have focused on adaptive grasping, dexterity and biomimetic artificial skin, only a few systems have proposed a lightweight, accessible solution integrating tactile sensing with a compliant linkage-based mechanism. This paper introduces OPENGRASP LITE, an open-source, highly integrated, tactile, and lightweight artificial hand. Leveraging compliant linkage systems and MEMS barometer-based tactile sensing, it offers versatile grasping capabilities with six degrees of actuation. By providing tactile sensors and enabling soft grasping, it serves as an accessible platform for further research in tactile artificial hands.",
    "link": "https://arxiv.org/abs/2408.02293",
    "context": "Title: OPENGRASP-LITE Version 1.0: A Tactile Artificial Hand with a Compliant Linkage Mechanism\nAbstract: arXiv:2408.02293v1 Announce Type: new  Abstract: Recent research has seen notable progress in the development of linkage-based artificial hands. While previous designs have focused on adaptive grasping, dexterity and biomimetic artificial skin, only a few systems have proposed a lightweight, accessible solution integrating tactile sensing with a compliant linkage-based mechanism. This paper introduces OPENGRASP LITE, an open-source, highly integrated, tactile, and lightweight artificial hand. Leveraging compliant linkage systems and MEMS barometer-based tactile sensing, it offers versatile grasping capabilities with six degrees of actuation. By providing tactile sensors and enabling soft grasping, it serves as an accessible platform for further research in tactile artificial hands.",
    "path": "papers/24/08/2408.02293.json",
    "total_tokens": 647,
    "translated_title": "OPENGRASP-LITE 版本1.0：带有可变形连杆机制的 Tactile 人造手",
    "translated_abstract": "arXiv:2408.02293v1 宣布类型：新  翻译摘要：在开发基于连杆的人造手方面，最近的研究取得了显著进展。尽管之前的设计侧重于适应性抓取、技巧和模仿生物皮肤，但只有少数系统提出了一种轻量级、可访问的解决方案，集成了触觉感测与基于可变形连杆的机制。本文介绍 OPENGRASP-LITE，这是一个开放源代码的高集成度、触觉和人造手。通过利用可变形连杆系统和MEMS气压计触觉传感技术，它提供了带有六个度自由度的多样化抓取能力。通过提供触觉传感器并与软抓取能力相容，它为在人造触觉手方面的进一步研究提供了一个可访问的平台。",
    "tldr": "介绍了一个名为OPENGRASP-LITE的开放源代码人工手项目，它具有轻量级、高集成度、触觉功能和基于可变形连杆的抓取能力，适用于触觉人造手技术的进一步研究。",
    "en_tdlr": "This paper introduces a new open-source artificial hand project called OPENGRASP-LITE, which offers lightweight, highly integrated, tactile features, and a grasp capability based on compliant linkage mechanisms, suitable for further research in tactile artificial hands."
}