{
    "title": "Multi-Frame Vision-Language Model for Long-form Reasoning in Driver Behavior Analysis",
    "abstract": "arXiv:2408.01682v1 Announce Type: cross  Abstract: Identifying risky driving behavior in real-world situations is essential for the safety of both drivers and pedestrians. However, integrating natural language models in this field remains relatively untapped. To address this, we created a novel multi-modal instruction tuning dataset and driver coaching inference system. Our primary use case is dashcam-based coaching for commercial drivers. The North American Dashcam Market is expected to register a CAGR of 15.4 percent from 2022 to 2027. Our dataset enables language models to learn visual instructions across various risky driving scenarios, emphasizing detailed reasoning crucial for effective driver coaching and managerial comprehension. Our model is trained on road-facing and driver-facing RGB camera footage, capturing the comprehensive scope of driving behavior in vehicles equipped with dashcams.",
    "link": "https://arxiv.org/abs/2408.01682",
    "context": "Title: Multi-Frame Vision-Language Model for Long-form Reasoning in Driver Behavior Analysis\nAbstract: arXiv:2408.01682v1 Announce Type: cross  Abstract: Identifying risky driving behavior in real-world situations is essential for the safety of both drivers and pedestrians. However, integrating natural language models in this field remains relatively untapped. To address this, we created a novel multi-modal instruction tuning dataset and driver coaching inference system. Our primary use case is dashcam-based coaching for commercial drivers. The North American Dashcam Market is expected to register a CAGR of 15.4 percent from 2022 to 2027. Our dataset enables language models to learn visual instructions across various risky driving scenarios, emphasizing detailed reasoning crucial for effective driver coaching and managerial comprehension. Our model is trained on road-facing and driver-facing RGB camera footage, capturing the comprehensive scope of driving behavior in vehicles equipped with dashcams.",
    "path": "papers/24/08/2408.01682.json",
    "total_tokens": 302,
    "tldr": "该文章开发了一种多帧视觉语言模型，用于在司机行为分析中进行长文本推理，改进了实时的安全和情境理解。"
}