{
    "title": "Robot-Enabled Machine Learning-Based Diagnosis of Gastric Cancer Polyps Using Partial Surface Tactile Imaging",
    "abstract": "arXiv:2408.01554v1 Announce Type: new  Abstract: In this paper, to collectively address the existing limitations on endoscopic diagnosis of Advanced Gastric Cancer (AGC) Tumors, for the first time, we propose (i) utilization and evaluation of our recently developed Vision-based Tactile Sensor (VTS), and (ii) a complementary Machine Learning (ML) algorithm for classifying tumors using their textural features. Leveraging a seven DoF robotic manipulator and unique custom-designed and additively-manufactured realistic AGC tumor phantoms, we demonstrated the advantages of automated data collection using the VTS addressing the problem of data scarcity and biases encountered in traditional ML-based approaches. Our synthetic-data-trained ML model was successfully evaluated and compared with traditional ML models utilizing various statistical metrics even under mixed morphological characteristics and partial sensor contact.",
    "link": "https://arxiv.org/abs/2408.01554",
    "context": "Title: Robot-Enabled Machine Learning-Based Diagnosis of Gastric Cancer Polyps Using Partial Surface Tactile Imaging\nAbstract: arXiv:2408.01554v1 Announce Type: new  Abstract: In this paper, to collectively address the existing limitations on endoscopic diagnosis of Advanced Gastric Cancer (AGC) Tumors, for the first time, we propose (i) utilization and evaluation of our recently developed Vision-based Tactile Sensor (VTS), and (ii) a complementary Machine Learning (ML) algorithm for classifying tumors using their textural features. Leveraging a seven DoF robotic manipulator and unique custom-designed and additively-manufactured realistic AGC tumor phantoms, we demonstrated the advantages of automated data collection using the VTS addressing the problem of data scarcity and biases encountered in traditional ML-based approaches. Our synthetic-data-trained ML model was successfully evaluated and compared with traditional ML models utilizing various statistical metrics even under mixed morphological characteristics and partial sensor contact.",
    "path": "papers/24/08/2408.01554.json",
    "total_tokens": 374,
    "tldr": "该文章首次将视觉触觉传感器技术与机器学习算法相结合，利用七自由度机器人和特殊设计的胃癌肿瘤假体，对胃癌肿瘤进行分类诊断。通过自动化数据收集，解决了传统机器学习方法中数据稀缺和偏见的难题，并在模拟数据训练的机器学习模型与传统模型之间进行了比较验证，展现了其在克服混合形态特征和触觉传感器不完全接触条件下的优越性。"
}