{
    "title": "SkyDiffusion: Street-to-Satellite Image Synthesis with Diffusion Models and BEV Paradigm",
    "abstract": "arXiv:2408.01812v1 Announce Type: new  Abstract: Street-to-satellite image synthesis focuses on generating realistic satellite images from corresponding ground street-view images while maintaining a consistent content layout, similar to looking down from the sky. The significant differences in perspectives create a substantial domain gap between the views, making this cross-view generation task particularly challenging. In this paper, we introduce SkyDiffusion, a novel cross-view generation method for synthesizing satellite images from street-view images, leveraging diffusion models and Bird's Eye View (BEV) paradigm. First, we design a Curved-BEV method to transform street-view images to the satellite view, reformulating the challenging cross-domain image synthesis task into a conditional generation problem. Curved-BEV also includes a \"Multi-to-One\" mapping strategy for combining multiple street-view images within the same satellite coverage area, effectively solving the occlusion iss",
    "link": "https://arxiv.org/abs/2408.01812",
    "context": "Title: SkyDiffusion: Street-to-Satellite Image Synthesis with Diffusion Models and BEV Paradigm\nAbstract: arXiv:2408.01812v1 Announce Type: new  Abstract: Street-to-satellite image synthesis focuses on generating realistic satellite images from corresponding ground street-view images while maintaining a consistent content layout, similar to looking down from the sky. The significant differences in perspectives create a substantial domain gap between the views, making this cross-view generation task particularly challenging. In this paper, we introduce SkyDiffusion, a novel cross-view generation method for synthesizing satellite images from street-view images, leveraging diffusion models and Bird's Eye View (BEV) paradigm. First, we design a Curved-BEV method to transform street-view images to the satellite view, reformulating the challenging cross-domain image synthesis task into a conditional generation problem. Curved-BEV also includes a \"Multi-to-One\" mapping strategy for combining multiple street-view images within the same satellite coverage area, effectively solving the occlusion iss",
    "path": "papers/24/08/2408.01812.json",
    "total_tokens": 360,
    "tldr": "该文章提出SkyDiffusion方法，利用扩散模型和鸟瞰视图（BEV）范式，实现了从街道视图图像到卫星图像的生成，解决了跨视角图像合成中的域差距大和内容重组难的问题，尤其适用于生成映射时同时拼接多张街道视图图像。"
}