{
    "title": "Real-time Localization and Mapping in Architectural Plans with Deviations",
    "abstract": "arXiv:2408.01737v1 Announce Type: new  Abstract: Having prior knowledge of an environment boosts the localization and mapping accuracy of robots. Several approaches in the literature have utilized architectural plans in this regard. However, almost all of them overlook the deviations between actual as-built environments and as-planned architectural designs, introducing bias in the estimations. To address this issue, we present a novel localization and mapping method denoted as deviations-informed Situational Graphs or diS-Graphs that integrates prior knowledge from architectural plans even in the presence of deviations. It is based on Situational Graphs (S-Graphs) that merge geometric models of the environment with 3D scene graphs into a multi-layered jointly optimizable factor graph. Our diS-Graph extracts information from architectural plans by first modeling them as a hierarchical factor graph, which we will call an Architectural Graph (A-Graph). While the robot explores the real en",
    "link": "https://arxiv.org/abs/2408.01737",
    "context": "Title: Real-time Localization and Mapping in Architectural Plans with Deviations\nAbstract: arXiv:2408.01737v1 Announce Type: new  Abstract: Having prior knowledge of an environment boosts the localization and mapping accuracy of robots. Several approaches in the literature have utilized architectural plans in this regard. However, almost all of them overlook the deviations between actual as-built environments and as-planned architectural designs, introducing bias in the estimations. To address this issue, we present a novel localization and mapping method denoted as deviations-informed Situational Graphs or diS-Graphs that integrates prior knowledge from architectural plans even in the presence of deviations. It is based on Situational Graphs (S-Graphs) that merge geometric models of the environment with 3D scene graphs into a multi-layered jointly optimizable factor graph. Our diS-Graph extracts information from architectural plans by first modeling them as a hierarchical factor graph, which we will call an Architectural Graph (A-Graph). While the robot explores the real en",
    "path": "papers/24/08/2408.01737.json",
    "total_tokens": 705,
    "translated_title": "实时定位与地图构建在有变动的建筑蓝图中的方法",
    "translated_abstract": "arXiv:2408.01737v1 通告类型：新 Abstract: 拥有环境的先验知识能够提高机器人定位和地图构建的准确性。文献中已经提出了多个利用建筑蓝图的方法。然而，几乎所有的方法都忽略了实际的建筑环境与预先设计的建筑设计之间的偏差，这导致了估计的偏差。为了解决这个问题，我们提出了一种新型的定位和地图构建方法，称之为“带有偏差信息的局势图”或“diS-Graph”，该方法即使在存在偏差的情况下也能整合从建筑蓝图获得的先验知识。它基于“局势图”(S-Graph)，这是一种将环境的几何模型与3D场景图合并到可以联合优化的多层次因子图中的方法。我们的diS-Graph通过首先将建筑蓝图建模为一个层次化的因子图，我们将称之为“建筑图”(A-Graph)，来提取相关信息。而机器人探索实际环境时，diS-Graph能够有效结合真实世界数据和建筑蓝图信息，从而提高定位和地图构建的准确性。此外，diS-Graph能够实时调整，适应突发状况和未知偏差，确保机器人能够在偏离预设设计的情况下依然能够进行准确的操作。",
    "tldr": "本文提出的diS-Graph方法通过结合建筑蓝图信息和在实际环境中收集的数据，即使在存在偏差的情况下，也能有效提高机器人的定位和地图构建的准确性。",
    "en_tdlr": "This paper presents a novel methodology for accurate localization and mapping that combines data gathered by robots in real environments with architectural plan information, even in the presence of deviations from the intended design."
}