{
    "title": "Latency-Aware Resource Allocation for Mobile Edge Generation and Computing via Deep Reinforcement Learning",
    "abstract": "arXiv:2408.02047v1 Announce Type: cross  Abstract: Recently, the integration of mobile edge computing (MEC) and generative artificial intelligence (GAI) technology has given rise to a new area called mobile edge generation and computing (MEGC), which offers mobile users heterogeneous services such as task computing and content generation. In this letter, we investigate the joint communication, computation, and the AIGC resource allocation problem in an MEGC system. A latency minimization problem is first formulated to enhance the quality of service for mobile users. Due to the strong coupling of the optimization variables, we propose a new deep reinforcement learning-based algorithm to solve it efficiently. Numerical results demonstrate that the proposed algorithm can achieve lower latency than two baseline algorithms.",
    "link": "https://arxiv.org/abs/2408.02047",
    "context": "Title: Latency-Aware Resource Allocation for Mobile Edge Generation and Computing via Deep Reinforcement Learning\nAbstract: arXiv:2408.02047v1 Announce Type: cross  Abstract: Recently, the integration of mobile edge computing (MEC) and generative artificial intelligence (GAI) technology has given rise to a new area called mobile edge generation and computing (MEGC), which offers mobile users heterogeneous services such as task computing and content generation. In this letter, we investigate the joint communication, computation, and the AIGC resource allocation problem in an MEGC system. A latency minimization problem is first formulated to enhance the quality of service for mobile users. Due to the strong coupling of the optimization variables, we propose a new deep reinforcement learning-based algorithm to solve it efficiently. Numerical results demonstrate that the proposed algorithm can achieve lower latency than two baseline algorithms.",
    "path": "papers/24/08/2408.02047.json",
    "total_tokens": 289,
    "tldr": "该文章提出了一种基于深度强化学习的算法，能够在移动边缘生成和计算系统中实现通信、计算和人工智能内容生成资源的优化分配，以降低服务延迟，提高了用户体验。"
}