{
    "title": "Advanced User Credit Risk Prediction Model using LightGBM, XGBoost and Tabnet with SMOTEENN",
    "abstract": "arXiv:2408.03497v1 Announce Type: cross  Abstract: Bank credit risk is a significant challenge in modern financial transactions, and the ability to identify qualified credit card holders among a large number of applicants is crucial for the profitability of a bank'sbank's credit card business. In the past, screening applicants'applicants' conditions often required a significant amount of manual labor, which was time-consuming and labor-intensive. Although the accuracy and reliability of previously used ML models have been continuously improving, the pursuit of more reliable and powerful AI intelligent models is undoubtedly the unremitting pursuit by major banks in the financial industry. In this study, we used a dataset of over 40,000 records provided by a commercial bank as the research object. We compared various dimensionality reduction techniques such as PCA and T-SNE for preprocessing high-dimensional datasets and performed in-depth adaptation and tuning of distributed models such",
    "link": "https://arxiv.org/abs/2408.03497",
    "context": "Title: Advanced User Credit Risk Prediction Model using LightGBM, XGBoost and Tabnet with SMOTEENN\nAbstract: arXiv:2408.03497v1 Announce Type: cross  Abstract: Bank credit risk is a significant challenge in modern financial transactions, and the ability to identify qualified credit card holders among a large number of applicants is crucial for the profitability of a bank'sbank's credit card business. In the past, screening applicants'applicants' conditions often required a significant amount of manual labor, which was time-consuming and labor-intensive. Although the accuracy and reliability of previously used ML models have been continuously improving, the pursuit of more reliable and powerful AI intelligent models is undoubtedly the unremitting pursuit by major banks in the financial industry. In this study, we used a dataset of over 40,000 records provided by a commercial bank as the research object. We compared various dimensionality reduction techniques such as PCA and T-SNE for preprocessing high-dimensional datasets and performed in-depth adaptation and tuning of distributed models such",
    "path": "papers/24/08/2408.03497.json",
    "total_tokens": 357,
    "tldr": "该文章引入了一种高级用户信用风险预测模型，结合了LightGBM、XGBoost和Tabnet算法，并通过SMOTEENN技术增强了模型对不平衡数据集的适应性，显著提高了银行对于大量信用卡申请人的筛选效率和准确性，增强了银行信贷业务的盈利能力。"
}