{
    "title": "A Comprehensive Survey on Root Cause Analysis in (Micro) Services: Methodologies, Challenges, and Trends",
    "abstract": "arXiv:2408.00803v1 Announce Type: cross  Abstract: The complex dependencies and propagative faults inherent in microservices, characterized by a dense network of interconnected services, pose significant challenges in identifying the underlying causes of issues. Prompt identification and resolution of disruptive problems are crucial to ensure rapid recovery and maintain system stability. Numerous methodologies have emerged to address this challenge, primarily focusing on diagnosing failures through symptomatic data. This survey aims to provide a comprehensive, structured review of root cause analysis (RCA) techniques within microservices, exploring methodologies that include metrics, traces, logs, and multi-model data. It delves deeper into the methodologies, challenges, and future trends within microservices architectures. Positioned at the forefront of AI and automation advancements, it offers guidance for future research directions.",
    "link": "https://arxiv.org/abs/2408.00803",
    "context": "Title: A Comprehensive Survey on Root Cause Analysis in (Micro) Services: Methodologies, Challenges, and Trends\nAbstract: arXiv:2408.00803v1 Announce Type: cross  Abstract: The complex dependencies and propagative faults inherent in microservices, characterized by a dense network of interconnected services, pose significant challenges in identifying the underlying causes of issues. Prompt identification and resolution of disruptive problems are crucial to ensure rapid recovery and maintain system stability. Numerous methodologies have emerged to address this challenge, primarily focusing on diagnosing failures through symptomatic data. This survey aims to provide a comprehensive, structured review of root cause analysis (RCA) techniques within microservices, exploring methodologies that include metrics, traces, logs, and multi-model data. It delves deeper into the methodologies, challenges, and future trends within microservices architectures. Positioned at the forefront of AI and automation advancements, it offers guidance for future research directions.",
    "path": "papers/24/08/2408.00803.json",
    "total_tokens": 598,
    "translated_title": "元因分析在(微)服务中的全面调查：方法论、挑战和趋势",
    "translated_abstract": "arXiv:2408.00803v1 公告类型：交叉  摘要：微服务中的复杂依赖关系和传播性故障特性，这些服务以其密集的网络互联特性为标志，在确定问题的根本原因方面提出了巨大的挑战。迅速识别和解决破坏性的问题对于确保快速恢复和维护系统稳定性至关重要。已经出现了一系列方法来应对这一挑战，这些方法主要集中在通过症状数据诊断故障。本调查旨在提供对微服务中元因分析(RCA)技术的全面、结构化回顾，探索包括度量、跟踪、日志和多模态数据在内的方法论。它深入探讨了微服务架构中的方法论、挑战和未来趋势。位于人工智能和自动化进步的最前沿，它为未来的研究方向提供了指导。",
    "tldr": "本论文调查了在微服务中识别和解决复杂依赖和传播性故障挑战的根本原因分析(RCA)技术，强调了快速恢复和维护系统稳定性的重要性。",
    "en_tdlr": "The paper reviews methodologies for diagnosing failures in microservices plagued by complex dependencies and propagative faults, highlighting the importance of rapid recovery and maintaining system stability."
}