{
    "title": "More Than Positive and Negative: Communicating Fine Granularity in Medical Diagnosis",
    "abstract": "arXiv:2408.02214v1 Announce Type: new  Abstract: With the advance of deep learning, much progress has been made in building powerful artificial intelligence (AI) systems for automatic Chest X-ray (CXR) analysis. Most existing AI models are trained to be a binary classifier with the aim of distinguishing positive and negative cases. However, a large gap exists between the simple binary setting and complicated real-world medical scenarios. In this work, we reinvestigate the problem of automatic radiology diagnosis. We first observe that there is considerable diversity among cases within the positive class, which means simply classifying them as positive loses many important details. This motivates us to build AI models that can communicate fine-grained knowledge from medical images like human experts. To this end, we first propose a new benchmark on fine granularity learning from medical images. Specifically, we devise a division rule based on medical knowledge to divide positive cases i",
    "link": "https://arxiv.org/abs/2408.02214",
    "context": "Title: More Than Positive and Negative: Communicating Fine Granularity in Medical Diagnosis\nAbstract: arXiv:2408.02214v1 Announce Type: new  Abstract: With the advance of deep learning, much progress has been made in building powerful artificial intelligence (AI) systems for automatic Chest X-ray (CXR) analysis. Most existing AI models are trained to be a binary classifier with the aim of distinguishing positive and negative cases. However, a large gap exists between the simple binary setting and complicated real-world medical scenarios. In this work, we reinvestigate the problem of automatic radiology diagnosis. We first observe that there is considerable diversity among cases within the positive class, which means simply classifying them as positive loses many important details. This motivates us to build AI models that can communicate fine-grained knowledge from medical images like human experts. To this end, we first propose a new benchmark on fine granularity learning from medical images. Specifically, we devise a division rule based on medical knowledge to divide positive cases i",
    "path": "papers/24/08/2408.02214.json",
    "total_tokens": 724,
    "translated_title": "不仅仅是阳性与阴性：在医学诊断中传达精细粒度的信息",
    "translated_abstract": "arXiv:2408.02214v1 公告类型：新  摘要：随着深度学习的发展，在自动胸部X光片（CXR）分析的强大人工智能（AI）系统建设方面已经取得了显著的进展。现有的大部分AI模型都是在被训练成二分类器，旨在区分阳性与阴性案例。然而，简单二元设置与复杂的现实世界医学场景之间存在相当大的差距。在本工作中，我们对自动放射学诊断问题进行了重新评估。我们首先观察到阳性类别的案例之间存在显著差异，这意味着简单地将它们分类为阳性会丧失许多重要的细节。这激励我们构建能够从医疗图像中传达与人类专家相似的精细粒度知识的AI模型。为此，我们首先提出一个基于医学知识的新的精细粒度学习医学图像的基准。特别是，我们设计了一个基于医学知识的分割规则，将阳性案例分为更细粒度的子类别。通过在大型CXR数据集上训练和评估一系列的深度学习模型，我们验证了优秀模型能够跨越现有知识边界，捕获并传递关于疾病状态的更多细节。我们的研究提供了对这一重要但尚未充分探索的问题的见解，并为医学图像的AI诊断提供了新的视角。",
    "tldr": "研究提出了一种新的医学图像基准，以精细粒度学习为目标，证明了AI模型能够超越现有知识界限，捕捉并传递更详细的疾病状态信息，为医学图像的AI诊断提供了新的视角。"
}