{
    "title": "A Weakly Supervised and Globally Explainable Learning Framework for Brain Tumor Segmentation",
    "abstract": "arXiv:2408.01191v1 Announce Type: new  Abstract: Machine-based brain tumor segmentation can help doctors make better diagnoses. However, the complex structure of brain tumors and expensive pixel-level annotations present challenges for automatic tumor segmentation. In this paper, we propose a counterfactual generation framework that not only achieves exceptional brain tumor segmentation performance without the need for pixel-level annotations, but also provides explainability. Our framework effectively separates class-related features from class-unrelated features of the samples, and generate new samples that preserve identity features while altering class attributes by embedding different class-related features. We perform topological data analysis on the extracted class-related features and obtain a globally explainable manifold, and for each abnormal sample to be segmented, a meaningful normal sample could be effectively generated with the guidance of the rule-based paths designed w",
    "link": "https://arxiv.org/abs/2408.01191",
    "context": "Title: A Weakly Supervised and Globally Explainable Learning Framework for Brain Tumor Segmentation\nAbstract: arXiv:2408.01191v1 Announce Type: new  Abstract: Machine-based brain tumor segmentation can help doctors make better diagnoses. However, the complex structure of brain tumors and expensive pixel-level annotations present challenges for automatic tumor segmentation. In this paper, we propose a counterfactual generation framework that not only achieves exceptional brain tumor segmentation performance without the need for pixel-level annotations, but also provides explainability. Our framework effectively separates class-related features from class-unrelated features of the samples, and generate new samples that preserve identity features while altering class attributes by embedding different class-related features. We perform topological data analysis on the extracted class-related features and obtain a globally explainable manifold, and for each abnormal sample to be segmented, a meaningful normal sample could be effectively generated with the guidance of the rule-based paths designed w",
    "path": "papers/24/08/2408.01191.json",
    "total_tokens": 727,
    "translated_title": "论文标题: 一个弱监督和全局可解释的大脑肿瘤分割学习框架",
    "translated_abstract": "arXiv:2408.01191v1 新闻类型: 新更新 摘要: 基于机器的大脑肿瘤分割可以帮助医生做出更好的诊断。然而，大脑肿瘤的复杂结构以及昂贵的像素级标注给自动肿瘤分割带来了挑战。在这篇论文中，我们提出了一种反事实生成框架，该框架不仅在不需要像素级标注的情况下达到了异常的大脑肿瘤分割性能，而且还提供了可解释性。我们的框架有效地区分了样本的类别相关特征和类别无关特征，通过嵌入不同的类别相关特征，生成新的样本以保留身份特征并更改类别属性。我们对提取出的类别相关特征进行拓扑数据分析，获取一个全局可解释的流形，对于要分割的每个异常样本，都可以有效地生成一个具有规则路径指导的正常样本，该路径设计旨在在不同类型的样本中表达不同类别的类相关特征。",
    "tldr": "这篇论文提出了一个不需要像素级标注且具有可解释性的新框架，用于快速准确的大脑肿瘤分割。它通过生成保留身份特征但改变类别属性的新样本，有效地分离了类别相关和类别无关的特征。此外，该框架使用拓扑数据分析来创建一个全局可解释的流形，从而为每个需要分割的异常样本生成一个正常样本。"
}