{
    "title": "Cross Psuedo Supervision Framework for Sparsely Labelled Geo-spatial Images",
    "abstract": "arXiv:2408.02382v1 Announce Type: new  Abstract: Land Use Land Cover (LULC) mapping is essential for urban and resource planning and is one of the key elements in developing smart and sustainable cities. This study introduces a semi-supervised segmentation model for LULC prediction using high-resolution satellite images with a huge diversity in data distributions in different areas from the country of India. Our approach ensures a robust generalization across different types of buildings, roads, trees, and water bodies within these distinct areas. We propose a modified Cross Pseudo Supervision framework to train image segmentation models on sparsely labelled data. The proposed framework addresses the limitations of the popular \"Cross Pseudo Supervision\" technique for semi-supervised learning. Specifically, it tackles the challenges of training segmentation models on noisy satellite image data with sparse and inaccurate labels. This comprehensive approach enhances the accuracy and utili",
    "link": "https://arxiv.org/abs/2408.02382",
    "context": "Title: Cross Psuedo Supervision Framework for Sparsely Labelled Geo-spatial Images\nAbstract: arXiv:2408.02382v1 Announce Type: new  Abstract: Land Use Land Cover (LULC) mapping is essential for urban and resource planning and is one of the key elements in developing smart and sustainable cities. This study introduces a semi-supervised segmentation model for LULC prediction using high-resolution satellite images with a huge diversity in data distributions in different areas from the country of India. Our approach ensures a robust generalization across different types of buildings, roads, trees, and water bodies within these distinct areas. We propose a modified Cross Pseudo Supervision framework to train image segmentation models on sparsely labelled data. The proposed framework addresses the limitations of the popular \"Cross Pseudo Supervision\" technique for semi-supervised learning. Specifically, it tackles the challenges of training segmentation models on noisy satellite image data with sparse and inaccurate labels. This comprehensive approach enhances the accuracy and utili",
    "path": "papers/24/08/2408.02382.json",
    "total_tokens": 367,
    "tldr": "该文章提出了一个改进的交叉伪监督框架，用于训练在卫星图像上标记不准确和不完整的数据上的分割模型，特别是针对土地使用和覆盖场景的不均匀分布。通过这种方式，文章尝试解决现有交叉伪监督技巧在解决城市和资源规划中关键问题的限制，并且改善了在印度不同地区使用的多样高分辨率卫星图像上的LULC（Land Use and Land Cover）预测。"
}