{
    "title": "Facing the Music: Tackling Singing Voice Separation in Cinematic Audio Source Separation",
    "abstract": "arXiv:2408.03588v1 Announce Type: cross  Abstract: Cinematic audio source separation (CASS) is a fairly new subtask of audio source separation. A typical setup of CASS is a three-stem problem, with the aim of separating the mixture into the dialogue stem (DX), music stem (MX), and effects stem (FX). In practice, however, several edge cases exist as some sound sources do not fit neatly in either of these three stems, necessitating the use of additional auxiliary stems in production. One very common edge case is the singing voice in film audio, which may belong in either the DX or MX, depending heavily on the cinematic context. In this work, we demonstrate a very straightforward extension of the dedicated-decoder Bandit and query-based single-decoder Banquet models to a four-stem problem, treating non-musical dialogue, instrumental music, singing voice, and effects as separate stems. Interestingly, the query-based Banquet model outperformed the dedicated-decoder Bandit model. We hypothes",
    "link": "https://arxiv.org/abs/2408.03588",
    "context": "Title: Facing the Music: Tackling Singing Voice Separation in Cinematic Audio Source Separation\nAbstract: arXiv:2408.03588v1 Announce Type: cross  Abstract: Cinematic audio source separation (CASS) is a fairly new subtask of audio source separation. A typical setup of CASS is a three-stem problem, with the aim of separating the mixture into the dialogue stem (DX), music stem (MX), and effects stem (FX). In practice, however, several edge cases exist as some sound sources do not fit neatly in either of these three stems, necessitating the use of additional auxiliary stems in production. One very common edge case is the singing voice in film audio, which may belong in either the DX or MX, depending heavily on the cinematic context. In this work, we demonstrate a very straightforward extension of the dedicated-decoder Bandit and query-based single-decoder Banquet models to a four-stem problem, treating non-musical dialogue, instrumental music, singing voice, and effects as separate stems. Interestingly, the query-based Banquet model outperformed the dedicated-decoder Bandit model. We hypothes",
    "path": "papers/24/08/2408.03588.json",
    "total_tokens": 359,
    "tldr": "该文章提出了一种将唱歌声音分离纳入电影音频源分离的解决方案，改进了现有的音频源分离模型，能够更有效地处理电影中的唱歌声音，从而提高声音分离的准确性和实用性。"
}