{
    "title": "Learning the Latent dynamics of Fluid flows from High-Fidelity Numerical Simulations using Parsimonious Diffusion Maps",
    "abstract": "arXiv:2408.02630v1 Announce Type: cross  Abstract: We use parsimonious diffusion maps (PDMs) to discover the latent dynamics of high-fidelity Navier-Stokes simulations with a focus on the 2D fluidic pinball problem. By varying the Reynolds number, different flow regimes emerge, ranging from steady symmetric flows to quasi-periodic asymmetric and turbulence. We show, that the proposed non-linear manifold learning scheme, identifies in a crisp manner the expected intrinsic dimension of the underlying emerging dynamics over the parameter space. In particular, PDMs, estimate that the emergent dynamics in the oscillatory regime can be captured by just two variables, while in the chaotic regime, the dominant modes are three as anticipated by the normal form theory. On the other hand, proper orthogonal decomposition (POD)/PCA, most commonly used for dimensionality reduction in fluid mechanics, does not provide such a crisp separation between the dominant modes. To validate the performance of ",
    "link": "https://arxiv.org/abs/2408.02630",
    "context": "Title: Learning the Latent dynamics of Fluid flows from High-Fidelity Numerical Simulations using Parsimonious Diffusion Maps\nAbstract: arXiv:2408.02630v1 Announce Type: cross  Abstract: We use parsimonious diffusion maps (PDMs) to discover the latent dynamics of high-fidelity Navier-Stokes simulations with a focus on the 2D fluidic pinball problem. By varying the Reynolds number, different flow regimes emerge, ranging from steady symmetric flows to quasi-periodic asymmetric and turbulence. We show, that the proposed non-linear manifold learning scheme, identifies in a crisp manner the expected intrinsic dimension of the underlying emerging dynamics over the parameter space. In particular, PDMs, estimate that the emergent dynamics in the oscillatory regime can be captured by just two variables, while in the chaotic regime, the dominant modes are three as anticipated by the normal form theory. On the other hand, proper orthogonal decomposition (POD)/PCA, most commonly used for dimensionality reduction in fluid mechanics, does not provide such a crisp separation between the dominant modes. To validate the performance of ",
    "path": "papers/24/08/2408.02630.json",
    "total_tokens": 381,
    "tldr": "PDMs, we carry out experiments on the temporal evolution of vortices in the velocity field and show that the coarsest PDMs capture these vortices much better than POD/PCA. Additionally, our method allows for a fast creation of trajectory-based descriptors in the large parameter space, aiding in a comprehensive understanding of the mechanisms behind the transition to turbulence and suggesting a potential route to control these fluid flows."
}