{
    "title": "Spacecraft inertial parameters estimation using time series clustering and reinforcement learning",
    "abstract": "arXiv:2408.03445v1 Announce Type: cross  Abstract: This paper presents a machine learning approach to estimate the inertial parameters of a spacecraft in cases when those change during operations, e.g. multiple deployments of payloads, unfolding of appendages and booms, propellant consumption as well as during in-orbit servicing and active debris removal operations. The machine learning approach uses time series clustering together with an optimised actuation sequence generated by reinforcement learning to facilitate distinguishing among different inertial parameter sets. The performance of the proposed strategy is assessed against the case of a multi-satellite deployment system showing that the algorithm is resilient towards common disturbances in such kinds of operations.",
    "link": "https://arxiv.org/abs/2408.03445",
    "context": "Title: Spacecraft inertial parameters estimation using time series clustering and reinforcement learning\nAbstract: arXiv:2408.03445v1 Announce Type: cross  Abstract: This paper presents a machine learning approach to estimate the inertial parameters of a spacecraft in cases when those change during operations, e.g. multiple deployments of payloads, unfolding of appendages and booms, propellant consumption as well as during in-orbit servicing and active debris removal operations. The machine learning approach uses time series clustering together with an optimised actuation sequence generated by reinforcement learning to facilitate distinguishing among different inertial parameter sets. The performance of the proposed strategy is assessed against the case of a multi-satellite deployment system showing that the algorithm is resilient towards common disturbances in such kinds of operations.",
    "path": "papers/24/08/2408.03445.json",
    "total_tokens": 275,
    "tldr": "该文章创新地提出使用时间序列聚类和强化学习结合的方法来估计太空船在运行期间发生的动态惯性参数变化，并通过实际的例子证明了该方法在面对多卫星部署系统的常见干扰时的高稳定性。"
}