{
    "title": "Fast Point Cloud Geometry Compression with Context-based Residual Coding and INR-based Refinement",
    "abstract": "arXiv:2408.02966v1 Announce Type: new  Abstract: Compressing a set of unordered points is far more challenging than compressing images/videos of regular sample grids, because of the difficulties in characterizing neighboring relations in an irregular layout of points. Many researchers resort to voxelization to introduce regularity, but this approach suffers from quantization loss. In this research, we use the KNN method to determine the neighborhoods of raw surface points. This gives us a means to determine the spatial context in which the latent features of 3D points are compressed by arithmetic coding. As such, the conditional probability model is adaptive to local geometry, leading to significant rate reduction. Additionally, we propose a dual-layer architecture where a non-learning base layer reconstructs the main structures of the point cloud at low complexity, while a learned refinement layer focuses on preserving fine details. This design leads to reductions in model complexity ",
    "link": "https://arxiv.org/abs/2408.02966",
    "context": "Title: Fast Point Cloud Geometry Compression with Context-based Residual Coding and INR-based Refinement\nAbstract: arXiv:2408.02966v1 Announce Type: new  Abstract: Compressing a set of unordered points is far more challenging than compressing images/videos of regular sample grids, because of the difficulties in characterizing neighboring relations in an irregular layout of points. Many researchers resort to voxelization to introduce regularity, but this approach suffers from quantization loss. In this research, we use the KNN method to determine the neighborhoods of raw surface points. This gives us a means to determine the spatial context in which the latent features of 3D points are compressed by arithmetic coding. As such, the conditional probability model is adaptive to local geometry, leading to significant rate reduction. Additionally, we propose a dual-layer architecture where a non-learning base layer reconstructs the main structures of the point cloud at low complexity, while a learned refinement layer focuses on preserving fine details. This design leads to reductions in model complexity ",
    "path": "papers/24/08/2408.02966.json",
    "total_tokens": 362,
    "tldr": "该文章提出了一种基于上下文残差编码和INR优化的三维点云快速几何压缩方法，通过KNN方法确定原始表面点的邻域关系，有效利用算术编码对3D点特征进行压缩，并且设计了一个双层压缩架构，通过对粗糙结构和精细细节的层次处理，实现了模型复杂度和压缩率的平衡优化。"
}