{
    "title": "Clustering and Mining Accented Speech for Inclusive and Fair Speech Recognition",
    "abstract": "arXiv:2408.02582v1 Announce Type: cross  Abstract: Modern automatic speech recognition (ASR) systems are typically trained on more than tens of thousands hours of speech data, which is one of the main factors for their great success. However, the distribution of such data is typically biased towards common accents or typical speech patterns. As a result, those systems often poorly perform on atypical accented speech. In this paper, we present accent clustering and mining schemes for fair speech recognition systems which can perform equally well on under-represented accented speech. For accent recognition, we applied three schemes to overcome limited size of supervised accent data: supervised or unsupervised pre-training, distributionally robust optimization (DRO) and unsupervised clustering. Three schemes can significantly improve the accent recognition model especially for unbalanced and small accented speech. Fine-tuning ASR on the mined Indian accent speech using the proposed superv",
    "link": "https://arxiv.org/abs/2408.02582",
    "context": "Title: Clustering and Mining Accented Speech for Inclusive and Fair Speech Recognition\nAbstract: arXiv:2408.02582v1 Announce Type: cross  Abstract: Modern automatic speech recognition (ASR) systems are typically trained on more than tens of thousands hours of speech data, which is one of the main factors for their great success. However, the distribution of such data is typically biased towards common accents or typical speech patterns. As a result, those systems often poorly perform on atypical accented speech. In this paper, we present accent clustering and mining schemes for fair speech recognition systems which can perform equally well on under-represented accented speech. For accent recognition, we applied three schemes to overcome limited size of supervised accent data: supervised or unsupervised pre-training, distributionally robust optimization (DRO) and unsupervised clustering. Three schemes can significantly improve the accent recognition model especially for unbalanced and small accented speech. Fine-tuning ASR on the mined Indian accent speech using the proposed superv",
    "path": "papers/24/08/2408.02582.json",
    "total_tokens": 664,
    "translated_title": "带有押韵的语音聚类和挖掘对包容性和公平性语音识别的重要性",
    "translated_abstract": "arXiv:2408.02582v1 公告类型: 跨学科摘要: 现代自动语音识别(ASR)系统通常是在超过数万小时语音数据的训练下取得的巨大成功。然而，这样的数据分布通常倾向于平衡或者典型语音模式。因此，这些系统在典型口音以外的非典型口音的语音识别上表现不佳。在本研究中提出了倾斜语音聚类和挖掘方法来打造针对难以涉足的口音语音识别的公平系统。对于口音识别，我们应用了三种方法来克服数据量小或不平衡的监督口音数据：监督或无监督的数据预训练、分布稳健优化(DRO)及无监督的聚类方法。这三种方法对于校正小规模和不平衡口音语音的口音识别模型表现有显著提升。我们通过提出的方法在印度口音语音上对ASR进行微调并取得了显著的提升，这表明了监督和无监督的数据挖掘方法对于提高识别泛化性能的重要性。",
    "tldr": "本文提出了一种针对难以涉足的口音语音识别的公平性系统，通过改进的聚类和数据挖掘方法显著提高了非典型口音的语音识别性能。"
}