{
    "title": "Out-Of-Distribution Detection for Audio-visual Generalized Zero-Shot Learning: A General Framework",
    "abstract": "arXiv:2408.01284v1 Announce Type: cross  Abstract: Generalized Zero-Shot Learning (GZSL) is a challenging task requiring accurate classification of both seen and unseen classes. Within this domain, Audio-visual GZSL emerges as an extremely exciting yet difficult task, given the inclusion of both visual and acoustic features as multi-modal inputs. Existing efforts in this field mostly utilize either embedding-based or generative-based methods. However, generative training is difficult and unstable, while embedding-based methods often encounter domain shift problem. Thus, we find it promising to integrate both methods into a unified framework to leverage their advantages while mitigating their respective disadvantages. Our study introduces a general framework employing out-of-distribution (OOD) detection, aiming to harness the strengths of both approaches. We first employ generative adversarial networks to synthesize unseen features, enabling the training of an OOD detector alongside cla",
    "link": "https://arxiv.org/abs/2408.01284",
    "context": "Title: Out-Of-Distribution Detection for Audio-visual Generalized Zero-Shot Learning: A General Framework\nAbstract: arXiv:2408.01284v1 Announce Type: cross  Abstract: Generalized Zero-Shot Learning (GZSL) is a challenging task requiring accurate classification of both seen and unseen classes. Within this domain, Audio-visual GZSL emerges as an extremely exciting yet difficult task, given the inclusion of both visual and acoustic features as multi-modal inputs. Existing efforts in this field mostly utilize either embedding-based or generative-based methods. However, generative training is difficult and unstable, while embedding-based methods often encounter domain shift problem. Thus, we find it promising to integrate both methods into a unified framework to leverage their advantages while mitigating their respective disadvantages. Our study introduces a general framework employing out-of-distribution (OOD) detection, aiming to harness the strengths of both approaches. We first employ generative adversarial networks to synthesize unseen features, enabling the training of an OOD detector alongside cla",
    "path": "papers/24/08/2408.01284.json",
    "total_tokens": 646,
    "translated_title": "音频视觉泛化零样本学习中的分布外检测：一个通用的框架",
    "translated_abstract": "本文研究了音频视觉泛化零样本学习（GZSL）中的影响。GZSL任务要求对既有训练数据又有测试数据的样本进行准确分类。在多模式输入中，同时包含视觉和声学特征使其成为了一个极具挑战性的任务。虽然现有的研究大多集中在嵌入方法和生成方法上，但由于训练不稳定性和生成方法之间的差距，我们对将这两种方法整合到一个框架中持乐观态度。我们提出了一种新的通用框架，利用了分布外（OOD）检测技术，旨在利用这些方法的优势同时缓解它们各自的缺点。我们首先使用生成对抗网络来模拟未见过的特征，并在这个过程中训练一个OOD检测器。这是通用框架的一种创新方法，旨在解决泛化零样本分类中出现的域发生问题。我们的实采纳生成对抗网络和嵌入方法，通过整合在一起来提高训练数据的质量和多样性。此外，我们还介绍了一种新的训练和评估策略，以有效地评估模型对未见过的类别的性能。",
    "tldr": "本文提出了一种新的通用框架，利用分布外检测技术来解决音频视觉泛化零样本学习中的域发生问题。通过整合生成对抗网络和嵌入方法，该框架提高了对未知类别的准确分类能力。同时，还介绍了一种新的训练和评估策略，以优化模型性能。"
}