{
    "title": "Prototypical Partial Optimal Transport for Universal Domain Adaptation",
    "abstract": "arXiv:2408.01089v1 Announce Type: new  Abstract: Universal domain adaptation (UniDA) aims to transfer knowledge from a labeled source domain to an unlabeled target domain without requiring the same label sets of both domains. The existence of domain and category shift makes the task challenging and requires us to distinguish \"known\" samples (i.e., samples whose labels exist in both domains) and \"unknown\" samples (i.e., samples whose labels exist in only one domain) in both domains before reducing the domain gap. In this paper, we consider the problem from the point of view of distribution matching which we only need to align two distributions partially. A novel approach, dubbed mini-batch Prototypical Partial Optimal Transport (m-PPOT), is proposed to conduct partial distribution alignment for UniDA. In training phase, besides minimizing m-PPOT, we also leverage the transport plan of m-PPOT to reweight source prototypes and target samples, and design reweighted entropy loss and reweigh",
    "link": "https://arxiv.org/abs/2408.01089",
    "context": "Title: Prototypical Partial Optimal Transport for Universal Domain Adaptation\nAbstract: arXiv:2408.01089v1 Announce Type: new  Abstract: Universal domain adaptation (UniDA) aims to transfer knowledge from a labeled source domain to an unlabeled target domain without requiring the same label sets of both domains. The existence of domain and category shift makes the task challenging and requires us to distinguish \"known\" samples (i.e., samples whose labels exist in both domains) and \"unknown\" samples (i.e., samples whose labels exist in only one domain) in both domains before reducing the domain gap. In this paper, we consider the problem from the point of view of distribution matching which we only need to align two distributions partially. A novel approach, dubbed mini-batch Prototypical Partial Optimal Transport (m-PPOT), is proposed to conduct partial distribution alignment for UniDA. In training phase, besides minimizing m-PPOT, we also leverage the transport plan of m-PPOT to reweight source prototypes and target samples, and design reweighted entropy loss and reweigh",
    "path": "papers/24/08/2408.01089.json",
    "total_tokens": 715,
    "translated_title": "半优化的典型部分最优运输理论在跨领域适配中的普遍应用",
    "translated_abstract": "跨领域适配（UniDA）旨在从带标签的源领域向无标签的目标领域传输知识，无需两者具有相同的标签集。领域和类别偏移的存在使得任务具有挑战性，并要求我们对两者中的样本进行区分，这些样本具有在领域中的标签，但同时在目标领域中却没有标签。在论文中，我们考虑到分布匹配问题，我们只需要对分布进行部分对齐。提出了一种名为mini-batch Prototypical Partial Optimal Transport（m-PPOT）的全新方法，旨在为UniDA进行部分分布对齐。在训练阶段，除了最小化m-PPOT之外，我们还在运输计划中重置源原型和目标样本的权重，并设计了重置熵损失和重置权重来改进学习效果。同时，我们还提出了一种用于衡量模型稳健性的uniform converage criterion，并定义了基于该准则的损失函数，从而加强了模型在泛化能力上的改进。最后，通过在多种跨领域适配任务上的实验，证明了我们的方法在减轻领域差异和提高预测性能方面的有效性。",
    "tldr": "本文为减轻更大领域的差异提出了一个名为m-PPOT的方法，该方法通过重置权重和优化损失函数提高了泛化能力，并在多种跨领域适配任务上取得了显著效果。"
}