{
    "title": "Contrastive Learning-based Chaining-Cluster for Multilingual Voice-Face Association",
    "abstract": "arXiv:2408.02025v1 Announce Type: cross  Abstract: The innate correlation between a person's face and voice has recently emerged as a compelling area of study, especially within the context of multilingual environments. This paper introduces our novel solution to the Face-Voice Association in Multilingual Environments (FAME) 2024 challenge, focusing on a contrastive learning-based chaining-cluster method to enhance face-voice association. This task involves the challenges of building biometric relations between auditory and visual modality cues and modelling the prosody interdependence between different languages while addressing both intrinsic and extrinsic variability present in the data. To handle these non-trivial challenges, our method employs supervised cross-contrastive (SCC) learning to establish robust associations between voices and faces in multi-language scenarios. Following this, we have specifically designed a chaining-cluster-based post-processing step to mitigate the im",
    "link": "https://arxiv.org/abs/2408.02025",
    "context": "Title: Contrastive Learning-based Chaining-Cluster for Multilingual Voice-Face Association\nAbstract: arXiv:2408.02025v1 Announce Type: cross  Abstract: The innate correlation between a person's face and voice has recently emerged as a compelling area of study, especially within the context of multilingual environments. This paper introduces our novel solution to the Face-Voice Association in Multilingual Environments (FAME) 2024 challenge, focusing on a contrastive learning-based chaining-cluster method to enhance face-voice association. This task involves the challenges of building biometric relations between auditory and visual modality cues and modelling the prosody interdependence between different languages while addressing both intrinsic and extrinsic variability present in the data. To handle these non-trivial challenges, our method employs supervised cross-contrastive (SCC) learning to establish robust associations between voices and faces in multi-language scenarios. Following this, we have specifically designed a chaining-cluster-based post-processing step to mitigate the im",
    "path": "papers/24/08/2408.02025.json",
    "total_tokens": 358,
    "tldr": "该文章提出了一种基于对比学习方法的链结集群算法，用于解决跨语言环境下人脸与声音的关联问题。通过结合监督的交叉对比学习以及定制化的链结集群处理，该算法能够在面对语言间声调差异和数据中固有与外在的多样性时，增强不同语言背景下人脸与声音的匹配能力。"
}