{
    "title": "Improving Neural Surface Reconstruction with Feature Priors from Multi-View Image",
    "abstract": "arXiv:2408.02079v1 Announce Type: new  Abstract: Recent advancements in Neural Surface Reconstruction (NSR) have significantly improved multi-view reconstruction when coupled with volume rendering. However, relying solely on photometric consistency in image space falls short of addressing complexities posed by real-world data, including occlusions and non-Lambertian surfaces. To tackle these challenges, we propose an investigation into feature-level consistent loss, aiming to harness valuable feature priors from diverse pretext visual tasks and overcome current limitations. It is crucial to note the existing gap in determining the most effective pretext visual task for enhancing NSR. In this study, we comprehensively explore multi-view feature priors from seven pretext visual tasks, comprising thirteen methods. Our main goal is to strengthen NSR training by considering a wide range of possibilities. Additionally, we examine the impact of varying feature resolutions and evaluate both pi",
    "link": "https://arxiv.org/abs/2408.02079",
    "context": "Title: Improving Neural Surface Reconstruction with Feature Priors from Multi-View Image\nAbstract: arXiv:2408.02079v1 Announce Type: new  Abstract: Recent advancements in Neural Surface Reconstruction (NSR) have significantly improved multi-view reconstruction when coupled with volume rendering. However, relying solely on photometric consistency in image space falls short of addressing complexities posed by real-world data, including occlusions and non-Lambertian surfaces. To tackle these challenges, we propose an investigation into feature-level consistent loss, aiming to harness valuable feature priors from diverse pretext visual tasks and overcome current limitations. It is crucial to note the existing gap in determining the most effective pretext visual task for enhancing NSR. In this study, we comprehensively explore multi-view feature priors from seven pretext visual tasks, comprising thirteen methods. Our main goal is to strengthen NSR training by considering a wide range of possibilities. Additionally, we examine the impact of varying feature resolutions and evaluate both pi",
    "path": "papers/24/08/2408.02079.json",
    "total_tokens": 321,
    "tldr": "该文章提出了一个新颖的框架，旨在通过从多视图图像中学习到的特征先验来改进神经表面重建技术，从而能够更好地处理真实世界场景中的遮挡和非理想漫反射表面等问题。"
}