{
    "title": "Fuzzy Logic Approach For Visual Analysis Of Websites With K-means Clustering-based Color Extraction",
    "abstract": "arXiv:2408.00774v1 Announce Type: cross  Abstract: Websites form the foundation of the Internet, serving as platforms for disseminating information and accessing digital resources. They allow users to engage with a wide range of content and services, enhancing the Internet's utility for all. The aesthetics of a website play a crucial role in its overall effectiveness and can significantly impact user experience, engagement, and satisfaction. This paper examines the importance of website design aesthetics in enhancing user experience, given the increasing number of internet users worldwide. It emphasizes the significant impact of first impressions, often formed within 50 milliseconds, on users' perceptions of a website's appeal and usability. We introduce a novel method for measuring website aesthetics based on color harmony and font popularity, using fuzzy logic to predict aesthetic preferences. We collected our own dataset, consisting of nearly 200 popular and frequently used website ",
    "link": "https://arxiv.org/abs/2408.00774",
    "context": "Title: Fuzzy Logic Approach For Visual Analysis Of Websites With K-means Clustering-based Color Extraction\nAbstract: arXiv:2408.00774v1 Announce Type: cross  Abstract: Websites form the foundation of the Internet, serving as platforms for disseminating information and accessing digital resources. They allow users to engage with a wide range of content and services, enhancing the Internet's utility for all. The aesthetics of a website play a crucial role in its overall effectiveness and can significantly impact user experience, engagement, and satisfaction. This paper examines the importance of website design aesthetics in enhancing user experience, given the increasing number of internet users worldwide. It emphasizes the significant impact of first impressions, often formed within 50 milliseconds, on users' perceptions of a website's appeal and usability. We introduce a novel method for measuring website aesthetics based on color harmony and font popularity, using fuzzy logic to predict aesthetic preferences. We collected our own dataset, consisting of nearly 200 popular and frequently used website ",
    "path": "papers/24/08/2408.00774.json",
    "total_tokens": 655,
    "translated_title": "基于模糊逻辑的网站视觉分析方法：基于K-means聚类的中文摘要提取",
    "translated_abstract": "arXiv:2408.00774v1 公告类型：交叉 摘要：网站构成了互联网的基础，作为信息传播和访问数字资源的平台。它们允许用户参与广泛的内容和服务，提高互联网对所有人的实用性。网站的设计美学在提升用户体验方面起着至关重要的作用，而在全世界互联网用户数量日益增长的大背景下这一点尤为重要。本文探讨了网站设计美学的提高用户体验的重要性。它强调了用户在50毫秒内形成的“第一印象”对用户对网站吸引力和易用性的看法的重大影响。我们提出了一个基于颜色和谐度和字体流行度测量网站美学的创新方法，使用模糊逻辑预测美学偏好。我们对包含近200个热门和经常使用的网站的数据集进行了研究，并且我们使用了一种新颖的基于颜色提取的K-means聚类方法来有效预测中文摘要中每个词的颜色，尽管存在语义不明确的问题，但这种颜色预",
    "tldr": "本文引入了一种新颖的基于K-means聚类方法，有效预测中文摘要中每个词的颜色，即使存在语义不明确的问题，但仍能准确预测颜色偏好。"
}