{
    "title": "Efficient Data-driven Joint-level Calibration of Cable-driven Surgical Robots",
    "abstract": "arXiv:2408.01604v1 Announce Type: new  Abstract: Knowing accurate joint positions is crucial for safe and precise control of laparoscopic surgical robots, especially for the automation of surgical sub-tasks. These robots have often been designed with cable-driven arms and tools because cables allow for larger motors to be placed at the base of the robot, further from the operating area where space is at a premium. However, by connecting the joint to its motor with a cable, any stretch in the cable can lead to errors in kinematic estimation from encoders at the motor, which can result in difficulties for accurate control of the surgical tool. In this work, we propose an efficient data-driven calibration of positioning joints of such robots, in this case the RAVEN-II surgical robotics research platform. While the calibration takes only 8-21 minutes, the accuracy of the calibrated joints remains high during a 6-hour heavily loaded operation, suggesting desirable feasibility in real practi",
    "link": "https://arxiv.org/abs/2408.01604",
    "context": "Title: Efficient Data-driven Joint-level Calibration of Cable-driven Surgical Robots\nAbstract: arXiv:2408.01604v1 Announce Type: new  Abstract: Knowing accurate joint positions is crucial for safe and precise control of laparoscopic surgical robots, especially for the automation of surgical sub-tasks. These robots have often been designed with cable-driven arms and tools because cables allow for larger motors to be placed at the base of the robot, further from the operating area where space is at a premium. However, by connecting the joint to its motor with a cable, any stretch in the cable can lead to errors in kinematic estimation from encoders at the motor, which can result in difficulties for accurate control of the surgical tool. In this work, we propose an efficient data-driven calibration of positioning joints of such robots, in this case the RAVEN-II surgical robotics research platform. While the calibration takes only 8-21 minutes, the accuracy of the calibrated joints remains high during a 6-hour heavily loaded operation, suggesting desirable feasibility in real practi",
    "path": "papers/24/08/2408.01604.json",
    "total_tokens": 367,
    "tldr": "该文章报告了一项创新的研究，提出了一种高效的数据驱动方法来校准具有电缆驱动臂和工具的手术机器人的关节位置。该方法仅耗时8到21分钟，即使在长时间且负载重的实际操作中，校准后的关节精度仍然保持高水准，展示了该方法在真实手术环境中的实际应用潜力。"
}