{
    "title": "Perception Matters: Enhancing Embodied AI with Uncertainty-Aware Semantic Segmentation",
    "abstract": "arXiv:2408.02297v1 Announce Type: new  Abstract: Embodied AI has made significant progress acting in unexplored environments. However, tasks such as object search have largely focused on efficient policy learning. In this work, we identify several gaps in current search methods: They largely focus on dated perception models, neglect temporal aggregation, and transfer from ground truth directly to noisy perception at test time, without accounting for the resulting overconfidence in the perceived state. We address the identified problems through calibrated perception probabilities and uncertainty across aggregation and found decisions, thereby adapting the models for sequential tasks. The resulting methods can be directly integrated with pretrained models across a wide family of existing search approaches at no additional training cost. We perform extensive evaluations of aggregation methods across both different semantic perception models and policies, confirming the importance of calib",
    "link": "https://arxiv.org/abs/2408.02297",
    "context": "Title: Perception Matters: Enhancing Embodied AI with Uncertainty-Aware Semantic Segmentation\nAbstract: arXiv:2408.02297v1 Announce Type: new  Abstract: Embodied AI has made significant progress acting in unexplored environments. However, tasks such as object search have largely focused on efficient policy learning. In this work, we identify several gaps in current search methods: They largely focus on dated perception models, neglect temporal aggregation, and transfer from ground truth directly to noisy perception at test time, without accounting for the resulting overconfidence in the perceived state. We address the identified problems through calibrated perception probabilities and uncertainty across aggregation and found decisions, thereby adapting the models for sequential tasks. The resulting methods can be directly integrated with pretrained models across a wide family of existing search approaches at no additional training cost. We perform extensive evaluations of aggregation methods across both different semantic perception models and policies, confirming the importance of calib",
    "path": "papers/24/08/2408.02297.json",
    "total_tokens": 592,
    "translated_title": "感知至关重要：通过不确定性感知语义分割增强身体人工智能",
    "translated_abstract": "arXiv:2408.02297v1 宣布类型：新的摘要：身体人工智能在未知环境中执行任务方面取得了显著进展。然而，如物体搜索等任务主要关注有效策略的学习。在这项工作中，我们识别出当前搜索方法中的几个差距：它们主要集中在过时的感知模型上，忽略了时间聚合，并且从地面真实直接转移到测试时的噪声感知，而不考虑到感知状态的过度自信。通过校准的感知概率和不确定性以及聚合和决策过程中的不确定性来解决这些问题，从而对模型进行适应以处理序列任务。所得到的方法可以直接集成到一系列现有的搜索方法中，且没有额外的训练成本。我们在不同类型的语义感知模型和策略上进行了广泛的评估，确认了校准感知概率在聚合方法和不同感知模型和策略中的重要性。",
    "tldr": "此研究通过校准感知概率和不确定性改进了身体人工智能的搜索任务，特别是在不同类型的语义感知模型中取得了显著进展。"
}