{
    "title": "MaFreeI2P: A Matching-Free Image-to-Point Cloud Registration Paradigm with Active Camera Pose Retrieval",
    "abstract": "arXiv:2408.02392v1 Announce Type: new  Abstract: Image-to-point cloud registration seeks to estimate their relative camera pose, which remains an open question due to the data modality gaps. The recent matching-based methods tend to tackle this by building 2D-3D correspondences. In this paper, we reveal the information loss inherent in these methods and propose a matching-free paradigm, named MaFreeI2P. Our key insight is to actively retrieve the camera pose in SE(3) space by contrasting the geometric features between the point cloud and the query image. To achieve this, we first sample a set of candidate camera poses and construct their cost volume using the cross-modal features. Superior to matching, cost volume can preserve more information and its feature similarity implicitly reflects the confidence level of the sampled poses. Afterwards, we employ a convolutional network to adaptively formulate a similarity assessment function, where the input cost volume is further improved by f",
    "link": "https://arxiv.org/abs/2408.02392",
    "context": "Title: MaFreeI2P: A Matching-Free Image-to-Point Cloud Registration Paradigm with Active Camera Pose Retrieval\nAbstract: arXiv:2408.02392v1 Announce Type: new  Abstract: Image-to-point cloud registration seeks to estimate their relative camera pose, which remains an open question due to the data modality gaps. The recent matching-based methods tend to tackle this by building 2D-3D correspondences. In this paper, we reveal the information loss inherent in these methods and propose a matching-free paradigm, named MaFreeI2P. Our key insight is to actively retrieve the camera pose in SE(3) space by contrasting the geometric features between the point cloud and the query image. To achieve this, we first sample a set of candidate camera poses and construct their cost volume using the cross-modal features. Superior to matching, cost volume can preserve more information and its feature similarity implicitly reflects the confidence level of the sampled poses. Afterwards, we employ a convolutional network to adaptively formulate a similarity assessment function, where the input cost volume is further improved by f",
    "path": "papers/24/08/2408.02392.json",
    "total_tokens": 506,
    "translated_title": "MaFreeI2P: 一种无需配准的图像到点云注册方法，以及带有主动相机姿态检索的活跃相机姿态",
    "tldr": "论文提出了一种无需图像到点云配准的新方法MaFreeI2P，该方法通过主动地在SE(3)空间中检索相机姿态，并对比几何特征，无需建立2D到3D的对应关系。",
    "en_tdlr": "MaFreeI2P proposes a novel matching-free image-to-point cloud registration paradigm that actively retrieves camera poses in SE(3) space through geometric feature comparison, without establishing 2D-3D correspondences."
}