{
    "title": "Probabilistic modeling reveals coordinated social interaction states and their multisensory bases",
    "abstract": "arXiv:2408.01683v1 Announce Type: new  Abstract: Social behavior across animal species ranges from simple pairwise interactions to thousands of individuals coordinating goal-directed movements. Regardless of the scale, these interactions are governed by the interplay between multimodal sensory information and the internal state of each animal. Here, we investigate how animals use multiple sensory modalities to guide social behavior in the highly social zebrafish (Danio rerio) and uncover the complex features of pairwise interactions early in development. To identify distinct behaviors and understand how they vary over time, we developed a new hidden Markov model with constrained linear-model emissions to automatically classify states of coordinated interaction, using the movements of one animal to predict those of another. We discovered that social behaviors alternate between two interaction states within a single experimental session, distinguished by unique movements and timescales. ",
    "link": "https://arxiv.org/abs/2408.01683",
    "context": "Title: Probabilistic modeling reveals coordinated social interaction states and their multisensory bases\nAbstract: arXiv:2408.01683v1 Announce Type: new  Abstract: Social behavior across animal species ranges from simple pairwise interactions to thousands of individuals coordinating goal-directed movements. Regardless of the scale, these interactions are governed by the interplay between multimodal sensory information and the internal state of each animal. Here, we investigate how animals use multiple sensory modalities to guide social behavior in the highly social zebrafish (Danio rerio) and uncover the complex features of pairwise interactions early in development. To identify distinct behaviors and understand how they vary over time, we developed a new hidden Markov model with constrained linear-model emissions to automatically classify states of coordinated interaction, using the movements of one animal to predict those of another. We discovered that social behaviors alternate between two interaction states within a single experimental session, distinguished by unique movements and timescales. ",
    "path": "papers/24/08/2408.01683.json",
    "total_tokens": 291,
    "tldr": "这项研究创新性地利用概率模型分析了 zebrafish 在社会互动中的协调行为，并揭示了这种行为的多模态感官基础，为理解动物如何利用感官信息和内部状态进行社交行为提供了新的视角。"
}