{
    "title": "Lost in Translation: Latent Concept Misalignment in Text-to-Image Diffusion Models",
    "abstract": "arXiv:2408.00230v2 Announce Type: replace  Abstract: Advancements in text-to-image diffusion models have broadened extensive downstream practical applications, but such models often encounter misalignment issues between text and image. Taking the generation of a combination of two disentangled concepts as an example, say given the prompt \"a tea cup of iced coke\", existing models usually generate a glass cup of iced coke because the iced coke usually co-occurs with the glass cup instead of the tea one during model training. The root of such misalignment is attributed to the confusion in the latent semantic space of text-to-image diffusion models, and hence we refer to the \"a tea cup of iced coke\" phenomenon as Latent Concept Misalignment (LC-Mis). We leverage large language models (LLMs) to thoroughly investigate the scope of LC-Mis, and develop an automated pipeline for aligning the latent semantics of diffusion models to text prompts. Empirical assessments confirm the effectiveness of",
    "link": "https://arxiv.org/abs/2408.00230",
    "context": "Title: Lost in Translation: Latent Concept Misalignment in Text-to-Image Diffusion Models\nAbstract: arXiv:2408.00230v2 Announce Type: replace  Abstract: Advancements in text-to-image diffusion models have broadened extensive downstream practical applications, but such models often encounter misalignment issues between text and image. Taking the generation of a combination of two disentangled concepts as an example, say given the prompt \"a tea cup of iced coke\", existing models usually generate a glass cup of iced coke because the iced coke usually co-occurs with the glass cup instead of the tea one during model training. The root of such misalignment is attributed to the confusion in the latent semantic space of text-to-image diffusion models, and hence we refer to the \"a tea cup of iced coke\" phenomenon as Latent Concept Misalignment (LC-Mis). We leverage large language models (LLMs) to thoroughly investigate the scope of LC-Mis, and develop an automated pipeline for aligning the latent semantics of diffusion models to text prompts. Empirical assessments confirm the effectiveness of",
    "path": "papers/24/08/2408.00230.json",
    "total_tokens": 582,
    "translated_title": "迷失在翻译中：文本到图像扩散模型中的潜在概念不一致",
    "translated_abstract": "这篇文章讨论了文本到图像扩散模型在概念映射方面所遇到的挑战。在现有的模型中，当输入包括两个潜在概念的组合时（例如，“一杯冰可乐”这个词组），模型常常生成冰可乐与玻璃杯的组合。这种不一致的问题是因为文本和图像之间的潜在概念映射存在问题。为了解决这些问题，我们提出了一种基于大型语言模型的自动化管道，并通过实际的评估确认了该方法的有效性。",
    "tldr": "文章探讨了文本到图像扩散模型在处理文字与图像概念映射时存在的问题，并提出了一种基于大型语言模型的解决方案，有效提高了模型对文字提示的响应一致性。",
    "en_tdlr": "This paper discusses challenges in concept mapping in text-to-image diffusion models and proposes a solution based on large language models, which is found to be effective in improving the model's response consistency to text prompts."
}