{
    "title": "LAMPO: Large Language Models as Preference Machines for Few-shot Ordinal Classification",
    "abstract": "arXiv:2408.03359v1 Announce Type: cross  Abstract: We introduce LAMPO, a novel paradigm that leverages Large Language Models (LLMs) for solving few-shot multi-class ordinal classification tasks. Unlike conventional methods, which concatenate all demonstration examples with the test instance and prompt LLMs to produce the pointwise prediction, our framework uses the LLM as a preference machine that makes a relative comparative decision between the test instance and each demonstration. A self-supervised method is then introduced to aggregate these binary comparisons into the final ordinal decision. LAMPO addresses several limitations inherent in previous methods, including context length constraints, ordering biases, and challenges associated with absolute point-wise estimation. Extensive experiments on seven public datasets demonstrate LAMPO's remarkably competitive performance across a diverse spectrum of applications (e.g., movie review analysis and hate speech detection). Notably, in",
    "link": "https://arxiv.org/abs/2408.03359",
    "context": "Title: LAMPO: Large Language Models as Preference Machines for Few-shot Ordinal Classification\nAbstract: arXiv:2408.03359v1 Announce Type: cross  Abstract: We introduce LAMPO, a novel paradigm that leverages Large Language Models (LLMs) for solving few-shot multi-class ordinal classification tasks. Unlike conventional methods, which concatenate all demonstration examples with the test instance and prompt LLMs to produce the pointwise prediction, our framework uses the LLM as a preference machine that makes a relative comparative decision between the test instance and each demonstration. A self-supervised method is then introduced to aggregate these binary comparisons into the final ordinal decision. LAMPO addresses several limitations inherent in previous methods, including context length constraints, ordering biases, and challenges associated with absolute point-wise estimation. Extensive experiments on seven public datasets demonstrate LAMPO's remarkably competitive performance across a diverse spectrum of applications (e.g., movie review analysis and hate speech detection). Notably, in",
    "path": "papers/24/08/2408.03359.json",
    "total_tokens": 318,
    "tldr": "该文章提出LAMPO方法，利用大型语言模型作为偏好机器，通过对比学习对少样本多类顺序分类问题进行解决，显著提升了模型性能。"
}