{
    "title": "Video-based Pedestrian and Vehicle Traffic Analysis During Football Games",
    "abstract": "arXiv:2408.02146v1 Announce Type: new  Abstract: This paper utilizes video analytics to study pedestrian and vehicle traffic behavior, focusing on analyzing traffic patterns during football gamedays. The University of Florida (UF) hosts six to seven home football games on Saturdays during the college football season, attracting significant pedestrian activity. Through video analytics, this study provides valuable insights into the impact of these events on traffic volumes and safety at intersections. Comparing pedestrian and vehicle activities on gamedays versus non-gamedays reveals differing patterns. For example, pedestrian volume substantially increases during gamedays, which is positively correlated with the probability of the away team winning. This correlation is likely because fans of the home team enjoy watching difficult games. Win probabilities as an early predictor of pedestrian volumes at intersections can be a tool to help traffic professionals anticipate traffic managemen",
    "link": "https://arxiv.org/abs/2408.02146",
    "context": "Title: Video-based Pedestrian and Vehicle Traffic Analysis During Football Games\nAbstract: arXiv:2408.02146v1 Announce Type: new  Abstract: This paper utilizes video analytics to study pedestrian and vehicle traffic behavior, focusing on analyzing traffic patterns during football gamedays. The University of Florida (UF) hosts six to seven home football games on Saturdays during the college football season, attracting significant pedestrian activity. Through video analytics, this study provides valuable insights into the impact of these events on traffic volumes and safety at intersections. Comparing pedestrian and vehicle activities on gamedays versus non-gamedays reveals differing patterns. For example, pedestrian volume substantially increases during gamedays, which is positively correlated with the probability of the away team winning. This correlation is likely because fans of the home team enjoy watching difficult games. Win probabilities as an early predictor of pedestrian volumes at intersections can be a tool to help traffic professionals anticipate traffic managemen",
    "path": "papers/24/08/2408.02146.json",
    "total_tokens": 310,
    "tldr": "该文章通过视频分析手段，详细探讨了足球比赛对体育场周边交通行为的影响，揭示了在比赛日与非比赛日之间的显著交通模式差异，为交通管理人员提供了预测和管理交通流量的新视角。"
}