{
    "title": "Generating High-quality Symbolic Music Using Fine-grained Discriminators",
    "abstract": "arXiv:2408.01696v1 Announce Type: cross  Abstract: Existing symbolic music generation methods usually utilize discriminator to improve the quality of generated music via global perception of music. However, considering the complexity of information in music, such as rhythm and melody, a single discriminator cannot fully reflect the differences in these two primary dimensions of music. In this work, we propose to decouple the melody and rhythm from music, and design corresponding fine-grained discriminators to tackle the aforementioned issues. Specifically, equipped with a pitch augmentation strategy, the melody discriminator discerns the melody variations presented by the generated samples. By contrast, the rhythm discriminator, enhanced with bar-level relative positional encoding, focuses on the velocity of generated notes. Such a design allows the generator to be more explicitly aware of which aspects should be adjusted in the generated music, making it easier to mimic human-composed",
    "link": "https://arxiv.org/abs/2408.01696",
    "context": "Title: Generating High-quality Symbolic Music Using Fine-grained Discriminators\nAbstract: arXiv:2408.01696v1 Announce Type: cross  Abstract: Existing symbolic music generation methods usually utilize discriminator to improve the quality of generated music via global perception of music. However, considering the complexity of information in music, such as rhythm and melody, a single discriminator cannot fully reflect the differences in these two primary dimensions of music. In this work, we propose to decouple the melody and rhythm from music, and design corresponding fine-grained discriminators to tackle the aforementioned issues. Specifically, equipped with a pitch augmentation strategy, the melody discriminator discerns the melody variations presented by the generated samples. By contrast, the rhythm discriminator, enhanced with bar-level relative positional encoding, focuses on the velocity of generated notes. Such a design allows the generator to be more explicitly aware of which aspects should be adjusted in the generated music, making it easier to mimic human-composed",
    "path": "papers/24/08/2408.01696.json",
    "total_tokens": 334,
    "tldr": "该文章提出了一种使用精细化判别器的方法，能够提高生成音乐的质量，其中包含针对旋律和节奏的专门判别器，通过引入旋律判别器和节奏判别器，针对性地改善了生成音乐的旋律变化和节奏速度，实现了更高质量的符号音乐生成。"
}