{
    "title": "A Blockchain-based Reliable Federated Meta-learning for Metaverse: A Dual Game Framework",
    "abstract": "arXiv:2408.03694v1 Announce Type: cross  Abstract: The metaverse, envisioned as the next digital frontier for avatar-based virtual interaction, involves high-performance models. In this dynamic environment, users' tasks frequently shift, requiring fast model personalization despite limited data. This evolution consumes extensive resources and requires vast data volumes. To address this, meta-learning emerges as an invaluable tool for metaverse users, with federated meta-learning (FML), offering even more tailored solutions owing to its adaptive capabilities. However, the metaverse is characterized by users heterogeneity with diverse data structures, varied tasks, and uneven sample sizes, potentially undermining global training outcomes due to statistical difference. Given this, an urgent need arises for smart coalition formation that accounts for these disparities. This paper introduces a dual game-theoretic framework for metaverse services involving meta-learners as workers to manage ",
    "link": "https://arxiv.org/abs/2408.03694",
    "context": "Title: A Blockchain-based Reliable Federated Meta-learning for Metaverse: A Dual Game Framework\nAbstract: arXiv:2408.03694v1 Announce Type: cross  Abstract: The metaverse, envisioned as the next digital frontier for avatar-based virtual interaction, involves high-performance models. In this dynamic environment, users' tasks frequently shift, requiring fast model personalization despite limited data. This evolution consumes extensive resources and requires vast data volumes. To address this, meta-learning emerges as an invaluable tool for metaverse users, with federated meta-learning (FML), offering even more tailored solutions owing to its adaptive capabilities. However, the metaverse is characterized by users heterogeneity with diverse data structures, varied tasks, and uneven sample sizes, potentially undermining global training outcomes due to statistical difference. Given this, an urgent need arises for smart coalition formation that accounts for these disparities. This paper introduces a dual game-theoretic framework for metaverse services involving meta-learners as workers to manage ",
    "path": "papers/24/08/2408.03694.json",
    "total_tokens": 328,
    "tldr": "该文章提出了一种基于区块链的可靠联邦元学习方法，用于管理metaverse中的元学习者作为工人，通过双游戏理论框架来解决元学习者在元宇宙服务中的异质性问题。"
}