{
    "title": "Leveraging GNSS and Onboard Visual Data from Consumer Vehicles for Robust Road Network Estimation",
    "abstract": "arXiv:2408.01640v1 Announce Type: cross  Abstract: Maps are essential for diverse applications, such as vehicle navigation and autonomous robotics. Both require spatial models for effective route planning and localization. This paper addresses the challenge of road graph construction for autonomous vehicles. Despite recent advances, creating a road graph remains labor-intensive and has yet to achieve full automation. The goal of this paper is to generate such graphs automatically and accurately. Modern cars are equipped with onboard sensors used for today's advanced driver assistance systems like lane keeping. We propose using global navigation satellite system (GNSS) traces and basic image data acquired from these standard sensors in consumer vehicles to estimate road-level maps with minimal effort. We exploit the spatial information in the data by framing the problem as a road centerline semantic segmentation task using a convolutional neural network. We also utilize the data's time ",
    "link": "https://arxiv.org/abs/2408.01640",
    "context": "Title: Leveraging GNSS and Onboard Visual Data from Consumer Vehicles for Robust Road Network Estimation\nAbstract: arXiv:2408.01640v1 Announce Type: cross  Abstract: Maps are essential for diverse applications, such as vehicle navigation and autonomous robotics. Both require spatial models for effective route planning and localization. This paper addresses the challenge of road graph construction for autonomous vehicles. Despite recent advances, creating a road graph remains labor-intensive and has yet to achieve full automation. The goal of this paper is to generate such graphs automatically and accurately. Modern cars are equipped with onboard sensors used for today's advanced driver assistance systems like lane keeping. We propose using global navigation satellite system (GNSS) traces and basic image data acquired from these standard sensors in consumer vehicles to estimate road-level maps with minimal effort. We exploit the spatial information in the data by framing the problem as a road centerline semantic segmentation task using a convolutional neural network. We also utilize the data's time ",
    "path": "papers/24/08/2408.01640.json",
    "total_tokens": 703,
    "translated_title": "利用消费型车辆上GNSS和图像数据进行道路网络估计的创新方法",
    "translated_abstract": "arXiv:2408.01640v1 公告类型: 交叉 摘要: 地图对于诸如车辆导航和自动驾驶机器人等众多应用至关重要。这些应用都需要有效的路线规划和定位空间模型。本文解决了为自动驾驶车辆构建道路图的挑战。尽管最近取得了进步，但创建一个准确的道路图仍然需要大量的工作，并且还没有实现完全的自动化。本文的目标是通过使用全球导航卫星系统（GNSS）轨迹和从现代车辆上标准传感器获取的基本图像数据自动且准确地生成此类图。我们通过将问题框架为使用卷积神经网络的语义分割任务来实现这一点，并利用数据中的空间信息。我们还利用数据中的时间信息来解决出现的问题，并且通过预处理和后处理步骤来提高数据的质量。此外，提出了一种新的监督学习框架，它能够从少量标注数据中学习，并去噪数据以减少不相关的边缘和噪点。在车辆收集的数据集上进行的实验验证了所提出方法的有效性和实用性。并通过与现有方法的对比，说明了使用建议的方法可以大幅度减少数据收集和自动化道路图创建过程中的努力和成本。",
    "tldr": "本文提出了一种利用消费型车辆上的GNSS数据和摄像头图像进行道路图自动创建的方法，该方法不仅提高了创建道路图的准确性，还大大减少了所需的工作量和成本。"
}