{
    "title": "Enabling Intelligent Traffic Systems: A Deep Learning Method for Accurate Arabic License Plate Recognition",
    "abstract": "arXiv:2408.02904v1 Announce Type: new  Abstract: This paper introduces a novel two-stage framework for accurate Egyptian Vehicle License Plate Recognition (EVLPR). The first stage employs image processing techniques to reliably localize license plates, while the second stage utilizes a custom-designed deep learning model for robust Arabic character recognition. The proposed system achieves a remarkable 99.3% accuracy on a diverse dataset, surpassing existing approaches. Its potential applications extend to intelligent traffic management, including traffic violation detection and parking optimization. Future research will focus on enhancing the system's capabilities through architectural refinements, expanded datasets, and addressing system dependencies.",
    "link": "https://arxiv.org/abs/2408.02904",
    "context": "Title: Enabling Intelligent Traffic Systems: A Deep Learning Method for Accurate Arabic License Plate Recognition\nAbstract: arXiv:2408.02904v1 Announce Type: new  Abstract: This paper introduces a novel two-stage framework for accurate Egyptian Vehicle License Plate Recognition (EVLPR). The first stage employs image processing techniques to reliably localize license plates, while the second stage utilizes a custom-designed deep learning model for robust Arabic character recognition. The proposed system achieves a remarkable 99.3% accuracy on a diverse dataset, surpassing existing approaches. Its potential applications extend to intelligent traffic management, including traffic violation detection and parking optimization. Future research will focus on enhancing the system's capabilities through architectural refinements, expanded datasets, and addressing system dependencies.",
    "path": "papers/24/08/2408.02904.json",
    "total_tokens": 330,
    "tldr": "该文章提出了一种新颖的两阶段框架，用于准确识别埃及车辆牌照上的阿拉伯文字。该框架首先通过图像处理技术可靠地定位牌照，然后使用定制设计的深度学习模型进行阿拉伯字符识别。该系统在多样化数据集上取得了99.3%的准确率，超过现有方法。其潜在应用包括智能交通管理，如交通违规检测和停车场优化。未来研究将进一步通过架构改进、扩大数据集和解决系统依赖问题来增强系统的性能。"
}