{
    "title": "Anomaly Prediction: A Novel Approach with Explicit Delay and Horizon",
    "abstract": "arXiv:2408.04377v1 Announce Type: cross  Abstract: Detecting anomalies in time series data is a critical challenge across various domains. Traditional methods typically focus on identifying anomalies in immediate subsequent steps, often underestimating the significance of temporal dynamics such as delay time and horizons of anomalies, which generally require extensive post-analysis. This paper introduces a novel approach for time series anomaly prediction, incorporating temporal information directly into the prediction results. We propose a new dataset specifically designed to evaluate this approach and conduct comprehensive experiments using several state-of-the-art methods. results demonstrate the efficacy of our approach in providing timely and accurate anomaly predictions, setting a new benchmark for future research in this field.",
    "link": "https://arxiv.org/abs/2408.04377",
    "context": "Title: Anomaly Prediction: A Novel Approach with Explicit Delay and Horizon\nAbstract: arXiv:2408.04377v1 Announce Type: cross  Abstract: Detecting anomalies in time series data is a critical challenge across various domains. Traditional methods typically focus on identifying anomalies in immediate subsequent steps, often underestimating the significance of temporal dynamics such as delay time and horizons of anomalies, which generally require extensive post-analysis. This paper introduces a novel approach for time series anomaly prediction, incorporating temporal information directly into the prediction results. We propose a new dataset specifically designed to evaluate this approach and conduct comprehensive experiments using several state-of-the-art methods. results demonstrate the efficacy of our approach in providing timely and accurate anomaly predictions, setting a new benchmark for future research in this field.",
    "path": "papers/24/08/2408.04377.json",
    "total_tokens": 280,
    "tldr": "该文章提出了一种针对时间序列异常预测的全新方法，该方法能够在预测结果中直接融入延迟时间和异常持续期的信息，从而提高了异常预测的及时性和准确性，并为未来的研究设定了新的标准。"
}