{
    "title": "OpenLogParser: Unsupervised Parsing with Open-Source Large Language Models",
    "abstract": "arXiv:2408.01585v1 Announce Type: cross  Abstract: Log parsing is a critical step that transforms unstructured log data into structured formats, facilitating subsequent log-based analysis. Traditional syntax-based log parsers are efficient and effective, but they often experience decreased accuracy when processing logs that deviate from the predefined rules. Recently, large language models (LLM) based log parsers have shown superior parsing accuracy. However, existing LLM-based parsers face three main challenges: 1)time-consuming and labor-intensive manual labeling for fine-tuning or in-context learning, 2)increased parsing costs due to the vast volume of log data and limited context size of LLMs, and 3)privacy risks from using commercial models like ChatGPT with sensitive log information. To overcome these limitations, this paper introduces OpenLogParser, an unsupervised log parsing approach that leverages open-source LLMs (i.e., Llama3-8B) to enhance privacy and reduce operational co",
    "link": "https://arxiv.org/abs/2408.01585",
    "context": "Title: OpenLogParser: Unsupervised Parsing with Open-Source Large Language Models\nAbstract: arXiv:2408.01585v1 Announce Type: cross  Abstract: Log parsing is a critical step that transforms unstructured log data into structured formats, facilitating subsequent log-based analysis. Traditional syntax-based log parsers are efficient and effective, but they often experience decreased accuracy when processing logs that deviate from the predefined rules. Recently, large language models (LLM) based log parsers have shown superior parsing accuracy. However, existing LLM-based parsers face three main challenges: 1)time-consuming and labor-intensive manual labeling for fine-tuning or in-context learning, 2)increased parsing costs due to the vast volume of log data and limited context size of LLMs, and 3)privacy risks from using commercial models like ChatGPT with sensitive log information. To overcome these limitations, this paper introduces OpenLogParser, an unsupervised log parsing approach that leverages open-source LLMs (i.e., Llama3-8B) to enhance privacy and reduce operational co",
    "path": "papers/24/08/2408.01585.json",
    "total_tokens": 405,
    "tldr": "该文章介绍了一种称为OpenLogParser的无监督日志解析方法，该方法利用开源的大语言模型（LLMs）来提高隐私保护并降低运营成本。该方法通过对开源LLMs的训练，无需人工标注，即可实现精确的日志数据结构化处理，适用于各种非结构化日志数据的解析，尤其是那些不遵循预设语法规则的数据。这种方法的提出旨在解决现有基于LLM的日志解析器面临的时间效率低、成本高昂和隐私泄露问题。"
}