{
    "title": "Modelling Visual Semantics via Image Captioning to extract Enhanced Multi-Level Cross-Modal Semantic Incongruity Representation with Attention for Multimodal Sarcasm Detection",
    "abstract": "arXiv:2408.02595v1 Announce Type: new  Abstract: Sarcasm is a type of irony, characterized by an inherent mismatch between the literal interpretation and the intended connotation. Though sarcasm detection in text has been extensively studied, there are situations in which textual input alone might be insufficient to perceive sarcasm. The inclusion of additional contextual cues, such as images, is essential to recognize sarcasm in social media data effectively. This study presents a novel framework for multimodal sarcasm detection that can process input triplets. Two components of these triplets comprise the input text and its associated image, as provided in the datasets. Additionally, a supplementary modality is introduced in the form of descriptive image captions. The motivation behind incorporating this visual semantic representation is to more accurately capture the discrepancies between the textual and visual content, which are fundamental to the sarcasm detection task. The primar",
    "link": "https://arxiv.org/abs/2408.02595",
    "context": "Title: Modelling Visual Semantics via Image Captioning to extract Enhanced Multi-Level Cross-Modal Semantic Incongruity Representation with Attention for Multimodal Sarcasm Detection\nAbstract: arXiv:2408.02595v1 Announce Type: new  Abstract: Sarcasm is a type of irony, characterized by an inherent mismatch between the literal interpretation and the intended connotation. Though sarcasm detection in text has been extensively studied, there are situations in which textual input alone might be insufficient to perceive sarcasm. The inclusion of additional contextual cues, such as images, is essential to recognize sarcasm in social media data effectively. This study presents a novel framework for multimodal sarcasm detection that can process input triplets. Two components of these triplets comprise the input text and its associated image, as provided in the datasets. Additionally, a supplementary modality is introduced in the form of descriptive image captions. The motivation behind incorporating this visual semantic representation is to more accurately capture the discrepancies between the textual and visual content, which are fundamental to the sarcasm detection task. The primar",
    "path": "papers/24/08/2408.02595.json",
    "total_tokens": 743,
    "translated_title": "利用图文描述提取多模态讽刺检测中增强的多层级跨模态语义不匹配表示法，通过注意力机制进行视觉语义建模",
    "translated_abstract": "arXiv:2408.02595v1 公告类型：新  摘要：讽刺是一种讽刺，以其固有的字面解读与意图内涵之间的差异为特征。尽管文本讽刺检测已经受到了广泛的探讨，但在一些情况下，仅凭文本输入可能不足以解读讽刺。为了在社交媒体数据中有效地识别讽刺，必须包含额外的情境线索，如图片。本研究提出了一个用于多模态讽刺检测的全新框架，它能够处理输入三元组。这些三元组中的两个组成元素是输入文本及其关联的图片，如数据集中所提供。此外，还引入了一种补充模态，即描述性的图片描述。引入这种视觉语义表示的动机是为了更准确地捕获文本与视觉内容之间的分歧，这对于讽刺检测任务来说是根本的。该研究的主要挑战在于如何更加敏感地捕捉图文之间的语义不匹配，以及如何通过引人注意机制来增强文本模块的表达能力。通过在Facebook和Instagram上分享的图片和图文帖子中加入描述性图片描述，该系统展示了如何通过多层级语义表示来捕捉讽刺的语义不匹配，并提出了一种有效的方法来检测其中的讽刺。",
    "tldr": "本文提出了一种新框架来检测多模态讽刺，该框架利用图文描述来捕捉和检测讽刺，并提高了模型处理图文不匹配的能力。"
}