{
    "title": "Deep Learning Meets OBIA: Tasks, Challenges, Strategies, and Perspectives",
    "abstract": "arXiv:2408.01607v1 Announce Type: new  Abstract: Deep learning has gained significant attention in remote sensing, especially in pixel- or patch-level applications. Despite initial attempts to integrate deep learning into object-based image analysis (OBIA), its full potential remains largely unexplored. In this article, as OBIA usage becomes more widespread, we conducted a comprehensive review and expansion of its task subdomains, with or without the integration of deep learning. Furthermore, we have identified and summarized five prevailing strategies to address the challenge of deep learning's limitations in directly processing unstructured object data within OBIA, and this review also recommends some important future research directions. Our goal with these endeavors is to inspire more exploration in this fascinating yet overlooked area and facilitate the integration of deep learning into OBIA processing workflows.",
    "link": "https://arxiv.org/abs/2408.01607",
    "context": "Title: Deep Learning Meets OBIA: Tasks, Challenges, Strategies, and Perspectives\nAbstract: arXiv:2408.01607v1 Announce Type: new  Abstract: Deep learning has gained significant attention in remote sensing, especially in pixel- or patch-level applications. Despite initial attempts to integrate deep learning into object-based image analysis (OBIA), its full potential remains largely unexplored. In this article, as OBIA usage becomes more widespread, we conducted a comprehensive review and expansion of its task subdomains, with or without the integration of deep learning. Furthermore, we have identified and summarized five prevailing strategies to address the challenge of deep learning's limitations in directly processing unstructured object data within OBIA, and this review also recommends some important future research directions. Our goal with these endeavors is to inspire more exploration in this fascinating yet overlooked area and facilitate the integration of deep learning into OBIA processing workflows.",
    "path": "papers/24/08/2408.01607.json",
    "total_tokens": 315,
    "tldr": "该文章全面回顾和扩展了在对象级图像分析（OBIA）中集成深度学习的任务领域，并识别了五种策略来应对该挑战，同时提出了未来研究方向，旨在促进深度学习在OBIA中的应用。"
}