{
    "title": "Automatic rating of incomplete hippocampal inversions evaluated across multiple cohorts",
    "abstract": "arXiv:2408.02496v1 Announce Type: cross  Abstract: Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal malrotation, is an atypical anatomical pattern of the hippocampus found in about 20% of the general population. IHI can be visually assessed on coronal slices of T1 weighted MR images, using a composite score that combines four anatomical criteria. IHI has been associated with several brain disorders (epilepsy, schizophrenia). However, these studies were based on small samples. Furthermore, the factors (genetic or environmental) that contribute to the genesis of IHI are largely unknown. Large-scale studies are thus needed to further understand IHI and their potential relationships to neurological and psychiatric disorders. However, visual evaluation is long and tedious, justifying the need for an automatic method. In this paper, we propose, for the first time, to automatically rate IHI. We proceed by predicting four anatomical criteria, which are then summed up to for",
    "link": "https://arxiv.org/abs/2408.02496",
    "context": "Title: Automatic rating of incomplete hippocampal inversions evaluated across multiple cohorts\nAbstract: arXiv:2408.02496v1 Announce Type: cross  Abstract: Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal malrotation, is an atypical anatomical pattern of the hippocampus found in about 20% of the general population. IHI can be visually assessed on coronal slices of T1 weighted MR images, using a composite score that combines four anatomical criteria. IHI has been associated with several brain disorders (epilepsy, schizophrenia). However, these studies were based on small samples. Furthermore, the factors (genetic or environmental) that contribute to the genesis of IHI are largely unknown. Large-scale studies are thus needed to further understand IHI and their potential relationships to neurological and psychiatric disorders. However, visual evaluation is long and tedious, justifying the need for an automatic method. In this paper, we propose, for the first time, to automatically rate IHI. We proceed by predicting four anatomical criteria, which are then summed up to for",
    "path": "papers/24/08/2408.02496.json",
    "total_tokens": 947,
    "translated_title": "自动评估多个队列中的不完全海马反转评分",
    "translated_abstract": "arXiv:2408.02496v1 公告类型：交叉  摘要：在大约20%的普通人群中，不完全的海马反转（IHI），有时被称为海马旋转异常，是在T1加权磁共振图像的冠状切片上能够视觉评估的一种解剖模式。IHI与几种脑病（癫痫，精神分裂症）有关。然而，这些研究是基于较小样本进行的。此外，导致IHI产生的因素（遗传或环境因素）仍然知之甚少。因此，需要进行大规模研究，以进一步了解IHI以及它们与神经和精神疾病之间的关系。然而，视觉评估耗时且繁琐，因此需要开发一种自动方法。在本文中，我们提出了首次自动评级IHI的方法。我们通过预测四个解剖学标准来完成这项任务，然后将它们相加以获得一个综合评分。尽管研究的队列很大，但与之前的单队列研究相比，使用跨多个队列的验证数据进行评估的方法准确度可能较低。挑战在于克服模型对不同队列中特征空间的差异的敏感性。为了解决这一问题，我们提出了将不同队列的数据融合在一起进行训练，并在单独的队列上进行验证和测试的策略。我们的实验结果表明，将来自多个队列的数据统一后训练的模型是有希望的，可以在不同队列中保持较高的评分准确性。此外，使用自动评分系统代替手动评分，可以显著提高评估的速度和可行性，这对于大规模研究和临床应用具有重要意义。",
    "tldr": "本文首次提出了自动评级不完全海马反转（IHI）的方法，该方法通过预测四个解剖学标准并将它们相加获得综合评分。尽管如此，研究中的挑战是如何克服模型对不同队列中特征空间的差异的敏感性。为此，作者提出了将不同队列的数据统一后进行训练，并在单独的队列上进行验证和测试的策略。实验结果表明，这种方法在保持较高评分准确性的同时，也加快了评估的速度和可行性，对于大规模研究和临床应用具有重要意义。"
}