{
    "title": "AgentPeerTalk: Empowering Students through Agentic-AI-Driven Discernment of Bullying and Joking in Peer Interactions in Schools",
    "abstract": "arXiv:2408.01459v1 Announce Type: cross  Abstract: Addressing school bullying effectively and promptly is crucial for the mental health of students. This study examined the potential of large language models (LLMs) to empower students by discerning between bullying and joking in school peer interactions. We employed ChatGPT-4, Gemini 1.5 Pro, and Claude 3 Opus, evaluating their effectiveness through human review. Our results revealed that not all LLMs were suitable for an agentic approach, with ChatGPT-4 showing the most promise. We observed variations in LLM outputs, possibly influenced by political overcorrectness, context window limitations, and pre-existing bias in their training data. ChatGPT-4 excelled in context-specific accuracy after implementing the agentic approach, highlighting its potential to provide continuous, real-time support to vulnerable students. This study underlines the significant social impact of using agentic AI in educational settings, offering a new avenue f",
    "link": "https://arxiv.org/abs/2408.01459",
    "context": "Title: AgentPeerTalk: Empowering Students through Agentic-AI-Driven Discernment of Bullying and Joking in Peer Interactions in Schools\nAbstract: arXiv:2408.01459v1 Announce Type: cross  Abstract: Addressing school bullying effectively and promptly is crucial for the mental health of students. This study examined the potential of large language models (LLMs) to empower students by discerning between bullying and joking in school peer interactions. We employed ChatGPT-4, Gemini 1.5 Pro, and Claude 3 Opus, evaluating their effectiveness through human review. Our results revealed that not all LLMs were suitable for an agentic approach, with ChatGPT-4 showing the most promise. We observed variations in LLM outputs, possibly influenced by political overcorrectness, context window limitations, and pre-existing bias in their training data. ChatGPT-4 excelled in context-specific accuracy after implementing the agentic approach, highlighting its potential to provide continuous, real-time support to vulnerable students. This study underlines the significant social impact of using agentic AI in educational settings, offering a new avenue f",
    "path": "papers/24/08/2408.01459.json",
    "total_tokens": 677,
    "translated_title": "AgentPeerTalk：通过带有代理AI的辨别能力增强学校学生对抗校园欺凌和玩笑的能力",
    "translated_abstract": "本研究探讨了大型语言模型(LLM)在辨别学校中同伴互动中的欺凌与玩笑方面的潜力，旨在为学生的心理健康提供有效和及时的防护。我们使用了ChatGPT-4、Gemini 1.5 Pro和Claude 3 Opus，并经过人工审查评估了它们的功效。结果显示，并不是所有的LLM都适合采用代理式方法。ChatGPT-4在这方面的表现最为突出。我们注意到不同LLM输出的差异，这可能受到了政治上的过度纠正、上下文窗口限制和训练数据的预先偏见的影响。在实施了代理式方法后，ChatGPT-4在特定情境下的准确率有了显著提升，凸显了它能为易受伤害的学生提供持续、实时支持的能力。本研究强调，在教育环境中使用代理AI技术的重要性，并为该领域开辟了一条新的发展道路。",
    "tldr": "该研究通过使用ChatGPT-4等大型语言模型，发现代理式AI技术可能有助于辨别校园欺凌与玩笑，为学生的心理安全提供有效支持。"
}