{
    "title": "AssemAI: Interpretable Image-Based Anomaly Detection for Manufacturing Pipelines",
    "abstract": "arXiv:2408.02181v1 Announce Type: new  Abstract: Anomaly detection in manufacturing pipelines remains a critical challenge, intensified by the complexity and variability of industrial environments. This paper introduces AssemAI, an interpretable image-based anomaly detection system tailored for smart manufacturing pipelines. Our primary contributions include the creation of a tailored image dataset and the development of a custom object detection model, YOLO-FF, designed explicitly for anomaly detection in manufacturing assembly environments. Utilizing the preprocessed image dataset derived from an industry-focused rocket assembly pipeline, we address the challenge of imbalanced image data and demonstrate the importance of image-based methods in anomaly detection. The proposed approach leverages domain knowledge in data preparation, model development and reasoning. We compare our method against several baselines, including simple CNN and custom Visual Transformer (ViT) models, showcasi",
    "link": "https://arxiv.org/abs/2408.02181",
    "context": "Title: AssemAI: Interpretable Image-Based Anomaly Detection for Manufacturing Pipelines\nAbstract: arXiv:2408.02181v1 Announce Type: new  Abstract: Anomaly detection in manufacturing pipelines remains a critical challenge, intensified by the complexity and variability of industrial environments. This paper introduces AssemAI, an interpretable image-based anomaly detection system tailored for smart manufacturing pipelines. Our primary contributions include the creation of a tailored image dataset and the development of a custom object detection model, YOLO-FF, designed explicitly for anomaly detection in manufacturing assembly environments. Utilizing the preprocessed image dataset derived from an industry-focused rocket assembly pipeline, we address the challenge of imbalanced image data and demonstrate the importance of image-based methods in anomaly detection. The proposed approach leverages domain knowledge in data preparation, model development and reasoning. We compare our method against several baselines, including simple CNN and custom Visual Transformer (ViT) models, showcasi",
    "path": "papers/24/08/2408.02181.json",
    "total_tokens": 371,
    "tldr": "该文章提出了AssemAI，一个用于智能制造管道的可解释图像基础异常检测系统。系统成功创建了针对工业火箭组装管道的特定图像数据集，并开发了自定义目标检测模型YOLO-FF，专门用于制造业组装环境的异常检测。通过处理数据集的不平衡性和使用深度学习模型，文章展示了图像方法在异常检测中的重要性，并展示了其在对抗简单CNN方法和自定义Visual Transformer模型的效果，进一步证明了该系统的有效性和专业性。"
}