{
    "title": "Intuitionistic Fuzzy Cognitive Maps for Interpretable Image Classification",
    "abstract": "arXiv:2408.03745v1 Announce Type: new  Abstract: The interpretability of machine learning models is critical, as users may be reluctant to rely on their inferences. Intuitionistic FCMs (iFCMs) have been proposed as an extension of FCMs offering a natural mechanism to assess the quality of their output through the estimation of hesitancy, a concept resembling to human hesitation in decision making. To address the challenge of interpretable image classification, this paper introduces a novel framework, named Interpretable Intuitionistic FCM (I2FCM) which is domain-independent, simple to implement, and can be applied on Convolutional Neural Network (CNN) models, rendering them interpretable. To the best of our knowledge this is the first time iFCMs are applied for image classification. Further novel contributions include: a feature extraction process focusing on the most informative image regions; a learning algorithm for data-driven determination of the intuitionistic fuzzy interconnecti",
    "link": "https://arxiv.org/abs/2408.03745",
    "context": "Title: Intuitionistic Fuzzy Cognitive Maps for Interpretable Image Classification\nAbstract: arXiv:2408.03745v1 Announce Type: new  Abstract: The interpretability of machine learning models is critical, as users may be reluctant to rely on their inferences. Intuitionistic FCMs (iFCMs) have been proposed as an extension of FCMs offering a natural mechanism to assess the quality of their output through the estimation of hesitancy, a concept resembling to human hesitation in decision making. To address the challenge of interpretable image classification, this paper introduces a novel framework, named Interpretable Intuitionistic FCM (I2FCM) which is domain-independent, simple to implement, and can be applied on Convolutional Neural Network (CNN) models, rendering them interpretable. To the best of our knowledge this is the first time iFCMs are applied for image classification. Further novel contributions include: a feature extraction process focusing on the most informative image regions; a learning algorithm for data-driven determination of the intuitionistic fuzzy interconnecti",
    "path": "papers/24/08/2408.03745.json",
    "total_tokens": 381,
    "tldr": "该文章提出了一个基于直觉模糊认知地图（iFCM）的图像分类框架，该框架能够为深度学习模型提供可解释性。这种方法使得用户能够理解模型决策背后的逻辑，从而在使用时更加放心。通过将直觉模糊认知地图应用于图像分类任务，该研究可能在模糊系统在图像处理领域的应用方面实现了重要创新，提升了机器学习模型在复杂决策场景中的实际应用价值。"
}