{
    "title": "LDFaceNet: Latent Diffusion-based Network for High-Fidelity Deepfake Generation",
    "abstract": "arXiv:2408.02078v1 Announce Type: new  Abstract: Over the past decade, there has been tremendous progress in the domain of synthetic media generation. This is mainly due to the powerful methods based on generative adversarial networks (GANs). Very recently, diffusion probabilistic models, which are inspired by non-equilibrium thermodynamics, have taken the spotlight. In the realm of image generation, diffusion models (DMs) have exhibited remarkable proficiency in producing both realistic and heterogeneous imagery through their stochastic sampling procedure. This paper proposes a novel facial swapping module, termed as LDFaceNet (Latent Diffusion based Face Swapping Network), which is based on a guided latent diffusion model that utilizes facial segmentation and facial recognition modules for a conditioned denoising process. The model employs a unique loss function to offer directional guidance to the diffusion process. Notably, LDFaceNet can incorporate supplementary facial guidance fo",
    "link": "https://arxiv.org/abs/2408.02078",
    "context": "Title: LDFaceNet: Latent Diffusion-based Network for High-Fidelity Deepfake Generation\nAbstract: arXiv:2408.02078v1 Announce Type: new  Abstract: Over the past decade, there has been tremendous progress in the domain of synthetic media generation. This is mainly due to the powerful methods based on generative adversarial networks (GANs). Very recently, diffusion probabilistic models, which are inspired by non-equilibrium thermodynamics, have taken the spotlight. In the realm of image generation, diffusion models (DMs) have exhibited remarkable proficiency in producing both realistic and heterogeneous imagery through their stochastic sampling procedure. This paper proposes a novel facial swapping module, termed as LDFaceNet (Latent Diffusion based Face Swapping Network), which is based on a guided latent diffusion model that utilizes facial segmentation and facial recognition modules for a conditioned denoising process. The model employs a unique loss function to offer directional guidance to the diffusion process. Notably, LDFaceNet can incorporate supplementary facial guidance fo",
    "path": "papers/24/08/2408.02078.json",
    "total_tokens": 338,
    "tldr": "该文章提出了一种名为LDFaceNet的基于潜伏扩散模型的脸部替换模块，它能够通过使用面部分割和面部识别模块进行条件去噪过程，并在扩散过程中利用独特的损失函数提供方向性引导，显著提高了深度伪造生成的高保真度。"
}