{
    "title": "ParkingE2E: Camera-based End-to-end Parking Network, from Images to Planning",
    "abstract": "arXiv:2408.02061v1 Announce Type: cross  Abstract: Autonomous parking is a crucial task in the intelligent driving field. Traditional parking algorithms are usually implemented using rule-based schemes. However, these methods are less effective in complex parking scenarios due to the intricate design of the algorithms. In contrast, neural-network-based methods tend to be more intuitive and versatile than the rule-based methods. By collecting a large number of expert parking trajectory data and emulating human strategy via learning-based methods, the parking task can be effectively addressed. In this paper, we employ imitation learning to perform end-to-end planning from RGB images to path planning by imitating human driving trajectories. The proposed end-to-end approach utilizes a target query encoder to fuse images and target features, and a transformer-based decoder to autoregressively predict future waypoints. We conducted extensive experiments in real-world scenarios, and the resul",
    "link": "https://arxiv.org/abs/2408.02061",
    "context": "Title: ParkingE2E: Camera-based End-to-end Parking Network, from Images to Planning\nAbstract: arXiv:2408.02061v1 Announce Type: cross  Abstract: Autonomous parking is a crucial task in the intelligent driving field. Traditional parking algorithms are usually implemented using rule-based schemes. However, these methods are less effective in complex parking scenarios due to the intricate design of the algorithms. In contrast, neural-network-based methods tend to be more intuitive and versatile than the rule-based methods. By collecting a large number of expert parking trajectory data and emulating human strategy via learning-based methods, the parking task can be effectively addressed. In this paper, we employ imitation learning to perform end-to-end planning from RGB images to path planning by imitating human driving trajectories. The proposed end-to-end approach utilizes a target query encoder to fuse images and target features, and a transformer-based decoder to autoregressively predict future waypoints. We conducted extensive experiments in real-world scenarios, and the resul",
    "path": "papers/24/08/2408.02061.json",
    "total_tokens": 641,
    "translated_title": "停车场网络：相机为基础的端到端泊车，从图像到规划",
    "translated_abstract": "arXiv:2408.02061v1 宣布类型：交叉 摘要：自动驾驶泊车是智能驾驶领域的一个关键任务。传统的泊车算法通常基于规则设计。然而，由于算法设计的复杂性，这些方法在复杂的停车场景中不太有效。相比之下，基于神经网络的方",
    "tldr": "通过模仿学习，本文提出了一个端到端的方法，能够从图像中直接规划出停车路径，该方法在真实世界中展现出良好的适用性和性能。",
    "en_tdlr": "This paper presents an end-to-end method for direct path planning from images to parking, utilizing imitation learning, outperforming traditional methods in real-world scenarios."
}