{
    "title": "TGS: Trajectory Generation and Selection using Vision Language Models in Mapless Outdoor Environments",
    "abstract": "arXiv:2408.02454v1 Announce Type: new  Abstract: We present a multi-modal trajectory generation and selection algorithm for real-world mapless outdoor navigation in challenging scenarios with unstructured off-road features like buildings, grass, and curbs. Our goal is to compute suitable trajectories that (1) satisfy the environment-specific traversability constraints and (2) match human-like paths while navigating in crosswalks, sidewalks, etc. Our formulation uses a Conditional Variational Autoencoder (CVAE) generative model enhanced with traversability constraints to generate multiple candidate trajectories for global navigation. We use VLMs and a visual prompting approach with their zero-shot ability of semantic understanding and logical reasoning to choose the best trajectory given the contextual information about the task. We evaluate our methods in various outdoor scenes with wheeled robots and compare the performance with other global navigation algorithms. In practice, we obse",
    "link": "https://arxiv.org/abs/2408.02454",
    "context": "Title: TGS: Trajectory Generation and Selection using Vision Language Models in Mapless Outdoor Environments\nAbstract: arXiv:2408.02454v1 Announce Type: new  Abstract: We present a multi-modal trajectory generation and selection algorithm for real-world mapless outdoor navigation in challenging scenarios with unstructured off-road features like buildings, grass, and curbs. Our goal is to compute suitable trajectories that (1) satisfy the environment-specific traversability constraints and (2) match human-like paths while navigating in crosswalks, sidewalks, etc. Our formulation uses a Conditional Variational Autoencoder (CVAE) generative model enhanced with traversability constraints to generate multiple candidate trajectories for global navigation. We use VLMs and a visual prompting approach with their zero-shot ability of semantic understanding and logical reasoning to choose the best trajectory given the contextual information about the task. We evaluate our methods in various outdoor scenes with wheeled robots and compare the performance with other global navigation algorithms. In practice, we obse",
    "path": "papers/24/08/2408.02454.json",
    "total_tokens": 384,
    "tldr": "该文章提出了一种使用视觉语言模型（VLMs）的轨迹生成与选择方法，能够在无地图的户外环境中处理复杂的导航任务，确保路径既满足特定环境的可通行性约束又能符合人类的路径偏好。文章通过条件变分自编码器（CVAE）模型生成多条候选轨迹，并通过视觉提示和VLMs的零射能力进行路径的选择，以适配任务的上下文信息。实验结果表明，该方法在真实环境下的表现优于传统全局导航算法。"
}