{
    "title": "ParkingE2E: Camera-based End-to-end Parking Network, from Images to Planning",
    "abstract": "arXiv:2408.02061v1 Announce Type: cross  Abstract: Autonomous parking is a crucial task in the intelligent driving field. Traditional parking algorithms are usually implemented using rule-based schemes. However, these methods are less effective in complex parking scenarios due to the intricate design of the algorithms. In contrast, neural-network-based methods tend to be more intuitive and versatile than the rule-based methods. By collecting a large number of expert parking trajectory data and emulating human strategy via learning-based methods, the parking task can be effectively addressed. In this paper, we employ imitation learning to perform end-to-end planning from RGB images to path planning by imitating human driving trajectories. The proposed end-to-end approach utilizes a target query encoder to fuse images and target features, and a transformer-based decoder to autoregressively predict future waypoints. We conducted extensive experiments in real-world scenarios, and the resul",
    "link": "https://arxiv.org/abs/2408.02061",
    "context": "Title: ParkingE2E: Camera-based End-to-end Parking Network, from Images to Planning\nAbstract: arXiv:2408.02061v1 Announce Type: cross  Abstract: Autonomous parking is a crucial task in the intelligent driving field. Traditional parking algorithms are usually implemented using rule-based schemes. However, these methods are less effective in complex parking scenarios due to the intricate design of the algorithms. In contrast, neural-network-based methods tend to be more intuitive and versatile than the rule-based methods. By collecting a large number of expert parking trajectory data and emulating human strategy via learning-based methods, the parking task can be effectively addressed. In this paper, we employ imitation learning to perform end-to-end planning from RGB images to path planning by imitating human driving trajectories. The proposed end-to-end approach utilizes a target query encoder to fuse images and target features, and a transformer-based decoder to autoregressively predict future waypoints. We conducted extensive experiments in real-world scenarios, and the resul",
    "path": "papers/24/08/2408.02061.json",
    "total_tokens": 362,
    "tldr": "该文章提出了一种基于图像的停车场全程规划系统（ParkingE2E），通过模仿人类驾驶策略，实现了从图像到路径规划的端到端自动化设计。利用深度学习技术，该系统能够以更高的效率和更加灵活的方式完成复杂停车场景下的任务，为智能驾驶车辆的自主泊车提供了一种新的技术方案。"
}