{
    "title": "Mixture-of-Noises Enhanced Forgery-Aware Predictor for Multi-Face Manipulation Detection and Localization",
    "abstract": "arXiv:2408.02306v1 Announce Type: new  Abstract: With the advancement of face manipulation technology, forgery images in multi-face scenarios are gradually becoming a more complex and realistic challenge. Despite this, detection and localization methods for such multi-face manipulations remain underdeveloped. Traditional manipulation localization methods either indirectly derive detection results from localization masks, resulting in limited detection performance, or employ a naive two-branch structure to simultaneously obtain detection and localization results, which cannot effectively benefit the localization capability due to limited interaction between two tasks. This paper proposes a new framework, namely MoNFAP, specifically tailored for multi-face manipulation detection and localization. The MoNFAP primarily introduces two novel modules: the Forgery-aware Unified Predictor (FUP) Module and the Mixture-of-Noises Module (MNM). The FUP integrates detection and localization tasks us",
    "link": "https://arxiv.org/abs/2408.02306",
    "context": "Title: Mixture-of-Noises Enhanced Forgery-Aware Predictor for Multi-Face Manipulation Detection and Localization\nAbstract: arXiv:2408.02306v1 Announce Type: new  Abstract: With the advancement of face manipulation technology, forgery images in multi-face scenarios are gradually becoming a more complex and realistic challenge. Despite this, detection and localization methods for such multi-face manipulations remain underdeveloped. Traditional manipulation localization methods either indirectly derive detection results from localization masks, resulting in limited detection performance, or employ a naive two-branch structure to simultaneously obtain detection and localization results, which cannot effectively benefit the localization capability due to limited interaction between two tasks. This paper proposes a new framework, namely MoNFAP, specifically tailored for multi-face manipulation detection and localization. The MoNFAP primarily introduces two novel modules: the Forgery-aware Unified Predictor (FUP) Module and the Mixture-of-Noises Module (MNM). The FUP integrates detection and localization tasks us",
    "path": "papers/24/08/2408.02306.json",
    "total_tokens": 635,
    "translated_title": "通过噪声混合增强的伪造意识预测器用于多脸操纵检测和定位",
    "translated_abstract": "随着人脸操纵技术的发展，多脸场景中的伪造图像逐渐成为一个更复杂、更具现实挑战的问题。尽管如此，针对这类多脸操纵的检测和定位方法仍然发展不足。传统的手动定位方法要么间接从定位掩膜中推导出检测结果，从而导致检测性能有限，要么采用一个简单的两分支结构同时获得检测和定位结果，由于两个任务之间没有有效的互动，这不能有效地提高定位能力。本研究提出了一种新框架，即MoNFAP，专门用于多脸操纵的检测和定位。MoNFAP主要引入了两项新的模块：伪造意识统一预测（FUP）模块和噪声混合模块（MNM）。FUP模块将检测和定位任务整合在一起使用。MNM模块通过提取噪声特征来增强预测器的性能。",
    "tldr": "本研究提出了一种名为MoNFAP的新框架，该框架通过集成伪造意识统一预测和噪声混合模块增强了多脸操纵检测和定位的性能。",
    "en_tdlr": "This study introduces a new framework called MoNFAP that enhances the performance of multi-face manipulation detection and localization through the integration of a Forgery-aware Unified Predictor and Mixture-of-Noises Module."
}