{
    "title": "ChipExpert: The Open-Source Integrated-Circuit-Design-Specific Large Language Model",
    "abstract": "arXiv:2408.00804v1 Announce Type: cross  Abstract: The field of integrated circuit (IC) design is highly specialized, presenting significant barriers to entry and research and development challenges. Although large language models (LLMs) have achieved remarkable success in various domains, existing LLMs often fail to meet the specific needs of students, engineers, and researchers. Consequently, the potential of LLMs in the IC design domain remains largely unexplored. To address these issues, we introduce ChipExpert, the first open-source, instructional LLM specifically tailored for the IC design field. ChipExpert is trained on one of the current best open-source base model (Llama-3 8B). The entire training process encompasses several key stages, including data preparation, continue pre-training, instruction-guided supervised fine-tuning, preference alignment, and evaluation. In the data preparation stage, we construct multiple high-quality custom datasets through manual selection and d",
    "link": "https://arxiv.org/abs/2408.00804",
    "context": "Title: ChipExpert: The Open-Source Integrated-Circuit-Design-Specific Large Language Model\nAbstract: arXiv:2408.00804v1 Announce Type: cross  Abstract: The field of integrated circuit (IC) design is highly specialized, presenting significant barriers to entry and research and development challenges. Although large language models (LLMs) have achieved remarkable success in various domains, existing LLMs often fail to meet the specific needs of students, engineers, and researchers. Consequently, the potential of LLMs in the IC design domain remains largely unexplored. To address these issues, we introduce ChipExpert, the first open-source, instructional LLM specifically tailored for the IC design field. ChipExpert is trained on one of the current best open-source base model (Llama-3 8B). The entire training process encompasses several key stages, including data preparation, continue pre-training, instruction-guided supervised fine-tuning, preference alignment, and evaluation. In the data preparation stage, we construct multiple high-quality custom datasets through manual selection and d",
    "path": "papers/24/08/2408.00804.json",
    "total_tokens": 787,
    "translated_title": "ChipExpert：开放源代码的集成电路设计专用大型语言模型",
    "translated_abstract": "arXiv:2408.00804v1 宣布类型：交叉  摘要：集成电路（IC）设计领域具有高度的专业性，为入门和研究开发带来了重大挑战。虽然大型语言模型（LLMs）在各种领域取得了显着的成功，但现有的LLMs往往无法满足学生、工程师和研究人员在IC设计领域的特定需求。因此，LLMs在IC设计领域中的潜力大部分仍未被开发。为了解决这些问题，我们介绍了ChipExpert，这是第一个针对IC设计领域的开放源代码教育型LLM。ChipExpert是在当前最佳开源基础模型（Llama-3 8B）上训练的。整个训练过程包括几个关键阶段，包括数据准备、继续预训练、指令指导的有监督微调和偏好对齐以及评估。在数据准备阶段，我们通过手动选择和人工注释创建了多个高质量的定制数据集。我们还包括了一个包含真实世界设计挑战的交互式问答数据集以及一个IC设计案例研究。在继续预训练阶段，我们使用Karel逻辑推理任务来集成IC设计的语言漫游能力。在指令指导的有监督微调阶段，我们开发了包含多个IC设计相关任务的精调数据集。在偏好对齐阶段，我们应用了偏置校正来提高ChipExpert在IC设计相关任务上的性能。最后，我们通过与工业领域的工程师合作进行了一系列的评估实验，以确保LLM能够准确地处理真实世界的IC设计问题。我们相信，通过开放源代码和定制化的LLM，将进一步促进IC设计领域的研究和教育。",
    "tldr": "ChipExpert是专门为集成电路设计领域设计的开放源代码大型语言模型，旨在解决该领域的专业知识和高门槛问题。",
    "en_tdlr": "ChipExpert is an open-source large language model tailored specifically for the field of integrated circuit design, aimed at addressing the expertise and high barrier to entry issues."
}