{
    "title": "A Semi-supervised Multi-channel Graph Convolutional Network for Query Classification in E-commerce",
    "abstract": "arXiv:2408.01928v1 Announce Type: cross  Abstract: Query intent classification is an essential module for customers to find desired products on the e-commerce application quickly. Most existing query intent classification methods rely on the users' click behavior as a supervised signal to construct training samples. However, these methods based entirely on posterior labels may lead to serious category imbalance problems because of the Matthew effect in click samples. Compared with popular categories, it is difficult for products under long-tail categories to obtain traffic and user clicks, which makes the models unable to detect users' intent for products under long-tail categories. This in turn aggravates the problem that long-tail categories cannot obtain traffic, forming a vicious circle. In addition, due to the randomness of the user's click, the posterior label is unstable for the query with similar semantics, which makes the model very sensitive to the input, leading to an unstab",
    "link": "https://arxiv.org/abs/2408.01928",
    "context": "Title: A Semi-supervised Multi-channel Graph Convolutional Network for Query Classification in E-commerce\nAbstract: arXiv:2408.01928v1 Announce Type: cross  Abstract: Query intent classification is an essential module for customers to find desired products on the e-commerce application quickly. Most existing query intent classification methods rely on the users' click behavior as a supervised signal to construct training samples. However, these methods based entirely on posterior labels may lead to serious category imbalance problems because of the Matthew effect in click samples. Compared with popular categories, it is difficult for products under long-tail categories to obtain traffic and user clicks, which makes the models unable to detect users' intent for products under long-tail categories. This in turn aggravates the problem that long-tail categories cannot obtain traffic, forming a vicious circle. In addition, due to the randomness of the user's click, the posterior label is unstable for the query with similar semantics, which makes the model very sensitive to the input, leading to an unstab",
    "path": "papers/24/08/2408.01928.json",
    "total_tokens": 331,
    "tldr": "该文章提出了一种半监督的多通道图卷积网络，能够利用包含点击行为在内的多通道信息进行查询意图的分类，尤其在解决长尾类别产品的查询意图识别问题方面表现出更强的鲁棒性。"
}