{
    "title": "Identifying treatment response subgroups in observational time-to-event data",
    "abstract": "arXiv:2408.03463v1 Announce Type: cross  Abstract: Identifying patient subgroups with different treatment responses is an important task to inform medical recommendations, guidelines, and the design of future clinical trials. Existing approaches for subgroup analysis primarily focus on Randomised Controlled Trials (RCTs), in which treatment assignment is randomised. Furthermore, the patient cohort of an RCT is often constrained by cost, and is not representative of the heterogeneity of patients likely to receive treatment in real-world clinical practice. Therefore, when applied to observational studies, such approaches suffer from significant statistical biases because of the non-randomisation of treatment. Our work introduces a novel, outcome-guided method for identifying treatment response subgroups in observational studies. Our approach assigns each patient to a subgroup associated with two time-to-event distributions: one under treatment and one under control regime. It hence posit",
    "link": "https://arxiv.org/abs/2408.03463",
    "context": "Title: Identifying treatment response subgroups in observational time-to-event data\nAbstract: arXiv:2408.03463v1 Announce Type: cross  Abstract: Identifying patient subgroups with different treatment responses is an important task to inform medical recommendations, guidelines, and the design of future clinical trials. Existing approaches for subgroup analysis primarily focus on Randomised Controlled Trials (RCTs), in which treatment assignment is randomised. Furthermore, the patient cohort of an RCT is often constrained by cost, and is not representative of the heterogeneity of patients likely to receive treatment in real-world clinical practice. Therefore, when applied to observational studies, such approaches suffer from significant statistical biases because of the non-randomisation of treatment. Our work introduces a novel, outcome-guided method for identifying treatment response subgroups in observational studies. Our approach assigns each patient to a subgroup associated with two time-to-event distributions: one under treatment and one under control regime. It hence posit",
    "path": "papers/24/08/2408.03463.json",
    "total_tokens": 351,
    "tldr": "该文章提出了一种新的、以结局为导向的方法，用于在观察性研究中识别治疗反应亚组。这种方法将每个患者分配到与两种时间-事件分布相关的亚组中：治疗和控制方案下的分布。这使得研究者能够分析不同患者群体在治疗和控制方案下的治疗效果，从而为实际临床实践中患者群体的治疗建议提供了强有力的证据。"
}