{
    "title": "Deep Spectral Methods for Unsupervised Ultrasound Image Interpretation",
    "abstract": "arXiv:2408.02043v1 Announce Type: new  Abstract: Ultrasound imaging is challenging to interpret due to non-uniform intensities, low contrast, and inherent artifacts, necessitating extensive training for non-specialists. Advanced representation with clear tissue structure separation could greatly assist clinicians in mapping underlying anatomy and distinguishing between tissue layers. Decomposing an image into semantically meaningful segments is mainly achieved using supervised segmentation algorithms. Unsupervised methods are beneficial, as acquiring large labeled datasets is difficult and costly, but despite their advantages, they still need to be explored in ultrasound. This paper proposes a novel unsupervised deep learning strategy tailored to ultrasound to obtain easily interpretable tissue separations. We integrate key concepts from unsupervised deep spectral methods, which combine spectral graph theory with deep learning methods. We utilize self-supervised transformer features fo",
    "link": "https://arxiv.org/abs/2408.02043",
    "context": "Title: Deep Spectral Methods for Unsupervised Ultrasound Image Interpretation\nAbstract: arXiv:2408.02043v1 Announce Type: new  Abstract: Ultrasound imaging is challenging to interpret due to non-uniform intensities, low contrast, and inherent artifacts, necessitating extensive training for non-specialists. Advanced representation with clear tissue structure separation could greatly assist clinicians in mapping underlying anatomy and distinguishing between tissue layers. Decomposing an image into semantically meaningful segments is mainly achieved using supervised segmentation algorithms. Unsupervised methods are beneficial, as acquiring large labeled datasets is difficult and costly, but despite their advantages, they still need to be explored in ultrasound. This paper proposes a novel unsupervised deep learning strategy tailored to ultrasound to obtain easily interpretable tissue separations. We integrate key concepts from unsupervised deep spectral methods, which combine spectral graph theory with deep learning methods. We utilize self-supervised transformer features fo",
    "path": "papers/24/08/2408.02043.json",
    "total_tokens": 308,
    "tldr": "该文章提出了一种新型的深层频率方法，用于无监督的超声成像解释，该方法通过结合自监督的Transformer特征和谱图理论，能够为临床医生提供更加直观和易于理解的组织分离。"
}