{
    "title": "Grasp Failure Constraints for Fast and Reliable Pick-and-Place Using Multi-Suction-Cup Grippers",
    "abstract": "arXiv:2408.03498v1 Announce Type: new  Abstract: Multi-suction-cup grippers are frequently employed to perform pick-and-place robotic tasks, especially in industrial settings where grasping a wide range of light to heavy objects in limited amounts of time is a common requirement. However, most existing works focus on using one or two suction cups to grasp only irregularly shaped but light objects. There is a lack of research on robust manipulation of heavy objects using larger arrays of suction cups, which introduces challenges in modeling and predicting grasp failure. This paper presents a general approach to modeling grasp strength in multi-suction-cup grippers, introducing new constraints usable for trajectory planning and optimization to achieve fast and reliable pick-and-place maneuvers. The primary modeling challenge is the accurate prediction of the distribution of loads at each suction cup while grasping objects. To solve for this load distribution, we find minimum spring poten",
    "link": "https://arxiv.org/abs/2408.03498",
    "context": "Title: Grasp Failure Constraints for Fast and Reliable Pick-and-Place Using Multi-Suction-Cup Grippers\nAbstract: arXiv:2408.03498v1 Announce Type: new  Abstract: Multi-suction-cup grippers are frequently employed to perform pick-and-place robotic tasks, especially in industrial settings where grasping a wide range of light to heavy objects in limited amounts of time is a common requirement. However, most existing works focus on using one or two suction cups to grasp only irregularly shaped but light objects. There is a lack of research on robust manipulation of heavy objects using larger arrays of suction cups, which introduces challenges in modeling and predicting grasp failure. This paper presents a general approach to modeling grasp strength in multi-suction-cup grippers, introducing new constraints usable for trajectory planning and optimization to achieve fast and reliable pick-and-place maneuvers. The primary modeling challenge is the accurate prediction of the distribution of loads at each suction cup while grasping objects. To solve for this load distribution, we find minimum spring poten",
    "path": "papers/24/08/2408.03498.json",
    "total_tokens": 372,
    "tldr": "该文章提出了一种针对多吸盘爪 grippers 的快速和可靠的pick-and-place方法的创新，通过引入新的约束用于轨迹规划和优化，可以实现对各种物体的高效可靠抓取。这些约束考虑了吸盘爪抓握力的大小和分布，特别是在抓取重物时，确保了抓取过程的稳定性和准确性。"
}