{
    "title": "RobNODDI: Robust NODDI Parameter Estimation with Adaptive Sampling under Continuous Representation",
    "abstract": "arXiv:2408.01944v1 Announce Type: new  Abstract: Neurite Orientation Dispersion and Density Imaging (NODDI) is an important imaging technology used to evaluate the microstructure of brain tissue, which is of great significance for the discovery and treatment of various neurological diseases. Current deep learning-based methods perform parameter estimation through diffusion magnetic resonance imaging (dMRI) with a small number of diffusion gradients. These methods speed up parameter estimation and improve accuracy. However, the diffusion directions used by most existing deep learning models during testing needs to be strictly consistent with the diffusion directions during training. This results in poor generalization and robustness of deep learning models in dMRI parameter estimation. In this work, we verify for the first time that the parameter estimation performance of current mainstream methods will significantly decrease when the testing diffusion directions and the training diffus",
    "link": "https://arxiv.org/abs/2408.01944",
    "context": "Title: RobNODDI: Robust NODDI Parameter Estimation with Adaptive Sampling under Continuous Representation\nAbstract: arXiv:2408.01944v1 Announce Type: new  Abstract: Neurite Orientation Dispersion and Density Imaging (NODDI) is an important imaging technology used to evaluate the microstructure of brain tissue, which is of great significance for the discovery and treatment of various neurological diseases. Current deep learning-based methods perform parameter estimation through diffusion magnetic resonance imaging (dMRI) with a small number of diffusion gradients. These methods speed up parameter estimation and improve accuracy. However, the diffusion directions used by most existing deep learning models during testing needs to be strictly consistent with the diffusion directions during training. This results in poor generalization and robustness of deep learning models in dMRI parameter estimation. In this work, we verify for the first time that the parameter estimation performance of current mainstream methods will significantly decrease when the testing diffusion directions and the training diffus",
    "path": "papers/24/08/2408.01944.json",
    "total_tokens": 680,
    "translated_title": "RobNODDI: 自适应采样下连续表示下NODDI参数估计的鲁棒性验证",
    "translated_abstract": "arXiv:2408.01944v1 宣布类型：新 Abstract: 神经纤维取向分散与密度成像（NODDI）是一种用于评估脑组织微观结构的重要成像技术，对于发现和治疗各种神经系统疾病具有重要意义。目前基于深度学习的方法通过扩散磁共振成像（dMRI）来估计参数，使用数量较少的扩散梯度。这些方法加速了参数的估计并提高了准确性。然而，大多数现有深度学习模型在测试期间使用的扩散方向必须在严格的意义上与训练期间使用的扩散方向一致。这导致深度学习模型在dMRI参数估计方面的泛化性和鲁棒性不佳。在本工作中，我们首次验证了当测试时的扩散方向与训练时的扩散方向不一致时，目前的主流方法在dMRI参数估计方面的性能将显著下降。为此，我们提出了一种新的自适应多尺度扩散采样策略，该策略通过动态规划选择最具信息的扩散方向并组织的取样过程，大大提高了计算效率，增强了模型对未知测试样品的泛化能力。我们的方法在多个dMRI数据集上取得了显著的性能提升，表明了它在处理监督深度学习模型泛化性的挑战时，展现出了强大的潜在应用价值。",
    "tldr": "本文提出了一种新的自适应多尺度扩散采样策略，提高了扩散磁共振成像（dMRI）参数估计的计算效率和模型对未知测试样品的泛化能力，特别是在测试扩散方向与训练方向不一致的情况下。"
}