{
    "title": "A Few-Shot Approach for Relation Extraction Domain Adaptation using Large Language Models",
    "abstract": "arXiv:2408.02377v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) have been successfully applied to the analysis of complex scientific and technological domains, with automatic KG generation methods typically building upon relation extraction models capturing fine-grained relations between domain entities in text. While these relations are fully applicable across scientific areas, existing models are trained on few domain-specific datasets such as SciERC and do not perform well on new target domains. In this paper, we experiment with leveraging in-context learning capabilities of Large Language Models to perform schema-constrained data annotation, collecting in-domain training instances for a Transformer-based relation extraction model deployed on titles and abstracts of research papers in the Architecture, Construction, Engineering and Operations (AECO) domain. By assessing the performance gain with respect to a baseline Deep Learning architecture trained on off-domain data, w",
    "link": "https://arxiv.org/abs/2408.02377",
    "context": "Title: A Few-Shot Approach for Relation Extraction Domain Adaptation using Large Language Models\nAbstract: arXiv:2408.02377v1 Announce Type: cross  Abstract: Knowledge graphs (KGs) have been successfully applied to the analysis of complex scientific and technological domains, with automatic KG generation methods typically building upon relation extraction models capturing fine-grained relations between domain entities in text. While these relations are fully applicable across scientific areas, existing models are trained on few domain-specific datasets such as SciERC and do not perform well on new target domains. In this paper, we experiment with leveraging in-context learning capabilities of Large Language Models to perform schema-constrained data annotation, collecting in-domain training instances for a Transformer-based relation extraction model deployed on titles and abstracts of research papers in the Architecture, Construction, Engineering and Operations (AECO) domain. By assessing the performance gain with respect to a baseline Deep Learning architecture trained on off-domain data, w",
    "path": "papers/24/08/2408.02377.json",
    "total_tokens": 332,
    "tldr": "该文章提出了一种基于大型语言模型的少样本学习方法，用于在技术领域中广泛应用的常识知识图谱中关系提取任务的领域适应性问题，通过在具体领域中应用关系提取模型，实现了在未知目标领域中识别和提取关系的高效性能改善。"
}