{
    "title": "LDFaceNet: Latent Diffusion-based Network for High-Fidelity Deepfake Generation",
    "abstract": "arXiv:2408.02078v1 Announce Type: new  Abstract: Over the past decade, there has been tremendous progress in the domain of synthetic media generation. This is mainly due to the powerful methods based on generative adversarial networks (GANs). Very recently, diffusion probabilistic models, which are inspired by non-equilibrium thermodynamics, have taken the spotlight. In the realm of image generation, diffusion models (DMs) have exhibited remarkable proficiency in producing both realistic and heterogeneous imagery through their stochastic sampling procedure. This paper proposes a novel facial swapping module, termed as LDFaceNet (Latent Diffusion based Face Swapping Network), which is based on a guided latent diffusion model that utilizes facial segmentation and facial recognition modules for a conditioned denoising process. The model employs a unique loss function to offer directional guidance to the diffusion process. Notably, LDFaceNet can incorporate supplementary facial guidance fo",
    "link": "https://arxiv.org/abs/2408.02078",
    "context": "Title: LDFaceNet: Latent Diffusion-based Network for High-Fidelity Deepfake Generation\nAbstract: arXiv:2408.02078v1 Announce Type: new  Abstract: Over the past decade, there has been tremendous progress in the domain of synthetic media generation. This is mainly due to the powerful methods based on generative adversarial networks (GANs). Very recently, diffusion probabilistic models, which are inspired by non-equilibrium thermodynamics, have taken the spotlight. In the realm of image generation, diffusion models (DMs) have exhibited remarkable proficiency in producing both realistic and heterogeneous imagery through their stochastic sampling procedure. This paper proposes a novel facial swapping module, termed as LDFaceNet (Latent Diffusion based Face Swapping Network), which is based on a guided latent diffusion model that utilizes facial segmentation and facial recognition modules for a conditioned denoising process. The model employs a unique loss function to offer directional guidance to the diffusion process. Notably, LDFaceNet can incorporate supplementary facial guidance fo",
    "path": "papers/24/08/2408.02078.json",
    "total_tokens": 626,
    "translated_title": "LDFaceNet: 基于潜扩散网络的高保真度Deepfake生成方法",
    "translated_abstract": "在过去的十年中，在合成媒体生成领域取得了巨大的进步。这主要是由于基于生成对抗网络（GANs）的强大方法的推动。最近，受到非平衡热力学启发的扩散概率模型吸引了人们的注意。在图像生成领域，扩散模型（DMs）通过它们的随机抽样过程展现了在生成逼真和非同质图像方面的杰出能力。本文提出了一种名为LDFaceNet（潜扩散基于面部交换网络）的新型面部交换模块，它基于一个指导潜扩散模型，该模型采用了面部分割和面部识别模块进行有条件的去噪过程。模型采用了独特的损失函数来为扩散过程提供方向性指导。值得注意的是，LDFaceNet可以结合补充面部指导信息来实现高质量的Deepfake视频生成。模型采用了独特的损失函数来为扩散过程提供方向性指导。值得注意的是，LDFaceNet可以结合补充面部指导信息来实现高质量的Deepfake视频生成。",
    "tldr": "LDFaceNet是使用指导潜扩散模型进行面部交换的视频生成方法，能够生成高质量Deepfake视频。",
    "en_tdlr": "LDFaceNet is a video generation method using a guided latent diffusion model for facial swapping, capable of producing high-quality Deepfake videos."
}