{
    "title": "Advancing Mental Health Pre-Screening: A New Custom GPT for Psychological Distress Assessment",
    "abstract": "arXiv:2408.01614v1 Announce Type: cross  Abstract: This study introduces 'Psycho Analyst', a custom GPT model based on OpenAI's GPT-4, optimized for pre-screening mental health disorders. Enhanced with DSM-5, PHQ-8, detailed data descriptions, and extensive training data, the model adeptly decodes nuanced linguistic indicators of mental health disorders. It utilizes a dual-task framework that includes binary classification and a three-stage PHQ-8 score computation involving initial assessment, detailed breakdown, and independent assessment, showcasing refined analytic capabilities. Validation with the DAIC-WOZ dataset reveals F1 and Macro-F1 scores of 0.929 and 0.949, respectively, along with the lowest MAE and RMSE of 2.89 and 3.69 in PHQ-8 scoring. These results highlight the model's precision and transformative potential in enhancing public mental health support, improving accessibility, cost-effectiveness, and serving as a second opinion for professionals.",
    "link": "https://arxiv.org/abs/2408.01614",
    "context": "Title: Advancing Mental Health Pre-Screening: A New Custom GPT for Psychological Distress Assessment\nAbstract: arXiv:2408.01614v1 Announce Type: cross  Abstract: This study introduces 'Psycho Analyst', a custom GPT model based on OpenAI's GPT-4, optimized for pre-screening mental health disorders. Enhanced with DSM-5, PHQ-8, detailed data descriptions, and extensive training data, the model adeptly decodes nuanced linguistic indicators of mental health disorders. It utilizes a dual-task framework that includes binary classification and a three-stage PHQ-8 score computation involving initial assessment, detailed breakdown, and independent assessment, showcasing refined analytic capabilities. Validation with the DAIC-WOZ dataset reveals F1 and Macro-F1 scores of 0.929 and 0.949, respectively, along with the lowest MAE and RMSE of 2.89 and 3.69 in PHQ-8 scoring. These results highlight the model's precision and transformative potential in enhancing public mental health support, improving accessibility, cost-effectiveness, and serving as a second opinion for professionals.",
    "path": "papers/24/08/2408.01614.json",
    "total_tokens": 379,
    "tldr": "该文章创新性地开发了一个新的基于GPT-4的心理 distress评估模型——Psycho Analyst，该模型能够通过自然的语言处理手段来提高心理健康问题的早期筛查精准度，为公共心理健康支持提供了一个高效且准确的第二意见系统。"
}