{
    "title": "Improving the quality of Persian clinical text with a novel spelling correction system",
    "abstract": "arXiv:2408.03622v1 Announce Type: cross  Abstract: Background: The accuracy of spelling in Electronic Health Records (EHRs) is a critical factor for efficient clinical care, research, and ensuring patient safety. The Persian language, with its abundant vocabulary and complex characteristics, poses unique challenges for real-word error correction. This research aimed to develop an innovative approach for detecting and correcting spelling errors in Persian clinical text.   Methods: Our strategy employs a state-of-the-art pre-trained model that has been meticulously fine-tuned specifically for the task of spelling correction in the Persian clinical domain. This model is complemented by an innovative orthographic similarity matching algorithm, PERTO, which uses visual similarity of characters for ranking correction candidates.   Results: The evaluation of our approach demonstrated its robustness and precision in detecting and rectifying word errors in Persian clinical text. In terms of non",
    "link": "https://arxiv.org/abs/2408.03622",
    "context": "Title: Improving the quality of Persian clinical text with a novel spelling correction system\nAbstract: arXiv:2408.03622v1 Announce Type: cross  Abstract: Background: The accuracy of spelling in Electronic Health Records (EHRs) is a critical factor for efficient clinical care, research, and ensuring patient safety. The Persian language, with its abundant vocabulary and complex characteristics, poses unique challenges for real-word error correction. This research aimed to develop an innovative approach for detecting and correcting spelling errors in Persian clinical text.   Methods: Our strategy employs a state-of-the-art pre-trained model that has been meticulously fine-tuned specifically for the task of spelling correction in the Persian clinical domain. This model is complemented by an innovative orthographic similarity matching algorithm, PERTO, which uses visual similarity of characters for ranking correction candidates.   Results: The evaluation of our approach demonstrated its robustness and precision in detecting and rectifying word errors in Persian clinical text. In terms of non",
    "path": "papers/24/08/2408.03622.json",
    "total_tokens": 332,
    "tldr": "该文章创新地开发了一种针对Persian临床文本的拼写校正系统，通过结合深度学习模型和专门的字符视觉相似性匹配算法，有效提高了电子健康记录中拼写准确性的同时，确保了临床研究和患者安全工作的效率与质量。"
}