{
    "title": "SAM 2 in Robotic Surgery: An Empirical Evaluation for Robustness and Generalization in Surgical Video Segmentation",
    "abstract": "arXiv:2408.04593v1 Announce Type: cross  Abstract: The recent Segment Anything Model (SAM) 2 has demonstrated remarkable foundational competence in semantic segmentation, with its memory mechanism and mask decoder further addressing challenges in video tracking and object occlusion, thereby achieving superior results in interactive segmentation for both images and videos. Building upon our previous empirical studies, we further explore the zero-shot segmentation performance of SAM 2 in robot-assisted surgery based on prompts, alongside its robustness against real-world corruption. For static images, we employ two forms of prompts: 1-point and bounding box, while for video sequences, the 1-point prompt is applied to the initial frame. Through extensive experimentation on the MICCAI EndoVis 2017 and EndoVis 2018 benchmarks, SAM 2, when utilizing bounding box prompts, outperforms state-of-the-art (SOTA) methods in comparative evaluations. The results with point prompts also exhibit a subs",
    "link": "https://arxiv.org/abs/2408.04593",
    "context": "Title: SAM 2 in Robotic Surgery: An Empirical Evaluation for Robustness and Generalization in Surgical Video Segmentation\nAbstract: arXiv:2408.04593v1 Announce Type: cross  Abstract: The recent Segment Anything Model (SAM) 2 has demonstrated remarkable foundational competence in semantic segmentation, with its memory mechanism and mask decoder further addressing challenges in video tracking and object occlusion, thereby achieving superior results in interactive segmentation for both images and videos. Building upon our previous empirical studies, we further explore the zero-shot segmentation performance of SAM 2 in robot-assisted surgery based on prompts, alongside its robustness against real-world corruption. For static images, we employ two forms of prompts: 1-point and bounding box, while for video sequences, the 1-point prompt is applied to the initial frame. Through extensive experimentation on the MICCAI EndoVis 2017 and EndoVis 2018 benchmarks, SAM 2, when utilizing bounding box prompts, outperforms state-of-the-art (SOTA) methods in comparative evaluations. The results with point prompts also exhibit a subs",
    "path": "papers/24/08/2408.04593.json",
    "total_tokens": 501,
    "tldr": "该文章探讨了Segment Anything Model 2 (SAM 2)在机器人手术中的应用，进行了一次实证评价，特别是评估了其在手术视频分割中的鲁棒性和泛化能力。研究显示，SAM 2在处理视频跟踪和对象遮挡问题时表现出色，并且在互动分割（包括图像和视频）方面取得了显著成果。此外，文章还评估了SAM 2在不同类型提示下的零 shot分割性能，并测试了其在真实世界干扰情况下的表现。通过对MICCAI EndoVis 2017和EndoVis 2018基准测试的数据集进行广泛实验，发现使用边界框提示的SAM 2在对比评估中优于当前的先进技术。使用点提示的结果也显示了潜力。总的来说，SAM 2在手术视频分割中的应用展现了强大的能力，为机器人手术领域提供了一个有前景的解决方案。"
}