{
    "title": "Hierarchical Clustering using Reversible Binary Cellular Automata for High-Dimensional Data",
    "abstract": "arXiv:2408.02250v1 Announce Type: cross  Abstract: This work proposes a hierarchical clustering algorithm for high-dimensional datasets using the cyclic space of reversible finite cellular automata. In cellular automaton (CA) based clustering, if two objects belong to the same cycle, they are closely related and considered as part of the same cluster. However, if a high-dimensional dataset is clustered using the cycles of one CA, closely related objects may belong to different cycles. This paper identifies the relationship between objects in two different cycles based on the median of all elements in each cycle so that they can be grouped in the next stage. Further, to minimize the number of intermediate clusters which in turn reduces the computational cost, a rule selection strategy is taken to find the best rules based on information propagation and cycle structure. After encoding the dataset using frequency-based encoding such that the consecutive data elements maintain a minimum ha",
    "link": "https://arxiv.org/abs/2408.02250",
    "context": "Title: Hierarchical Clustering using Reversible Binary Cellular Automata for High-Dimensional Data\nAbstract: arXiv:2408.02250v1 Announce Type: cross  Abstract: This work proposes a hierarchical clustering algorithm for high-dimensional datasets using the cyclic space of reversible finite cellular automata. In cellular automaton (CA) based clustering, if two objects belong to the same cycle, they are closely related and considered as part of the same cluster. However, if a high-dimensional dataset is clustered using the cycles of one CA, closely related objects may belong to different cycles. This paper identifies the relationship between objects in two different cycles based on the median of all elements in each cycle so that they can be grouped in the next stage. Further, to minimize the number of intermediate clusters which in turn reduces the computational cost, a rule selection strategy is taken to find the best rules based on information propagation and cycle structure. After encoding the dataset using frequency-based encoding such that the consecutive data elements maintain a minimum ha",
    "path": "papers/24/08/2408.02250.json",
    "total_tokens": 342,
    "tldr": "该文章提出了一种使用可逆二元细胞自动机的高维数据层次聚类算法，通过分析数据元素在不同周期中的关系来改进传统的单周期聚类方法，并采用基于信息传播和周期结构的规则选择策略，以减少中间聚类的数量并降低计算成本。"
}