{
    "title": "Large-scale Deployment of Vision-based Tactile Sensors on Multi-fingered Grippers",
    "abstract": "arXiv:2408.02206v1 Announce Type: new  Abstract: Vision-based Tactile Sensors (VBTSs) show significant promise in that they can leverage image measurements to provide high-spatial-resolution human-like performance. However, current VBTS designs, typically confined to the fingertips of robotic grippers, prove somewhat inadequate, as many grasping and manipulation tasks require multiple contact points with the object. With an end goal of enabling large-scale, multi-surface tactile sensing via VBTSs, our research (i) develops a synchronized image acquisition system with minimal latency,(ii) proposes a modularized VBTS design for easy integration into finger phalanges, and (iii) devises a zero-shot calibration approach to improve data efficiency in the simultaneous calibration of multiple VBTSs. In validating the system within a miniature 3-fingered robotic gripper equipped with 7 VBTSs we demonstrate improved tactile perception performance by covering the contact surfaces of both gripper ",
    "link": "https://arxiv.org/abs/2408.02206",
    "context": "Title: Large-scale Deployment of Vision-based Tactile Sensors on Multi-fingered Grippers\nAbstract: arXiv:2408.02206v1 Announce Type: new  Abstract: Vision-based Tactile Sensors (VBTSs) show significant promise in that they can leverage image measurements to provide high-spatial-resolution human-like performance. However, current VBTS designs, typically confined to the fingertips of robotic grippers, prove somewhat inadequate, as many grasping and manipulation tasks require multiple contact points with the object. With an end goal of enabling large-scale, multi-surface tactile sensing via VBTSs, our research (i) develops a synchronized image acquisition system with minimal latency,(ii) proposes a modularized VBTS design for easy integration into finger phalanges, and (iii) devises a zero-shot calibration approach to improve data efficiency in the simultaneous calibration of multiple VBTSs. In validating the system within a miniature 3-fingered robotic gripper equipped with 7 VBTSs we demonstrate improved tactile perception performance by covering the contact surfaces of both gripper ",
    "path": "papers/24/08/2408.02206.json",
    "total_tokens": 415,
    "tldr": "该文章提出了一个大型的基于视觉的触觉传感器部署在多指夹 grippers 上的研究，实现了通过模拟人类手指的高空间分辨率来增强触觉感知性能。文章还开发了一个同步图像采集系统，一个模块化的视觉触觉传感器设计，以及一种无监督的方法来提高多个视觉触觉传感器的联合校准效率。在验证这一系统的设置中，使用一个小型三指夹持机器人装备有7个视觉触觉传感器，表明了在大规模触觉表面覆盖下的显著性能提升。"
}