{
    "title": "UlRe-NeRF: 3D Ultrasound Imaging through Neural Rendering with Ultrasound Reflection Direction Parameterization",
    "abstract": "arXiv:2408.00860v1 Announce Type: new  Abstract: Three-dimensional ultrasound imaging is a critical technology widely used in medical diagnostics. However, traditional 3D ultrasound imaging methods have limitations such as fixed resolution, low storage efficiency, and insufficient contextual connectivity, leading to poor performance in handling complex artifacts and reflection characteristics. Recently, techniques based on NeRF (Neural Radiance Fields) have made significant progress in view synthesis and 3D reconstruction, but there remains a research gap in high-quality ultrasound imaging. To address these issues, we propose a new model, UlRe-NeRF, which combines implicit neural networks and explicit ultrasound volume rendering into an ultrasound neural rendering architecture. This model incorporates reflection direction parameterization and harmonic encoding, using a directional MLP module to generate view-dependent high-frequency reflection intensity estimates, and a spatial MLP mod",
    "link": "https://arxiv.org/abs/2408.00860",
    "context": "Title: UlRe-NeRF: 3D Ultrasound Imaging through Neural Rendering with Ultrasound Reflection Direction Parameterization\nAbstract: arXiv:2408.00860v1 Announce Type: new  Abstract: Three-dimensional ultrasound imaging is a critical technology widely used in medical diagnostics. However, traditional 3D ultrasound imaging methods have limitations such as fixed resolution, low storage efficiency, and insufficient contextual connectivity, leading to poor performance in handling complex artifacts and reflection characteristics. Recently, techniques based on NeRF (Neural Radiance Fields) have made significant progress in view synthesis and 3D reconstruction, but there remains a research gap in high-quality ultrasound imaging. To address these issues, we propose a new model, UlRe-NeRF, which combines implicit neural networks and explicit ultrasound volume rendering into an ultrasound neural rendering architecture. This model incorporates reflection direction parameterization and harmonic encoding, using a directional MLP module to generate view-dependent high-frequency reflection intensity estimates, and a spatial MLP mod",
    "path": "papers/24/08/2408.00860.json",
    "total_tokens": 730,
    "translated_title": "UlRe-NeRF: 使用神经渲染的3D超声成像，通过超声反射方向参数化",
    "translated_abstract": "arXiv:2408.00860v1 公告类型：新提交  摘要：三维超声成像在医疗诊断中广泛使用，是一项关键技术。然而，传统的三维超声成像方法存在固定分辨率、存储效率低、上下文连接不足等问题，导致在处理复杂的图像异常和反射特性时表现不佳。最近，基于NeRF（神经辐射场）的技术在视角合成和三维重建方面取得了显著进步，但在高清晰度超声成像方面仍有研究缺口。为了解决这些问题，我们提出了一种新的模型UlRe-NeRF，它将隐式的神经网络和显式的超声体绘制功能集成到一个超声神经渲染架构中。该模型包含了反射方向参数化和谐波编码，使用方向性MLP模块生成视角依赖的高频反射强度估计，以及一个空间MLP模块来估计整个空间内的反射强度变化，从而提高图像的质量和真实性。通过这项技术，UlRe-NeRF能够提供接近真实物理的3D ultrasound渲染，并且具有更高效的存储和更优的处理能力，尤其是在处理复杂反射和透视问题时。实验结果表明，UlRe-NeRF在各种复杂场景中的表现优于现有技术，为超声成像领域提供了新的解决方案。",
    "tldr": "该模型通过将超声反射方向参数化和谐波编码与神经渲染结合，生成接近真实物理的3D超声图像，提高了图像质量和处理复杂反射的能力。",
    "en_tdlr": "UlRe-NeRF is a model that combines ultrasound reflection direction parameterization and harmonic encoding with neural rendering to produce high-quality, physically-correct 3D ultrasound images, enhancing image quality and handling complex reflections."
}