{
    "title": "CCSRP: Robust Pruning of Spiking Neural Networks through Cooperative Coevolution",
    "abstract": "arXiv:2408.00794v1 Announce Type: cross  Abstract: Spiking neural networks (SNNs) have shown promise in various dynamic visual tasks, yet those ready for practical deployment often lack the compactness and robustness essential in resource-limited and safety-critical settings. Prior research has predominantly concentrated on enhancing the compactness or robustness of artificial neural networks through strategies like network pruning and adversarial training, with little exploration into similar methodologies for SNNs. Robust pruning of SNNs aims to reduce computational overhead while preserving both accuracy and robustness. Current robust pruning approaches generally necessitate expert knowledge and iterative experimentation to establish suitable pruning criteria or auxiliary modules, thus constraining their broader application. Concurrently, evolutionary algorithms (EAs) have been employed to automate the pruning of artificial neural networks, delivering remarkable outcomes yet overloo",
    "link": "https://arxiv.org/abs/2408.00794",
    "context": "Title: CCSRP: Robust Pruning of Spiking Neural Networks through Cooperative Coevolution\nAbstract: arXiv:2408.00794v1 Announce Type: cross  Abstract: Spiking neural networks (SNNs) have shown promise in various dynamic visual tasks, yet those ready for practical deployment often lack the compactness and robustness essential in resource-limited and safety-critical settings. Prior research has predominantly concentrated on enhancing the compactness or robustness of artificial neural networks through strategies like network pruning and adversarial training, with little exploration into similar methodologies for SNNs. Robust pruning of SNNs aims to reduce computational overhead while preserving both accuracy and robustness. Current robust pruning approaches generally necessitate expert knowledge and iterative experimentation to establish suitable pruning criteria or auxiliary modules, thus constraining their broader application. Concurrently, evolutionary algorithms (EAs) have been employed to automate the pruning of artificial neural networks, delivering remarkable outcomes yet overloo",
    "path": "papers/24/08/2408.00794.json",
    "total_tokens": 608,
    "translated_title": "CCSRP: 通过协作共进化法实现突触神经网络稳健修剪",
    "translated_abstract": "arXiv:2408.00794v1 宣布类型：交叉 摘要：脉冲神经网络（SNNs）在各种动态视觉任务中显示了潜力，但那些适合实际部署的通常缺乏在资源受限和关键安全环境中所需的紧凑性和鲁棒性。先前的工作主要集中在通过网络剪枝和对抗性训练等策略来提高人工神经网络的紧凑性或鲁棒性，而对于SNNs的类似方法研究甚少。稳健修剪突触神经网络的目标是减少计算开销同时保持准确性及鲁棒性。现有的稳健修剪方法通常需要专家知识和反复试验来确定合适的剪枝标准或辅助模块，因此限制了它们更广泛的适用性。同时，进化算法（EAs）已经被应用来自动化人工神经网络的剪枝，获得了显著的成果，但超出了剪枝标准或辅助模块的选择自动化。",
    "tldr": "通过协作共进化，本研究提出了一种稳健的SNN剪枝方法，旨在在不牺牲准确性与鲁棒性的前提下，减少计算资源需求。"
}