{
    "title": "A systematic review and analysis of the viability of virtual reality (VR) in construction work and education",
    "abstract": "arXiv:2408.01450v1 Announce Type: cross  Abstract: This systematic review explores the viability of virtual reality (VR) technologies for enhancing learning outcomes and operational efficiency within the construction industry. This study evaluates the current integration of VR in construction education and practice. Employing the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines, this review analyzed 36 peer-reviewed journal articles from databases such as the Web of Science, ERIC, and Scopus. The methodology focused on identifying, appraising, and synthesizing all relevant studies to assess the effectiveness of VR applications in construction-related fields. This review highlights that VR significantly enhances learning by providing immersive interactive simulations that improve the understanding of every complex construction process, such as structural elements or tunnel-boring machine operations. This review contributes by systematically compiling and eva",
    "link": "https://arxiv.org/abs/2408.01450",
    "context": "Title: A systematic review and analysis of the viability of virtual reality (VR) in construction work and education\nAbstract: arXiv:2408.01450v1 Announce Type: cross  Abstract: This systematic review explores the viability of virtual reality (VR) technologies for enhancing learning outcomes and operational efficiency within the construction industry. This study evaluates the current integration of VR in construction education and practice. Employing the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines, this review analyzed 36 peer-reviewed journal articles from databases such as the Web of Science, ERIC, and Scopus. The methodology focused on identifying, appraising, and synthesizing all relevant studies to assess the effectiveness of VR applications in construction-related fields. This review highlights that VR significantly enhances learning by providing immersive interactive simulations that improve the understanding of every complex construction process, such as structural elements or tunnel-boring machine operations. This review contributes by systematically compiling and eva",
    "path": "papers/24/08/2408.01450.json",
    "total_tokens": 324,
    "tldr": "该文章系统地回顾并分析了虚拟现实(VR)在建筑工作和教育中的可行性，强调了VR在提供沉浸式交互式模拟中所起的作用，这些模拟增强了复杂建筑过程的理解，如结构元素或盾构机操作，从而显著提高了学习效果。"
}