{
    "title": "Decoding AI and Human Authorship: Nuances Revealed Through NLP and Statistical Analysis",
    "abstract": "arXiv:2408.00769v1 Announce Type: cross  Abstract: This research explores the nuanced differences in texts produced by AI and those written by humans, aiming to elucidate how language is expressed differently by AI and humans. Through comprehensive statistical data analysis, the study investigates various linguistic traits, patterns of creativity, and potential biases inherent in human-written and AI- generated texts. The significance of this research lies in its contribution to understanding AI's creative capabilities and its impact on literature, communication, and societal frameworks. By examining a meticulously curated dataset comprising 500K essays spanning diverse topics and genres, generated by LLMs, or written by humans, the study uncovers the deeper layers of linguistic expression and provides insights into the cognitive processes underlying both AI and human-driven textual compositions. The analysis revealed that human-authored essays tend to have a higher total word count on",
    "link": "https://arxiv.org/abs/2408.00769",
    "context": "Title: Decoding AI and Human Authorship: Nuances Revealed Through NLP and Statistical Analysis\nAbstract: arXiv:2408.00769v1 Announce Type: cross  Abstract: This research explores the nuanced differences in texts produced by AI and those written by humans, aiming to elucidate how language is expressed differently by AI and humans. Through comprehensive statistical data analysis, the study investigates various linguistic traits, patterns of creativity, and potential biases inherent in human-written and AI- generated texts. The significance of this research lies in its contribution to understanding AI's creative capabilities and its impact on literature, communication, and societal frameworks. By examining a meticulously curated dataset comprising 500K essays spanning diverse topics and genres, generated by LLMs, or written by humans, the study uncovers the deeper layers of linguistic expression and provides insights into the cognitive processes underlying both AI and human-driven textual compositions. The analysis revealed that human-authored essays tend to have a higher total word count on",
    "path": "papers/24/08/2408.00769.json",
    "total_tokens": 728,
    "translated_title": "通过自然语言处理和统计分析解码人工智能和人类作者的写作：揭示的语言微妙差异",
    "translated_abstract": "arXiv:2408.00769v1 公告类型：交叉 摘要：这项研究探讨了由人工智能和人类撰写的文本之间的微妙差异，旨在阐明人工智能和人类如何表达语言。通过全面的数据统计分析，研究调查了文本中的各种语言特征、创造力和潜在的人类和AI撰写的文本中的偏差。这项研究的重要性在于它对理解AI的创造能力和其对文学、交流和社会框架的影响做出了贡献。通过精心策划的数据集，包含跨越各种主题和流派的500K篇论文，这些论文是由大型语言模型生成的，或由人类撰写，该研究揭示了语言表达的深层次以及AI和人类文本创作的认知过程。分析发现，人类撰写的论文通常在总单词数上比AI生成的要多，并且展现了更高的复杂性和多样性。此外，研究还指出，AI在某些特定的语言模式和句式使用上表现出一致性，这与人类的写作风格存在差异。这些发现有助于我们更好地理解人工智能在文学创作中的作用，以及它在未来可能对人类写作方式产生的变革。论文的结论强调了进一步研究AI写作特性和人类认知过程之间的差异的必要性。",
    "tldr": "该研究揭示了人工智能与人“更高的总字数、复杂性和多样性”撰写者在语言表达上的微妙差异，并突出展示了AI在特定语言模式和句子结构上的独特一致性。"
}