{
    "title": "Integrating a Digital Twin Concept in the Zero Emission Sea Transporter (ZEST) Project for Sustainable Maritime Transport using Stonefish Simulator",
    "abstract": "arXiv:2408.02277v1 Announce Type: new  Abstract: In response to stringent emission reduction targets imposed by the International Maritime Organization (IMO) and the European Green Deal's Fit for 55 legislation package, the maritime industry has shifted its focus towards decarbonization. While significant attention has been placed on vessels exceeding 5,000 gross tons (GT), emissions from coastal and short sea shipping, amounting to approximately 13% of global shipping transportation and 15% within the European Union (EU), have not received adequate consideration. This abstract introduces the Zero Emission Sea Transporter (ZEST) project, designed to address this issue by developing a zero-emissions multi-purpose catamaran for short sea route",
    "link": "https://arxiv.org/abs/2408.02277",
    "context": "Title: Integrating a Digital Twin Concept in the Zero Emission Sea Transporter (ZEST) Project for Sustainable Maritime Transport using Stonefish Simulator\nAbstract: arXiv:2408.02277v1 Announce Type: new  Abstract: In response to stringent emission reduction targets imposed by the International Maritime Organization (IMO) and the European Green Deal's Fit for 55 legislation package, the maritime industry has shifted its focus towards decarbonization. While significant attention has been placed on vessels exceeding 5,000 gross tons (GT), emissions from coastal and short sea shipping, amounting to approximately 13% of global shipping transportation and 15% within the European Union (EU), have not received adequate consideration. This abstract introduces the Zero Emission Sea Transporter (ZEST) project, designed to address this issue by developing a zero-emissions multi-purpose catamaran for short sea route",
    "path": "papers/24/08/2408.02277.json",
    "total_tokens": 332,
    "tldr": "该文章介绍了名为ZEST的零排放海运器的项目，该项目通过开发一种适用于短途海路运输的零排放双体船，旨在解决沿海和近海航运的碳排放问题。此项目的实施对于实现国际海事组织（IMO）和欧盟绿色协议中规定的碳排放减排目标具有重要意义。"
}