{
    "title": "Text Conditioned Symbolic Drumbeat Generation using Latent Diffusion Models",
    "abstract": "arXiv:2408.02711v1 Announce Type: cross  Abstract: This study introduces a text-conditioned approach to generating drumbeats with Latent Diffusion Models (LDMs). It uses informative conditioning text extracted from training data filenames. By pretraining a text and drumbeat encoder through contrastive learning within a multimodal network, aligned following CLIP, we align the modalities of text and music closely. Additionally, we examine an alternative text encoder based on multihot text encodings. Inspired by musics multi-resolution nature, we propose a novel LSTM variant, MultiResolutionLSTM, designed to operate at various resolutions independently. In common with recent LDMs in the image space, it speeds up the generation process by running diffusion in a latent space provided by a pretrained unconditional autoencoder. We demonstrate the originality and variety of the generated drumbeats by measuring distance (both over binary pianorolls and in the latent space) versus the training d",
    "link": "https://arxiv.org/abs/2408.02711",
    "context": "Title: Text Conditioned Symbolic Drumbeat Generation using Latent Diffusion Models\nAbstract: arXiv:2408.02711v1 Announce Type: cross  Abstract: This study introduces a text-conditioned approach to generating drumbeats with Latent Diffusion Models (LDMs). It uses informative conditioning text extracted from training data filenames. By pretraining a text and drumbeat encoder through contrastive learning within a multimodal network, aligned following CLIP, we align the modalities of text and music closely. Additionally, we examine an alternative text encoder based on multihot text encodings. Inspired by musics multi-resolution nature, we propose a novel LSTM variant, MultiResolutionLSTM, designed to operate at various resolutions independently. In common with recent LDMs in the image space, it speeds up the generation process by running diffusion in a latent space provided by a pretrained unconditional autoencoder. We demonstrate the originality and variety of the generated drumbeats by measuring distance (both over binary pianorolls and in the latent space) versus the training d",
    "path": "papers/24/08/2408.02711.json",
    "total_tokens": 420,
    "tldr": "该文章创新性地提出了一种基于潜伏扩散模型（LDMs）的文本条件鼓点生成方法，通过对比学习将文本与鼓点进行联合编码，并与CLIP算法相结合，实现了文本与音乐模态的紧密关联。同时，文章还引入了多分辨率长短期记忆网络（MultiResolutionLSTM），旨在模拟音乐的多分辨率特性。此外，文章提出了一种新的预训练无条件自动编码器，能够在生成过程中加速扩散过程，并通过评估训练数据与生成的鼓点之间的距离（二进制钢琴卷帘和潜在空间）来展示生成鼓点的原创性和多样性。"
}