{
    "title": "An Agile Adaptation Method for Multi-mode Vehicle Communication Networks",
    "abstract": "arXiv:2408.01429v1 Announce Type: cross  Abstract: This paper focuses on discovering the impact of communication mode allocation on communication efficiency in the vehicle communication networks. To be specific, Markov decision process and reinforcement learning are applied to establish an agile adaptation mechanism for multi-mode communication devices according to the driving scenarios and business requirements. Then, Q-learning is used to train the agile adaptation reinforcement learning model and output the trained model. By learning the best actions to take in different states to maximize the cumulative reward, and avoiding the problem of poor adaptation effect caused by inaccurate delay measurement in unstable communication scenarios. The experiments show that the proposed scheme can quickly adapt to dynamic vehicle networking environment, while achieving high concurrency and communication efficiency.",
    "link": "https://arxiv.org/abs/2408.01429",
    "context": "Title: An Agile Adaptation Method for Multi-mode Vehicle Communication Networks\nAbstract: arXiv:2408.01429v1 Announce Type: cross  Abstract: This paper focuses on discovering the impact of communication mode allocation on communication efficiency in the vehicle communication networks. To be specific, Markov decision process and reinforcement learning are applied to establish an agile adaptation mechanism for multi-mode communication devices according to the driving scenarios and business requirements. Then, Q-learning is used to train the agile adaptation reinforcement learning model and output the trained model. By learning the best actions to take in different states to maximize the cumulative reward, and avoiding the problem of poor adaptation effect caused by inaccurate delay measurement in unstable communication scenarios. The experiments show that the proposed scheme can quickly adapt to dynamic vehicle networking environment, while achieving high concurrency and communication efficiency.",
    "path": "papers/24/08/2408.01429.json",
    "total_tokens": 338,
    "tldr": "该文章提出一种多模车辆通信网络中通信模式分配对通信效率影响的分析方法，利用马尔可夫决策过程和强化学习构建了一种能够根据驾驶场景和业务需求敏捷适应的多模通信设备机制，并通过Q-learning训练一个敏捷适应的强化学习模型，有效地避免了因通信不稳定场景中延迟测量不准确导致的适应效果不佳的问题。实验结果表明，该方案能够在动态的车辆网络环境中快速适应，同时实现了高并发性和通信效率。"
}