{
    "title": "Integrating Large Language Models and Knowledge Graphs for Extraction and Validation of Textual Test Data",
    "abstract": "arXiv:2408.01700v1 Announce Type: new  Abstract: Aerospace manufacturing companies, such as Thales Alenia Space, design, develop, integrate, verify, and validate products characterized by high complexity and low volume. They carefully document all phases for each product but analyses across products are challenging due to the heterogeneity and unstructured nature of the data in documents. In this paper, we propose a hybrid methodology that leverages Knowledge Graphs (KGs) in conjunction with Large Language Models (LLMs) to extract and validate data contained in these documents. We consider a case study focused on test data related to electronic boards for satellites. To do so, we extend the Semantic Sensor Network ontology. We store the metadata of the reports in a KG, while the actual test results are stored in parquet accessible via a Virtual Knowledge Graph. The validation process is managed using an LLM-based approach. We also conduct a benchmarking study to evaluate the performanc",
    "link": "https://arxiv.org/abs/2408.01700",
    "context": "Title: Integrating Large Language Models and Knowledge Graphs for Extraction and Validation of Textual Test Data\nAbstract: arXiv:2408.01700v1 Announce Type: new  Abstract: Aerospace manufacturing companies, such as Thales Alenia Space, design, develop, integrate, verify, and validate products characterized by high complexity and low volume. They carefully document all phases for each product but analyses across products are challenging due to the heterogeneity and unstructured nature of the data in documents. In this paper, we propose a hybrid methodology that leverages Knowledge Graphs (KGs) in conjunction with Large Language Models (LLMs) to extract and validate data contained in these documents. We consider a case study focused on test data related to electronic boards for satellites. To do so, we extend the Semantic Sensor Network ontology. We store the metadata of the reports in a KG, while the actual test results are stored in parquet accessible via a Virtual Knowledge Graph. The validation process is managed using an LLM-based approach. We also conduct a benchmarking study to evaluate the performanc",
    "path": "papers/24/08/2408.01700.json",
    "total_tokens": 358,
    "tldr": "该文章提出了一种结合知识图谱和大型语言模型的方法，用于从文档中提取和验证文本形式的测试数据，特别是针对卫星电子板制造的案例研究。这种方法提高了数据分析效率，并通过集成KGs和LLMs，解决了文档数据复杂性和结构化的难题。"
}