{
    "title": "Interpreting Global Perturbation Robustness of Image Models using Axiomatic Spectral Importance Decomposition",
    "abstract": "arXiv:2408.01139v1 Announce Type: cross  Abstract: Perturbation robustness evaluates the vulnerabilities of models, arising from a variety of perturbations, such as data corruptions and adversarial attacks. Understanding the mechanisms of perturbation robustness is critical for global interpretability. We present a model-agnostic, global mechanistic interpretability method to interpret the perturbation robustness of image models. This research is motivated by two key aspects. First, previous global interpretability works, in tandem with robustness benchmarks, e.g. mean corruption error (mCE), are not designed to directly interpret the mechanisms of perturbation robustness within image models. Second, we notice that the spectral signal-to-noise ratios (SNR) of perturbed natural images exponentially decay over the frequency. This power-law-like decay implies that: Low-frequency signals are generally more robust than high-frequency signals -- yet high classification accuracy can not be ac",
    "link": "https://arxiv.org/abs/2408.01139",
    "context": "Title: Interpreting Global Perturbation Robustness of Image Models using Axiomatic Spectral Importance Decomposition\nAbstract: arXiv:2408.01139v1 Announce Type: cross  Abstract: Perturbation robustness evaluates the vulnerabilities of models, arising from a variety of perturbations, such as data corruptions and adversarial attacks. Understanding the mechanisms of perturbation robustness is critical for global interpretability. We present a model-agnostic, global mechanistic interpretability method to interpret the perturbation robustness of image models. This research is motivated by two key aspects. First, previous global interpretability works, in tandem with robustness benchmarks, e.g. mean corruption error (mCE), are not designed to directly interpret the mechanisms of perturbation robustness within image models. Second, we notice that the spectral signal-to-noise ratios (SNR) of perturbed natural images exponentially decay over the frequency. This power-law-like decay implies that: Low-frequency signals are generally more robust than high-frequency signals -- yet high classification accuracy can not be ac",
    "path": "papers/24/08/2408.01139.json",
    "total_tokens": 935,
    "translated_title": "使用定理谱重要性分解解释图像模型的全局扰动鲁棒性",
    "translated_abstract": "arXiv:2408.01139v1 公告类型: 交叉 摘要: 扰动鲁棒性评估了模型对各种扰动的脆弱性，包括数据污染和 adversarial攻击。理解扰动鲁棒性的机制对于全局解释性至关重要。我们提出了一种无模型的全局机制解释性方法，用于解释图像模型的扰动鲁棒性。这项研究受到两个关键因素的启发。首先，以前的全球解释性工作与鲁棒性基准（例如平均污染错误mCE）同时进行，并不是为了直接解释图像模型中扰动鲁棒性的工作机制。其次，我们注意到，受扰自然图像的谱信噪比（SNR）随频率指数下降。这种幂律类似的下降表明：低频信号通常比高频信号更鲁棒——然而，高分类精度并不能保证模型的鲁棒性。我们还进一步洞察到，模型的鲁棒性度量-mCE和高频信号的贡献有负相关性，这意味着在高频信号较小的图像区域中，即使存在高噪声水平，模型的鲁棒性通常也很高。这些发现揭示了高频率信号在模型鲁棒性中的负面作用，并为模型结构的设计提供了上下文。例如，即使对于轻度扰动，具有良好鲁棒性的模型也倾向于在低频信号更大的空间区域中保持更高的SNR值。最后，我们在多个图像模型上进行了广泛实验，展示了该方法的有效性和洞察力。总的来说，我们的工作扩展了对图像模型鲁棒性的全球解释性理解和评估方法，有助于推动后续的模型设计、理解和优化工作。下方是该论文的英文标题和摘要，请注意，对于以下的tldr和en_tldr部分，我会总结出一个中文和英文版的概要：",
    "tldr": "该研究提出了一种无模型的全局解释性方法，用于理解和评估图像模型在全球扰动下的鲁棒性。通过分析受扰自然图像的谱信噪比随频率的指数下降趋势，揭示了低频信号在模型鲁棒性中的正面作用，并发现高频率信号的贡献与模型的鲁棒性度量负相关。这些发现有助于设计更加鲁棒的模型结构。"
}