{
    "title": "A Survey on Robotic Prosthetics: Neuroprosthetics, Soft Actuators, and Control Strategies",
    "abstract": "arXiv:2408.01729v1 Announce Type: new  Abstract: The field of robotics is a quickly evolving feat of technology that accepts contributions from various genres of science. Neuroscience, Physiology, Chemistry, Material science, Computer science, and the wide umbrella of mechatronics have all simultaneously contributed to many innovations in the prosthetic applications of robotics. This review begins with a discussion of the scope of the term robotic prosthetics and discusses the evolving domain of Neuroprosthetics. The discussion is then constrained to focus on various actuation and control strategies for robotic prosthetic limbs. This review discusses various soft robotic actuators such as EAP, SMA, FFA, etc., and the merits of such actuators over conventional hard robotic actuators. Options in control strategies for robotic prosthetics, that are in various states of research and development, are reviewed. This paper concludes the discussion with an analysis regarding the prospective di",
    "link": "https://arxiv.org/abs/2408.01729",
    "context": "Title: A Survey on Robotic Prosthetics: Neuroprosthetics, Soft Actuators, and Control Strategies\nAbstract: arXiv:2408.01729v1 Announce Type: new  Abstract: The field of robotics is a quickly evolving feat of technology that accepts contributions from various genres of science. Neuroscience, Physiology, Chemistry, Material science, Computer science, and the wide umbrella of mechatronics have all simultaneously contributed to many innovations in the prosthetic applications of robotics. This review begins with a discussion of the scope of the term robotic prosthetics and discusses the evolving domain of Neuroprosthetics. The discussion is then constrained to focus on various actuation and control strategies for robotic prosthetic limbs. This review discusses various soft robotic actuators such as EAP, SMA, FFA, etc., and the merits of such actuators over conventional hard robotic actuators. Options in control strategies for robotic prosthetics, that are in various states of research and development, are reviewed. This paper concludes the discussion with an analysis regarding the prospective di",
    "path": "papers/24/08/2408.01729.json",
    "total_tokens": 387,
    "tldr": "这篇综述探讨了机器人假肢领域，包括神经假肢、软执行器和控制策略。它概述了机器人假肢的广泛应用，并重点介绍了软机器人执行器如EAP、SMA和FFA的优势。此外，它还审查了各种控制策略和未来的潜在发展。"
}