{
    "title": "Evaluating and Enhancing LLMs Agent based on Theory of Mind in Guandan: A Multi-Player Cooperative Game under Imperfect Information",
    "abstract": "arXiv:2408.02559v1 Announce Type: cross  Abstract: Large language models (LLMs) have shown success in handling simple games with imperfect information and enabling multi-agent coordination, but their ability to facilitate practical collaboration against other agents in complex, imperfect information environments, especially in a non-English environment, still needs to be explored. This study investigates the applicability of knowledge acquired by open-source and API-based LLMs to sophisticated text-based games requiring agent collaboration under imperfect information, comparing their performance to established baselines using other types of agents. We propose a Theory of Mind (ToM) planning technique that allows LLM agents to adapt their strategy against various adversaries using only game rules, current state, and historical context as input. An external tool was incorporated to mitigate the challenge of dynamic and extensive action spaces in this card game. Our results show that alth",
    "link": "https://arxiv.org/abs/2408.02559",
    "context": "Title: Evaluating and Enhancing LLMs Agent based on Theory of Mind in Guandan: A Multi-Player Cooperative Game under Imperfect Information\nAbstract: arXiv:2408.02559v1 Announce Type: cross  Abstract: Large language models (LLMs) have shown success in handling simple games with imperfect information and enabling multi-agent coordination, but their ability to facilitate practical collaboration against other agents in complex, imperfect information environments, especially in a non-English environment, still needs to be explored. This study investigates the applicability of knowledge acquired by open-source and API-based LLMs to sophisticated text-based games requiring agent collaboration under imperfect information, comparing their performance to established baselines using other types of agents. We propose a Theory of Mind (ToM) planning technique that allows LLM agents to adapt their strategy against various adversaries using only game rules, current state, and historical context as input. An external tool was incorporated to mitigate the challenge of dynamic and extensive action spaces in this card game. Our results show that alth",
    "path": "papers/24/08/2408.02559.json",
    "total_tokens": 797,
    "translated_title": "基于心智理论的LLM代理评估与增强：在“挂戟丹”多玩家合作游戏中对不完美信息的处理",
    "translated_abstract": "arXiv:2408.02559v1 公告类型：交叉 摘要：大型语言模型（LLMs）在处理带有不完美信息的简单游戏中取得了成功，并能够在复杂的、带有不完美信息的环境中实现多代理协调，尤其是在非英语环境中，它们在实际与他人合作对抗代理的能力仍需进一步探索。本研究探讨了开源和基于API的LLMs在复杂的、需要在不完美信息环境中进行合作的文本游戏中的适用性，并将它们的性能与使用其他类型代理的现有基准进行比较。我们提出了一种心智理论（ToM）规划技术，允许LLM代理通过仅使用游戏规则、当前状态和历史上下文作为输入来适应对抗各种对手的策略。我们引入了一个外部工具来解决这种扑克游戏中动态和广泛的行动空间所面临的挑战。我们的结果表明，虽然LLM代理能够仅凭常识而成功，但他们的性能仍然依赖于具体的对手策略和游戏 dynamics，这表明了改进LLM推理和应对不完美信息挑战的潜在空间。这是研究人机合作问题的第一个研究，未来工作将集中在进一步提高LLM的性能和扩展到其他具有不同维度的多玩家文本游戏。",
    "tldr": "在“挂戟丹”多玩家合作游戏中，研究探讨了LLM代理如何基于心智理论适应应对不同对手策略，尽管促进了良好合作，但性能仍然受到特定对手策略和游戏动态的影响，展现出了改进LLM推理能力以解决信息不完美挑战的潜力。",
    "en_tdlr": "This study investigates the ability of LLM agents to adapt strategies against various adversaries in the Guandan multi-player cooperative game under imperfect information, leveraging a Theory of Mind planning technique. Although effective in achieving cooperation based on common sense, the agents' performance is shown to be influenced by specific strategies of the adversaries and game dynamics, highlighting the potential for further improving LLM reasoning capabilities to address the challenges of imperfect information."
}