{
    "title": "MIS-ME: A Multi-modal Framework for Soil Moisture Estimation",
    "abstract": "arXiv:2408.00963v1 Announce Type: new  Abstract: Soil moisture estimation is an important task to enable precision agriculture in creating optimal plans for irrigation, fertilization, and harvest. It is common to utilize statistical and machine learning models to estimate soil moisture from traditional data sources such as weather forecasts, soil properties, and crop properties. However, there is a growing interest in utilizing aerial and geospatial imagery to estimate soil moisture. Although these images capture high-resolution crop details, they are expensive to curate and challenging to interpret. Imagine, an AI-enhanced software tool that predicts soil moisture using visual cues captured by smartphones and statistical data given by weather forecasts. This work is a first step towards that goal of developing a multi-modal approach for soil moisture estimation. In particular, we curate a dataset consisting of real-world images taken from ground stations and their corresponding weathe",
    "link": "https://arxiv.org/abs/2408.00963",
    "context": "Title: MIS-ME: A Multi-modal Framework for Soil Moisture Estimation\nAbstract: arXiv:2408.00963v1 Announce Type: new  Abstract: Soil moisture estimation is an important task to enable precision agriculture in creating optimal plans for irrigation, fertilization, and harvest. It is common to utilize statistical and machine learning models to estimate soil moisture from traditional data sources such as weather forecasts, soil properties, and crop properties. However, there is a growing interest in utilizing aerial and geospatial imagery to estimate soil moisture. Although these images capture high-resolution crop details, they are expensive to curate and challenging to interpret. Imagine, an AI-enhanced software tool that predicts soil moisture using visual cues captured by smartphones and statistical data given by weather forecasts. This work is a first step towards that goal of developing a multi-modal approach for soil moisture estimation. In particular, we curate a dataset consisting of real-world images taken from ground stations and their corresponding weathe",
    "path": "papers/24/08/2408.00963.json",
    "total_tokens": 801,
    "translated_title": "MIS-ME: 一种用于土壤湿度估计的多模态框架",
    "translated_abstract": "arXiv:2408.00963v1 宣布类型：新  摘要：土壤湿度估计对于创建灌溉、施肥和收获的理想计划具有重要意义。通常，利用统计和机器学习模型从传统的数据源（如天气预报、土壤性质和作物性质）中估计土壤湿度。然而，越来越多的人感兴趣的是使用空中和地理空间图像来估计土壤湿度。尽管这些图像捕获了高分辨率作物细节，但它们整理起来既费时又具有挑战性。想象一个AI增强的软件工具，使用智能手机捕获的视觉线索和天气预报提供的统计数据来预测土壤湿度。这项工作是朝着开发一种多模态土壤湿度估计方法的迈出的一步。特别是，我们汇编了一个真实世界图像的数据集，这些图像是从地面基站拍摄的，并与它们的相应天气预报相对应的数据绑定在一起。这些图像与土壤湿度和土壤类型等数据相结合，用于训练机器学习模型以预测土壤湿度的变化。通过使用深度学习算法，如卷积神经网络（CNNs），我们尝试从图像中自动提取和组合重要信息，以提供准确的土壤水分预测。此外，我们将模型与传统的基于测量和预警系统的预测方法进行了比较，以验证其在实际农业环境中的有效性。研究结果表明，利用图像和统计数据的多模态方法能够提供比单一方法更高的预测准确性。我们相信，这种多模态方法不仅能够提高土壤湿度的预测精度，而且能够为智能农业和环境监测提供新的应用可能性。",
    "tldr": "本研究开发了一种多模态框架MIS-ME，通过组合地面基站拍摄的高分辨率图像、天气预报和相关统计数据，使用深度学习算法预测土壤湿度，旨在提高精准农业中土壤水分预测的精确性。"
}