{
    "title": "Unsupervised Detection of Fetal Brain Anomalies using Denoising Diffusion Models",
    "abstract": "arXiv:2408.03654v1 Announce Type: cross  Abstract: Congenital malformations of the brain are among the most common fetal abnormalities that impact fetal development. Previous anomaly detection methods on ultrasound images are based on supervised learning, rely on manual annotations, and risk missing underrepresented categories. In this work, we frame fetal brain anomaly detection as an unsupervised task using diffusion models. To this end, we employ an inpainting-based Noise Agnostic Anomaly Detection approach that identifies the abnormality using diffusion-reconstructed fetal brain images from multiple noise levels. Our approach only requires normal fetal brain ultrasound images for training, addressing the limited availability of abnormal data. Our experiments on a real-world clinical dataset show the potential of using unsupervised methods for fetal brain anomaly detection. Additionally, we comprehensively evaluate how different noise types affect diffusion models in the fetal anoma",
    "link": "https://arxiv.org/abs/2408.03654",
    "context": "Title: Unsupervised Detection of Fetal Brain Anomalies using Denoising Diffusion Models\nAbstract: arXiv:2408.03654v1 Announce Type: cross  Abstract: Congenital malformations of the brain are among the most common fetal abnormalities that impact fetal development. Previous anomaly detection methods on ultrasound images are based on supervised learning, rely on manual annotations, and risk missing underrepresented categories. In this work, we frame fetal brain anomaly detection as an unsupervised task using diffusion models. To this end, we employ an inpainting-based Noise Agnostic Anomaly Detection approach that identifies the abnormality using diffusion-reconstructed fetal brain images from multiple noise levels. Our approach only requires normal fetal brain ultrasound images for training, addressing the limited availability of abnormal data. Our experiments on a real-world clinical dataset show the potential of using unsupervised methods for fetal brain anomaly detection. Additionally, we comprehensively evaluate how different noise types affect diffusion models in the fetal anoma",
    "path": "papers/24/08/2408.03654.json",
    "total_tokens": 328,
    "tldr": "该文章提出了一种使用去噪扩散模型进行胎儿大脑异常的无监督检测方法，通过仅使用正常胎儿大脑超声图像进行训练，解决了异常数据稀缺的问题，并在实际临床数据集上取得了良好效果。"
}