{
    "title": "PhysMamba: Leveraging Dual-Stream Cross-Attention SSD for Remote Physiological Measurement",
    "abstract": "arXiv:2408.01077v1 Announce Type: new  Abstract: Remote Photoplethysmography (rPPG) is a non-contact technique for extracting physiological signals from facial videos, used in applications like emotion monitoring, medical assistance, and anti-face spoofing. Unlike controlled laboratory settings, real-world environments often contain motion artifacts and noise, affecting the performance of existing methods. To address this, we propose PhysMamba, a dual-stream time-frequency interactive model based on Mamba. PhysMamba integrates the state-of-the-art Mamba-2 model and employs a dual-stream architecture to learn diverse rPPG features, enhancing robustness in noisy conditions. Additionally, we designed the Cross-Attention State Space Duality (CASSD) module to improve information exchange and feature complementarity between the two streams. We validated PhysMamba using PURE, UBFC-rPPG and MMPD. Experimental results show that PhysMamba achieves state-of-the-art performance across various scen",
    "link": "https://arxiv.org/abs/2408.01077",
    "context": "Title: PhysMamba: Leveraging Dual-Stream Cross-Attention SSD for Remote Physiological Measurement\nAbstract: arXiv:2408.01077v1 Announce Type: new  Abstract: Remote Photoplethysmography (rPPG) is a non-contact technique for extracting physiological signals from facial videos, used in applications like emotion monitoring, medical assistance, and anti-face spoofing. Unlike controlled laboratory settings, real-world environments often contain motion artifacts and noise, affecting the performance of existing methods. To address this, we propose PhysMamba, a dual-stream time-frequency interactive model based on Mamba. PhysMamba integrates the state-of-the-art Mamba-2 model and employs a dual-stream architecture to learn diverse rPPG features, enhancing robustness in noisy conditions. Additionally, we designed the Cross-Attention State Space Duality (CASSD) module to improve information exchange and feature complementarity between the two streams. We validated PhysMamba using PURE, UBFC-rPPG and MMPD. Experimental results show that PhysMamba achieves state-of-the-art performance across various scen",
    "path": "papers/24/08/2408.01077.json",
    "total_tokens": 732,
    "translated_title": "PhysMamba: 利用双流跨注意力SSD进行远程生理测量",
    "translated_abstract": "arXiv:2408.01077v1 宣布类型：新  摘要：远程光电容积脉搏图（rPPG）是一种从面部视频中提取生理信号的非接触技术，用于情绪监测、医疗援助和反面部欺骗等应用。与受控的实验室环境相比，真实世界环境中经常存在运动干扰和噪声，这影响现有方法的表现。为了解决这个问题，我们提出了PhysMamba，一个基于Mamba的时间频谱交互双流模型。PhysMamba集成了最先进的Mamba-2模型，并采用了双流架构来学习多样化的rPPG特征，从而在噪声条件下提高鲁棒性。此外，我们还设计了跨注意力状态空间对偶（CASSD）模块，以改善两个流间的信息交换和特征互补性。我们使用PURE、UBFC-rPPG和MMPD验证了PhysMamba。实验结果表明，PhysMamba在各种场景中实现了最先进的表现。",
    "tldr": "本文提出了一种名为PhysMamba的模型，它结合了Mamba-2模型的状态和双流架构来增强rPPG信号在对抗噪声环境下的鲁棒性，并通过跨注意力状态空间对偶模块提升了特征互补性。",
    "en_tdlr": "This paper introduces a model called PhysMamba that combines the state of the art of Mamba-2 with a dual-stream architecture to enhance the robustness of rPPG signals in noisy environments, using a Cross-Attention State Space Duality module to improve feature complementarity."
}