{
    "title": "Hierarchical learning control for autonomous robots inspired by central nervous system",
    "abstract": "arXiv:2408.03525v1 Announce Type: new  Abstract: Mammals can generate autonomous behaviors in various complex environments through the coordination and interaction of activities at different levels of their central nervous system. In this paper, we propose a novel hierarchical learning control framework by mimicking the hierarchical structure of the central nervous system along with their coordination and interaction behaviors. The framework combines the active and passive control systems to improve both the flexibility and reliability of the control system as well as to achieve more diverse autonomous behaviors of robots. Specifically, the framework has a backbone of independent neural network controllers at different levels and takes a three-level dual descending pathway structure, inspired from the functionality of the cerebral cortex, cerebellum, and spinal cord. We comprehensively validated the proposed approach through the simulation as well as the experiment of a hexapod robot i",
    "link": "https://arxiv.org/abs/2408.03525",
    "context": "Title: Hierarchical learning control for autonomous robots inspired by central nervous system\nAbstract: arXiv:2408.03525v1 Announce Type: new  Abstract: Mammals can generate autonomous behaviors in various complex environments through the coordination and interaction of activities at different levels of their central nervous system. In this paper, we propose a novel hierarchical learning control framework by mimicking the hierarchical structure of the central nervous system along with their coordination and interaction behaviors. The framework combines the active and passive control systems to improve both the flexibility and reliability of the control system as well as to achieve more diverse autonomous behaviors of robots. Specifically, the framework has a backbone of independent neural network controllers at different levels and takes a three-level dual descending pathway structure, inspired from the functionality of the cerebral cortex, cerebellum, and spinal cord. We comprehensively validated the proposed approach through the simulation as well as the experiment of a hexapod robot i",
    "path": "papers/24/08/2408.03525.json",
    "total_tokens": 322,
    "tldr": "该文章提出了一种模仿中枢神经系统分层结构与协作互动行为的学习控制框架，旨在提升机器人控制系统的灵活性与可靠性，并实现多样化的自主行为。通过在模拟和实际实验中验证对六足机器人的应用，该框架展现了其在复杂环境下的有效性。"
}