{
    "title": "Rotation center identification based on geometric relationships for rotary motion deblurring",
    "abstract": "arXiv:2408.04171v1 Announce Type: new  Abstract: Non-blind rotary motion deblurring (RMD) aims to recover the latent clear image from a rotary motion blurred (RMB) image. The rotation center is a crucial input parameter in non-blind RMD methods. Existing methods directly estimate the rotation center from the RMB image. However they always suffer significant errors, and the performance of RMD is limited. For the assembled imaging systems, the position of the rotation center remains fixed. Leveraging this prior knowledge, we propose a geometric-based method for rotation center identification and analyze its error range. Furthermore, we construct a RMB imaging system. The experiment demonstrates that our method achieves less than 1-pixel error along a single axis (x-axis or y-axis). We utilize the constructed imaging system to capture real RMB images, and experimental results show that our method can help existing RMD approaches yield better RMD images.",
    "link": "https://arxiv.org/abs/2408.04171",
    "context": "Title: Rotation center identification based on geometric relationships for rotary motion deblurring\nAbstract: arXiv:2408.04171v1 Announce Type: new  Abstract: Non-blind rotary motion deblurring (RMD) aims to recover the latent clear image from a rotary motion blurred (RMB) image. The rotation center is a crucial input parameter in non-blind RMD methods. Existing methods directly estimate the rotation center from the RMB image. However they always suffer significant errors, and the performance of RMD is limited. For the assembled imaging systems, the position of the rotation center remains fixed. Leveraging this prior knowledge, we propose a geometric-based method for rotation center identification and analyze its error range. Furthermore, we construct a RMB imaging system. The experiment demonstrates that our method achieves less than 1-pixel error along a single axis (x-axis or y-axis). We utilize the constructed imaging system to capture real RMB images, and experimental results show that our method can help existing RMD approaches yield better RMD images.",
    "path": "papers/24/08/2408.04171.json",
    "total_tokens": 342,
    "tldr": "该文章提出一种基于几何关系的旋转中心识别方法，为非盲式旋转运动去模糊提供了精准的旋转中心，改进了现有方法的性能，并通过实验验证了其在实际旋转运动模糊图像中的有效性。"
}