{
    "title": "Hardware Aware Ensemble Selection for Balancing Predictive Accuracy and Cost",
    "abstract": "arXiv:2408.02280v1 Announce Type: cross  Abstract: Automated Machine Learning (AutoML) significantly simplifies the deployment of machine learning models by automating tasks from data preprocessing to model selection to ensembling. AutoML systems for tabular data often employ post hoc ensembling, where multiple models are combined to improve predictive accuracy. This typically results in longer inference times, a major limitation in practical deployments. Addressing this, we introduce a hardware-aware ensemble selection approach that integrates inference time into post hoc ensembling. By leveraging an existing framework for ensemble selection with quality diversity optimization, our method evaluates ensemble candidates for their predictive accuracy and hardware efficiency. This dual focus allows for a balanced consideration of accuracy and operational efficiency. Thus, our approach enables practitioners to choose from a Pareto front of accurate and efficient ensembles. Our evaluation u",
    "link": "https://arxiv.org/abs/2408.02280",
    "context": "Title: Hardware Aware Ensemble Selection for Balancing Predictive Accuracy and Cost\nAbstract: arXiv:2408.02280v1 Announce Type: cross  Abstract: Automated Machine Learning (AutoML) significantly simplifies the deployment of machine learning models by automating tasks from data preprocessing to model selection to ensembling. AutoML systems for tabular data often employ post hoc ensembling, where multiple models are combined to improve predictive accuracy. This typically results in longer inference times, a major limitation in practical deployments. Addressing this, we introduce a hardware-aware ensemble selection approach that integrates inference time into post hoc ensembling. By leveraging an existing framework for ensemble selection with quality diversity optimization, our method evaluates ensemble candidates for their predictive accuracy and hardware efficiency. This dual focus allows for a balanced consideration of accuracy and operational efficiency. Thus, our approach enables practitioners to choose from a Pareto front of accurate and efficient ensembles. Our evaluation u",
    "path": "papers/24/08/2408.02280.json",
    "total_tokens": 715,
    "translated_title": "硬件自适应集成选择方法以平衡预测准确性和成本",
    "translated_abstract": "arXiv:2408.02280v1 公告类型: 交叉  翻译摘要: 自动机器学习 (AutoML) 在简化机器学习模型部署方面发挥了巨大作用，它自动化了从数据预处理到模型选择再到集成的一系列任务。针对表格数据的AutoML系统通常采用后验集成方法，该方法通过结合多个模型来提高预测准确性。这通常会导致更长的推理时间，这在实际部署中是一个主要限制。为了解决这个问题，我们提出了一种面向硬件的集成选择方法，该方法将推理时间整合到后验集成中。通过利用现有的集成选择框架，该框架采用质量多样性优化，我们的方法对候选集合的预测准确性和硬件效率进行了评估。这种双重焦点使人们能够从准确性和效率的帕累托前沿中进行选择。我们的评估使用合集能够根据服务器硬件和机器学习任务的细节，在预测精度、集成大小和推理时间之间取得权衡。这种方法验证了在保持高预测精度同时提高集成功率的潜力，适合部署在资源有限或成本敏感的生产环境中。",
    "tldr": "本文提出了一种面向硬件的集成选择方法，该方法将推理时间整合到后验集成中，以在预测准确性和推理效率之间取得平衡。我们的方法可以在保持高预测精度的同时提高集成功率，适合部署在资源有限或成本敏感的生产环境中。"
}