{
    "title": "AgentPeerTalk: Empowering Students through Agentic-AI-Driven Discernment of Bullying and Joking in Peer Interactions in Schools",
    "abstract": "arXiv:2408.01459v1 Announce Type: cross  Abstract: Addressing school bullying effectively and promptly is crucial for the mental health of students. This study examined the potential of large language models (LLMs) to empower students by discerning between bullying and joking in school peer interactions. We employed ChatGPT-4, Gemini 1.5 Pro, and Claude 3 Opus, evaluating their effectiveness through human review. Our results revealed that not all LLMs were suitable for an agentic approach, with ChatGPT-4 showing the most promise. We observed variations in LLM outputs, possibly influenced by political overcorrectness, context window limitations, and pre-existing bias in their training data. ChatGPT-4 excelled in context-specific accuracy after implementing the agentic approach, highlighting its potential to provide continuous, real-time support to vulnerable students. This study underlines the significant social impact of using agentic AI in educational settings, offering a new avenue f",
    "link": "https://arxiv.org/abs/2408.01459",
    "context": "Title: AgentPeerTalk: Empowering Students through Agentic-AI-Driven Discernment of Bullying and Joking in Peer Interactions in Schools\nAbstract: arXiv:2408.01459v1 Announce Type: cross  Abstract: Addressing school bullying effectively and promptly is crucial for the mental health of students. This study examined the potential of large language models (LLMs) to empower students by discerning between bullying and joking in school peer interactions. We employed ChatGPT-4, Gemini 1.5 Pro, and Claude 3 Opus, evaluating their effectiveness through human review. Our results revealed that not all LLMs were suitable for an agentic approach, with ChatGPT-4 showing the most promise. We observed variations in LLM outputs, possibly influenced by political overcorrectness, context window limitations, and pre-existing bias in their training data. ChatGPT-4 excelled in context-specific accuracy after implementing the agentic approach, highlighting its potential to provide continuous, real-time support to vulnerable students. This study underlines the significant social impact of using agentic AI in educational settings, offering a new avenue f",
    "path": "papers/24/08/2408.01459.json",
    "total_tokens": 407,
    "tldr": "该文章提出一个名为AgentPeerTalk的新型方案，使用先进的AI模型如ChatGPT 4来区分学生之间的欺凌和戏谑行为，旨在对学生进行有效及时的保护和干预。研究发现ChatGPT 4在实际应用中能够提供相对较为准确的判断，对于敏感的社交互动情境具有很好的适应性。通过这种“代理AI”的方式，学生可以得到持续的实时支持，有助于创建一个更安全的校园环境。"
}