{
    "title": "Transferable Adversarial Facial Images for Privacy Protection",
    "abstract": "arXiv:2408.01428v1 Announce Type: new  Abstract: The success of deep face recognition (FR) systems has raised serious privacy concerns due to their ability to enable unauthorized tracking of users in the digital world. Previous studies proposed introducing imperceptible adversarial noises into face images to deceive those face recognition models, thus achieving the goal of enhancing facial privacy protection. Nevertheless, they heavily rely on user-chosen references to guide the generation of adversarial noises, and cannot simultaneously construct natural and highly transferable adversarial face images in black-box scenarios. In light of this, we present a novel face privacy protection scheme with improved transferability while maintain high visual quality. We propose shaping the entire face space directly instead of exploiting one kind of facial characteristic like makeup information to integrate adversarial noises. To achieve this goal, we first exploit global adversarial latent sear",
    "link": "https://arxiv.org/abs/2408.01428",
    "context": "Title: Transferable Adversarial Facial Images for Privacy Protection\nAbstract: arXiv:2408.01428v1 Announce Type: new  Abstract: The success of deep face recognition (FR) systems has raised serious privacy concerns due to their ability to enable unauthorized tracking of users in the digital world. Previous studies proposed introducing imperceptible adversarial noises into face images to deceive those face recognition models, thus achieving the goal of enhancing facial privacy protection. Nevertheless, they heavily rely on user-chosen references to guide the generation of adversarial noises, and cannot simultaneously construct natural and highly transferable adversarial face images in black-box scenarios. In light of this, we present a novel face privacy protection scheme with improved transferability while maintain high visual quality. We propose shaping the entire face space directly instead of exploiting one kind of facial characteristic like makeup information to integrate adversarial noises. To achieve this goal, we first exploit global adversarial latent sear",
    "path": "papers/24/08/2408.01428.json",
    "total_tokens": 322,
    "tldr": "该文章提出了一种新的方案，旨在提高人脸隐私保护的同时保持高视觉质量。通过直接塑造整个面部空间而不是仅利用某种面部特征（如妆容信息）来整合对抗性噪声，研究者成功地在黑盒环境中制作出逼真且高度迁移性的对抗性人脸图像。"
}