{
    "title": "Improvement and Empirical Testing of a Novel Autonomous Microplastics-Collecting Semisubmersible",
    "abstract": "arXiv:2408.02162v1 Announce Type: new  Abstract: Since their invention, plastics have become ubiquitous in modern societies all around the world, and their impact on the environment has, in recent years, become nearly as well-known. Plastics produced by humans have reached nearly every corner of the world, and throughout their centuries-long lifetimes, plastics continually break down into smaller and smaller particles due to the physical stresses which they are subjected to. These stresses eventually, inevitably, break these plastics down into microplastics -pieces of plastic small enough to be consumed by organisms in bodies of water throughout the globe. These microplastics can very easily bioaccumulate, and have been found everywhere from the Great Lakes to the bloodstreams of humans. The effects of these plastics are poorly understood, however, they have been linked to infertility, halted growth, and a host of other maladies in aquatic organisms. Currently, removal of these plastic",
    "link": "https://arxiv.org/abs/2408.02162",
    "context": "Title: Improvement and Empirical Testing of a Novel Autonomous Microplastics-Collecting Semisubmersible\nAbstract: arXiv:2408.02162v1 Announce Type: new  Abstract: Since their invention, plastics have become ubiquitous in modern societies all around the world, and their impact on the environment has, in recent years, become nearly as well-known. Plastics produced by humans have reached nearly every corner of the world, and throughout their centuries-long lifetimes, plastics continually break down into smaller and smaller particles due to the physical stresses which they are subjected to. These stresses eventually, inevitably, break these plastics down into microplastics -pieces of plastic small enough to be consumed by organisms in bodies of water throughout the globe. These microplastics can very easily bioaccumulate, and have been found everywhere from the Great Lakes to the bloodstreams of humans. The effects of these plastics are poorly understood, however, they have been linked to infertility, halted growth, and a host of other maladies in aquatic organisms. Currently, removal of these plastic",
    "path": "papers/24/08/2408.02162.json",
    "total_tokens": 333,
    "tldr": "该文章提出并验证了一种新型的自适应微塑料收集半潜水平台，旨在改善微塑料在海水中的清除效率，并研究了其对海洋环境改善的实际贡献。"
}