{
    "title": "Single-tap Latency Reduction with Single- or Double- tap Prediction",
    "abstract": "arXiv:2408.02525v1 Announce Type: cross  Abstract: Touch surfaces are widely utilized for smartphones, tablet PCs, and laptops (touchpad), and single and double taps are the most basic and common operations on them. The detection of single or double taps causes the single-tap latency problem, which creates a bottleneck in terms of the sensitivity of touch inputs. To reduce the single-tap latency, we propose a novel machine-learning-based tap prediction method called PredicTaps. Our method predicts whether a detected tap is a single tap or the first contact of a double tap without having to wait for the hundreds of milliseconds conventionally required. We present three evaluations and one user evaluation that demonstrate its broad applicability and usability for various tap situations on two form factors (touchpad and smartphone). The results showed PredicTaps reduces the single-tap latency from 150-500 ms to 12 ms on laptops and to 17.6 ms on smartphones without reducing usability.",
    "link": "https://arxiv.org/abs/2408.02525",
    "context": "Title: Single-tap Latency Reduction with Single- or Double- tap Prediction\nAbstract: arXiv:2408.02525v1 Announce Type: cross  Abstract: Touch surfaces are widely utilized for smartphones, tablet PCs, and laptops (touchpad), and single and double taps are the most basic and common operations on them. The detection of single or double taps causes the single-tap latency problem, which creates a bottleneck in terms of the sensitivity of touch inputs. To reduce the single-tap latency, we propose a novel machine-learning-based tap prediction method called PredicTaps. Our method predicts whether a detected tap is a single tap or the first contact of a double tap without having to wait for the hundreds of milliseconds conventionally required. We present three evaluations and one user evaluation that demonstrate its broad applicability and usability for various tap situations on two form factors (touchpad and smartphone). The results showed PredicTaps reduces the single-tap latency from 150-500 ms to 12 ms on laptops and to 17.6 ms on smartphones without reducing usability.",
    "path": "papers/24/08/2408.02525.json",
    "total_tokens": 712,
    "translated_title": "单击延迟减少与单击或双击预测",
    "translated_abstract": "arXiv:2408.02525v1 公告类型：交叉  摘要：智能手机、平板电脑和笔记本电脑（触控板）上广泛使用触摸表面，单击和双击是最基本的也是最常用的操作。单或双击的检测导致单击延迟问题，这在触控输入的敏感性方面形成了一个性能瓶颈。为了减少单击延迟，我们提出了一种新的基于机器学习的点击预测方法，称为PredicTaps。我们的方法无需等待传统的数百毫秒，就能预测检测到的点击是单击还是双击的第一接触点。我们提出了三个评估和一个用户评估，展示了它在各种点击情况下的广泛适用性和在不同形式因子的触摸板和平板电脑上的可用性（触摸板和平板电脑）。结果表明，PredicTaps在不降低可用性的情况下，将笔记本电脑的单击延迟从150-500毫秒降低到12毫秒，将智能手机的单击延迟降低到17.6毫秒。",
    "tldr": "本文提出了一种新的机器学习方法PredicTaps，可以在单击或双击出现之前预测检测到的点击是单击还是双击的第一接触点，从而显著减少了用户在触摸屏设备上的单击延迟。"
}