{
    "title": "A Decomposition of Interaction Force for Multi-Agent Co-Manipulation",
    "abstract": "arXiv:2408.01543v1 Announce Type: new  Abstract: Multi-agent human-robot co-manipulation is a poorly understood process with many inputs that potentially affect agent behavior. This paper explores one such input known as interaction force. Interaction force is potentially a primary component in communication that occurs during co-manipulation. There are, however, many different perspectives and definitions of interaction force in the literature. Therefore, a decomposition of interaction force is proposed that provides a consistent way of ascertaining the state of an agent relative to the group for multi-agent co-manipulation. This proposed method extends a current definition from one to four degrees of freedom, does not rely on a predefined object path, and is independent of the number of agents acting on the system and their locations and input wrenches (forces and torques). In addition, all of the necessary measures can be obtained by a self-contained robotic system, allowing for a m",
    "link": "https://arxiv.org/abs/2408.01543",
    "context": "Title: A Decomposition of Interaction Force for Multi-Agent Co-Manipulation\nAbstract: arXiv:2408.01543v1 Announce Type: new  Abstract: Multi-agent human-robot co-manipulation is a poorly understood process with many inputs that potentially affect agent behavior. This paper explores one such input known as interaction force. Interaction force is potentially a primary component in communication that occurs during co-manipulation. There are, however, many different perspectives and definitions of interaction force in the literature. Therefore, a decomposition of interaction force is proposed that provides a consistent way of ascertaining the state of an agent relative to the group for multi-agent co-manipulation. This proposed method extends a current definition from one to four degrees of freedom, does not rely on a predefined object path, and is independent of the number of agents acting on the system and their locations and input wrenches (forces and torques). In addition, all of the necessary measures can be obtained by a self-contained robotic system, allowing for a m",
    "path": "papers/24/08/2408.01543.json",
    "total_tokens": 627,
    "translated_title": "多代理协同操纵力分解研究",
    "translated_abstract": "arXiv:2408.01543v1 公告类型: 新 Abstract: 多代理人类-机器人协同操纵是一个具有许多输入因素的过程，这些因素可能会影响代理的行为。本文探讨了一个名为相互作用力的输入因素。在协同操纵中，相互作用力可能是代理人之间通信的主要组成部分。然而，在文献中存在许多不同的相互作用力的观点和定义。因此，本文提出了一个相互作用力的分解方法，该方法为多代理协同操纵提供了一种确定代理相对于群体的状态的方法。该提议的方法扩展了文献中现有的定义，从一维扩展到了四维自由度，不需要预定义的物体路径，也不依赖于系统中的代理数量、位置以及输入力矩（力和扭矩）。此外，所有必要的测量方法可以由一个自我包含的机器人系统获得，从而允许多代理协同操纵实施不依赖于外部信息的复杂任务。",
    "tldr": "论文提出了一种将多代理协同操纵中的相互作用力分解的方法，使得各个代理能够独立于外部的信息进行复杂的任务执行。",
    "en_tdlr": "This paper proposes a method for decomposing interaction force in multi-agent human-robot co-manipulation, enabling agents to perform complex tasks independently of external information."
}