{
    "title": "A Comparative Analysis of CNN-based Deep Learning Models for Landslide Detection",
    "abstract": "arXiv:2408.01692v1 Announce Type: new  Abstract: Landslides inflict substantial societal and economic damage, underscoring their global significance as recurrent and destructive natural disasters. Recent landslides in northern parts of India and Nepal have caused significant disruption, damaging infrastructure and posing threats to local communities. Convolutional Neural Networks (CNNs), a type of deep learning technique, have shown remarkable success in image processing. Because of their sophisticated architectures, advanced CNN-based models perform better in landslide detection than conventional algorithms. The purpose of this work is to investigate CNNs' potential in more detail, with an emphasis on comparison of CNN based models for better landslide detection. We compared four traditional semantic segmentation models (U-Net, LinkNet, PSPNet, and FPN) and utilized the ResNet50 backbone encoder to implement them. Moreover, we have experimented with the hyperparameters such as learnin",
    "link": "https://arxiv.org/abs/2408.01692",
    "context": "Title: A Comparative Analysis of CNN-based Deep Learning Models for Landslide Detection\nAbstract: arXiv:2408.01692v1 Announce Type: new  Abstract: Landslides inflict substantial societal and economic damage, underscoring their global significance as recurrent and destructive natural disasters. Recent landslides in northern parts of India and Nepal have caused significant disruption, damaging infrastructure and posing threats to local communities. Convolutional Neural Networks (CNNs), a type of deep learning technique, have shown remarkable success in image processing. Because of their sophisticated architectures, advanced CNN-based models perform better in landslide detection than conventional algorithms. The purpose of this work is to investigate CNNs' potential in more detail, with an emphasis on comparison of CNN based models for better landslide detection. We compared four traditional semantic segmentation models (U-Net, LinkNet, PSPNet, and FPN) and utilized the ResNet50 backbone encoder to implement them. Moreover, we have experimented with the hyperparameters such as learnin",
    "path": "papers/24/08/2408.01692.json",
    "total_tokens": 723,
    "translated_title": "基于CNN的深度学习模型在滑坡检测中的比较分析",
    "translated_abstract": "arXiv:2408.01692v1 公告类型：新  摘要：滑坡对社会的经济造成了重大损失，突显了它们作为全球范围内的频繁和破坏性自然灾害的重要性。印度和尼泊尔北部地区最近发生的滑坡造成了严重的破坏，损坏了基础设施，并对当地社区构成了威胁。卷积神经网络（CNNs）是一种深度学习技术，在图像处理领域表现出惊人的成功。由于其复杂的架构和高级的CNN-based模型在滑坡检测方面优于传统的算法。这项工作旨在更详细地研究CNNs的潜力，并着重于对基于CNN的模型进行比较，以便更好地进行滑坡检测。我们对四种传统的语义分割模型（U-Net、LinkNet、PSPNet和FPN）进行了比较，并将ResNet50 backbone encoder应用于它们。此外，我们还实验了诸如学习率、批大小和训练 epoch 等超参数对性能的影响。最后，我们通过随机森林分类器和多光谱遥感数据进行了实验评估，结果表明所提出的模型能够有效检测滑坡并提高了检测精度。",
    "tldr": "这篇论文比较了四种传统语义分割模型（U-Net、LinkNet、PSPNet和FPN）和ResNet50 backbone encoder的应用，通过实验评估证明所提出的模型可以有效检测滑坡并提高检测精度。"
}