{
    "title": "SCOPE: A Synthetic Multi-Modal Dataset for Collective Perception Including Physical-Correct Weather Conditions",
    "abstract": "arXiv:2408.03065v1 Announce Type: new  Abstract: Collective perception has received considerable attention as a promising approach to overcome occlusions and limited sensing ranges of vehicle-local perception in autonomous driving. In order to develop and test novel collective perception technologies, appropriate datasets are required. These datasets must include not only different environmental conditions, as they strongly influence the perception capabilities, but also a wide range of scenarios with different road users as well as realistic sensor models. Therefore, we propose the Synthetic COllective PErception (SCOPE) dataset. SCOPE is the first synthetic multi-modal dataset that incorporates realistic camera and LiDAR models as well as parameterized and physically accurate weather simulations for both sensor types. The dataset contains 17,600 frames from over 40 diverse scenarios with up to 24 collaborative agents, infrastructure sensors, and passive traffic, including cyclists an",
    "link": "https://arxiv.org/abs/2408.03065",
    "context": "Title: SCOPE: A Synthetic Multi-Modal Dataset for Collective Perception Including Physical-Correct Weather Conditions\nAbstract: arXiv:2408.03065v1 Announce Type: new  Abstract: Collective perception has received considerable attention as a promising approach to overcome occlusions and limited sensing ranges of vehicle-local perception in autonomous driving. In order to develop and test novel collective perception technologies, appropriate datasets are required. These datasets must include not only different environmental conditions, as they strongly influence the perception capabilities, but also a wide range of scenarios with different road users as well as realistic sensor models. Therefore, we propose the Synthetic COllective PErception (SCOPE) dataset. SCOPE is the first synthetic multi-modal dataset that incorporates realistic camera and LiDAR models as well as parameterized and physically accurate weather simulations for both sensor types. The dataset contains 17,600 frames from over 40 diverse scenarios with up to 24 collaborative agents, infrastructure sensors, and passive traffic, including cyclists an",
    "path": "papers/24/08/2408.03065.json",
    "total_tokens": 355,
    "tldr": "该文章提出了一种名为SCOPE的合成多模态数据集，用于集体感知研究。该数据集包括多种环境和天气条件下的传感器模拟，特别是物理准确的风雨模拟，为开发和测试新型集体感知技术提供了基础。SCOPE数据集通过模拟现实的传感器数据和复杂的交通场景，促进了自动驾驶和车辆感知领域的技术创新。"
}