{
    "title": "Cross Psuedo Supervision Framework for Sparsely Labelled Geo-spatial Images",
    "abstract": "arXiv:2408.02382v1 Announce Type: new  Abstract: Land Use Land Cover (LULC) mapping is essential for urban and resource planning and is one of the key elements in developing smart and sustainable cities. This study introduces a semi-supervised segmentation model for LULC prediction using high-resolution satellite images with a huge diversity in data distributions in different areas from the country of India. Our approach ensures a robust generalization across different types of buildings, roads, trees, and water bodies within these distinct areas. We propose a modified Cross Pseudo Supervision framework to train image segmentation models on sparsely labelled data. The proposed framework addresses the limitations of the popular \"Cross Pseudo Supervision\" technique for semi-supervised learning. Specifically, it tackles the challenges of training segmentation models on noisy satellite image data with sparse and inaccurate labels. This comprehensive approach enhances the accuracy and utili",
    "link": "https://arxiv.org/abs/2408.02382",
    "context": "Title: Cross Psuedo Supervision Framework for Sparsely Labelled Geo-spatial Images\nAbstract: arXiv:2408.02382v1 Announce Type: new  Abstract: Land Use Land Cover (LULC) mapping is essential for urban and resource planning and is one of the key elements in developing smart and sustainable cities. This study introduces a semi-supervised segmentation model for LULC prediction using high-resolution satellite images with a huge diversity in data distributions in different areas from the country of India. Our approach ensures a robust generalization across different types of buildings, roads, trees, and water bodies within these distinct areas. We propose a modified Cross Pseudo Supervision framework to train image segmentation models on sparsely labelled data. The proposed framework addresses the limitations of the popular \"Cross Pseudo Supervision\" technique for semi-supervised learning. Specifically, it tackles the challenges of training segmentation models on noisy satellite image data with sparse and inaccurate labels. This comprehensive approach enhances the accuracy and utili",
    "path": "papers/24/08/2408.02382.json",
    "total_tokens": 811,
    "translated_title": "跨伪监督框架用于稀疏标注地理空间图像",
    "translated_abstract": "arXiv:2408.02382v1 新闻类型：新  摘要：土地使用土地覆盖（LULC）映射对于城市和资源规划至关重要，是发展智能和可持续城市的关键组成部分之一。本研究介绍了一种半监督分割模型，用于使用来自印度不同地区的多样性数据分布的高分辨率卫星图像进行LULC预测。我们的方法确保在different areas不同的地区内对建筑物、道路、树木和水体进行robust generalization稳健泛化。我们提出了一种经过修改的跨伪监督框架，用于在稀疏标注数据上训练图像分割模型。该提出的框架解决了半监督学习中流行的“跨伪监督”技术的一些限制。特别是，它解决了在带有sparse和inaccurate标签的noisy卫星图像数据上训练分割模型的挑战。这种全面的approach方法增强了模型在truncated edge area修剪边缘区域内的精准度和utility实用性。双向labeling methods反向标注方法在这些边缘区域内分割表现不佳，引入了significant bias极大的偏差。通过跨伪监督的改进，我们提出了一个先验的，intrinsic faithfulness intrinsic 相符性约束，以enhance 增强模型的CAUSALITY因果性。此外，我们还摒弃了泛化到整个feature space特征空间的概念，而是专注于 fine-grained 细致的segmentation细节分割，这对urban planning城市规划非常有益。Our proposed framework significantly outperforms conventional semisupervised models on various benchmarks. These experiments demonstrate the robustness and effectiveness of our approach, paving the way for cost-effective and efficient mapping strategies in resource-scarce urban environments.",
    "tldr": "本研究提出了一种改进的跨伪监督框架，用于在稀疏标注的高分辨率卫星图像上训练精确的土地使用土地覆盖（LULC）分割模型，尤其适用于资源有限的繁忙城市环境。"
}