{
    "title": "Doubly Stochastic Adaptive Neighbors Clustering via the Marcus Mapping",
    "abstract": "arXiv:2408.02932v1 Announce Type: cross  Abstract: Clustering is a fundamental task in machine learning and data science, and similarity graph-based clustering is an important approach within this domain. Doubly stochastic symmetric similarity graphs provide numerous benefits for clustering problems and downstream tasks, yet learning such graphs remains a significant challenge. Marcus theorem states that a strictly positive symmetric matrix can be transformed into a doubly stochastic symmetric matrix by diagonal matrices. However, in clustering, learning sparse matrices is crucial for computational efficiency. We extend Marcus theorem by proposing the Marcus mapping, which indicates that certain sparse matrices can also be transformed into doubly stochastic symmetric matrices via diagonal matrices. Additionally, we introduce rank constraints into the clustering problem and propose the Doubly Stochastic Adaptive Neighbors Clustering algorithm based on the Marcus Mapping (ANCMM). This en",
    "link": "https://arxiv.org/abs/2408.02932",
    "context": "Title: Doubly Stochastic Adaptive Neighbors Clustering via the Marcus Mapping\nAbstract: arXiv:2408.02932v1 Announce Type: cross  Abstract: Clustering is a fundamental task in machine learning and data science, and similarity graph-based clustering is an important approach within this domain. Doubly stochastic symmetric similarity graphs provide numerous benefits for clustering problems and downstream tasks, yet learning such graphs remains a significant challenge. Marcus theorem states that a strictly positive symmetric matrix can be transformed into a doubly stochastic symmetric matrix by diagonal matrices. However, in clustering, learning sparse matrices is crucial for computational efficiency. We extend Marcus theorem by proposing the Marcus mapping, which indicates that certain sparse matrices can also be transformed into doubly stochastic symmetric matrices via diagonal matrices. Additionally, we introduce rank constraints into the clustering problem and propose the Doubly Stochastic Adaptive Neighbors Clustering algorithm based on the Marcus Mapping (ANCMM). This en",
    "path": "papers/24/08/2408.02932.json",
    "total_tokens": 321,
    "tldr": "该文章提出了一种基于Marcus映射的改进算法，通过引入秩限制，实现了稀疏矩阵到双重可导对称矩阵的转换，从而为聚类问题提供了一种新型的稀疏聚类方法，提高了聚类效率并保持了聚类的可导性。"
}