{
    "title": "RiskAwareBench: Towards Evaluating Physical Risk Awareness for High-level Planning of LLM-based Embodied Agents",
    "abstract": "arXiv:2408.04449v1 Announce Type: new  Abstract: The integration of large language models (LLMs) into robotics significantly enhances the capabilities of embodied agents in understanding and executing complex natural language instructions. However, the unmitigated deployment of LLM-based embodied systems in real-world environments may pose potential physical risks, such as property damage and personal injury. Existing security benchmarks for LLMs overlook risk awareness for LLM-based embodied agents. To address this gap, we propose RiskAwareBench, an automated framework designed to assess physical risks awareness in LLM-based embodied agents. RiskAwareBench consists of four modules: safety tips generation, risky scene generation, plan generation, and evaluation, enabling comprehensive risk assessment with minimal manual intervention. Utilizing this framework, we compile the PhysicalRisk dataset, encompassing diverse scenarios with associated safety tips, observations, and instructions.",
    "link": "https://arxiv.org/abs/2408.04449",
    "context": "Title: RiskAwareBench: Towards Evaluating Physical Risk Awareness for High-level Planning of LLM-based Embodied Agents\nAbstract: arXiv:2408.04449v1 Announce Type: new  Abstract: The integration of large language models (LLMs) into robotics significantly enhances the capabilities of embodied agents in understanding and executing complex natural language instructions. However, the unmitigated deployment of LLM-based embodied systems in real-world environments may pose potential physical risks, such as property damage and personal injury. Existing security benchmarks for LLMs overlook risk awareness for LLM-based embodied agents. To address this gap, we propose RiskAwareBench, an automated framework designed to assess physical risks awareness in LLM-based embodied agents. RiskAwareBench consists of four modules: safety tips generation, risky scene generation, plan generation, and evaluation, enabling comprehensive risk assessment with minimal manual intervention. Utilizing this framework, we compile the PhysicalRisk dataset, encompassing diverse scenarios with associated safety tips, observations, and instructions.",
    "path": "papers/24/08/2408.04449.json",
    "total_tokens": 392,
    "tldr": "该文章提出了一种自动化框架RiskAwareBench，旨在评估基于大型语言模型的智能体在现实环境中执行任务时的物理风险意识。通过包含四个模块，即安全提示生成、危险场景生成、计划生成和评估，该框架能够对智能体进行全面的风险评估，并且需要很少的人工干预。同时，文章还创建了一个名为PhysicalRisk的数据集，包含了多样化的场景、相应的安全提示和操作指令，以促进对风险意识建模的研究。"
}