{
    "title": "Generative Language Models with Retrieval Augmented Generation for Automated Short Answer Scoring",
    "abstract": "arXiv:2408.03811v1 Announce Type: cross  Abstract: Automated Short Answer Scoring (ASAS) is a critical component in educational assessment. While traditional ASAS systems relied on rule-based algorithms or complex deep learning methods, recent advancements in Generative Language Models (GLMs) offer new opportunities for improvement. This study explores the application of GLMs to ASAS, leveraging their off-the-shelf capabilities and performance in various domains. We propose a novel pipeline that combines vector databases, transformer-based encoders, and GLMs to enhance short answer scoring accuracy. Our approach stores training responses in a vector database, retrieves semantically similar responses during inference, and employs a GLM to analyze these responses and determine appropriate scores. We further optimize the system through fine-tuned retrieval processes and prompt engineering. Evaluation on the SemEval 2013 dataset demonstrates a significant improvement on the SCIENTSBANK 3-w",
    "link": "https://arxiv.org/abs/2408.03811",
    "context": "Title: Generative Language Models with Retrieval Augmented Generation for Automated Short Answer Scoring\nAbstract: arXiv:2408.03811v1 Announce Type: cross  Abstract: Automated Short Answer Scoring (ASAS) is a critical component in educational assessment. While traditional ASAS systems relied on rule-based algorithms or complex deep learning methods, recent advancements in Generative Language Models (GLMs) offer new opportunities for improvement. This study explores the application of GLMs to ASAS, leveraging their off-the-shelf capabilities and performance in various domains. We propose a novel pipeline that combines vector databases, transformer-based encoders, and GLMs to enhance short answer scoring accuracy. Our approach stores training responses in a vector database, retrieves semantically similar responses during inference, and employs a GLM to analyze these responses and determine appropriate scores. We further optimize the system through fine-tuned retrieval processes and prompt engineering. Evaluation on the SemEval 2013 dataset demonstrates a significant improvement on the SCIENTSBANK 3-w",
    "path": "papers/24/08/2408.03811.json",
    "total_tokens": 323,
    "tldr": "该文章提出的模型结合了向量数据库和GLM技术，通过改进的检索过程和提示工程，在ASAS领域实现了显著的性能提升。"
}