{
    "title": "SPIdepth: Strengthened Pose Information for Self-supervised Monocular Depth Estimation",
    "abstract": "arXiv:2404.12501v2 Announce Type: replace  Abstract: Self-supervised monocular depth estimation has garnered considerable attention for its applications in autonomous driving and robotics. While recent methods have made strides in leveraging techniques like the Self Query Layer (SQL) to infer depth from motion, they often overlook the potential of strengthening pose information. In this paper, we introduce SPIdepth, a novel approach that prioritizes enhancing the pose network for improved depth estimation. Building upon the foundation laid by SQL, SPIdepth emphasizes the importance of pose information in capturing fine-grained scene structures. By enhancing the pose network's capabilities, SPIdepth achieves remarkable advancements in scene understanding and depth estimation. Experimental results on benchmark datasets such as KITTI, Cityscapes, and Make3D showcase SPIdepth's state-of-the-art performance, surpassing previous methods by significant margins. Specifically, SPIdepth tops the",
    "link": "https://arxiv.org/abs/2404.12501",
    "context": "Title: SPIdepth: Strengthened Pose Information for Self-supervised Monocular Depth Estimation\nAbstract: arXiv:2404.12501v2 Announce Type: replace  Abstract: Self-supervised monocular depth estimation has garnered considerable attention for its applications in autonomous driving and robotics. While recent methods have made strides in leveraging techniques like the Self Query Layer (SQL) to infer depth from motion, they often overlook the potential of strengthening pose information. In this paper, we introduce SPIdepth, a novel approach that prioritizes enhancing the pose network for improved depth estimation. Building upon the foundation laid by SQL, SPIdepth emphasizes the importance of pose information in capturing fine-grained scene structures. By enhancing the pose network's capabilities, SPIdepth achieves remarkable advancements in scene understanding and depth estimation. Experimental results on benchmark datasets such as KITTI, Cityscapes, and Make3D showcase SPIdepth's state-of-the-art performance, surpassing previous methods by significant margins. Specifically, SPIdepth tops the",
    "path": "papers/24/04/2404.12501.json",
    "total_tokens": 664,
    "translated_title": "SPIdepth: 强化姿势信息用于自监督的单目深度估计",
    "translated_abstract": "arXiv:2404.12501v2 公告类型: 替换  翻译摘要: 自监督的单目深度估计由于其在自动驾驶和机器人学领域的应用而受到了广泛关注。虽然最近的方法已经在利用诸如自查询层(SQL)这样的技术从运动中推断深度方面取得了进展，但它们往往忽视了加强姿势信息潜力的重要性。在本论文中，我们提出了一种名为SPIdepth的新方法，该方法注重加强姿势网络以提高深度估计。SPIdepth建立在SQL基础之上，强调了姿势信息在捕捉精细场景结构中的重要性。通过加强姿势网络的能力，SPIdepth在场景理解和深度估计方面取得了显著的进步。在KITTI、Cityscapes和Make3D等基准数据集上的实验结果展示了SPIdepth的先进性能，在多个方面明显超过了先前的方法。特别是，SPIdepth在目标识别、实例分割和深度估计方面取得了卓越的成绩，它采用了自监督学习框架，大大提高了模型的鲁棒性和准确性。",
    "tldr": "SPIdepth通过强化姿势网络，在自监督单目深度估计中实现了对场景细节的高级捕捉和提升。",
    "en_tdlr": "SPIdepth achieves enhanced scene detail capture and improvements in self-supervised monocular depth estimation by strengthening the pose network."
}