{
    "title": "A Survey on Deep Learning for Theorem Proving",
    "abstract": "arXiv:2404.09939v2 Announce Type: replace  Abstract: Theorem proving is a fundamental aspect of mathematics, spanning from informal reasoning in natural language to rigorous derivations in formal systems. In recent years, the advancement of deep learning, especially the emergence of large language models, has sparked a notable surge of research exploring these techniques to enhance the process of theorem proving. This paper presents a comprehensive survey of deep learning for theorem proving by offering (i) a thorough review of existing approaches across various tasks such as autoformalization, premise selection, proofstep generation, and proof search; (ii) an extensive summary of curated datasets and strategies for synthetic data generation; (iii) a detailed analysis of evaluation metrics and the performance of state-of-the-art methods; and (iv) a critical discussion on the persistent challenges and the promising avenues for future exploration. Our survey aims to serve as a foundation",
    "link": "https://arxiv.org/abs/2404.09939",
    "context": "Title: A Survey on Deep Learning for Theorem Proving\nAbstract: arXiv:2404.09939v2 Announce Type: replace  Abstract: Theorem proving is a fundamental aspect of mathematics, spanning from informal reasoning in natural language to rigorous derivations in formal systems. In recent years, the advancement of deep learning, especially the emergence of large language models, has sparked a notable surge of research exploring these techniques to enhance the process of theorem proving. This paper presents a comprehensive survey of deep learning for theorem proving by offering (i) a thorough review of existing approaches across various tasks such as autoformalization, premise selection, proofstep generation, and proof search; (ii) an extensive summary of curated datasets and strategies for synthetic data generation; (iii) a detailed analysis of evaluation metrics and the performance of state-of-the-art methods; and (iv) a critical discussion on the persistent challenges and the promising avenues for future exploration. Our survey aims to serve as a foundation",
    "path": "papers/24/04/2404.09939.json",
    "total_tokens": 356,
    "tldr": "该文章详细介绍了深度学习在定理证明领域的应用，包括自动正规化、前提选择、证明步骤生成和证明搜索等任务。文中不仅总结了现有的方法，还讨论了评价指标和当前技术在处理这些任务时的表现，并对未来的研究方向提出了建议。因此，该论文的主要贡献在于全面概述了深度学习在提升定理证明效率方面的最新进展和面临的主要挑战。"
}