{
    "title": "Image Generative Semantic Communication with Multi-Modal Similarity Estimation for Resource-Limited Networks",
    "abstract": "arXiv:2404.11280v2 Announce Type: replace-cross  Abstract: To reduce network traffic and support environments with limited resources, a method for transmitting images with minimal transmission data is required. Several machine learning-based image compression methods, which compress the data size of images while maintaining their features, have been proposed. However, in certain situations, reconstructing only the semantic information of images at the receiver end may be sufficient. To realize this concept, semantic-information-based communication, called semantic communication, has been proposed, along with an image transmission method using semantic communication. This method transmits only the semantic information of an image, and the receiver reconstructs it using an image-generation model. This method utilizes a single type of semantic information for image reconstruction, but reconstructing images similar to the original image using only this information is challenging. This stud",
    "link": "https://arxiv.org/abs/2404.11280",
    "context": "Title: Image Generative Semantic Communication with Multi-Modal Similarity Estimation for Resource-Limited Networks\nAbstract: arXiv:2404.11280v2 Announce Type: replace-cross  Abstract: To reduce network traffic and support environments with limited resources, a method for transmitting images with minimal transmission data is required. Several machine learning-based image compression methods, which compress the data size of images while maintaining their features, have been proposed. However, in certain situations, reconstructing only the semantic information of images at the receiver end may be sufficient. To realize this concept, semantic-information-based communication, called semantic communication, has been proposed, along with an image transmission method using semantic communication. This method transmits only the semantic information of an image, and the receiver reconstructs it using an image-generation model. This method utilizes a single type of semantic information for image reconstruction, but reconstructing images similar to the original image using only this information is challenging. This stud",
    "path": "papers/24/04/2404.11280.json",
    "total_tokens": 325,
    "tldr": "该文章提出了一种利用多模态相似性估计的图像生成式语义通信方法，该方法旨在资源受限的网络中实现低数据传输量的图像传输，并通过重建图像的语义信息来减少网络流量，从而支持资源有限的场景。"
}