{
    "title": "Deep Reinforcement Learning for Traveling Purchaser Problems",
    "abstract": "arXiv:2404.02476v3 Announce Type: replace-cross  Abstract: The traveling purchaser problem (TPP) is an important combinatorial optimization problem with broad applications. Due to the coupling between routing and purchasing, existing works on TPPs commonly address route construction and purchase planning simultaneously, which, however, leads to exact methods with high computational cost and heuristics with sophisticated design but limited performance. In sharp contrast, we propose a novel approach based on deep reinforcement learning (DRL), which addresses route construction and purchase planning separately, while evaluating and optimizing the solution from a global perspective. The key components of our approach include a bipartite graph representation for TPPs to capture the market-product relations, and a policy network that extracts information from the bipartite graph and uses it to sequentially construct the route. One significant benefit of our framework is that we can efficient",
    "link": "https://arxiv.org/abs/2404.02476",
    "context": "Title: Deep Reinforcement Learning for Traveling Purchaser Problems\nAbstract: arXiv:2404.02476v3 Announce Type: replace-cross  Abstract: The traveling purchaser problem (TPP) is an important combinatorial optimization problem with broad applications. Due to the coupling between routing and purchasing, existing works on TPPs commonly address route construction and purchase planning simultaneously, which, however, leads to exact methods with high computational cost and heuristics with sophisticated design but limited performance. In sharp contrast, we propose a novel approach based on deep reinforcement learning (DRL), which addresses route construction and purchase planning separately, while evaluating and optimizing the solution from a global perspective. The key components of our approach include a bipartite graph representation for TPPs to capture the market-product relations, and a policy network that extracts information from the bipartite graph and uses it to sequentially construct the route. One significant benefit of our framework is that we can efficient",
    "path": "papers/24/04/2404.02476.json",
    "total_tokens": 687,
    "translated_title": "深度强化学习在旅游采购问题中的应用",
    "translated_abstract": "arXiv:2404.02476v3 公告类型：替换交叉 摘要：旅行采购问题（TPP）是一个具有广泛应用的重要组合优化问题。由于路线构建和采购计划之间存在耦合，现有关于TPPs的工作通常同时解决路线和采购计划，这虽然导致了解高计算成本的确切方法和设计复杂但性能有限的启发式方法。与此形成鲜明对比的是，我们提出了一种基于深度强化学习（DRL）的新方法，该方法将路线构建和采购计划分开处理，并在全局视角下评估和优化解决方案。我们方法的关键组成部分包括用于TPPs的双边图表示，以捕获市场与产品之间的关系，以及一个政策网络，它从双边图中提取信息，并使用这些信息来顺序构建路线。我们框架的一个显著优点是我们能够以较少的处理时间为起点，在路线上的所有商店位置空间中随机初始化一个点，并使用强化学习算法的精髓来优化路径，从而为旅游采购问题的有效解决方案提供了一种新途径。设计了专门的双边图表示。我们的方法在多阶段旅行采购问题上进行了测试并获得了良好的结果。",
    "tldr": "我们提出了一种新方法，利用深度强化学习将旅行采购问题中的路线构建和采购计划分开处理，并从全局视角优化解决方案。我们的方法是高效的，能够为旅游采购问题提供有效解决方案。"
}