{
    "title": "ORBIT: Oak Ridge Base Foundation Model for Earth System Predictability",
    "abstract": "arXiv:2404.14712v2 Announce Type: replace-cross  Abstract: Earth system predictability is challenged by the complexity of environmental dynamics and the multitude of variables involved. Current AI foundation models, although advanced by leveraging large and heterogeneous data, are often constrained by their size and data integration, limiting their effectiveness in addressing the full range of Earth system prediction challenges. To overcome these limitations, we introduce the Oak Ridge Base Foundation Model for Earth System Predictability (ORBIT), an advanced vision transformer model that scales up to 113 billion parameters using a novel hybrid tensor-data orthogonal parallelism technique. As the largest model of its kind, ORBIT surpasses the current climate AI foundation model size by a thousandfold. Performance scaling tests conducted on the Frontier supercomputer have demonstrated that ORBIT achieves 684 petaFLOPS to 1.6 exaFLOPS sustained throughput, with scaling efficiency maintai",
    "link": "https://arxiv.org/abs/2404.14712",
    "context": "Title: ORBIT: Oak Ridge Base Foundation Model for Earth System Predictability\nAbstract: arXiv:2404.14712v2 Announce Type: replace-cross  Abstract: Earth system predictability is challenged by the complexity of environmental dynamics and the multitude of variables involved. Current AI foundation models, although advanced by leveraging large and heterogeneous data, are often constrained by their size and data integration, limiting their effectiveness in addressing the full range of Earth system prediction challenges. To overcome these limitations, we introduce the Oak Ridge Base Foundation Model for Earth System Predictability (ORBIT), an advanced vision transformer model that scales up to 113 billion parameters using a novel hybrid tensor-data orthogonal parallelism technique. As the largest model of its kind, ORBIT surpasses the current climate AI foundation model size by a thousandfold. Performance scaling tests conducted on the Frontier supercomputer have demonstrated that ORBIT achieves 684 petaFLOPS to 1.6 exaFLOPS sustained throughput, with scaling efficiency maintai",
    "path": "papers/24/04/2404.14712.json",
    "total_tokens": 361,
    "tldr": "该文章引入了Oak Ridge Base Foundation Model for Earth System Predictability（ORBIT），这是一个具有113亿参数的先进视觉转换器模型，采用了创新的混合张量数据并行策略。ORBIT通过这一策略超越了当前气候人工智能模型的大小限制，实现了对环境动态复杂性和数据整合的改善，从而提高了地球系统预测的准确性。"
}