{
    "title": "Automatic Target-Less Camera-LiDAR Calibration From Motion and Deep Point Correspondences",
    "abstract": "arXiv:2404.17298v2 Announce Type: replace  Abstract: Sensor setups of robotic platforms commonly include both camera and LiDAR as they provide complementary information. However, fusing these two modalities typically requires a highly accurate calibration between them. In this paper, we propose MDPCalib which is a novel method for camera-LiDAR calibration that requires neither human supervision nor any specific target objects. Instead, we utilize sensor motion estimates from visual and LiDAR odometry as well as deep learning-based 2D-pixel-to-3D-point correspondences that are obtained without in-domain retraining. We represent camera-LiDAR calibration as an optimization problem and minimize the costs induced by constraints from sensor motion and point correspondences. In extensive experiments, we demonstrate that our approach yields highly accurate extrinsic calibration parameters and is robust to random initialization. Additionally, our approach generalizes to a wide range of sensor s",
    "link": "https://arxiv.org/abs/2404.17298",
    "context": "Title: Automatic Target-Less Camera-LiDAR Calibration From Motion and Deep Point Correspondences\nAbstract: arXiv:2404.17298v2 Announce Type: replace  Abstract: Sensor setups of robotic platforms commonly include both camera and LiDAR as they provide complementary information. However, fusing these two modalities typically requires a highly accurate calibration between them. In this paper, we propose MDPCalib which is a novel method for camera-LiDAR calibration that requires neither human supervision nor any specific target objects. Instead, we utilize sensor motion estimates from visual and LiDAR odometry as well as deep learning-based 2D-pixel-to-3D-point correspondences that are obtained without in-domain retraining. We represent camera-LiDAR calibration as an optimization problem and minimize the costs induced by constraints from sensor motion and point correspondences. In extensive experiments, we demonstrate that our approach yields highly accurate extrinsic calibration parameters and is robust to random initialization. Additionally, our approach generalizes to a wide range of sensor s",
    "path": "papers/24/04/2404.17298.json",
    "total_tokens": 345,
    "tldr": "该文章提出了一种无需人工干预和特定目标物体的自动相机-激光雷达无目标校准方法，该方法通过利用视觉和激光雷达里程学的运动估计以及无需适应域重新训练的深度学习像素到点对应关系，有效地进行相机-激光雷达的校准。"
}