{
    "title": "COVID-19 Detection Based on Blood Test Parameters using Various Artificial Intelligence Methods",
    "abstract": "arXiv:2404.02348v3 Announce Type: replace-cross  Abstract: In 2019, the world faced a new challenge: a COVID-19 disease caused by the novel coronavirus, SARS-CoV-2. The virus rapidly spread across the globe, leading to a high rate of mortality, which prompted health organizations to take measures to control its transmission. Early disease detection is crucial in the treatment process, and computer-based automatic detection systems have been developed to aid in this effort. These systems often rely on artificial intelligence (AI) approaches such as machine learning, neural networks, fuzzy systems, and deep learning to classify diseases. This study aimed to differentiate COVID-19 patients from others using self-categorizing classifiers and employing various AI methods. This study used two datasets: the blood test samples and radiography images. The best results for the blood test samples obtained from San Raphael Hospital, which include two classes of individuals, those with COVID-19 and",
    "link": "https://arxiv.org/abs/2404.02348",
    "context": "Title: COVID-19 Detection Based on Blood Test Parameters using Various Artificial Intelligence Methods\nAbstract: arXiv:2404.02348v3 Announce Type: replace-cross  Abstract: In 2019, the world faced a new challenge: a COVID-19 disease caused by the novel coronavirus, SARS-CoV-2. The virus rapidly spread across the globe, leading to a high rate of mortality, which prompted health organizations to take measures to control its transmission. Early disease detection is crucial in the treatment process, and computer-based automatic detection systems have been developed to aid in this effort. These systems often rely on artificial intelligence (AI) approaches such as machine learning, neural networks, fuzzy systems, and deep learning to classify diseases. This study aimed to differentiate COVID-19 patients from others using self-categorizing classifiers and employing various AI methods. This study used two datasets: the blood test samples and radiography images. The best results for the blood test samples obtained from San Raphael Hospital, which include two classes of individuals, those with COVID-19 and",
    "path": "papers/24/04/2404.02348.json",
    "total_tokens": 329,
    "tldr": "该文章利用不同的人工智能方法对COVID-19患者和未感染人群的血检参数进行了自动分类，从而提高了疾病的早期检测效率。"
}