{
    "title": "Sampling for Model Predictive Trajectory Planning in Autonomous Driving using Normalizing Flows",
    "abstract": "arXiv:2404.09657v3 Announce Type: replace  Abstract: Alongside optimization-based planners, sampling-based approaches are often used in trajectory planning for autonomous driving due to their simplicity. Model predictive path integral control is a framework that builds upon optimization principles while incorporating stochastic sampling of input trajectories. This paper investigates several sampling approaches for trajectory generation. In this context, normalizing flows originating from the field of variational inference are considered for the generation of sampling distributions, as they model transformations of simple to more complex distributions. Accordingly, learning-based normalizing flow models are trained for a more efficient exploration of the input domain for the task at hand. The developed algorithm and the proposed sampling distributions are evaluated in two simulation scenarios.",
    "link": "https://arxiv.org/abs/2404.09657",
    "context": "Title: Sampling for Model Predictive Trajectory Planning in Autonomous Driving using Normalizing Flows\nAbstract: arXiv:2404.09657v3 Announce Type: replace  Abstract: Alongside optimization-based planners, sampling-based approaches are often used in trajectory planning for autonomous driving due to their simplicity. Model predictive path integral control is a framework that builds upon optimization principles while incorporating stochastic sampling of input trajectories. This paper investigates several sampling approaches for trajectory generation. In this context, normalizing flows originating from the field of variational inference are considered for the generation of sampling distributions, as they model transformations of simple to more complex distributions. Accordingly, learning-based normalizing flow models are trained for a more efficient exploration of the input domain for the task at hand. The developed algorithm and the proposed sampling distributions are evaluated in two simulation scenarios.",
    "path": "papers/24/04/2404.09657.json",
    "total_tokens": 285,
    "tldr": "该文章创新地提出了一种使用正态化流动(normalizing flows)进行模型预测轨迹规划的方法，这项技术能够高效地探索输入域，并在模拟场景中进行了评估。"
}