{
    "title": "Transfer Learning Study of Motion Transformer-based Trajectory Predictions",
    "abstract": "arXiv:2404.08271v3 Announce Type: replace-cross  Abstract: Trajectory planning in autonomous driving is highly dependent on predicting the emergent behavior of other road users. Learning-based methods are currently showing impressive results in simulation-based challenges, with transformer-based architectures technologically leading the way. Ultimately, however, predictions are needed in the real world. In addition to the shifts from simulation to the real world, many vehicle- and country-specific shifts, i.e. differences in sensor systems, fusion and perception algorithms as well as traffic rules and laws, are on the agenda. Since models that can cover all system setups and design domains at once are not yet foreseeable, model adaptation plays a central role. Therefore, a simulation-based study on transfer learning techniques is conducted on basis of a transformer-based model. Furthermore, the study aims to provide insights into possible trade-offs between computational time and perfo",
    "link": "https://arxiv.org/abs/2404.08271",
    "context": "Title: Transfer Learning Study of Motion Transformer-based Trajectory Predictions\nAbstract: arXiv:2404.08271v3 Announce Type: replace-cross  Abstract: Trajectory planning in autonomous driving is highly dependent on predicting the emergent behavior of other road users. Learning-based methods are currently showing impressive results in simulation-based challenges, with transformer-based architectures technologically leading the way. Ultimately, however, predictions are needed in the real world. In addition to the shifts from simulation to the real world, many vehicle- and country-specific shifts, i.e. differences in sensor systems, fusion and perception algorithms as well as traffic rules and laws, are on the agenda. Since models that can cover all system setups and design domains at once are not yet foreseeable, model adaptation plays a central role. Therefore, a simulation-based study on transfer learning techniques is conducted on basis of a transformer-based model. Furthermore, the study aims to provide insights into possible trade-offs between computational time and perfo",
    "path": "papers/24/04/2404.08271.json",
    "total_tokens": 354,
    "tldr": "该文章介绍了基于Motion Transformer模型的自动驾驶车辆轨迹预测的迁移学习研究，旨在减少从模拟环境到真实环境预测的差距。通过研究迁移学习技术，作者希望能够了解在计算时间和预测准确性之间可能的权衡，以适应不同传感系统、感知算法、交通规则和法律的变化，并为模型在不同环境下的适应性提供见解。"
}