{
    "title": "Blended RAG: Improving RAG (Retriever-Augmented Generation) Accuracy with Semantic Search and Hybrid Query-Based Retrievers",
    "abstract": "arXiv:2404.07220v2 Announce Type: replace-cross  Abstract: Retrieval-Augmented Generation (RAG) is a prevalent approach to infuse a private knowledge base of documents with Large Language Models (LLM) to build Generative Q\\&A (Question-Answering) systems. However, RAG accuracy becomes increasingly challenging as the corpus of documents scales up, with Retrievers playing an outsized role in the overall RAG accuracy by extracting the most relevant document from the corpus to provide context to the LLM. In this paper, we propose the 'Blended RAG' method of leveraging semantic search techniques, such as Dense Vector indexes and Sparse Encoder indexes, blended with hybrid query strategies. Our study achieves better retrieval results and sets new benchmarks for IR (Information Retrieval) datasets like NQ and TREC-COVID datasets. We further extend such a 'Blended Retriever' to the RAG system to demonstrate far superior results on Generative Q\\&A datasets like SQUAD, even surpassing fine-tunin",
    "link": "https://arxiv.org/abs/2404.07220",
    "context": "Title: Blended RAG: Improving RAG (Retriever-Augmented Generation) Accuracy with Semantic Search and Hybrid Query-Based Retrievers\nAbstract: arXiv:2404.07220v2 Announce Type: replace-cross  Abstract: Retrieval-Augmented Generation (RAG) is a prevalent approach to infuse a private knowledge base of documents with Large Language Models (LLM) to build Generative Q\\&A (Question-Answering) systems. However, RAG accuracy becomes increasingly challenging as the corpus of documents scales up, with Retrievers playing an outsized role in the overall RAG accuracy by extracting the most relevant document from the corpus to provide context to the LLM. In this paper, we propose the 'Blended RAG' method of leveraging semantic search techniques, such as Dense Vector indexes and Sparse Encoder indexes, blended with hybrid query strategies. Our study achieves better retrieval results and sets new benchmarks for IR (Information Retrieval) datasets like NQ and TREC-COVID datasets. We further extend such a 'Blended Retriever' to the RAG system to demonstrate far superior results on Generative Q\\&A datasets like SQUAD, even surpassing fine-tunin",
    "path": "papers/24/04/2404.07220.json",
    "total_tokens": 756,
    "translated_title": "混合RAG：通过语义搜索和混合查询基础检索器提高RAG准确性",
    "translated_abstract": "检索增强生成（RAG）是将私人知识库文档集与大型语言模型（LLM）结合以构建生成式问答（Question-Answering）系统的一种流行方法。然而，随着文档集的扩大，RAG的准确性变得越来越具有挑战性，检索器在这一过程中扮演了重要角色，通过从文档集中提取最相关的文档给LLM提供上下文，从而显著影响了整体RAG的准确性。在这项研究中，我们提出了“混合RAG”方法，它利用了语义搜索技术，如密集向量索引和稀疏编码器索引，并与混合查询策略相结合。我们的研究在信息检索（IR）数据集，如NQ和TREC-COVID数据集上取得了更好的检索结果，并设定了新的基准。我们还将这种“混合检索器”扩展到了RAG系统中，在诸如SQUAD之类的生成式问答数据集上展示了显著更好的结果，甚至超过了fine-tuning的RAG系统性能。",
    "tldr": "论文提出了“混合RAG”方法，通过结合语义搜索技术和混合查询策略，改善了RAG系统的准确性，并在多个IR和生成式问答数据集上取得了突破性成果。"
}