{
    "title": "Laying Anchors: Semantically Priming Numerals in Language Modeling",
    "abstract": "arXiv:2404.01536v2 Announce Type: replace-cross  Abstract: Off-the-shelf pre-trained language models have become the de facto standard in NLP pipelines for a multitude of downstream tasks. However, the inability of these models to properly encode numerals limits their performance on tasks requiring numeric comprehension. We introduce strategies to semantically prime numerals in any corpus by generating anchors governed by the distribution of numerals in said corpus, thereby enabling mathematically grounded representations of these numeral tokens. We establish the superiority of our proposed techniques through evaluation on a range of numeracy tasks for both in-domain (seen) and out-domain (unseen) numerals. Further, we expand our empirical evaluations to numerals ranging from 1 to 10 billion, a significantly broader range compared to previous studies of the same nature, and we demonstrate significant improvements in the mathematical grounding of our learned embeddings.",
    "link": "https://arxiv.org/abs/2404.01536",
    "context": "Title: Laying Anchors: Semantically Priming Numerals in Language Modeling\nAbstract: arXiv:2404.01536v2 Announce Type: replace-cross  Abstract: Off-the-shelf pre-trained language models have become the de facto standard in NLP pipelines for a multitude of downstream tasks. However, the inability of these models to properly encode numerals limits their performance on tasks requiring numeric comprehension. We introduce strategies to semantically prime numerals in any corpus by generating anchors governed by the distribution of numerals in said corpus, thereby enabling mathematically grounded representations of these numeral tokens. We establish the superiority of our proposed techniques through evaluation on a range of numeracy tasks for both in-domain (seen) and out-domain (unseen) numerals. Further, we expand our empirical evaluations to numerals ranging from 1 to 10 billion, a significantly broader range compared to previous studies of the same nature, and we demonstrate significant improvements in the mathematical grounding of our learned embeddings.",
    "path": "papers/24/04/2404.01536.json",
    "total_tokens": 328,
    "tldr": "该文章提出了一种策略，通过在包含特定分布的语料库中生成锚点的方法，为语言模型中的数字创建了更有意义的预处理，从而提高了模型在需要理解数字的任务中的表现。"
}