{
    "title": "Generalization Gap in Data Augmentation: Insights from Illumination",
    "abstract": "arXiv:2404.07514v2 Announce Type: replace  Abstract: In the field of computer vision, data augmentation is widely used to enrich the feature complexity of training datasets with deep learning techniques. However, regarding the generalization capabilities of models, the difference in artificial features generated by data augmentation and natural visual features has not been fully revealed. This study introduces the concept of \"visual representation variables\" to define the possible visual variations in a task as a joint distribution of these variables. We focus on the visual representation variable \"illumination\", by simulating its distribution degradation and examining how data augmentation techniques enhance model performance on a classification task. Our goal is to investigate the differences in generalization between models trained with augmented data and those trained under real-world illumination conditions. Results indicate that after applying various data augmentation methods, m",
    "link": "https://arxiv.org/abs/2404.07514",
    "context": "Title: Generalization Gap in Data Augmentation: Insights from Illumination\nAbstract: arXiv:2404.07514v2 Announce Type: replace  Abstract: In the field of computer vision, data augmentation is widely used to enrich the feature complexity of training datasets with deep learning techniques. However, regarding the generalization capabilities of models, the difference in artificial features generated by data augmentation and natural visual features has not been fully revealed. This study introduces the concept of \"visual representation variables\" to define the possible visual variations in a task as a joint distribution of these variables. We focus on the visual representation variable \"illumination\", by simulating its distribution degradation and examining how data augmentation techniques enhance model performance on a classification task. Our goal is to investigate the differences in generalization between models trained with augmented data and those trained under real-world illumination conditions. Results indicate that after applying various data augmentation methods, m",
    "path": "papers/24/04/2404.07514.json",
    "total_tokens": 656,
    "translated_title": "数据增强中的泛化差距：光照输入的洞察",
    "translated_abstract": "arXiv:2404.07514v2 通告类型：替换  翻译摘要：在计算机视觉领域，数据增强技术被广泛应用于通过深度学习方法丰富训练数据的特征复杂性。然而，关于模型的泛化能力，数据增强生成的模拟特征与自然视觉特征之间的差异尚未被完全揭示。本研究引入了“视觉表示变量”的概念，来定义任务中可能的视觉变量的联合分布。我们专注于视觉表示变量“光照”，通过模拟其分布的退化，考察数据增强技术在分类任务上如何提高模型性能。我们的目标是研究在数据增强数据上训练的模型与在真实世界光照条件下训练的模型之间的泛化差异。结果表明，在应用了各种数据增强方法之后，模型的泛化能力增强了，但泛化性能在光照条件下并没有得到显著提升。这表明，尽管数据增强能够提供丰富的训练数据，但在自然光照条件下训练的模型可能更具有泛化能力。我们进一步讨论了泛化差距的存在及其对模型性能的影响。",
    "tldr": "本研究发现，尽管数据增强能够提高模型在模拟光照条件下的泛化能力，但其性能在真实光照下并未显著提升，表明在自然光照条件下训练的模型可能具有更强的泛化能力。",
    "en_tdlr": "The study reveals that while data augmentation enhances model generalization under simulated illumination, performance under real illumination does not show a significant improvement, suggesting that models trained under natural lighting conditions may have stronger generalization capabilities."
}