{
    "title": "Transformer-Based Classification Outcome Prediction for Multimodal Stroke Treatment",
    "abstract": "arXiv:2404.12634v2 Announce Type: replace  Abstract: This study proposes a multi-modal fusion framework Multitrans based on the Transformer architecture and self-attention mechanism. This architecture combines the study of non-contrast computed tomography (NCCT) images and discharge diagnosis reports of patients undergoing stroke treatment, using a variety of methods based on Transformer architecture approach to predicting functional outcomes of stroke treatment. The results show that the performance of single-modal text classification is significantly better than single-modal image classification, but the effect of multi-modal combination is better than any single modality. Although the Transformer model only performs worse on imaging data, when combined with clinical meta-diagnostic information, both can learn better complementary information and make good contributions to accurately predicting stroke treatment effects..",
    "link": "https://arxiv.org/abs/2404.12634",
    "context": "Title: Transformer-Based Classification Outcome Prediction for Multimodal Stroke Treatment\nAbstract: arXiv:2404.12634v2 Announce Type: replace  Abstract: This study proposes a multi-modal fusion framework Multitrans based on the Transformer architecture and self-attention mechanism. This architecture combines the study of non-contrast computed tomography (NCCT) images and discharge diagnosis reports of patients undergoing stroke treatment, using a variety of methods based on Transformer architecture approach to predicting functional outcomes of stroke treatment. The results show that the performance of single-modal text classification is significantly better than single-modal image classification, but the effect of multi-modal combination is better than any single modality. Although the Transformer model only performs worse on imaging data, when combined with clinical meta-diagnostic information, both can learn better complementary information and make good contributions to accurately predicting stroke treatment effects..",
    "path": "papers/24/04/2404.12634.json",
    "total_tokens": 350,
    "tldr": "该文章提出了一个基于Transformer架构的框架，结合了CT图像和非对比性诊断报告，以预测脑卒中的治疗结果。通过这种方法，论文证明了解释文本信息的模型在表现上优于单独使用图像信息的模型，而且在多模态信息结合的情况下，效果显著优于单一模态。尽管仅基于图像数据的Transformer模型表现不佳，但当结合带有临床meta特征诊断信息时，模型可以更好地学习和预测脑卒中治疗效果。"
}