{
    "title": "Reinforcement Learning with Generalizable Gaussian Splatting",
    "abstract": "arXiv:2404.07950v2 Announce Type: replace  Abstract: An excellent representation is crucial for reinforcement learning (RL) performance, especially in vision-based reinforcement learning tasks. The quality of the environment representation directly influences the achievement of the learning task. Previous vision-based RL typically uses explicit or implicit ways to represent environments, such as images, points, voxels, and neural radiance fields. However, these representations contain several drawbacks. They cannot either describe complex local geometries or generalize well to unseen scenes, or require precise foreground masks. Moreover, these implicit neural representations are akin to a ``black box\", significantly hindering interpretability. 3D Gaussian Splatting (3DGS), with its explicit scene representation and differentiable rendering nature, is considered a revolutionary change for reconstruction and representation methods. In this paper, we propose a novel Generalizable Gaussian",
    "link": "https://arxiv.org/abs/2404.07950",
    "context": "Title: Reinforcement Learning with Generalizable Gaussian Splatting\nAbstract: arXiv:2404.07950v2 Announce Type: replace  Abstract: An excellent representation is crucial for reinforcement learning (RL) performance, especially in vision-based reinforcement learning tasks. The quality of the environment representation directly influences the achievement of the learning task. Previous vision-based RL typically uses explicit or implicit ways to represent environments, such as images, points, voxels, and neural radiance fields. However, these representations contain several drawbacks. They cannot either describe complex local geometries or generalize well to unseen scenes, or require precise foreground masks. Moreover, these implicit neural representations are akin to a ``black box\", significantly hindering interpretability. 3D Gaussian Splatting (3DGS), with its explicit scene representation and differentiable rendering nature, is considered a revolutionary change for reconstruction and representation methods. In this paper, we propose a novel Generalizable Gaussian",
    "path": "papers/24/04/2404.07950.json",
    "total_tokens": 727,
    "translated_title": "使用可泛化高斯点积的强化学习",
    "translated_abstract": "arXiv:2404.07950v2 公告类型：替换 摘要：在基于视觉的强化学习任务中，优秀的数据表示至关重要。环境表示的质量直接影响了学习任务的成功。以往的基于视觉的强化学习通常使用显式或隐式的方法来表示环境，如图像、点、体素和神经辐射场。然而，这些表示方法存在若干缺点。它们要么无法描述复杂的局部几何，要么在从未见过的新场景中泛化能力差，或者需要精确的背景遮罩。此外，这些隐式的神经表示就像是一个“黑箱”，严重阻碍了可解释性。与传统的隐式神经表示方法相比，3D高斯点积(3DGS)作为一种显式的场景表示和可微的渲染方法，被认为是对重排和表示方法的一种革命性改变。在本文中，我们提出了一种新颖的可泛化高斯点积方法的强化学习。这种方法能够提供更清晰的场景描述，并且在不同的环境中表现出优异的泛化能力。更重要的是，我们的方法通过直接使用形状函数和概率分布来表示场景，使得所提出的方法易于理解和去“黑箱”，从而可以为强化学习任务提供更深入的见解。",
    "tldr": "我们提出了一种基于可泛化高斯点积的强化学习方法，该方法在不同的环境中提供了更清晰和泛化的场景表示，并通过直接使用形状函数和概率分布去除了“黑箱”效应，使得方法更易于理解和可视化。"
}