{
    "title": "Learning Prehensile Dexterity by Imitating and Emulating State-only Observations",
    "abstract": "arXiv:2404.05582v3 Announce Type: replace  Abstract: When human acquire physical skills (e.g., tennis) from experts, we tend to first learn from merely observing the expert. But this is often insufficient. We then engage in practice, where we try to emulate the expert and ensure that our actions produce similar effects on our environment. Inspired by this observation, we introduce Combining IMitation and Emulation for Motion Refinement (CIMER) -- a two-stage framework to learn dexterous prehensile manipulation skills from state-only observations. CIMER's first stage involves imitation: simultaneously encode the complex interdependent motions of the robot hand and the object in a structured dynamical system. This results in a reactive motion generation policy that provides a reasonable motion prior, but lacks the ability to reason about contact effects due to the lack of action labels. The second stage involves emulation: learn a motion refinement policy via reinforcement that adjusts t",
    "link": "https://arxiv.org/abs/2404.05582",
    "context": "Title: Learning Prehensile Dexterity by Imitating and Emulating State-only Observations\nAbstract: arXiv:2404.05582v3 Announce Type: replace  Abstract: When human acquire physical skills (e.g., tennis) from experts, we tend to first learn from merely observing the expert. But this is often insufficient. We then engage in practice, where we try to emulate the expert and ensure that our actions produce similar effects on our environment. Inspired by this observation, we introduce Combining IMitation and Emulation for Motion Refinement (CIMER) -- a two-stage framework to learn dexterous prehensile manipulation skills from state-only observations. CIMER's first stage involves imitation: simultaneously encode the complex interdependent motions of the robot hand and the object in a structured dynamical system. This results in a reactive motion generation policy that provides a reasonable motion prior, but lacks the ability to reason about contact effects due to the lack of action labels. The second stage involves emulation: learn a motion refinement policy via reinforcement that adjusts t",
    "path": "papers/24/04/2404.05582.json",
    "total_tokens": 382,
    "tldr": "该文章提出了一种名为CIMER（Combining IMitation and Emulation for Motion Refinement）的双阶段框架，用于从仅包含状态的观察中学习复杂的抓取操作技能。在第一阶段，通过模仿学习，自动编码手的动作和物体的状态，形成了一个反应性的动作生成策略。在第二阶段，通过模拟学习，强化训练了一个动作微调策略，以调整动作以适应不同的接触效果。"
}