{
    "title": "LoSA: Long-Short-range Adapter for Scaling End-to-End Temporal Action Localization",
    "abstract": "arXiv:2404.01282v2 Announce Type: replace  Abstract: Temporal Action Localization (TAL) involves localizing and classifying action snippets in an untrimmed video. The emergence of large video foundation models has led RGB-only video backbones to outperform previous methods needing both RGB and optical flow modalities. Leveraging these large models is often limited to training only the TAL head due to the prohibitively large GPU memory required to adapt the video backbone for TAL. To overcome this limitation, we introduce LoSA, the first memory-and-parameter-efficient backbone adapter designed specifically for TAL to handle untrimmed videos. LoSA specializes for TAL by introducing Long-Short-range Adapters that adapt the intermediate layers of the video backbone over different temporal ranges. These adapters run parallel to the video backbone to significantly reduce memory footprint. LoSA also includes Long-Short-range Gated Fusion that strategically combines the output of these adapter",
    "link": "https://arxiv.org/abs/2404.01282",
    "context": "Title: LoSA: Long-Short-range Adapter for Scaling End-to-End Temporal Action Localization\nAbstract: arXiv:2404.01282v2 Announce Type: replace  Abstract: Temporal Action Localization (TAL) involves localizing and classifying action snippets in an untrimmed video. The emergence of large video foundation models has led RGB-only video backbones to outperform previous methods needing both RGB and optical flow modalities. Leveraging these large models is often limited to training only the TAL head due to the prohibitively large GPU memory required to adapt the video backbone for TAL. To overcome this limitation, we introduce LoSA, the first memory-and-parameter-efficient backbone adapter designed specifically for TAL to handle untrimmed videos. LoSA specializes for TAL by introducing Long-Short-range Adapters that adapt the intermediate layers of the video backbone over different temporal ranges. These adapters run parallel to the video backbone to significantly reduce memory footprint. LoSA also includes Long-Short-range Gated Fusion that strategically combines the output of these adapter",
    "path": "papers/24/04/2404.01282.json",
    "total_tokens": 411,
    "tldr": "该文章提出了一种名为LoSA的特殊长短期范围适配器，用于针对端到端时序动作定位任务，能够有效适应和处理未裁剪的视频。这种适配器特别设计用于时序动作定位，并通过在视频 backbone 的中间层上引入特殊的长短期范围适配器，能够在不增加大量 GPU 内存消耗的情况下，显著减少内存足迹。此外，LoSA 还包括了一种长短期范围门控融合机制，能够有效地结合这些适配器的输出，从而提高了时序动作识别的准确性和效率。"
}