{
    "title": "Breaching the Bottleneck: Evolutionary Transition from Reward-Driven Learning to Reward-Agnostic Domain-Adapted Learning in Neuromodulated Neural Nets",
    "abstract": "arXiv:2404.12631v2 Announce Type: replace-cross  Abstract: Advanced biological intelligence learns efficiently from an information-rich stream of stimulus information, even when feedback on behaviour quality is sparse or absent. Such learning exploits implicit assumptions about task domains. We refer to such learning as Domain-Adapted Learning (DAL). In contrast, AI learning algorithms rely on explicit externally provided measures of behaviour quality to acquire fit behaviour. This imposes an information bottleneck that precludes learning from diverse non-reward stimulus information, limiting learning efficiency. We consider the question of how biological evolution circumvents this bottleneck to produce DAL. We propose that species first evolve the ability to learn from reward signals, providing inefficient (bottlenecked) but broad adaptivity. From there, integration of non-reward information into the learning process can proceed via gradual accumulation of biases induced by such infor",
    "link": "https://arxiv.org/abs/2404.12631",
    "context": "Title: Breaching the Bottleneck: Evolutionary Transition from Reward-Driven Learning to Reward-Agnostic Domain-Adapted Learning in Neuromodulated Neural Nets\nAbstract: arXiv:2404.12631v2 Announce Type: replace-cross  Abstract: Advanced biological intelligence learns efficiently from an information-rich stream of stimulus information, even when feedback on behaviour quality is sparse or absent. Such learning exploits implicit assumptions about task domains. We refer to such learning as Domain-Adapted Learning (DAL). In contrast, AI learning algorithms rely on explicit externally provided measures of behaviour quality to acquire fit behaviour. This imposes an information bottleneck that precludes learning from diverse non-reward stimulus information, limiting learning efficiency. We consider the question of how biological evolution circumvents this bottleneck to produce DAL. We propose that species first evolve the ability to learn from reward signals, providing inefficient (bottlenecked) but broad adaptivity. From there, integration of non-reward information into the learning process can proceed via gradual accumulation of biases induced by such infor",
    "path": "papers/24/04/2404.12631.json",
    "total_tokens": 662,
    "translated_title": "突破瓶颈：神经调制神经网络中从奖励驱动学习到奖励 agnostic 的领域自适应学习演化过渡",
    "translated_abstract": "arXiv:2404.12631v2 公告类型：替换交叉引用 摘要：高级生物智能能够高效地从刺激信息的丰富流中学习，即使在行为质量反馈稀缺或完全缺失的情况下也是如此。这种学习利用了对任务领域的一些隐含假设。我们把这种学习称为领域自适应学习（Domain-Adapted Learning, DAL）。相比之下，人工智能学习算法依赖于从行为质量的外部明确提供指标来获得适应性行为。这种做法设立了一个信息瓶颈，阻碍了对多样非奖励刺激信息的认知，限制了学习效率。我们考虑这样一个问题：生物进化是如何绕过这个瓶颈来产生DAL的？我们提出物种首先进化出从奖励信号中学习的本领，虽然效率低下（有瓶颈）但却具有广泛的适应性。从那里，通过逐渐积累的非奖励信息的纳入学习过程可以逐渐进行，因此这些信息可以用来引导学习。",
    "tldr": "论文讨论了如何在生物智能中突破信息瓶颈，让机器学习能像生物智能一样高效地从多样非奖励刺激信息中学习。",
    "en_tdlr": "The paper discusses how to break the information bottleneck in biological intelligence to enable machine learning to learn efficiently from diverse non-reward stimulus information in a manner similar to biological intelligence."
}