{
    "title": "A Comprehensive Evaluation on Event Reasoning of Large Language Models",
    "abstract": "arXiv:2404.17513v2 Announce Type: replace-cross  Abstract: Event reasoning is a fundamental ability that underlies many applications. It requires event schema knowledge to perform global reasoning and needs to deal with the diversity of the inter-event relations and the reasoning paradigms. How well LLMs accomplish event reasoning on various relations and reasoning paradigms remains unknown. To mitigate this disparity, we comprehensively evaluate the abilities of event reasoning of LLMs. We introduce a novel benchmark EV2 for EValuation of EVent reasoning. EV2 consists of two levels of evaluation of schema and instance and is comprehensive in relations and reasoning paradigms. We conduct extensive experiments on EV2. We find that LLMs have abilities to accomplish event reasoning but their performances are far from satisfactory. We also notice the imbalance of event reasoning abilities in LLMs. Besides, LLMs have event schema knowledge, however, they're not aligned with humans on how to",
    "link": "https://arxiv.org/abs/2404.17513",
    "context": "Title: A Comprehensive Evaluation on Event Reasoning of Large Language Models\nAbstract: arXiv:2404.17513v2 Announce Type: replace-cross  Abstract: Event reasoning is a fundamental ability that underlies many applications. It requires event schema knowledge to perform global reasoning and needs to deal with the diversity of the inter-event relations and the reasoning paradigms. How well LLMs accomplish event reasoning on various relations and reasoning paradigms remains unknown. To mitigate this disparity, we comprehensively evaluate the abilities of event reasoning of LLMs. We introduce a novel benchmark EV2 for EValuation of EVent reasoning. EV2 consists of two levels of evaluation of schema and instance and is comprehensive in relations and reasoning paradigms. We conduct extensive experiments on EV2. We find that LLMs have abilities to accomplish event reasoning but their performances are far from satisfactory. We also notice the imbalance of event reasoning abilities in LLMs. Besides, LLMs have event schema knowledge, however, they're not aligned with humans on how to",
    "path": "papers/24/04/2404.17513.json",
    "total_tokens": 660,
    "translated_title": "大型语言模型事件推理的综合评价",
    "translated_abstract": "arXiv:2404.17513v2 公告类型：替换交叉  摘要：事件推理是许多应用的基础能力。它需要事件模式知识进行全局推理，并且需要处理各种事件之间的关系和推理范式。LLM在不同关系和推理范式上完成事件推理的能力仍然未知。为了减轻这一差距，我们对LLM的事件推理能力进行了全面评估。我们引入了一个新的基准EV2用于评估事件推理。EV2包含两个层次的评价，即模式和实例，并且在关系和推理范式方面是全面的。我们在EV2上进行了广泛的实验。我们发现LLM有完成事件推理的能力，但它们的性能远未达到满意。我们还注意到LLM在事件推理能力方面的不平衡。此外，LLM具有事件模式知识，尽管它们在人类如何进行事件推理方面并不一致。",
    "tldr": "本文评估了大型语言模型在不同关系和推理范式上的事件推理能力，发现虽然模型有完成事件推理的能力，但总体表现并不令人满意，同时也发现模型在事件推理能力上的不均衡性。"
}