{
    "title": "Cooperative Evolutionary Pressure and Diminishing Returns Might Explain the Fermi Paradox: On What Super-AIs Are Like",
    "abstract": "arXiv:2404.03685v4 Announce Type: replace-cross  Abstract: With an evolutionary approach, the basis of morality can be explained as adaptations to problems of cooperation. With 'evolution' taken in a broad sense, evolving AIs that satisfy the conditions for evolution to apply will be subject to the same cooperative evolutionary pressure as biological entities. Here the adaptiveness of increased cooperation as material safety and wealth increase is discussed -- for humans, for other societies, and for AIs. Diminishing beneficial returns from increased access to material resources also suggests the possibility that, on the whole, there will be no incentive to for instance colonize entire galaxies, thus providing a possible explanation of the Fermi paradox, wondering where everybody is. It is further argued that old societies could engender, give way to, super-AIs, since it is likely that super-AIs are feasible, and fitter. Closing is an aside on effective ways for morals and goals to aff",
    "link": "https://arxiv.org/abs/2404.03685",
    "context": "Title: Cooperative Evolutionary Pressure and Diminishing Returns Might Explain the Fermi Paradox: On What Super-AIs Are Like\nAbstract: arXiv:2404.03685v4 Announce Type: replace-cross  Abstract: With an evolutionary approach, the basis of morality can be explained as adaptations to problems of cooperation. With 'evolution' taken in a broad sense, evolving AIs that satisfy the conditions for evolution to apply will be subject to the same cooperative evolutionary pressure as biological entities. Here the adaptiveness of increased cooperation as material safety and wealth increase is discussed -- for humans, for other societies, and for AIs. Diminishing beneficial returns from increased access to material resources also suggests the possibility that, on the whole, there will be no incentive to for instance colonize entire galaxies, thus providing a possible explanation of the Fermi paradox, wondering where everybody is. It is further argued that old societies could engender, give way to, super-AIs, since it is likely that super-AIs are feasible, and fitter. Closing is an aside on effective ways for morals and goals to aff",
    "path": "papers/24/04/2404.03685.json",
    "total_tokens": 394,
    "tldr": "该文章通过进化论的角度，讨论了超级智能AI可能的行为模式，提出随着物质资源的增加，合作行为的适应性增強，但对于超级AI来说，这种增益可能会随着资源的增多而逐渐减少。因此，超级AI可能没有必要去星際殖民，这可能解释了费米悖论中提出的智能生命未被观测到的问题。文章还探讨了超级AI的产生方式和道德价值观可能的方式。"
}