{
    "title": "Recent Deep Semi-supervised Learning Approaches and Related Works",
    "abstract": "arXiv:2106.11528v3 Announce Type: replace-cross  Abstract: This work proposes an overview of the recent semi-supervised learning approaches and related works. Despite the remarkable success of neural networks in various applications, there exist a few formidable constraints, including the need for a large amount of labeled data. Therefore, semi-supervised learning, which is a learning scheme in which scarce labels and a larger amount of unlabeled data are utilized to train models (e.g., deep neural networks), is getting more important. Based on the key assumptions of semi-supervised learning, which are the manifold assumption, cluster assumption, and continuity assumption, the work reviews the recent semi-supervised learning approaches. In particular, the methods in regard to using deep neural networks in a semi-supervised learning setting are primarily discussed. In addition, the existing works are first classified based on the underlying idea and explained, then the holistic approach",
    "link": "https://arxiv.org/abs/2106.11528",
    "context": "Title: Recent Deep Semi-supervised Learning Approaches and Related Works\nAbstract: arXiv:2106.11528v3 Announce Type: replace-cross  Abstract: This work proposes an overview of the recent semi-supervised learning approaches and related works. Despite the remarkable success of neural networks in various applications, there exist a few formidable constraints, including the need for a large amount of labeled data. Therefore, semi-supervised learning, which is a learning scheme in which scarce labels and a larger amount of unlabeled data are utilized to train models (e.g., deep neural networks), is getting more important. Based on the key assumptions of semi-supervised learning, which are the manifold assumption, cluster assumption, and continuity assumption, the work reviews the recent semi-supervised learning approaches. In particular, the methods in regard to using deep neural networks in a semi-supervised learning setting are primarily discussed. In addition, the existing works are first classified based on the underlying idea and explained, then the holistic approach",
    "path": "papers/21/06/2106.11528.json",
    "total_tokens": 357,
    "tldr": "该文章总结了近年来在半监督学习领域中提出的深入半监督学习方法及相关研究。它解释了半监督学习中常用的关键假设，包括流形假设、簇假设和连续性假设，并对使用深度神经网络进行半监督学习的最新方法进行了重点讨论。文章通过综合分类和解释现有研究，提供了一种全面的视角来了解半监督学习的发展趋势和应用潜力。"
}