{
    "title": "Nonlinear Model Predictive Control of a Conductance-Based Neuron Model via Data-Driven Forecasting",
    "abstract": "arXiv:2312.14274v2 Announce Type: replace  Abstract: Objective. Precise control of neural systems is essential to experimental investigations of how the brain controls behavior and holds the potential for therapeutic manipulations to correct aberrant network states. Model predictive control, which employs a dynamical model of the system to find optimal control inputs, has promise for dealing with the nonlinear dynamics, high levels of exogenous noise, and limited information about unmeasured states and parameters that are common in a wide range of neural systems. However, the challenge still remains of selecting the right model, constraining its parameters, and synchronizing to the neural system. Approach. As a proof of principle, we used recent advances in data-driven forecasting to construct a nonlinear machine-learning model of a Hodgkin-Huxley type neuron when only the membrane voltage is observable and there are an unknown number of intrinsic currents. Main Results. We show that t",
    "link": "https://arxiv.org/abs/2312.14274",
    "context": "Title: Nonlinear Model Predictive Control of a Conductance-Based Neuron Model via Data-Driven Forecasting\nAbstract: arXiv:2312.14274v2 Announce Type: replace  Abstract: Objective. Precise control of neural systems is essential to experimental investigations of how the brain controls behavior and holds the potential for therapeutic manipulations to correct aberrant network states. Model predictive control, which employs a dynamical model of the system to find optimal control inputs, has promise for dealing with the nonlinear dynamics, high levels of exogenous noise, and limited information about unmeasured states and parameters that are common in a wide range of neural systems. However, the challenge still remains of selecting the right model, constraining its parameters, and synchronizing to the neural system. Approach. As a proof of principle, we used recent advances in data-driven forecasting to construct a nonlinear machine-learning model of a Hodgkin-Huxley type neuron when only the membrane voltage is observable and there are an unknown number of intrinsic currents. Main Results. We show that t",
    "path": "papers/23/12/2312.14274.json",
    "total_tokens": 354,
    "tldr": "文章的创新点在于提出了一种通过数据驱动预测构建的非线性模型预测控制方法，应用于仅观测到膜电压的 Hodgkin-Huxley 型神经元的控制问题，特别是当存在未知数量的内在电流时。这一方法能够精确控制神经系统，具有潜在的应用价值，尽管面临选取适当的模型、限制参数以及与神经系统同步的挑战。"
}