{
    "title": "WoVoGen: World Volume-aware Diffusion for Controllable Multi-camera Driving Scene Generation",
    "abstract": "arXiv:2312.02934v4 Announce Type: replace  Abstract: Generating multi-camera street-view videos is critical for augmenting autonomous driving datasets, addressing the urgent demand for extensive and varied data. Due to the limitations in diversity and challenges in handling lighting conditions, traditional rendering-based methods are increasingly being supplanted by diffusion-based methods. However, a significant challenge in diffusion-based methods is ensuring that the generated sensor data preserve both intra-world consistency and inter-sensor coherence. To address these challenges, we combine an additional explicit world volume and propose the World Volume-aware Multi-camera Driving Scene Generator (WoVoGen). This system is specifically designed to leverage 4D world volume as a foundational element for video generation. Our model operates in two distinct phases: (i) envisioning the future 4D temporal world volume based on vehicle control sequences, and (ii) generating multi-camera v",
    "link": "https://arxiv.org/abs/2312.02934",
    "context": "Title: WoVoGen: World Volume-aware Diffusion for Controllable Multi-camera Driving Scene Generation\nAbstract: arXiv:2312.02934v4 Announce Type: replace  Abstract: Generating multi-camera street-view videos is critical for augmenting autonomous driving datasets, addressing the urgent demand for extensive and varied data. Due to the limitations in diversity and challenges in handling lighting conditions, traditional rendering-based methods are increasingly being supplanted by diffusion-based methods. However, a significant challenge in diffusion-based methods is ensuring that the generated sensor data preserve both intra-world consistency and inter-sensor coherence. To address these challenges, we combine an additional explicit world volume and propose the World Volume-aware Multi-camera Driving Scene Generator (WoVoGen). This system is specifically designed to leverage 4D world volume as a foundational element for video generation. Our model operates in two distinct phases: (i) envisioning the future 4D temporal world volume based on vehicle control sequences, and (ii) generating multi-camera v",
    "path": "papers/23/12/2312.02934.json",
    "total_tokens": 339,
    "tldr": "该文章提出的WoVoGen系统使用World Volume作为基础，结合4D世界体积信息，提出了一种控制多摄像头驾驶场景生成的方法，以确保生成的传感器数据既具有世界内部的一致性也有跨传感器的连贯性。"
}