{
    "title": "Partial End-to-end Reinforcement Learning for Robustness Against Modelling Error in Autonomous Racing",
    "abstract": "arXiv:2312.06406v2 Announce Type: replace  Abstract: In this paper, we address the issue of increasing the performance of reinforcement learning (RL) solutions for autonomous racing cars when navigating under conditions where practical vehicle modelling errors (commonly known as \\emph{model mismatches}) are present. To address this challenge, we propose a partial end-to-end algorithm that decouples the planning and control tasks. Within this framework, an RL agent generates a trajectory comprising a path and velocity, which is subsequently tracked using a pure pursuit steering controller and a proportional velocity controller, respectively. In contrast, many current learning-based (i.e., reinforcement and imitation learning) algorithms utilise an end-to-end approach whereby a deep neural network directly maps from sensor data to control commands. By leveraging the robustness of a classical controller, our partial end-to-end driving algorithm exhibits better robustness towards model mis",
    "link": "https://arxiv.org/abs/2312.06406",
    "context": "Title: Partial End-to-end Reinforcement Learning for Robustness Against Modelling Error in Autonomous Racing\nAbstract: arXiv:2312.06406v2 Announce Type: replace  Abstract: In this paper, we address the issue of increasing the performance of reinforcement learning (RL) solutions for autonomous racing cars when navigating under conditions where practical vehicle modelling errors (commonly known as \\emph{model mismatches}) are present. To address this challenge, we propose a partial end-to-end algorithm that decouples the planning and control tasks. Within this framework, an RL agent generates a trajectory comprising a path and velocity, which is subsequently tracked using a pure pursuit steering controller and a proportional velocity controller, respectively. In contrast, many current learning-based (i.e., reinforcement and imitation learning) algorithms utilise an end-to-end approach whereby a deep neural network directly maps from sensor data to control commands. By leveraging the robustness of a classical controller, our partial end-to-end driving algorithm exhibits better robustness towards model mis",
    "path": "papers/23/12/2312.06406.json",
    "total_tokens": 336,
    "tldr": "该文章提出了一种针对自动驾驶赛车在应对实际车辆模型误差（模态差异）时的端到端强化学习方案，采用解耦的规划和控制方法，有效提高算法在面对模型误差时的性能和鲁棒性。"
}