{
    "title": "Deep Unlearning: Fast and Efficient Gradient-free Approach to Class Forgetting",
    "abstract": "arXiv:2312.00761v4 Announce Type: replace-cross  Abstract: Machine unlearning is a prominent and challenging field, driven by regulatory demands for user data deletion and heightened privacy awareness. Existing approaches involve retraining model or multiple finetuning steps for each deletion request, often constrained by computational limits and restricted data access. In this work, we introduce a novel class unlearning algorithm designed to strategically eliminate specific classes from the learned model. Our algorithm first estimates the Retain and the Forget Spaces using Singular Value Decomposition on the layerwise activations for a small subset of samples from the retain and unlearn classes, respectively. We then compute the shared information between these spaces and remove it from the forget space to isolate class-discriminatory feature space. Finally, we obtain the unlearned model by updating the weights to suppress the class discriminatory features from the activation spaces. ",
    "link": "https://arxiv.org/abs/2312.00761",
    "context": "Title: Deep Unlearning: Fast and Efficient Gradient-free Approach to Class Forgetting\nAbstract: arXiv:2312.00761v4 Announce Type: replace-cross  Abstract: Machine unlearning is a prominent and challenging field, driven by regulatory demands for user data deletion and heightened privacy awareness. Existing approaches involve retraining model or multiple finetuning steps for each deletion request, often constrained by computational limits and restricted data access. In this work, we introduce a novel class unlearning algorithm designed to strategically eliminate specific classes from the learned model. Our algorithm first estimates the Retain and the Forget Spaces using Singular Value Decomposition on the layerwise activations for a small subset of samples from the retain and unlearn classes, respectively. We then compute the shared information between these spaces and remove it from the forget space to isolate class-discriminatory feature space. Finally, we obtain the unlearned model by updating the weights to suppress the class discriminatory features from the activation spaces. ",
    "path": "papers/23/12/2312.00761.json",
    "total_tokens": 338,
    "tldr": "该文章提出了一种称为深度去学习（Deep Unlearning）的新方法，该方法能够不依赖梯度信息地高效、快速地解决类别遗忘问题，从而实现了无需重训模型即可为每个删除请求进行精确的类别更新，在不违背隐私的情况下提高了数据处理效率。"
}