{
    "title": "Robustness of Deep Learning for Accelerated MRI: Benefits of Diverse Training Data",
    "abstract": "arXiv:2312.10271v2 Announce Type: replace-cross  Abstract: Deep learning based methods for image reconstruction are state-of-the-art for a variety of imaging tasks. However, neural networks often perform worse if the training data differs significantly from the data they are applied to. For example, a model trained for accelerated magnetic resonance imaging (MRI) on one scanner performs worse on another scanner. In this work, we investigate the impact of the training data on a model's performance and robustness for accelerated MRI. We find that models trained on the combination of various data distributions, such as those obtained from different MRI scanners and anatomies, exhibit robustness equal or superior to models trained on the best single distribution for a specific target distribution. Thus training on such diverse data tends to improve robustness. Furthermore, training on such a diverse dataset does not compromise in-distribution performance, i.e., a model trained on diverse d",
    "link": "https://arxiv.org/abs/2312.10271",
    "context": "Title: Robustness of Deep Learning for Accelerated MRI: Benefits of Diverse Training Data\nAbstract: arXiv:2312.10271v2 Announce Type: replace-cross  Abstract: Deep learning based methods for image reconstruction are state-of-the-art for a variety of imaging tasks. However, neural networks often perform worse if the training data differs significantly from the data they are applied to. For example, a model trained for accelerated magnetic resonance imaging (MRI) on one scanner performs worse on another scanner. In this work, we investigate the impact of the training data on a model's performance and robustness for accelerated MRI. We find that models trained on the combination of various data distributions, such as those obtained from different MRI scanners and anatomies, exhibit robustness equal or superior to models trained on the best single distribution for a specific target distribution. Thus training on such diverse data tends to improve robustness. Furthermore, training on such a diverse dataset does not compromise in-distribution performance, i.e., a model trained on diverse d",
    "path": "papers/23/12/2312.10271.json",
    "total_tokens": 382,
    "tldr": "该文章研究了深度学习在加速磁共振成像中的鲁棒性，发现如果训练数据与实际应用数据差别较大，神经网络的表现会有所下降。研究中，使用了来自不同MRI扫描器和不同解剖结构的多样化数据集训练模型，发现这种训练方式能够提高模型对于未知数据的适应能力。文中还提到，使用多样化数据集不仅能够提升模型对于未知数据的鲁棒性，而且不会降低在已知数据上模型的性能。"
}