{
    "title": "SPOC: Imitating Shortest Paths in Simulation Enables Effective Navigation and Manipulation in the Real World",
    "abstract": "arXiv:2312.02976v2 Announce Type: replace  Abstract: Reinforcement learning (RL) with dense rewards and imitation learning (IL) with human-generated trajectories are the most widely used approaches for training modern embodied agents. RL requires extensive reward shaping and auxiliary losses and is often too slow and ineffective for long-horizon tasks. While IL with human supervision is effective, collecting human trajectories at scale is extremely expensive. In this work, we show that imitating shortest-path planners in simulation produces agents that, given a language instruction, can proficiently navigate, explore, and manipulate objects in both simulation and in the real world using only RGB sensors (no depth map or GPS coordinates). This surprising result is enabled by our end-to-end, transformer-based, SPOC architecture, powerful visual encoders paired with extensive image augmentation, and the dramatic scale and diversity of our training data: millions of frames of shortest-path",
    "link": "https://arxiv.org/abs/2312.02976",
    "context": "Title: SPOC: Imitating Shortest Paths in Simulation Enables Effective Navigation and Manipulation in the Real World\nAbstract: arXiv:2312.02976v2 Announce Type: replace  Abstract: Reinforcement learning (RL) with dense rewards and imitation learning (IL) with human-generated trajectories are the most widely used approaches for training modern embodied agents. RL requires extensive reward shaping and auxiliary losses and is often too slow and ineffective for long-horizon tasks. While IL with human supervision is effective, collecting human trajectories at scale is extremely expensive. In this work, we show that imitating shortest-path planners in simulation produces agents that, given a language instruction, can proficiently navigate, explore, and manipulate objects in both simulation and in the real world using only RGB sensors (no depth map or GPS coordinates). This surprising result is enabled by our end-to-end, transformer-based, SPOC architecture, powerful visual encoders paired with extensive image augmentation, and the dramatic scale and diversity of our training data: millions of frames of shortest-path",
    "path": "papers/23/12/2312.02976.json",
    "total_tokens": 377,
    "tldr": "该文章提出了一种名为SPOC的架构，通过在模拟环境中模仿最短路径规划器来训练机器人代理，使其能够仅通过RGB传感器数据在现实世界中进行导航、探索和物体操作，并且不需要依赖深度地图或GPS坐标。这种训练方法使得机器人能够在实际环境中有效执行任务，这主要得益于大量的模拟数据、强有力的视觉编码器以及广泛的数据增强技术。"
}