{
    "title": "MS-Twins: Multi-Scale Deep Self-Attention Networks for Medical Image Segmentation",
    "abstract": "arXiv:2312.07128v2 Announce Type: replace-cross  Abstract: Chest X-ray is one of the most common radiological examination types for the diagnosis of chest diseases. Nowadays, the automatic classification technology of radiological images has been widely used in clinical diagnosis and treatment plans. However, each disease has its own different response characteristic receptive field region, which is the main challenge for chest disease classification tasks. Besides, the imbalance of sample data categories further increases the difficulty of tasks. To solve these problems, we propose a new multi-label chest disease image classification scheme based on a multi-scale attention network. In this scheme, multi-scale information is iteratively fused to focus on regions with a high probability of disease, to effectively mine more meaningful information from data, and the classification performance can be improved only by image level annotation. We also designed a new loss function to improve t",
    "link": "https://arxiv.org/abs/2312.07128",
    "context": "Title: MS-Twins: Multi-Scale Deep Self-Attention Networks for Medical Image Segmentation\nAbstract: arXiv:2312.07128v2 Announce Type: replace-cross  Abstract: Chest X-ray is one of the most common radiological examination types for the diagnosis of chest diseases. Nowadays, the automatic classification technology of radiological images has been widely used in clinical diagnosis and treatment plans. However, each disease has its own different response characteristic receptive field region, which is the main challenge for chest disease classification tasks. Besides, the imbalance of sample data categories further increases the difficulty of tasks. To solve these problems, we propose a new multi-label chest disease image classification scheme based on a multi-scale attention network. In this scheme, multi-scale information is iteratively fused to focus on regions with a high probability of disease, to effectively mine more meaningful information from data, and the classification performance can be improved only by image level annotation. We also designed a new loss function to improve t",
    "path": "papers/23/12/2312.07128.json",
    "total_tokens": 363,
    "tldr": "该文章提出了一种新的多标签胸病影像分类方案，名为MS-Twins，这是一种基于多尺度深度自注意力网络的方案。文章通过迭代融合多尺度信息，增强了对高概率病灶区域的关注，从而有效提取数据中的有价值信息。并且在只有图像级别标注的情况下，仅通过分类性能的提升。同时，文章还设计了一种新的损失函数，以进一步提升分类结果。"
}