{
    "title": "Decomposition Strategies and Multi-shot ASP Solving for Job-shop Scheduling",
    "abstract": "arXiv:2205.07537v3 Announce Type: replace  Abstract: The Job-shop Scheduling Problem (JSP) is a well-known and challenging combinatorial optimization problem in which tasks sharing a machine are to be arranged in a sequence such that encompassing jobs can be completed as early as possible. In this paper, we investigate problem decomposition into time windows whose operations can be successively scheduled and optimized by means of multi-shot Answer Set Programming (ASP) solving. From a computational perspective, decomposition aims to split highly complex scheduling tasks into better manageable subproblems with a balanced number of operations such that good-quality or even optimal partial solutions can be reliably found in a small fraction of runtime. We devise and investigate a variety of decomposition strategies in terms of the number and size of time windows as well as heuristics for choosing their operations. Moreover, we incorporate time window overlapping and compression techniques",
    "link": "https://arxiv.org/abs/2205.07537",
    "context": "Title: Decomposition Strategies and Multi-shot ASP Solving for Job-shop Scheduling\nAbstract: arXiv:2205.07537v3 Announce Type: replace  Abstract: The Job-shop Scheduling Problem (JSP) is a well-known and challenging combinatorial optimization problem in which tasks sharing a machine are to be arranged in a sequence such that encompassing jobs can be completed as early as possible. In this paper, we investigate problem decomposition into time windows whose operations can be successively scheduled and optimized by means of multi-shot Answer Set Programming (ASP) solving. From a computational perspective, decomposition aims to split highly complex scheduling tasks into better manageable subproblems with a balanced number of operations such that good-quality or even optimal partial solutions can be reliably found in a small fraction of runtime. We devise and investigate a variety of decomposition strategies in terms of the number and size of time windows as well as heuristics for choosing their operations. Moreover, we incorporate time window overlapping and compression techniques",
    "path": "papers/22/05/2205.07537.json",
    "total_tokens": 329,
    "tldr": "该文章主要创新和贡献在于通过分解策略和时间窗口的概念，将繁琐的作业调度问题分解为更易于管理的子问题，并通过多轮回答设定编程求解，从而在较短的时间内找到了良好的局部解甚至全局解。"
}