{
    "title": "Modelling Assessment Rubrics through Bayesian Networks: a Pragmatic Approach",
    "abstract": "arXiv:2209.05467v3 Announce Type: replace-cross  Abstract: Automatic assessment of learner competencies is a fundamental task in intelligent tutoring systems. An assessment rubric typically and effectively describes relevant competencies and competence levels. This paper presents an approach to deriving a learner model directly from an assessment rubric defining some (partial) ordering of competence levels. The model is based on Bayesian networks and exploits logical gates with uncertainty (often referred to as noisy gates) to reduce the number of parameters of the model, so to simplify their elicitation by experts and allow real-time inference in intelligent tutoring systems. We illustrate how the approach can be applied to automatize the human assessment of an activity developed for testing computational thinking skills. The simple elicitation of the model starting from the assessment rubric opens up the possibility of quickly automating the assessment of several tasks, making them m",
    "link": "https://arxiv.org/abs/2209.05467",
    "context": "Title: Modelling Assessment Rubrics through Bayesian Networks: a Pragmatic Approach\nAbstract: arXiv:2209.05467v3 Announce Type: replace-cross  Abstract: Automatic assessment of learner competencies is a fundamental task in intelligent tutoring systems. An assessment rubric typically and effectively describes relevant competencies and competence levels. This paper presents an approach to deriving a learner model directly from an assessment rubric defining some (partial) ordering of competence levels. The model is based on Bayesian networks and exploits logical gates with uncertainty (often referred to as noisy gates) to reduce the number of parameters of the model, so to simplify their elicitation by experts and allow real-time inference in intelligent tutoring systems. We illustrate how the approach can be applied to automatize the human assessment of an activity developed for testing computational thinking skills. The simple elicitation of the model starting from the assessment rubric opens up the possibility of quickly automating the assessment of several tasks, making them m",
    "path": "papers/22/09/2209.05467.json",
    "total_tokens": 621,
    "translated_title": "通过贝叶斯网络建模评估 rubrics：一种务实的approach",
    "translated_abstract": "arXiv:2209.05467v3 宣布类型：替换交叉 摘要：智能教学系统中的学习者技能自动评估是一项基本任务。评估 rubric通常有效地描述了相关技能水平和资质。本文介绍了一种直接从某些层次（部分）顺序定义评估 rubric中技能的方法，以创建一个学习者模型。该模型基于贝叶斯网络，并利用不确定性逻辑门（常称为“混淆门”）来减少模型的参数数量，以便通过专家简化参数的获取，并在智能教学系统中进行实时推断。我们说明了该方法是如何应用于自动化对计算机思维技能的测试任务的评估的。从评估 rubric中简化模型的获取方式，为快速自动化多种任务评估提供了可能性。",
    "tldr": "本文提出了一种直接从评估 rubric中获取学习者模型的方法，该方法基于贝叶斯网络，通过逻辑门简化参数获取，以自动化智能教学系统中的技能测试。"
}