{
    "title": "LAMBO: Large AI Model Empowered Edge Intelligence",
    "abstract": "arXiv:2308.15078v2 Announce Type: replace  Abstract: Next-generation edge intelligence is anticipated to benefit various applications via offloading techniques. However, traditional offloading architectures face several issues, including heterogeneous constraints, partial perception, uncertain generalization, and lack of tractability. In this paper, we propose a Large AI Model-Based Offloading (LAMBO) framework with over one billion parameters for solving these problems. We first use input embedding (IE) to achieve normalized feature representation with heterogeneous constraints and task prompts. Then, we introduce a novel asymmetric encoder-decoder (AED) as the decision-making model, which is an improved transformer architecture consisting of a deep encoder and a shallow decoder for global perception and decision. Next, actor-critic learning (ACL) is used to pre-train the AED for different optimization tasks under corresponding prompts, enhancing the AED's generalization in multi-task",
    "link": "https://arxiv.org/abs/2308.15078",
    "context": "Title: LAMBO: Large AI Model Empowered Edge Intelligence\nAbstract: arXiv:2308.15078v2 Announce Type: replace  Abstract: Next-generation edge intelligence is anticipated to benefit various applications via offloading techniques. However, traditional offloading architectures face several issues, including heterogeneous constraints, partial perception, uncertain generalization, and lack of tractability. In this paper, we propose a Large AI Model-Based Offloading (LAMBO) framework with over one billion parameters for solving these problems. We first use input embedding (IE) to achieve normalized feature representation with heterogeneous constraints and task prompts. Then, we introduce a novel asymmetric encoder-decoder (AED) as the decision-making model, which is an improved transformer architecture consisting of a deep encoder and a shallow decoder for global perception and decision. Next, actor-critic learning (ACL) is used to pre-train the AED for different optimization tasks under corresponding prompts, enhancing the AED's generalization in multi-task",
    "path": "papers/23/08/2308.15078.json",
    "total_tokens": 713,
    "translated_title": "LAMBO：用大型人工智能模型增强的边缘智能",
    "translated_abstract": "arXiv:2308.15078v2 公告类型：替换 摘要：下一代边缘智能预计将通过卸载技术为各种应用带来益处。然而，传统的外加载架构面临 several 几个问题，包括异构约束、部分感知、不确定性泛化和不具有可伸缩性。在这篇论文中，我们提出了一个基于大型人工智能模型的外加载（LAMBO）框架，解决这些问题，该框架拥有超过一亿个参数。我们首先使用输入嵌入（IE）来通过异构约束和任务提示实现标准化特征表示。然后，我们引入一个新的不对称编码器-解码器（AED）作为决策模型，这是一种改进的Transformer架构，它包括一个深度编码器和一个浅度解码器用于全局感知和决策。接下来，我们使用演员-批评者学习（ACL）对AED进行预训练，在相应的提示下为不同的优化任务，增强AED的多任务泛化能力。我们还介绍了一种基于AED的双向交互影响机制，用于提升决策质量的鲁棒性和优化任务间的迁移学习能力。最后，我们在不同的任务和网络架构上进行了广泛的实验，证明了LAMBO的有效性和鲁棒性。",
    "tldr": "LAMBO框架采用大型AI模型，通过输入嵌入和AED模型，结合ACE学习进行预训练，解决了边缘智能中异构约束、感知不全等问题，并提高了模型的泛化能力。"
}