{
    "title": "Domain Reduction Strategy for Non Line of Sight Imaging",
    "abstract": "arXiv:2308.10269v2 Announce Type: replace  Abstract: This paper presents a novel optimization-based method for non-line-of-sight (NLOS) imaging that aims to reconstruct hidden scenes under general setups with significantly reduced reconstruction time. In NLOS imaging, the visible surfaces of the target objects are notably sparse. To mitigate unnecessary computations arising from empty regions, we design our method to render the transients through partial propagations from a continuously sampled set of points from the hidden space. Our method is capable of accurately and efficiently modeling the view-dependent reflectance using surface normals, which enables us to obtain surface geometry as well as albedo. In this pipeline, we propose a novel domain reduction strategy to eliminate superfluous computations in empty regions. During the optimization process, our domain reduction procedure periodically prunes the empty regions from our sampling domain in a coarse-to-fine manner, leading to ",
    "link": "https://arxiv.org/abs/2308.10269",
    "context": "Title: Domain Reduction Strategy for Non Line of Sight Imaging\nAbstract: arXiv:2308.10269v2 Announce Type: replace  Abstract: This paper presents a novel optimization-based method for non-line-of-sight (NLOS) imaging that aims to reconstruct hidden scenes under general setups with significantly reduced reconstruction time. In NLOS imaging, the visible surfaces of the target objects are notably sparse. To mitigate unnecessary computations arising from empty regions, we design our method to render the transients through partial propagations from a continuously sampled set of points from the hidden space. Our method is capable of accurately and efficiently modeling the view-dependent reflectance using surface normals, which enables us to obtain surface geometry as well as albedo. In this pipeline, we propose a novel domain reduction strategy to eliminate superfluous computations in empty regions. During the optimization process, our domain reduction procedure periodically prunes the empty regions from our sampling domain in a coarse-to-fine manner, leading to ",
    "path": "papers/23/08/2308.10269.json",
    "total_tokens": 380,
    "tldr": "该文章提出了一种基于优化方法的非直线视线（NLOS）成像新方法，该方法通过连续从隐藏空间中采样点并在可见表面特征显著减少的情况下减少重建时间。通过设计特殊的策略来截断不必要的计算，我们的方法能够准确和高效地模拟视线依赖的反射率，并使用法线来重建表面几何和硬度。此外，文中还提出了一个新颖的域减少策略，它能够在重建过程中通过逐渐细化消除空洞区域的计算，从而提高了效率。"
}