{
    "title": "Domain Reduction Strategy for Non Line of Sight Imaging",
    "abstract": "arXiv:2308.10269v2 Announce Type: replace  Abstract: This paper presents a novel optimization-based method for non-line-of-sight (NLOS) imaging that aims to reconstruct hidden scenes under general setups with significantly reduced reconstruction time. In NLOS imaging, the visible surfaces of the target objects are notably sparse. To mitigate unnecessary computations arising from empty regions, we design our method to render the transients through partial propagations from a continuously sampled set of points from the hidden space. Our method is capable of accurately and efficiently modeling the view-dependent reflectance using surface normals, which enables us to obtain surface geometry as well as albedo. In this pipeline, we propose a novel domain reduction strategy to eliminate superfluous computations in empty regions. During the optimization process, our domain reduction procedure periodically prunes the empty regions from our sampling domain in a coarse-to-fine manner, leading to ",
    "link": "https://arxiv.org/abs/2308.10269",
    "context": "Title: Domain Reduction Strategy for Non Line of Sight Imaging\nAbstract: arXiv:2308.10269v2 Announce Type: replace  Abstract: This paper presents a novel optimization-based method for non-line-of-sight (NLOS) imaging that aims to reconstruct hidden scenes under general setups with significantly reduced reconstruction time. In NLOS imaging, the visible surfaces of the target objects are notably sparse. To mitigate unnecessary computations arising from empty regions, we design our method to render the transients through partial propagations from a continuously sampled set of points from the hidden space. Our method is capable of accurately and efficiently modeling the view-dependent reflectance using surface normals, which enables us to obtain surface geometry as well as albedo. In this pipeline, we propose a novel domain reduction strategy to eliminate superfluous computations in empty regions. During the optimization process, our domain reduction procedure periodically prunes the empty regions from our sampling domain in a coarse-to-fine manner, leading to ",
    "path": "papers/23/08/2308.10269.json",
    "total_tokens": 639,
    "translated_title": "非视线成像中的域减少策略",
    "translated_abstract": "本文提出了一种基于优化的非视线（NLOS）成像新方法，旨在在通用配置下大大减少重构时间的同时准确重建隐藏场景。在非视线成像中，目标对象的可视表面显著稀疏。为了减轻不必要的计算，这些计算源自空洞区域，我们设计了该方法，允许从隐藏空间中连续采样的一组点进行部分传播，从而渲染瞬态现象。我们的方法能够准确且高效地利用表面法线建模视向反射率，从而使得能够获得表面几何形状以及反照率。在优化过程中，我们提出了一种新的域减少策略，该策略在粗到细的步骤中定期从采样域中剔除空洞区域，导致计算减少。这促进了整体优化过程的效率，并显著提高了隐藏场景的重构质量。",
    "tldr": "本文提出一种优化方法来重建隐藏场景的非视线成像，通过减少不必要计算，并使用表面法线准确高效地建模视向反射率，从而提高重构效率和质量。"
}