{
    "title": "A Comprehensive Augmentation Framework for Anomaly Detection",
    "abstract": "arXiv:2308.15068v4 Announce Type: replace-cross  Abstract: Data augmentation methods are commonly integrated into the training of anomaly detection models. Previous approaches have primarily focused on replicating real-world anomalies or enhancing diversity, without considering that the standard of anomaly varies across different classes, potentially leading to a biased training distribution.This paper analyzes crucial traits of simulated anomalies that contribute to the training of reconstructive networks and condenses them into several methods, thus creating a comprehensive framework by selectively utilizing appropriate combinations.Furthermore, we integrate this framework with a reconstruction-based approach and concurrently propose a split training strategy that alleviates the issue of overfitting while avoiding introducing interference to the reconstruction process. The evaluations conducted on the MVTec anomaly detection dataset demonstrate that our method outperforms the previou",
    "link": "https://arxiv.org/abs/2308.15068",
    "context": "Title: A Comprehensive Augmentation Framework for Anomaly Detection\nAbstract: arXiv:2308.15068v4 Announce Type: replace-cross  Abstract: Data augmentation methods are commonly integrated into the training of anomaly detection models. Previous approaches have primarily focused on replicating real-world anomalies or enhancing diversity, without considering that the standard of anomaly varies across different classes, potentially leading to a biased training distribution.This paper analyzes crucial traits of simulated anomalies that contribute to the training of reconstructive networks and condenses them into several methods, thus creating a comprehensive framework by selectively utilizing appropriate combinations.Furthermore, we integrate this framework with a reconstruction-based approach and concurrently propose a split training strategy that alleviates the issue of overfitting while avoiding introducing interference to the reconstruction process. The evaluations conducted on the MVTec anomaly detection dataset demonstrate that our method outperforms the previou",
    "path": "papers/23/08/2308.15068.json",
    "total_tokens": 321,
    "tldr": "该文章提出了一种针对异常检测的全面增强学习框架，通过考虑不同类别的异常标准差异，选代地应用适当的增强策略，并采用分段训练策略缓解过度拟合问题，同时在无干扰的图像重构过程中保持性能，在MTVae异常检测数据集上的评估结果表明该方法表现出优越性能。"
}