{
    "title": "Rule-Based Error Detection and Correction to Operationalize Movement Trajectory Classification",
    "abstract": "arXiv:2308.14250v3 Announce Type: replace-cross  Abstract: Classification of movement trajectories has many applications in transportation and is a key component for large-scale movement trajectory generation and anomaly detection which has key safety applications in the aftermath of a disaster or other external shock. However, the current state-of-the-art (SOTA) are based on supervised deep learning - which leads to challenges when the distribution of trajectories changes due to such a shock. We provide a neuro-symbolic rule-based framework to conduct error correction and detection of these models to integrate into our movement trajectory platform. We provide a suite of experiments on several recent SOTA models where we show highly accurate error detection, the ability to improve accuracy with a changing test distribution, and accuracy improvement for the base use case in addition to a suite of theoretical properties that informed algorithm development. Specifically, we show an F1 sco",
    "link": "https://arxiv.org/abs/2308.14250",
    "context": "Title: Rule-Based Error Detection and Correction to Operationalize Movement Trajectory Classification\nAbstract: arXiv:2308.14250v3 Announce Type: replace-cross  Abstract: Classification of movement trajectories has many applications in transportation and is a key component for large-scale movement trajectory generation and anomaly detection which has key safety applications in the aftermath of a disaster or other external shock. However, the current state-of-the-art (SOTA) are based on supervised deep learning - which leads to challenges when the distribution of trajectories changes due to such a shock. We provide a neuro-symbolic rule-based framework to conduct error correction and detection of these models to integrate into our movement trajectory platform. We provide a suite of experiments on several recent SOTA models where we show highly accurate error detection, the ability to improve accuracy with a changing test distribution, and accuracy improvement for the base use case in addition to a suite of theoretical properties that informed algorithm development. Specifically, we show an F1 sco",
    "path": "papers/23/08/2308.14250.json",
    "total_tokens": 732,
    "translated_title": "规则基础的错误检测和修正以实现运动轨迹分类的操作化",
    "translated_abstract": "arXiv:2308.14250v3 宣布类型：替换交叉  翻译摘要：运动轨迹的分类在交通运输领域有许多应用，是大规模运动轨迹生成和异常检测的关键组成部分，对于灾难或其他外部冲击后的安全应用至关重要。然而，目前的先进技术（SOTA）依赖于监督深度学习，当轨迹分布发生变化时，这会造成挑战。我们提供了一个神经符号规则基础框架，用于这些模型的错误检测和修正，以集成到我们的运动轨迹平台上。我们对几个最近的高级技术模型提供了实验，展示了高度准确的错误检测能力，以及对变化测试分布的准确度改进，以及对基线用例的准确度改进，以及对算法开发具有理论属性的实验套件。尤其是在显示了F1评分在测试时的绩效之后，我们从新的SOTA模型中选择了六个最具代表性的模型进行比较，并对实际测试数据的性能进行了验证。我们的规则基础错误检测和修正方法在所有六个模型中实现的F1评分平均提高了5.45个百分点，表明了其在应对变化数据分布和提高模型准确度方面的有效性。在新的SOTA模型中，我们的方法实现了最强的性能改进，达到了21.62%的平均提升。我们的work通过在复杂、未经训练的数据上显示出色的性能，为运动轨迹错误检测和修正提供了强有力的证据，并且证实了神经符号规则基础方法的实用性和优越性。",
    "tldr": "本文提出了一套规则基础的错误检测和修正方法，大幅度提高了运动轨迹分类模型的性能，特别是在应对数据分布变化时。",
    "en_tdlr": "This paper presents a rule-based error detection and correction approach that significantly enhances the performance of movement trajectory classification models, particularly in the face of changing data distributions."
}