{
    "title": "Harmonized Spatial and Spectral Learning for Robust and Generalized Medical Image Segmentation",
    "abstract": "arXiv:2401.10373v2 Announce Type: replace-cross  Abstract: Deep learning has demonstrated remarkable achievements in medical image segmentation. However, prevailing deep learning models struggle with poor generalization due to (i) intra-class variations, where the same class appears differently in different samples, and (ii) inter-class independence, resulting in difficulties capturing intricate relationships between distinct objects, leading to higher false negative cases. This paper presents a novel approach that synergies spatial and spectral representations to enhance domain-generalized medical image segmentation. We introduce the innovative Spectral Correlation Coefficient objective to improve the model's capacity to capture middle-order features and contextual long-range dependencies. This objective complements traditional spatial objectives by incorporating valuable spectral information. Extensive experiments reveal that optimizing this objective with existing architectures like",
    "link": "https://arxiv.org/abs/2401.10373",
    "context": "Title: Harmonized Spatial and Spectral Learning for Robust and Generalized Medical Image Segmentation\nAbstract: arXiv:2401.10373v2 Announce Type: replace-cross  Abstract: Deep learning has demonstrated remarkable achievements in medical image segmentation. However, prevailing deep learning models struggle with poor generalization due to (i) intra-class variations, where the same class appears differently in different samples, and (ii) inter-class independence, resulting in difficulties capturing intricate relationships between distinct objects, leading to higher false negative cases. This paper presents a novel approach that synergies spatial and spectral representations to enhance domain-generalized medical image segmentation. We introduce the innovative Spectral Correlation Coefficient objective to improve the model's capacity to capture middle-order features and contextual long-range dependencies. This objective complements traditional spatial objectives by incorporating valuable spectral information. Extensive experiments reveal that optimizing this objective with existing architectures like",
    "path": "papers/24/01/2401.10373.json",
    "total_tokens": 379,
    "tldr": "该文章提出了一种结合空间和频谱表示的深度学习方法，以增强医学图像分割的领域泛化能力。该方法通过引入新颖的谱相关系数目标函数，极大地提升了模型捕捉中尺度特征和上下文长程依赖的能力，有效解决了现有模型在处理同类图像内部差异性和不同类图像之间关联性不足的问题，从而提高了区分不同对象的能力，减少了误检情况的出现。通过优化该目标函数与现有架构（如）的结合，实验结果表明该方法在提升医学图像分割准确性和泛化能力方面取得了显著成效。"
}