{
    "title": "Dual-View Data Hallucination with Semantic Relation Guidance for Few-Shot Image Recognition",
    "abstract": "arXiv:2401.07061v2 Announce Type: replace  Abstract: Learning to recognize novel concepts from just a few image samples is very challenging as the learned model is easily overfitted on the few data and results in poor generalizability. One promising but underexplored solution is to compensate the novel classes by generating plausible samples. However, most existing works of this line exploit visual information only, rendering the generated data easy to be distracted by some challenging factors contained in the few available samples. Being aware of the semantic information in the textual modality that reflects human concepts, this work proposes a novel framework that exploits semantic relations to guide dual-view data hallucination for few-shot image recognition. The proposed framework enables generating more diverse and reasonable data samples for novel classes through effective information transfer from base classes. Specifically, an instance-view data hallucination module hallucinate",
    "link": "https://arxiv.org/abs/2401.07061",
    "context": "Title: Dual-View Data Hallucination with Semantic Relation Guidance for Few-Shot Image Recognition\nAbstract: arXiv:2401.07061v2 Announce Type: replace  Abstract: Learning to recognize novel concepts from just a few image samples is very challenging as the learned model is easily overfitted on the few data and results in poor generalizability. One promising but underexplored solution is to compensate the novel classes by generating plausible samples. However, most existing works of this line exploit visual information only, rendering the generated data easy to be distracted by some challenging factors contained in the few available samples. Being aware of the semantic information in the textual modality that reflects human concepts, this work proposes a novel framework that exploits semantic relations to guide dual-view data hallucination for few-shot image recognition. The proposed framework enables generating more diverse and reasonable data samples for novel classes through effective information transfer from base classes. Specifically, an instance-view data hallucination module hallucinate",
    "path": "papers/24/01/2401.07061.json",
    "total_tokens": 333,
    "tldr": "该文章提出了一个名为“双视图语义关系指导下的少样本图像识别数据幻化”的框架，它通过利用文本模态中的语义信息，对少样本图像识别中的数据幻化问题进行了有效解决，使得生成的新数据样本更加合理且多样化。"
}