{
    "title": "Differentiable Tree Search Network",
    "abstract": "arXiv:2401.11660v2 Announce Type: replace-cross  Abstract: In decision-making problems with limited training data, policy functions approximated using deep neural networks often exhibit suboptimal performance. An alternative approach involves learning a world model from the limited data and determining actions through online search. However, the performance is adversely affected by compounding errors arising from inaccuracies in the learned world model. While methods like TreeQN have attempted to address these inaccuracies by incorporating algorithmic inductive biases into the neural network architectures, the biases they introduce are often weak and insufficient for complex decision-making tasks. In this work, we introduce Differentiable Tree Search Network (D-TSN), a novel neural network architecture that significantly strengthens the inductive bias by embedding the algorithmic structure of a best-first online search algorithm. D-TSN employs a learned world model to conduct a fully d",
    "link": "https://arxiv.org/abs/2401.11660",
    "context": "Title: Differentiable Tree Search Network\nAbstract: arXiv:2401.11660v2 Announce Type: replace-cross  Abstract: In decision-making problems with limited training data, policy functions approximated using deep neural networks often exhibit suboptimal performance. An alternative approach involves learning a world model from the limited data and determining actions through online search. However, the performance is adversely affected by compounding errors arising from inaccuracies in the learned world model. While methods like TreeQN have attempted to address these inaccuracies by incorporating algorithmic inductive biases into the neural network architectures, the biases they introduce are often weak and insufficient for complex decision-making tasks. In this work, we introduce Differentiable Tree Search Network (D-TSN), a novel neural network architecture that significantly strengthens the inductive bias by embedding the algorithmic structure of a best-first online search algorithm. D-TSN employs a learned world model to conduct a fully d",
    "path": "papers/24/01/2401.11660.json",
    "total_tokens": 640,
    "translated_title": "可微树搜索网络",
    "translated_abstract": "arXiv:2401.11660v2 发布公告类型：替换交叉引用摘要：在有限的训练数据下进行决策制定的问题中，使用深度神经网络近似的策略函数往往表现出较低的性能。另一种方法是从有限的资料中学习世界模型，并在线搜索中确定动作。然而，由于学习的世界模型不准确，错误会累积，导致性能不佳。虽然如TreeQN的方法试图通过在神经网络架构中引入算法的偏见来解决问题，但这些偏见的强度往往不够强，不足以解决复杂的问题。在本文中，我们介绍了一种名为可微树搜索网络（D-TSN）的全新神经网络架构，该架构通过在最佳第一在线搜索算法的结构中嵌入算法结构来显著加强偏见。D-TSN使用预测的世界模型进行完全的可微树搜索，这允许对搜索过程进行优化，从而显著提高策略性能。我们在多种复杂的跟踪任务和策略学习任务中表示了D-TSN的有效性，展示了在缺乏充分的训练数据的情况下，我们的方法如何在包含复杂感知和规划特性的随机任务中实现高效和准确的动作决策。",
    "tldr": "D-TSN利用可微树搜索优化策略性能，适用于在复杂任务中进行高效和准确的行动决策。",
    "en_tdlr": "D-TSN optimizes strategy performance through differentiable tree search, enabling efficient and accurate action decision-making in complex tasks."
}