{
    "title": "Credit Risk Meets Large Language Models: Building a Risk Indicator from Loan Descriptions in P2P Lending",
    "abstract": "arXiv:2401.16458v2 Announce Type: replace-cross  Abstract: Peer-to-peer (P2P) lending has emerged as a distinctive financing mechanism, linking borrowers with lenders through online platforms. However, P2P lending faces the challenge of information asymmetry, as lenders often lack sufficient data to assess the creditworthiness of borrowers. This paper proposes a novel approach to address this issue by leveraging the textual descriptions provided by borrowers during the loan application process. Our methodology involves processing these textual descriptions using a Large Language Model (LLM), a powerful tool capable of discerning patterns and semantics within the text. Transfer learning is applied to adapt the LLM to the specific task at hand.   Our results derived from the analysis of the Lending Club dataset show that the risk score generated by BERT, a widely used LLM, significantly improves the performance of credit risk classifiers. However, the inherent opacity of LLM-based system",
    "link": "https://arxiv.org/abs/2401.16458",
    "context": "Title: Credit Risk Meets Large Language Models: Building a Risk Indicator from Loan Descriptions in P2P Lending\nAbstract: arXiv:2401.16458v2 Announce Type: replace-cross  Abstract: Peer-to-peer (P2P) lending has emerged as a distinctive financing mechanism, linking borrowers with lenders through online platforms. However, P2P lending faces the challenge of information asymmetry, as lenders often lack sufficient data to assess the creditworthiness of borrowers. This paper proposes a novel approach to address this issue by leveraging the textual descriptions provided by borrowers during the loan application process. Our methodology involves processing these textual descriptions using a Large Language Model (LLM), a powerful tool capable of discerning patterns and semantics within the text. Transfer learning is applied to adapt the LLM to the specific task at hand.   Our results derived from the analysis of the Lending Club dataset show that the risk score generated by BERT, a widely used LLM, significantly improves the performance of credit risk classifiers. However, the inherent opacity of LLM-based system",
    "path": "papers/24/01/2401.16458.json",
    "total_tokens": 356,
    "tldr": "该文章提出一种利用文本描述信息通过大型语言模型(LLM)解决P2P借贷中信息不对称问题的新方法。通过在Lending Club数据集上对BERT等LLM的运用，本文展示了其生成风险评分对于提升信贷风险分类器性能的有效性。"
}