{
    "title": "Fun with Flags: Robust Principal Directions via Flag Manifolds",
    "abstract": "arXiv:2401.04071v4 Announce Type: replace  Abstract: Principal component analysis (PCA), along with its extensions to manifolds and outlier contaminated data, have been indispensable in computer vision and machine learning. In this work, we present a unifying formalism for PCA and its variants, and introduce a framework based on the flags of linear subspaces, ie a hierarchy of nested linear subspaces of increasing dimension, which not only allows for a common implementation but also yields novel variants, not explored previously. We begin by generalizing traditional PCA methods that either maximize variance or minimize reconstruction error. We expand these interpretations to develop a wide array of new dimensionality reduction algorithms by accounting for outliers and the data manifold. To devise a common computational approach, we recast robust and dual forms of PCA as optimization problems on flag manifolds. We then integrate tangent space approximations of principal geodesic analysi",
    "link": "https://arxiv.org/abs/2401.04071",
    "context": "Title: Fun with Flags: Robust Principal Directions via Flag Manifolds\nAbstract: arXiv:2401.04071v4 Announce Type: replace  Abstract: Principal component analysis (PCA), along with its extensions to manifolds and outlier contaminated data, have been indispensable in computer vision and machine learning. In this work, we present a unifying formalism for PCA and its variants, and introduce a framework based on the flags of linear subspaces, ie a hierarchy of nested linear subspaces of increasing dimension, which not only allows for a common implementation but also yields novel variants, not explored previously. We begin by generalizing traditional PCA methods that either maximize variance or minimize reconstruction error. We expand these interpretations to develop a wide array of new dimensionality reduction algorithms by accounting for outliers and the data manifold. To devise a common computational approach, we recast robust and dual forms of PCA as optimization problems on flag manifolds. We then integrate tangent space approximations of principal geodesic analysi",
    "path": "papers/24/01/2401.04071.json",
    "total_tokens": 333,
    "tldr": "该文章提出了一种基于线性子空间旗帜（flags）的统一框架，用于变量选择、误差最小化和数据分布的特殊情况处理，为PCA及其扩展提供了一种通用的实现方法，并在flags的层级结构中学到了新的维度降低算法。这为研究领域提供了新的视角和更多的算法选择。"
}