{
    "title": "Routoo: Learning to Route to Large Language Models Effectively",
    "abstract": "arXiv:2401.13979v2 Announce Type: replace-cross  Abstract: Developing foundational large language models (LLMs) is becoming increasingly costly and inefficient. Also, closed-source and larger open-source models generally offer better response quality but come with higher inference costs than smaller models. In this paper, we introduce Routoo, an architecture designed to optimize the selection of LLMs for specific prompts based on performance, cost, and efficiency. Routoo consists of two key components: a performance predictor and a cost-aware decoding. The performance predictor is a lightweight LLM that estimates the performance of various underlying LLMs without needing to execute and evaluate them. The cost-aware decoding then selects the most suitable model based on these predictions and other constraints like cost and latency. We evaluated Routoo using the MMLU benchmark across 57 domains employing open-source models. Our results show that Routoo matches the performance of the Mixt",
    "link": "https://arxiv.org/abs/2401.13979",
    "context": "Title: Routoo: Learning to Route to Large Language Models Effectively\nAbstract: arXiv:2401.13979v2 Announce Type: replace-cross  Abstract: Developing foundational large language models (LLMs) is becoming increasingly costly and inefficient. Also, closed-source and larger open-source models generally offer better response quality but come with higher inference costs than smaller models. In this paper, we introduce Routoo, an architecture designed to optimize the selection of LLMs for specific prompts based on performance, cost, and efficiency. Routoo consists of two key components: a performance predictor and a cost-aware decoding. The performance predictor is a lightweight LLM that estimates the performance of various underlying LLMs without needing to execute and evaluate them. The cost-aware decoding then selects the most suitable model based on these predictions and other constraints like cost and latency. We evaluated Routoo using the MMLU benchmark across 57 domains employing open-source models. Our results show that Routoo matches the performance of the Mixt",
    "path": "papers/24/01/2401.13979.json",
    "total_tokens": 747,
    "translated_title": "论文标题: 有效的路由学习到大型语言模型",
    "translated_abstract": "论文摘要: arXiv:2401.13979v2 公告类型: 替换跨学科摘要: 开发基础大型语言模型(LLM)的成本正在变得越来越高，效率也越来越低。此外，闭源和大型的开源模型通常提供更好的响应质量，但代价更高，不如小规模模型。在这篇论文中，我们介绍了一个名为“Routoo”的建筑设计，旨在根据性能、成本和效率来优化特定提示的LLM选择。Routoo包括两个关键组件：一个性能预测器和一个成本自适应解码器。性能预测器是一个轻量级的LLM，它不需要执行和评估就能估计各种底层LLM的性能。成本自适应解码器根据这些预测和其他约束（如成本和延迟）选择最合适的模型。我们使用MMLU基准对57个学科领域中的开源模型进行了评估。我们的结果表明，Routoo在匹配MMLU基准点方面与开源模型的性能相当。",
    "tldr": "论文创新：开发了一种名为“Routoo”的建筑，旨在根据性能、成本和效率来优化大型语言模型的选择，以提高特定提示的响应质量。"
}