{
    "title": "I am a Strange Dataset: Metalinguistic Tests for Language Models",
    "abstract": "arXiv:2401.05300v2 Announce Type: replace-cross  Abstract: Statements involving metalinguistic self-reference (\"This paper has six sections.\") are prevalent in many domains. Can current large language models (LLMs) handle such language? In this paper, we present \"I am a Strange Dataset\", a new dataset for addressing this question. There are two subtasks: generation and verification. In generation, models continue statements like \"The penultimate word in this sentence is\" (where a correct continuation is \"is\"). In verification, models judge the truth of statements like \"The penultimate word in this sentence is sentence.\" (false). We also provide minimally different metalinguistic non-self-reference examples to complement the main dataset by probing for whether models can handle metalinguistic language at all. The dataset is hand-crafted by experts and validated by non-expert annotators. We test a variety of open-source LLMs (7B to 70B parameters) as well as closed-source LLMs through AP",
    "link": "https://arxiv.org/abs/2401.05300",
    "context": "Title: I am a Strange Dataset: Metalinguistic Tests for Language Models\nAbstract: arXiv:2401.05300v2 Announce Type: replace-cross  Abstract: Statements involving metalinguistic self-reference (\"This paper has six sections.\") are prevalent in many domains. Can current large language models (LLMs) handle such language? In this paper, we present \"I am a Strange Dataset\", a new dataset for addressing this question. There are two subtasks: generation and verification. In generation, models continue statements like \"The penultimate word in this sentence is\" (where a correct continuation is \"is\"). In verification, models judge the truth of statements like \"The penultimate word in this sentence is sentence.\" (false). We also provide minimally different metalinguistic non-self-reference examples to complement the main dataset by probing for whether models can handle metalinguistic language at all. The dataset is hand-crafted by experts and validated by non-expert annotators. We test a variety of open-source LLMs (7B to 70B parameters) as well as closed-source LLMs through AP",
    "path": "papers/24/01/2401.05300.json",
    "total_tokens": 444,
    "tldr": "该文章创新性地创建了“I am a Strange Dataset”这一新数据集，用于评估和检测大型语言模型对包含自我参照语言的句子进行生成和验证的能力。该数据集的设计包括两个子任务：一是要求模型完成含有自我参照情况的句子，二是判断这些包含自我参照的句子是否真实。通过与非自我参照句子的对比，该数据集能够更全面地评估语言模型处理这类语句的能力。文章通过专家手工制作并经非专家审核，测试了多种规模的语言模型，展示了评估和管理语言模型在处理自我参照语言方面的性能改进。"
}