{
    "title": "The Cultivated Practices of Text-to-Image Generation",
    "abstract": "arXiv:2306.11393v2 Announce Type: replace-cross  Abstract: Humankind is entering a novel creative era in which anybody can synthesize digital information using generative artificial intelligence (AI). Text-to-image generation, in particular, has become vastly popular and millions of practitioners produce AI-generated images and AI art online. This chapter first gives an overview of the key developments that enabled a healthy co-creative online ecosystem around text-to-image generation to rapidly emerge, followed by a high-level description of key elements in this ecosystem. A particular focus is placed on prompt engineering, a creative practice that has been embraced by the AI art community. It is then argued that the emerging co-creative ecosystem constitutes an intelligent system on its own - a system that both supports human creativity, but also potentially entraps future generations and limits future development efforts in AI. The chapter discusses the potential risks and dangers o",
    "link": "https://arxiv.org/abs/2306.11393",
    "context": "Title: The Cultivated Practices of Text-to-Image Generation\nAbstract: arXiv:2306.11393v2 Announce Type: replace-cross  Abstract: Humankind is entering a novel creative era in which anybody can synthesize digital information using generative artificial intelligence (AI). Text-to-image generation, in particular, has become vastly popular and millions of practitioners produce AI-generated images and AI art online. This chapter first gives an overview of the key developments that enabled a healthy co-creative online ecosystem around text-to-image generation to rapidly emerge, followed by a high-level description of key elements in this ecosystem. A particular focus is placed on prompt engineering, a creative practice that has been embraced by the AI art community. It is then argued that the emerging co-creative ecosystem constitutes an intelligent system on its own - a system that both supports human creativity, but also potentially entraps future generations and limits future development efforts in AI. The chapter discusses the potential risks and dangers o",
    "path": "papers/23/06/2306.11393.json",
    "total_tokens": 609,
    "translated_title": "《人工智造 · 影像印记》",
    "translated_abstract": "人类正在进入一个全新的创造时代，任何人在线都可以使用生成的人工智能（AI）来创建数字信息。其中，文本到图像生成的技术尤为流行，数以百万计的实践者在线创作AI图像和艺术作品。本文首先概述了创造一个健康的文本到图像生成在线共创生态系统的关键发展，然后详细描述了这个生态系统中的关键元素。文中特别关注了催生工程--一种被AI艺术社区广泛接受的艺术实践。随后，文章建议这个逐渐成型的共创生态系统是一个独立的人工智能系统，它支持人类创造力，同时也可能限制未来AI的发展和影响未来代际的发展。文章讨论了这个系统可能带来的风险和挑战。",
    "tldr": "在《人工智造 · 影像印记》一章中，作者描述了文本到图像生成技术的里程碑式发展以及在其中扮演关键角色的“催生工程”。文章提醒我们需要对这种共创生态系统可能带来的影响进行深入思考。",
    "en_tdlr": "This chapter discusses the key developments in text-to-image generation and the concept of \"prompt engineering\" that has become prevalent in the AI art community, arguing over the potential risks and implications of this ecosystem."
}