{
    "title": "Rethinking Feature Backbone Fine-tuning for Remote Sensing Object Detection",
    "abstract": "arXiv:2407.15143v2 Announce Type: replace  Abstract: Recently, numerous methods have achieved impressive performance in remote sensing object detection, relying on convolution or transformer architectures. Such detectors typically have a feature backbone to extract useful features from raw input images. For the remote sensing domain, a common practice among current detectors is to initialize the backbone with pre-training on ImageNet consisting of natural scenes. Fine-tuning the backbone is then typically required to generate features suitable for remote-sensing images. However, this could hinder the extraction of basic visual features in long-term training, thus restricting performance improvement. To mitigate this issue, we propose a novel method named DBF (Dynamic Backbone Freezing) for feature backbone fine-tuning on remote sensing object detection. Our method aims to handle the dilemma of whether the backbone should extract low-level generic features or possess specific knowledge ",
    "link": "https://arxiv.org/abs/2407.15143",
    "context": "Title: Rethinking Feature Backbone Fine-tuning for Remote Sensing Object Detection\nAbstract: arXiv:2407.15143v2 Announce Type: replace  Abstract: Recently, numerous methods have achieved impressive performance in remote sensing object detection, relying on convolution or transformer architectures. Such detectors typically have a feature backbone to extract useful features from raw input images. For the remote sensing domain, a common practice among current detectors is to initialize the backbone with pre-training on ImageNet consisting of natural scenes. Fine-tuning the backbone is then typically required to generate features suitable for remote-sensing images. However, this could hinder the extraction of basic visual features in long-term training, thus restricting performance improvement. To mitigate this issue, we propose a novel method named DBF (Dynamic Backbone Freezing) for feature backbone fine-tuning on remote sensing object detection. Our method aims to handle the dilemma of whether the backbone should extract low-level generic features or possess specific knowledge ",
    "path": "papers/24/07/2407.15143.json",
    "total_tokens": 391,
    "tldr": "该文章提出了一种名为DBF（Dynamic Backbone Freezing）的动态特性骨干冻结方法，用于解决在遥感物体检测中特征骨干的精细调节问题。这种方法旨在解决在遥感领域中，常见的将骨干网络在ImageNet自然场景预训练后再用于遥感图像的特征提取可能会导致基础视觉特征提取能力下降的问题，限制了性能的进一步提升。通过动态调节骨干网络的冻结策略，DBF方法能够在保持骨干网络低级通用的特征提取能力的同时，提高其领域特定的知识提取效率，从而提高了遥感物体检测的性能。"
}