{
    "title": "VersusDebias: Universal Zero-Shot Debiasing for Text-to-Image Models via SLM-Based Prompt Engineering and Generative Adversary",
    "abstract": "arXiv:2407.19524v2 Announce Type: replace  Abstract: With the rapid development of Text-to-Image models, biases in human image generation against demographic groups social attract more and more concerns. Existing methods are designed based on certain models with fixed prompts, unable to accommodate the trend of high-speed updating of Text-to-Image (T2I) models and variable prompts in practical scenes. Additionally, they fail to consider the possibility of hallucinations, leading to deviations between expected and actual results. To address this issue, we introduce VersusDebias, a novel and universal debiasing framework for biases in T2I models, consisting of one generative adversarial mechanism (GAM) and one debiasing generation mechanism using a small language model (SLM). The self-adaptive GAM generates specialized attribute arrays for each prompts for diminishing the influence of hallucinations from T2I models. The SLM uses prompt engineering to generate debiased prompts for the T2I",
    "link": "https://arxiv.org/abs/2407.19524",
    "context": "Title: VersusDebias: Universal Zero-Shot Debiasing for Text-to-Image Models via SLM-Based Prompt Engineering and Generative Adversary\nAbstract: arXiv:2407.19524v2 Announce Type: replace  Abstract: With the rapid development of Text-to-Image models, biases in human image generation against demographic groups social attract more and more concerns. Existing methods are designed based on certain models with fixed prompts, unable to accommodate the trend of high-speed updating of Text-to-Image (T2I) models and variable prompts in practical scenes. Additionally, they fail to consider the possibility of hallucinations, leading to deviations between expected and actual results. To address this issue, we introduce VersusDebias, a novel and universal debiasing framework for biases in T2I models, consisting of one generative adversarial mechanism (GAM) and one debiasing generation mechanism using a small language model (SLM). The self-adaptive GAM generates specialized attribute arrays for each prompts for diminishing the influence of hallucinations from T2I models. The SLM uses prompt engineering to generate debiased prompts for the T2I",
    "path": "papers/24/07/2407.19524.json",
    "total_tokens": 707,
    "translated_title": "VersusDebias: 通用的零样本文本到图像模型的基于小语言模型的提示工程和生成对手的偏激消除",
    "translated_abstract": "arXiv:2407.19524v2 公告类型：替换 摘要：随着文本到图像（T2I）模型的快速发展，人类图像生成中对某些社会群体的偏见越来越受到关注。现有方法仅基于特定模型的固定提示，无法适应T2I模型更新速度快和实际场景中提示多样性的趋势。此外，它们还不能考虑到想象的风险，导致预期结果和实际结果之间存在偏差。为了解决这个问题，我们引入了VersusDebias，这是一个针对T2I模型中偏见的全新且通用的偏激消除框架，它由一个生成对手机制（GAM）和一个使用小语言模型的偏激消除生成机制组成。自适应的GAM为每个提示生成专用的属性数组，以减少T2I模型中想象的影响。SLM使用提示工程为T2I模型生成无偏提示。",
    "tldr": "我们提出了一种通用的文本到图像模型偏激消除框架VersusDebias，使用小语言模型和生成对手机制来减少偏激想象的影响，并通过提示工程生成无偏的提示。"
}