{
    "title": "MSA$^2$Net: Multi-scale Adaptive Attention-guided Network for Medical Image Segmentation",
    "abstract": "arXiv:2407.21640v2 Announce Type: replace-cross  Abstract: Medical image segmentation involves identifying and separating object instances in a medical image to delineate various tissues and structures, a task complicated by the significant variations in size, shape, and density of these features. Convolutional neural networks (CNNs) have traditionally been used for this task but have limitations in capturing long-range dependencies. Transformers, equipped with self-attention mechanisms, aim to address this problem. However, in medical image segmentation it is beneficial to merge both local and global features to effectively integrate feature maps across various scales, capturing both detailed features and broader semantic elements for dealing with variations in structures. In this paper, we introduce MSA$^2$Net, a new deep segmentation framework featuring an expedient design of skip-connections. These connections facilitate feature fusion by dynamically weighting and combining coarse-",
    "link": "https://arxiv.org/abs/2407.21640",
    "context": "Title: MSA$^2$Net: Multi-scale Adaptive Attention-guided Network for Medical Image Segmentation\nAbstract: arXiv:2407.21640v2 Announce Type: replace-cross  Abstract: Medical image segmentation involves identifying and separating object instances in a medical image to delineate various tissues and structures, a task complicated by the significant variations in size, shape, and density of these features. Convolutional neural networks (CNNs) have traditionally been used for this task but have limitations in capturing long-range dependencies. Transformers, equipped with self-attention mechanisms, aim to address this problem. However, in medical image segmentation it is beneficial to merge both local and global features to effectively integrate feature maps across various scales, capturing both detailed features and broader semantic elements for dealing with variations in structures. In this paper, we introduce MSA$^2$Net, a new deep segmentation framework featuring an expedient design of skip-connections. These connections facilitate feature fusion by dynamically weighting and combining coarse-",
    "path": "papers/24/07/2407.21640.json",
    "total_tokens": 665,
    "translated_title": "MSA²Net: 针对医学图像分割的多尺度自适应注意力导向网络",
    "translated_abstract": "arXiv:2407.21640v2 公告类型：替换交叉  翻译摘要：医学图像分割涉及在医学图像中识别和分离对象实例，以绘制各种组织和结构，这项任务因这些特征在大小、形状和密度上的显著差异而变得复杂。传统的卷积神经网络（CNNs）被用于这项任务，但它们在捕获长距离相关方面存在局限性。变换器，配备有自注意力机制，旨在解决这一问题。然而，在医学图像分割中，合并局部和全局特征是有益的，以有效地在各种尺度上整合特征映射，捕捉结构变化的详细特征和更广泛的意义要素。在这项研究中，我们提出了MSA²Net，一个新的深层分割框架，具有快捷的设计的跳转连接。这些连接通过动态加权和组合粗细特征，促进了特征融合，从而有效地处理了结构的变化。",
    "tldr": "MSA²Net 是一种新的深度分割框架，它通过设计快捷的跳转连接，解决了医学图像分割中对本地和全局特征进行有效融合的问题，以处理结构变化，促进特征的动态加权和组合。"
}