{
    "title": "Deep learning for dynamic modeling and coded information storage of vector-soliton pulsations in mode-locked fiber lasers",
    "abstract": "arXiv:2407.18725v2 Announce Type: replace-cross  Abstract: Soliton pulsations are ubiquitous feature of non-stationary soliton dynamics in mode-locked lasers and many other physical systems. To overcome difficulties related to huge amount of necessary computations and low efficiency of traditional numerical methods in modeling the evolution of non-stationary solitons, we propose a two-parallel bidirectional long short-term memory recurrent neural network, with the main objective to predict dynamics of vector-soliton pulsations in various complex states, whose real-time dynamics is verified by experiments. Besides, the scheme of coded information storage based on the TP-Bi_LSTM RNN, instead of actual pulse signals, is realized too. The findings offer new applications of deep learning to ultrafast optics and information storage.",
    "link": "https://arxiv.org/abs/2407.18725",
    "context": "Title: Deep learning for dynamic modeling and coded information storage of vector-soliton pulsations in mode-locked fiber lasers\nAbstract: arXiv:2407.18725v2 Announce Type: replace-cross  Abstract: Soliton pulsations are ubiquitous feature of non-stationary soliton dynamics in mode-locked lasers and many other physical systems. To overcome difficulties related to huge amount of necessary computations and low efficiency of traditional numerical methods in modeling the evolution of non-stationary solitons, we propose a two-parallel bidirectional long short-term memory recurrent neural network, with the main objective to predict dynamics of vector-soliton pulsations in various complex states, whose real-time dynamics is verified by experiments. Besides, the scheme of coded information storage based on the TP-Bi_LSTM RNN, instead of actual pulse signals, is realized too. The findings offer new applications of deep learning to ultrafast optics and information storage.",
    "path": "papers/24/07/2407.18725.json",
    "total_tokens": 429,
    "tldr": "Title: 基于深度学习的模式锁定光纤激光器中的矢量孤立子脉冲动态建模和编码信息存储\n摘要：arXiv:2407.18725v2 公告类型：替换交叉\n摘要：孤立子脉冲是模式锁定激光器等许多物理系统中非稳态孤立子动态的常见特征。为了克服传统数值方法在模拟非稳态孤立子演化时面临的巨大计算需求和低效率问题，我们提出了一个双并行双向长短期记忆 recurrent neural network（LSTM），旨在预测在各种复杂状态下矢量孤立子脉冲的动态，这些动态已在实验中得到证实。此外，还实现了基于 TP-Bi_LSTM RNN 的编码信息存储方案，它使用的是实际脉冲信号替代。我们的发现为超快光学和信息存储带来了深度学习的新应用。"
}