{
    "title": "Characterizing User Archetypes and Discussions on Scored.co",
    "abstract": "arXiv:2407.21753v1 Announce Type: cross  Abstract: In recent years, the proliferation of social platforms has drastically transformed the way individuals interact, organize, and share information. In this scenario, we experience an unprecedented increase in the scale and complexity of interactions and, at the same time, little to no research about some fringe social platforms. In this paper, we present a multi-dimensional framework for characterizing nodes and hyperedges in social hypernetworks, with a focus on the understudied alt-right platform Scored.co. Our approach integrates the possibility of studying higher-order interactions, thanks to the hypernetwork representation, and various node features such as user activity, sentiment, and toxicity, with the aim to define distinct user archetypes and understand their roles within the network. Utilizing a comprehensive dataset from Scored.co, we analyze the dynamics of these archetypes over time and explore their interactions and influe",
    "link": "https://arxiv.org/abs/2407.21753",
    "context": "Title: Characterizing User Archetypes and Discussions on Scored.co\nAbstract: arXiv:2407.21753v1 Announce Type: cross  Abstract: In recent years, the proliferation of social platforms has drastically transformed the way individuals interact, organize, and share information. In this scenario, we experience an unprecedented increase in the scale and complexity of interactions and, at the same time, little to no research about some fringe social platforms. In this paper, we present a multi-dimensional framework for characterizing nodes and hyperedges in social hypernetworks, with a focus on the understudied alt-right platform Scored.co. Our approach integrates the possibility of studying higher-order interactions, thanks to the hypernetwork representation, and various node features such as user activity, sentiment, and toxicity, with the aim to define distinct user archetypes and understand their roles within the network. Utilizing a comprehensive dataset from Scored.co, we analyze the dynamics of these archetypes over time and explore their interactions and influe",
    "path": "papers/24/07/2407.21753.json",
    "total_tokens": 663,
    "translated_title": "研究用户原型以及在评分网上的讨论",
    "translated_abstract": "arXiv:2407.21753v1 公告类型：交叉  摘要：近年来，社交媒体平台的普及极大地改变了个人互动、组织和分享信息的方式。在这种背景下，我们见证了互动规模和复杂性的急剧增加，同时对一些边缘社交平台的研究却少之又少。在本研究中，我们提出了一个多维框架，用于在关注度不高的极右翼平台“评分网”上研究节点和超边。我们的方法整合了对更高阶互动的可能性研究，得益于超网络表示，并考虑了节点特征，如用户活跃度、情感和毒性，旨在定义不同类型的用户原型并了解其在网络中的作用。利用评分网的大量数据，我们分析了这些原型随时间的变化，并探讨了它们之间的互动及其影响力。通过我们的方法，我们揭示了该平台上的用户特征、活跃度、讨论内容和社区成员的行为，为相关领域提供了深刻的见解",
    "tldr": "本研究开发了一个多维框架来分析极右翼社交平台“评分网”上的用户类型和互动，揭示了平台用户特征、活跃度、讨论内容和社区成员的行为"
}