{
    "title": "Implementing Streaming algorithm and k-means clusters to RAG",
    "abstract": "arXiv:2407.21300v2 Announce Type: replace-cross  Abstract: Retrieval-augmented generation (RAG) has achieved great success in information retrieval to assist large language models because it builds an external knowledge database. However, it also has many problems: it consumes a lot of memory because of the huge database. When faced with massive streaming data, it is unable to update the established index database in time. To save the memory of building the database and maintain accuracy simultaneously, we proposed a new approach combining a streaming algorithm and k-means cluster with RAG. Our approach applies a streaming algorithm to update the index and reduce memory consumption. Then use the k-means algorithm to cluster documents with high similarities together, the query time will be shortened by doing this. We conducted comparative experiments on four methods, and the results show that RAG with streaming algorithm and k-means cluster performs well in accuracy and memory. For mass",
    "link": "https://arxiv.org/abs/2407.21300",
    "context": "Title: Implementing Streaming algorithm and k-means clusters to RAG\nAbstract: arXiv:2407.21300v2 Announce Type: replace-cross  Abstract: Retrieval-augmented generation (RAG) has achieved great success in information retrieval to assist large language models because it builds an external knowledge database. However, it also has many problems: it consumes a lot of memory because of the huge database. When faced with massive streaming data, it is unable to update the established index database in time. To save the memory of building the database and maintain accuracy simultaneously, we proposed a new approach combining a streaming algorithm and k-means cluster with RAG. Our approach applies a streaming algorithm to update the index and reduce memory consumption. Then use the k-means algorithm to cluster documents with high similarities together, the query time will be shortened by doing this. We conducted comparative experiments on four methods, and the results show that RAG with streaming algorithm and k-means cluster performs well in accuracy and memory. For mass",
    "path": "papers/24/07/2407.21300.json",
    "total_tokens": 653,
    "translated_title": "使用流算法和K-means聚类实现RAG（检索增强生成）",
    "translated_abstract": "arXiv:2407.21300v2 公告类型：替换交叉 - 摘要：检索增强生成（RAG）在利用大型语言模型协助信息检索方面取得了巨大成功，因为它建立了一个外部知识数据库。然而，它也有许多问题：由于数据库巨大，它消耗了大量内存。面对海量流数据时，它无法及时更新已建立的索引数据库。为了节省建立数据库的内存消耗并保持准确性，我们提出了一种新的方法，将流算法和K-means聚类与RAG结合起来。我们的方法应用流算法来更新索引并减少内存消耗。然后使用K-means算法将彼此相似度高的文档聚类在一起，这样查询时间就会缩短。我们对四种方法进行了对比实验，结果表明，使用流算法和K-means聚类的RAG在准确性和内存方面表现良好。对于大规模的数据集，我们的方法在计算和内存消耗上都比传统RAG方法更高效。",
    "tldr": "论文提出了一种结合流算法和K-means聚类的RAG改进方案，以高效更新索引并缩短查询时间，同时节省内存资源。|>"
}