{
    "title": "CCVA-FL: Cross-Client Variations Adaptive Federated Learning for Medical Imaging",
    "abstract": "arXiv:2407.11652v3 Announce Type: replace  Abstract: Federated Learning (FL) offers a privacy-preserving approach to train models on decentralized data. Its potential in healthcare is significant, but challenges arise due to cross-client variations in medical image data, exacerbated by limited annotations. This paper introduces Cross-Client Variations Adaptive Federated Learning (CCVA-FL) to address these issues. CCVA-FL aims to minimize cross-client variations by transforming images into a common feature space. It involves expert annotation of a subset of images from each client, followed by the selection of a client with the least data complexity as the target. Synthetic medical images are then generated using Scalable Diffusion Models with Transformers (DiT) based on the target client's annotated images. These synthetic images, capturing diversity and representing the original data, are shared with other clients. Each client then translates its local images into the target image spa",
    "link": "https://arxiv.org/abs/2407.11652",
    "context": "Title: CCVA-FL: Cross-Client Variations Adaptive Federated Learning for Medical Imaging\nAbstract: arXiv:2407.11652v3 Announce Type: replace  Abstract: Federated Learning (FL) offers a privacy-preserving approach to train models on decentralized data. Its potential in healthcare is significant, but challenges arise due to cross-client variations in medical image data, exacerbated by limited annotations. This paper introduces Cross-Client Variations Adaptive Federated Learning (CCVA-FL) to address these issues. CCVA-FL aims to minimize cross-client variations by transforming images into a common feature space. It involves expert annotation of a subset of images from each client, followed by the selection of a client with the least data complexity as the target. Synthetic medical images are then generated using Scalable Diffusion Models with Transformers (DiT) based on the target client's annotated images. These synthetic images, capturing diversity and representing the original data, are shared with other clients. Each client then translates its local images into the target image spa",
    "path": "papers/24/07/2407.11652.json",
    "total_tokens": 709,
    "translated_title": "跨客户端变异性自适应联邦学习方法 CCVA-FL：应用于基于医学影像的数据集",
    "translated_abstract": "arXiv:2407.11652v3 公告类型：替换",
    "tldr": "本文提出了一种名为“跨客户端变异性自适应联邦学习”（CCVA-FL）的方法，通过生成合成医学图像解决医疗图像数据中的跨客户端变异问题，从而提高联邦学习的性能。",
    "en_tdlr": "This paper introduces a new method called \"Cross-Client Variations Adaptive Federated Learning\" (CCVA-FL), which addresses cross-client variations in medical image data by generating synthetic medical images, enhancing the effectiveness of federated learning."
}