{
    "title": "An Alternative to Multi-Factor Authentication with a Triple-Identity Authentication Scheme",
    "abstract": "arXiv:2407.19459v2 Announce Type: replace-cross  Abstract: Every user authentication scheme involves three login credentials, i.e. a username, a password and a hash value, but only one of them is associated with a user identity. However, this single identity is not robust enough to protect the whole system and the login entries (i.e., the username and password forms) have not been effectively authenticated. Therefore, a multi-factor authentication service is utilized to help guarantee the account security by transmitting a second factor to the user to use. If more identities can be employed for the two login forms to associate with all login credentials, and if the corresponding identifiers are not transmitted via the network and operated by users, such a system can be more robust even without relying on a third-party service. To this end, a triple-identity authentication scheme is designed within a dual-password login-authentication system, which defines identities for the username an",
    "link": "https://arxiv.org/abs/2407.19459",
    "context": "Title: An Alternative to Multi-Factor Authentication with a Triple-Identity Authentication Scheme\nAbstract: arXiv:2407.19459v2 Announce Type: replace-cross  Abstract: Every user authentication scheme involves three login credentials, i.e. a username, a password and a hash value, but only one of them is associated with a user identity. However, this single identity is not robust enough to protect the whole system and the login entries (i.e., the username and password forms) have not been effectively authenticated. Therefore, a multi-factor authentication service is utilized to help guarantee the account security by transmitting a second factor to the user to use. If more identities can be employed for the two login forms to associate with all login credentials, and if the corresponding identifiers are not transmitted via the network and operated by users, such a system can be more robust even without relying on a third-party service. To this end, a triple-identity authentication scheme is designed within a dual-password login-authentication system, which defines identities for the username an",
    "path": "papers/24/07/2407.19459.json",
    "total_tokens": 329,
    "tldr": "该文章提出了一种基于双密码登录验证系统的三重身份认证方案，该方案通过为用户名和密码定义身份，即使在不需要第三方服务的情况下，也能提高系统的安全性。"
}