{
    "title": "Integer-Valued Training and Spike-Driven Inference Spiking Neural Network for High-performance and Energy-efficient Object Detection",
    "abstract": "arXiv:2407.20708v3 Announce Type: replace  Abstract: Brain-inspired Spiking Neural Networks (SNNs) have bio-plausibility and low-power advantages over Artificial Neural Networks (ANNs). Applications of SNNs are currently limited to simple classification tasks because of their poor performance. In this work, we focus on bridging the performance gap between ANNs and SNNs on object detection. Our design revolves around network architecture and spiking neuron. First, the overly complex module design causes spike degradation when the YOLO series is converted to the corresponding spiking version. We design a SpikeYOLO architecture to solve this problem by simplifying the vanilla YOLO and incorporating meta SNN blocks. Second, object detection is more sensitive to quantization errors in the conversion of membrane potentials into binary spikes by spiking neurons. To address this challenge, we design a new spiking neuron that activates Integer values during training while maintaining spike-driv",
    "link": "https://arxiv.org/abs/2407.20708",
    "context": "Title: Integer-Valued Training and Spike-Driven Inference Spiking Neural Network for High-performance and Energy-efficient Object Detection\nAbstract: arXiv:2407.20708v3 Announce Type: replace  Abstract: Brain-inspired Spiking Neural Networks (SNNs) have bio-plausibility and low-power advantages over Artificial Neural Networks (ANNs). Applications of SNNs are currently limited to simple classification tasks because of their poor performance. In this work, we focus on bridging the performance gap between ANNs and SNNs on object detection. Our design revolves around network architecture and spiking neuron. First, the overly complex module design causes spike degradation when the YOLO series is converted to the corresponding spiking version. We design a SpikeYOLO architecture to solve this problem by simplifying the vanilla YOLO and incorporating meta SNN blocks. Second, object detection is more sensitive to quantization errors in the conversion of membrane potentials into binary spikes by spiking neurons. To address this challenge, we design a new spiking neuron that activates Integer values during training while maintaining spike-driv",
    "path": "papers/24/07/2407.20708.json",
    "total_tokens": 762,
    "translated_title": "整数值训练与 spikes 驱动推理的 SNN 对象检测，具备高性能与低能耗",
    "translated_abstract": "arXiv:2407.20708v3 宣布类型：替换 摘要： 与人工神经网络（ANNs）相比，具有生物学合理性和低功耗优势的突触神经网络（SNNs）目前仅限于执行简单的分类任务。在这项工作中，我们的目标是弥合对象检测中ANNs和SNNs之间的性能差距。我们的设计围绕网络结构和突触神经元展开。首先，YOLO系列向相应突触版本的转换过程中存在复杂模块设计导致的信号损耗。我们通过简化原始YOLO并集成元SNN块来解决这个问题，从而设计出SpikeYOLO架构。其次，对象检测对转换为二进制突触的过程中电位量的量化误差更为敏感。为了解决这个问题，我们设计了一种新类型的突触神经元，它能够在训练期间以整数值激活，同时保持脉冲驱动的预测性能。此外，还设计了优化后的训练方法和轻量级 SNN 网络结构，使其在保留高精度对象检测结果的同时，实现了优于多其它 SNN 网络架构的低能耗处理。最终，该设计在真实机器人硬件上实现了高性能、低能耗的实时对象检测，展示了可行性。 | 关键词：spiking neural networks, object detection, artificial neural networks, energy efficiency, real-time detection",
    "tldr": "设计了一种采用整数值训练和脉冲驱动推理的新型SNN，在对象检测任务上取得了比传统ANNs更好的性能，同时实现了高能效和实时检测能力。"
}