{
    "title": "Spatiotemporal Graph Guided Multi-modal Network for Livestreaming Product Retrieval",
    "abstract": "arXiv:2407.16248v3 Announce Type: replace  Abstract: With the rapid expansion of e-commerce, more consumers have become accustomed to making purchases via livestreaming. Accurately identifying the products being sold by salespeople, i.e., livestreaming product retrieval (LPR), poses a fundamental and daunting challenge. The LPR task encompasses three primary dilemmas in real-world scenarios: 1) the recognition of intended products from distractor products present in the background; 2) the video-image heterogeneity that the appearance of products showcased in live streams often deviates substantially from standardized product images in stores; 3) there are numerous confusing products with subtle visual nuances in the shop. To tackle these challenges, we propose the Spatiotemporal Graphing Multi-modal Network (SGMN). First, we employ a text-guided attention mechanism that leverages the spoken content of salespeople to guide the model to focus toward intended products, emphasizing their s",
    "link": "https://arxiv.org/abs/2407.16248",
    "context": "Title: Spatiotemporal Graph Guided Multi-modal Network for Livestreaming Product Retrieval\nAbstract: arXiv:2407.16248v3 Announce Type: replace  Abstract: With the rapid expansion of e-commerce, more consumers have become accustomed to making purchases via livestreaming. Accurately identifying the products being sold by salespeople, i.e., livestreaming product retrieval (LPR), poses a fundamental and daunting challenge. The LPR task encompasses three primary dilemmas in real-world scenarios: 1) the recognition of intended products from distractor products present in the background; 2) the video-image heterogeneity that the appearance of products showcased in live streams often deviates substantially from standardized product images in stores; 3) there are numerous confusing products with subtle visual nuances in the shop. To tackle these challenges, we propose the Spatiotemporal Graphing Multi-modal Network (SGMN). First, we employ a text-guided attention mechanism that leverages the spoken content of salespeople to guide the model to focus toward intended products, emphasizing their s",
    "path": "papers/24/07/2407.16248.json",
    "total_tokens": 752,
    "translated_title": "基于空间时间图的多模态网络直播产品检索",
    "translated_abstract": "arXiv:2407.16248v3 通告类型: 替换 Abstract: 在电子商务快速扩张的背景下，越来越多的消费者习惯于通过直播进行购物。准确识别销售人员正在销售的产品，即直播产品检索（LPR），是一项基础且艰巨的挑战。LPR任务在现实场景中面临三个主要难题：1）从背景中的干扰产品中识别出意图产品；2）直播中展示的产品外观常常与商店中的标准化产品图片存在显著差异；3）商店中有许多视觉细微差别的参考产品。为了解决这些挑战，我们提出了基于空间时间图的多模态网络（SGMN）。首先，我们采用了文本指导注意力机制，利用销售人员的口头内容来指导模型将注意力集中在意图产品上，强调它们在静态图像中的重要特征和形态信息。同时，视频流内的产品空间和时间信息也被提取和利用，使得网络能够根据产品在视频流中的动态变化捕捉产品回放的特征。最后，我们设计了相应的损失函数，综合考虑了视频流中产品的外观特征、位置信息以及文本描述。通过大量的直播视频数据进行训练，SGMN旨在有效地捕捉和识别直播中的产品特征，为未来的实时产品识别与推荐提供关键的技术支持。",
    "tldr": "该研究提出了一种名为SGMN的模型，利用文本指导注意力机制和视频空间时间信息，有效地捕捉并识别直播中的产品特征，为未来的实时产品识别与推荐提供支持。",
    "en_tdlr": "The study presents a model called SGMN that effectively captures and identifies product features in live streams using a text-guided attention mechanism and video spatiotemporal information, providing support for future real-time product identification and recommendation."
}