{
    "title": "Co-designing an AI Impact Assessment Report Template with AI Practitioners and AI Compliance Experts",
    "abstract": "arXiv:2407.17374v2 Announce Type: replace-cross  Abstract: In the evolving landscape of AI regulation, it is crucial for companies to conduct impact assessments and document their compliance through comprehensive reports. However, current reports lack grounding in regulations and often focus on specific aspects like privacy in relation to AI systems, without addressing the real-world uses of these systems. Moreover, there is no systematic effort to design and evaluate these reports with both AI practitioners and AI compliance experts. To address this gap, we conducted an iterative co-design process with 14 AI practitioners and 6 AI compliance experts and proposed a template for impact assessment reports grounded in the EU AI Act, NIST's AI Risk Management Framework, and ISO 42001 AI Management System. We evaluated the template by producing an impact assessment report for an AI-based meeting companion at a major tech company. A user study with 8 AI practitioners from the same company an",
    "link": "https://arxiv.org/abs/2407.17374",
    "context": "Title: Co-designing an AI Impact Assessment Report Template with AI Practitioners and AI Compliance Experts\nAbstract: arXiv:2407.17374v2 Announce Type: replace-cross  Abstract: In the evolving landscape of AI regulation, it is crucial for companies to conduct impact assessments and document their compliance through comprehensive reports. However, current reports lack grounding in regulations and often focus on specific aspects like privacy in relation to AI systems, without addressing the real-world uses of these systems. Moreover, there is no systematic effort to design and evaluate these reports with both AI practitioners and AI compliance experts. To address this gap, we conducted an iterative co-design process with 14 AI practitioners and 6 AI compliance experts and proposed a template for impact assessment reports grounded in the EU AI Act, NIST's AI Risk Management Framework, and ISO 42001 AI Management System. We evaluated the template by producing an impact assessment report for an AI-based meeting companion at a major tech company. A user study with 8 AI practitioners from the same company an",
    "path": "papers/24/07/2407.17374.json",
    "total_tokens": 688,
    "translated_title": "与AI从业者和AI合规专家共同设计的AI影响评估报告模板",
    "translated_abstract": "在AI监管日益发展的背景下，对于公司而言，进行影响评估并通过全面的报告文档其合规性至关重要。然而，目前报告往往缺乏对法规的深入理解，且通常只关注AI系统相关的隐私方面，而忽略了这些系统在实际使用中的广泛应用。此外，目前还没有系统地设计并评估这些报告，同时考虑AI从业者和AI合规专家的意见。为了填补这一空白，我们与14位AI从业者和6位AI合规专家经过反复的协同设计和评估，提出了一个基于欧盟AI法案、NIST的AI风险管理框架和ISO 42001 AI管理系统的AI影响评估报告模板。我们通过为一家大型科技公司的基于AI的会议伴侣生产一个影响评估报告，评估了该模板的效果。在该公司的8位AI从业者和具有相同背景的用户研究中，我们对报告的结构、内容和实用性进行了测试。用户对报告的结构和内容给予了积极评价，并且认为报告的实用性较高。这些结果为将来的影响评估报告设计提供了宝贵的反馈，并强调了与AI执法者和合规专家的合作对于确保报告的完整性和相关性的重要性。",
    "tldr": "本研究提出了一个基于欧盟AI法案和NIST框架的AI影响评估报告模板，并通过用户研究验证了其有效性。"
}