{
    "title": "Social and Ethical Risks Posed by General-Purpose LLMs for Settling Newcomers in Canada",
    "abstract": "arXiv:2407.20240v2 Announce Type: replace-cross  Abstract: The non-profit settlement sector in Canada supports newcomers in achieving successful integration. This sector faces increasing operational pressures amidst rising immigration targets, which highlights a need for enhanced efficiency and innovation, potentially through reliable AI solutions. The ad-hoc use of general-purpose generative AI, such as ChatGPT, might become a common practice among newcomers and service providers to address this need. However, these tools are not tailored for the settlement domain and can have detrimental implications for immigrants and refugees. We explore the risks that these tools might pose on newcomers to first, warn against the unguarded use of generative AI, and second, to incentivize further research and development in creating AI literacy programs as well as customized LLMs that are aligned with the preferences of the impacted communities. Crucially, such technologies should be designed to in",
    "link": "https://arxiv.org/abs/2407.20240",
    "context": "Title: Social and Ethical Risks Posed by General-Purpose LLMs for Settling Newcomers in Canada\nAbstract: arXiv:2407.20240v2 Announce Type: replace-cross  Abstract: The non-profit settlement sector in Canada supports newcomers in achieving successful integration. This sector faces increasing operational pressures amidst rising immigration targets, which highlights a need for enhanced efficiency and innovation, potentially through reliable AI solutions. The ad-hoc use of general-purpose generative AI, such as ChatGPT, might become a common practice among newcomers and service providers to address this need. However, these tools are not tailored for the settlement domain and can have detrimental implications for immigrants and refugees. We explore the risks that these tools might pose on newcomers to first, warn against the unguarded use of generative AI, and second, to incentivize further research and development in creating AI literacy programs as well as customized LLMs that are aligned with the preferences of the impacted communities. Crucially, such technologies should be designed to in",
    "path": "papers/24/07/2407.20240.json",
    "total_tokens": 664,
    "translated_title": "加拿大非营利性融入领域面临的新来者面临的整合作用广义用途LLM的社会和伦理风险",
    "translated_abstract": "arXiv:2407.20240v2  通告类型：替換交叉链接",
    "tldr": "本文讨论了加拿大非营利性融入领域面临的新来者面临的生成AI潜在风险，并建议加强相关研究与开发以促进AI教育和定制化LLM技术与服务提供者相应地对接。",
    "en_tdlr": "This paper explores the risks that general-purpose AI tools pose to newcomers in Canada's settlement sector and calls for further research and development on AI literacy and customized LLMs that can effectively serve the sector's needs."
}