{
    "title": "MSMA: Multi-agent Trajectory Prediction in Connected and Autonomous Vehicle Environment with Multi-source Data Integration",
    "abstract": "arXiv:2407.21310v2 Announce Type: replace  Abstract: The prediction of surrounding vehicle trajectories is crucial for collision-free path planning. In this study, we focus on a scenario where a connected and autonomous vehicle (CAV) serves as the central agent, utilizing both sensors and communication technologies to perceive its surrounding traffics consisting of autonomous vehicles (AVs), connected vehicles (CVs), and human-driven vehicles (HDVs). Our trajectory prediction task is aimed at all the detected surrounding vehicles. To effectively integrate the multi-source data from both sensor and communication technologies, we propose a deep learning framework called MSMA utilizing a cross-attention module for multi-source data fusion. Vector map data is utilized to provide contextual information. The trajectory dataset is collected in CARLA simulator with synthesized data errors introduced. Numerical experiments demonstrate that in a mixed traffic flow scenario, the integration of da",
    "link": "https://arxiv.org/abs/2407.21310",
    "context": "Title: MSMA: Multi-agent Trajectory Prediction in Connected and Autonomous Vehicle Environment with Multi-source Data Integration\nAbstract: arXiv:2407.21310v2 Announce Type: replace  Abstract: The prediction of surrounding vehicle trajectories is crucial for collision-free path planning. In this study, we focus on a scenario where a connected and autonomous vehicle (CAV) serves as the central agent, utilizing both sensors and communication technologies to perceive its surrounding traffics consisting of autonomous vehicles (AVs), connected vehicles (CVs), and human-driven vehicles (HDVs). Our trajectory prediction task is aimed at all the detected surrounding vehicles. To effectively integrate the multi-source data from both sensor and communication technologies, we propose a deep learning framework called MSMA utilizing a cross-attention module for multi-source data fusion. Vector map data is utilized to provide contextual information. The trajectory dataset is collected in CARLA simulator with synthesized data errors introduced. Numerical experiments demonstrate that in a mixed traffic flow scenario, the integration of da",
    "path": "papers/24/07/2407.21310.json",
    "total_tokens": 715,
    "translated_title": "MSMA：综合多源数据集的多智能体轨迹预测方法在互联自动驾驶车辆环境中的应用",
    "translated_abstract": "arXiv:2407.21310v2 公告类型：替换  摘要：碰撞无路径规划的关键是预测周围车辆的轨迹。在本文中，我们专注于这样一个场景：一个互联自动驾驶车辆（CAV）作为中心智能体，利用传感器和通信技术来感知其周围交通，这些交通包括自动驾驶车辆（AVs）、互联车辆（CVs）和人类驾驶车辆（HDVs）。我们的轨迹预测任务针对所有被检测到的周围车辆。为了有效地整合来自传感器和通信技术的多源数据，我们提出了一个名为MSMA的深度学习框架，使用一个跨注意力模块进行多源数据融合。使用矢量地图数据提供上下文信息。轨迹数据是在CARLA模拟器中收集的，并且引入了合成数据错误。数值实验表明，在混合交通流情况下，多源数据的集成对预测复杂交通中的车辆轨迹非常重要。",
    "tldr": "该研究提出了一种名为MSMA的深度学习框架，用于综合多源数据以预测复杂交通中的车辆轨迹，特别关注互联自动驾驶车辆（CAV）周围环境，包括自动驾驶车辆（AVs）、互联车辆（CVs）和人类驾驶车辆（HDVs）。",
    "en_tdlr": "This study introduces the MSMA deep learning framework for integrated multi-source data prediction of vehicle trajectories in complex traffic, focusing on the environment around Connected Autonomous Vehicles (CAVs), which include Autonomous Vehicles (AVs), Connected Vehicles (CVs), and Human-driven Vehicles (HDVs)."
}