{
    "title": "Beyond Aesthetics: Cultural Competence in Text-to-Image Models",
    "abstract": "arXiv:2407.06863v4 Announce Type: replace  Abstract: Text-to-Image (T2I) models are being increasingly adopted in diverse global communities where they create visual representations of their unique cultures. Current T2I benchmarks primarily focus on faithfulness, aesthetics, and realism of generated images, overlooking the critical dimension of cultural competence. In this work, we introduce a framework to evaluate cultural competence of T2I models along two crucial dimensions: cultural awareness and cultural diversity, and present a scalable approach using a combination of structured knowledge bases and large language models to build a large dataset of cultural artifacts to enable this evaluation. In particular, we apply this approach to build CUBE (CUltural BEnchmark for Text-to-Image models), a first-of-its-kind benchmark to evaluate cultural competence of T2I models. CUBE covers cultural artifacts associated with 8 countries across different geo-cultural regions and along 3 concept",
    "link": "https://arxiv.org/abs/2407.06863",
    "context": "Title: Beyond Aesthetics: Cultural Competence in Text-to-Image Models\nAbstract: arXiv:2407.06863v4 Announce Type: replace  Abstract: Text-to-Image (T2I) models are being increasingly adopted in diverse global communities where they create visual representations of their unique cultures. Current T2I benchmarks primarily focus on faithfulness, aesthetics, and realism of generated images, overlooking the critical dimension of cultural competence. In this work, we introduce a framework to evaluate cultural competence of T2I models along two crucial dimensions: cultural awareness and cultural diversity, and present a scalable approach using a combination of structured knowledge bases and large language models to build a large dataset of cultural artifacts to enable this evaluation. In particular, we apply this approach to build CUBE (CUltural BEnchmark for Text-to-Image models), a first-of-its-kind benchmark to evaluate cultural competence of T2I models. CUBE covers cultural artifacts associated with 8 countries across different geo-cultural regions and along 3 concept",
    "path": "papers/24/07/2407.06863.json",
    "total_tokens": 365,
    "tldr": "该文章提出了一个评估文本到图像模型跨文化能力的框架，该框架考虑了文化意识和文化多样性两个方面。文章还介绍了一种基于知识库和大型语言模型构建的文化资产数据集，并以此为基础创建了CUBE基准测试，这是首个用于评估文本到图像模型跨文化能力的基准。CUBE涵盖了来自不同国家和地区的文化主题。"
}