{
    "title": "MVGT: A Multi-view Graph Transformer Based on Spatial Relations for EEG Emotion Recognition",
    "abstract": "arXiv:2407.03131v3 Announce Type: replace-cross  Abstract: Electroencephalography (EEG), a medical imaging technique that captures scalp electrical activity of brain structures via electrodes, has been widely used in affective computing. The spatial domain of EEG is rich in affective information. However, few of the existing studies have simultaneously analyzed EEG signals from multiple perspectives of geometric and anatomical structures in spatial domain. In this paper, we propose a multi-view Graph Transformer (MVGT) based on spatial relations, which integrates information from the temporal, frequency and spatial domains, including geometric and anatomical structures, so as to enhance the expressive power of the model comprehensively. We incorporate the spatial information of EEG channels into the model as encoding, thereby improving its ability to perceive the spatial structure of the channels. Meanwhile, experimental results based on publicly available datasets demonstrate that our",
    "link": "https://arxiv.org/abs/2407.03131",
    "context": "Title: MVGT: A Multi-view Graph Transformer Based on Spatial Relations for EEG Emotion Recognition\nAbstract: arXiv:2407.03131v3 Announce Type: replace-cross  Abstract: Electroencephalography (EEG), a medical imaging technique that captures scalp electrical activity of brain structures via electrodes, has been widely used in affective computing. The spatial domain of EEG is rich in affective information. However, few of the existing studies have simultaneously analyzed EEG signals from multiple perspectives of geometric and anatomical structures in spatial domain. In this paper, we propose a multi-view Graph Transformer (MVGT) based on spatial relations, which integrates information from the temporal, frequency and spatial domains, including geometric and anatomical structures, so as to enhance the expressive power of the model comprehensively. We incorporate the spatial information of EEG channels into the model as encoding, thereby improving its ability to perceive the spatial structure of the channels. Meanwhile, experimental results based on publicly available datasets demonstrate that our",
    "path": "papers/24/07/2407.03131.json",
    "total_tokens": 367,
    "tldr": "该文章提出了一个基于空间关系的多视图图变换器（MVGT），该模型整合了时间、频率和空间域的信息，包括几何和解剖结构，以增强模型的表达能力。通过将EEG通道的空间信息融入模型中，该模型提高了感知通道空间结构的能力，并在公开数据集上的实验表明，该模型在识别EEG情绪方面的表现优于现有方法。"
}