{
    "title": "Two new feature selection methods based on learn-heuristic techniques for breast cancer prediction: A comprehensive analysis",
    "abstract": "arXiv:2407.14631v2 Announce Type: replace-cross  Abstract: Breast cancer is not preventable because of its unknown causes. However, its early diagnosis increases patients' recovery chances. Machine learning (ML) can be utilized to improve treatment outcomes in healthcare operations while diminishing costs and time. In this research, we suggest two novel feature selection (FS) methods based upon an imperialist competitive algorithm (ICA) and a bat algorithm (BA) and their combination with ML algorithms. This study aims to enhance diagnostic models' efficiency and present a comprehensive analysis to help clinical physicians make much more precise and reliable decisions than before. K-nearest neighbors, support vector machine, decision tree, Naive Bayes, AdaBoost, linear discriminant analysis, random forest, logistic regression, and artificial neural network are some of the methods employed. This paper applied a distinctive integration of evaluation measures and ML algorithms using the wr",
    "link": "https://arxiv.org/abs/2407.14631",
    "context": "Title: Two new feature selection methods based on learn-heuristic techniques for breast cancer prediction: A comprehensive analysis\nAbstract: arXiv:2407.14631v2 Announce Type: replace-cross  Abstract: Breast cancer is not preventable because of its unknown causes. However, its early diagnosis increases patients' recovery chances. Machine learning (ML) can be utilized to improve treatment outcomes in healthcare operations while diminishing costs and time. In this research, we suggest two novel feature selection (FS) methods based upon an imperialist competitive algorithm (ICA) and a bat algorithm (BA) and their combination with ML algorithms. This study aims to enhance diagnostic models' efficiency and present a comprehensive analysis to help clinical physicians make much more precise and reliable decisions than before. K-nearest neighbors, support vector machine, decision tree, Naive Bayes, AdaBoost, linear discriminant analysis, random forest, logistic regression, and artificial neural network are some of the methods employed. This paper applied a distinctive integration of evaluation measures and ML algorithms using the wr",
    "path": "papers/24/07/2407.14631.json",
    "total_tokens": 323,
    "tldr": "该文章提出两种新的基于学习启发式技术的特征选择方法，用以提升乳腺癌预测模型的性能，并进行了全面分析，旨在为临床医生提供更精确和可靠的决策。"
}