{
    "title": "Analyzing the Polysemy Evolution using Semantic Cells",
    "abstract": "arXiv:2407.16110v2 Announce Type: replace-cross  Abstract: The senses of words evolve. The sense of the same word may change from today to tomorrow, and multiple senses of the same word may be the result of the evolution of each other, that is, they may be parents and children. If we view Juba as an evolving ecosystem, the paradigm of learning the correct answer, which does not move with the sense of a word, is no longer valid. This paper is a case study that shows that word polysemy is an evolutionary consequence of the modification of Semantic Cells, which has al-ready been presented by the author, by introducing a small amount of diversity in its initial state as an example of analyzing the current set of short sentences. In particular, the analysis of a sentence sequence of 1000 sentences in some order for each of the four senses of the word Spring, collected using Chat GPT, shows that the word acquires the most polysemy monotonically in the analysis when the senses are arranged in",
    "link": "https://arxiv.org/abs/2407.16110",
    "context": "Title: Analyzing the Polysemy Evolution using Semantic Cells\nAbstract: arXiv:2407.16110v2 Announce Type: replace-cross  Abstract: The senses of words evolve. The sense of the same word may change from today to tomorrow, and multiple senses of the same word may be the result of the evolution of each other, that is, they may be parents and children. If we view Juba as an evolving ecosystem, the paradigm of learning the correct answer, which does not move with the sense of a word, is no longer valid. This paper is a case study that shows that word polysemy is an evolutionary consequence of the modification of Semantic Cells, which has al-ready been presented by the author, by introducing a small amount of diversity in its initial state as an example of analyzing the current set of short sentences. In particular, the analysis of a sentence sequence of 1000 sentences in some order for each of the four senses of the word Spring, collected using Chat GPT, shows that the word acquires the most polysemy monotonically in the analysis when the senses are arranged in",
    "path": "papers/24/07/2407.16110.json",
    "total_tokens": 675,
    "translated_title": "利用语义单元分析多义性进化",
    "translated_abstract": "arXiv:2407.16110v2 公告类型：替换-交叉 摘要：词义会随时间发展而演变。同一天不同时间对同一个词的理解可能不同，同一个词的不同意义可能是相互演化的结果，即它们可能是父母和子女关系。如果我们把Juba看作一个不断发展的生态系统，学习正确答案的模式，如果不随词义的变化而变化，那就不再有效了。本文采取了一个案例研究，展示了由作者提出并引入了一些初始状态多样性的小变化，分析了用Chat GPT收集的四个不同意义的句子集合，即春天的含义。特别的是，对包含1000个句子的序列进行排序分析，每个序列都是对“春天”一词的不同意义的句子，结果显示，当按顺序排列这些词义时，在分析中，“春天”一词的多义性随时间而逐渐增加。",
    "tldr": "本文通过分析“春天”一词在不同语境中的4种含义，揭示了词汇多义性的演化是由语义单元的修改所引起的，并且这一过程是随时间逐渐发生的。"
}