{
    "title": "Beyond Aesthetics: Cultural Competence in Text-to-Image Models",
    "abstract": "arXiv:2407.06863v4 Announce Type: replace  Abstract: Text-to-Image (T2I) models are being increasingly adopted in diverse global communities where they create visual representations of their unique cultures. Current T2I benchmarks primarily focus on faithfulness, aesthetics, and realism of generated images, overlooking the critical dimension of cultural competence. In this work, we introduce a framework to evaluate cultural competence of T2I models along two crucial dimensions: cultural awareness and cultural diversity, and present a scalable approach using a combination of structured knowledge bases and large language models to build a large dataset of cultural artifacts to enable this evaluation. In particular, we apply this approach to build CUBE (CUltural BEnchmark for Text-to-Image models), a first-of-its-kind benchmark to evaluate cultural competence of T2I models. CUBE covers cultural artifacts associated with 8 countries across different geo-cultural regions and along 3 concept",
    "link": "https://arxiv.org/abs/2407.06863",
    "context": "Title: Beyond Aesthetics: Cultural Competence in Text-to-Image Models\nAbstract: arXiv:2407.06863v4 Announce Type: replace  Abstract: Text-to-Image (T2I) models are being increasingly adopted in diverse global communities where they create visual representations of their unique cultures. Current T2I benchmarks primarily focus on faithfulness, aesthetics, and realism of generated images, overlooking the critical dimension of cultural competence. In this work, we introduce a framework to evaluate cultural competence of T2I models along two crucial dimensions: cultural awareness and cultural diversity, and present a scalable approach using a combination of structured knowledge bases and large language models to build a large dataset of cultural artifacts to enable this evaluation. In particular, we apply this approach to build CUBE (CUltural BEnchmark for Text-to-Image models), a first-of-its-kind benchmark to evaluate cultural competence of T2I models. CUBE covers cultural artifacts associated with 8 countries across different geo-cultural regions and along 3 concept",
    "path": "papers/24/07/2407.06863.json",
    "total_tokens": 675,
    "translated_title": "超越美学：文本到图像模型的文化能力",
    "translated_abstract": "arXiv:2407.06863v4 公告类型：替换  摘要：文本到图像（T2I）模型正在全球各地不断被采用，它们创造出各自独特文化的视觉表现。目前T2I模型的评价主要集中在生成图像的忠实性，美感和现实感上，而忽略了一个关键的维度：文化能力。在这项工作中，我们介绍了一种框架，用于评估T2I模型的文化能力，该框架涉及两个关键维度：对文化的意识和对文化多样性的尊重，并提出了一个使用结构化知识库和大型语言模型相结合的方法，以构建一个大型的文化 artefacts数据集，以实现这一评价。特别是，我们将这种方法应用于建立CUBE（文化基准测试，以测试文本到图像模型的表现），这是一项首次通过不同地理和文化区域和相关概念来评估文化能力的第一项基准测试。CUBE覆盖了与8个不同国家相关联的文化 artefacts，并沿着3个不同的概念进行筛查。",
    "tldr": "该研究提出了一种评估文本到图像模型文化能力的框架，并建立了一个覆盖多个国家、多个文化的文化基准测试，以评估模型在文化意识和多样性方面的表现。"
}