{
    "title": "HPC: Hierarchical Progressive Coding Framework for Volumetric Video",
    "abstract": "arXiv:2407.09026v2 Announce Type: replace  Abstract: Volumetric video based on Neural Radiance Field (NeRF) holds vast potential for various 3D applications, but its substantial data volume poses significant challenges for compression and transmission. Current NeRF compression lacks the flexibility to adjust video quality and bitrate within a single model for various network and device capacities. To address these issues, we propose HPC, a novel hierarchical progressive volumetric video coding framework achieving variable bitrate using a single model. Specifically, HPC introduces a hierarchical representation with a multi-resolution residual radiance field to reduce temporal redundancy in long-duration sequences while simultaneously generating various levels of detail. Then, we propose an end-to-end progressive learning approach with a multi-rate-distortion loss function to jointly optimize both hierarchical representation and compression. Our HPC trained only once can realize multiple",
    "link": "https://arxiv.org/abs/2407.09026",
    "context": "Title: HPC: Hierarchical Progressive Coding Framework for Volumetric Video\nAbstract: arXiv:2407.09026v2 Announce Type: replace  Abstract: Volumetric video based on Neural Radiance Field (NeRF) holds vast potential for various 3D applications, but its substantial data volume poses significant challenges for compression and transmission. Current NeRF compression lacks the flexibility to adjust video quality and bitrate within a single model for various network and device capacities. To address these issues, we propose HPC, a novel hierarchical progressive volumetric video coding framework achieving variable bitrate using a single model. Specifically, HPC introduces a hierarchical representation with a multi-resolution residual radiance field to reduce temporal redundancy in long-duration sequences while simultaneously generating various levels of detail. Then, we propose an end-to-end progressive learning approach with a multi-rate-distortion loss function to jointly optimize both hierarchical representation and compression. Our HPC trained only once can realize multiple",
    "path": "papers/24/07/2407.09026.json",
    "total_tokens": 338,
    "tldr": "该文章提出了一种名为HPC的框架，通过整合多分辨率残差辐射场和端到端渐进学习方法，实现了单模型多分辨率视频压缩，满足不同网络和设备能力下的灵活变量比特率需求，有效解决了NeRF视频技术面临的体积大、压缩与传输困难的问题。"
}