{
    "title": "HPC: Hierarchical Progressive Coding Framework for Volumetric Video",
    "abstract": "arXiv:2407.09026v2 Announce Type: replace  Abstract: Volumetric video based on Neural Radiance Field (NeRF) holds vast potential for various 3D applications, but its substantial data volume poses significant challenges for compression and transmission. Current NeRF compression lacks the flexibility to adjust video quality and bitrate within a single model for various network and device capacities. To address these issues, we propose HPC, a novel hierarchical progressive volumetric video coding framework achieving variable bitrate using a single model. Specifically, HPC introduces a hierarchical representation with a multi-resolution residual radiance field to reduce temporal redundancy in long-duration sequences while simultaneously generating various levels of detail. Then, we propose an end-to-end progressive learning approach with a multi-rate-distortion loss function to jointly optimize both hierarchical representation and compression. Our HPC trained only once can realize multiple",
    "link": "https://arxiv.org/abs/2407.09026",
    "context": "Title: HPC: Hierarchical Progressive Coding Framework for Volumetric Video\nAbstract: arXiv:2407.09026v2 Announce Type: replace  Abstract: Volumetric video based on Neural Radiance Field (NeRF) holds vast potential for various 3D applications, but its substantial data volume poses significant challenges for compression and transmission. Current NeRF compression lacks the flexibility to adjust video quality and bitrate within a single model for various network and device capacities. To address these issues, we propose HPC, a novel hierarchical progressive volumetric video coding framework achieving variable bitrate using a single model. Specifically, HPC introduces a hierarchical representation with a multi-resolution residual radiance field to reduce temporal redundancy in long-duration sequences while simultaneously generating various levels of detail. Then, we propose an end-to-end progressive learning approach with a multi-rate-distortion loss function to jointly optimize both hierarchical representation and compression. Our HPC trained only once can realize multiple",
    "path": "papers/24/07/2407.09026.json",
    "total_tokens": 648,
    "translated_title": "HPC: 分层渐进式编码框架用于体积视频",
    "translated_abstract": "arXiv:2407.09026v2 宣布类型：替换  摘要：基于神经辐射场（NeRF）的体积视频具有多种3D应用的巨大潜力，但其巨大的数据量对于压缩和传输提出了重大挑战。NeRF压缩目前缺乏在单个模型中对视频质量和比特率进行灵活调整的能力，以适应各种网络和设备能力。为了解决这些问题，我们提出了一种新颖的分层渐进式体积视频编码框架，它使用单一模型实现可变比特率压缩。具体来说，HPC引入了一个具有多分辨率残差辐射场的分层表示，以减少长时间序列中的时间冗余，同时产生各种细节级别。然后，我们提出了一个端到端的渐进式学习方法，以及一个多速率失真损失函数，以同时优化层次结构和压缩。我们的HPC只需训练一次，就可以实现多个比特率的编码效率，对于低带宽和低延迟的要求提供了灵活的解决方案。",
    "tldr": "本文提出了一种使用单一模型的分层渐进式体积视频编码框架HPC，可以实现灵活的比特率调整，以适应各种网络和设备能力。"
}