{
    "title": "MMInstruct: A High-Quality Multi-Modal Instruction Tuning Dataset with Extensive Diversity",
    "abstract": "arXiv:2407.15838v2 Announce Type: replace  Abstract: Despite the effectiveness of vision-language supervised fine-tuning in enhancing the performance of Vision Large Language Models (VLLMs). However, existing visual instruction tuning datasets include the following limitations: (1) Instruction annotation quality: despite existing VLLMs exhibiting strong performance, instructions generated by those advanced VLLMs may still suffer from inaccuracies, such as hallucinations. (2) Instructions and image diversity: the limited range of instruction types and the lack of diversity in image data may impact the model's ability to generate diversified and closer to real-world scenarios outputs. To address these challenges, we construct a high-quality, diverse visual instruction tuning dataset MMInstruct, which consists of 973K instructions from 24 domains. There are four instruction types: Judgement, Multiple-Choice, Long Visual Question Answering and Short Visual Question Answering. To construct ",
    "link": "https://arxiv.org/abs/2407.15838",
    "context": "Title: MMInstruct: A High-Quality Multi-Modal Instruction Tuning Dataset with Extensive Diversity\nAbstract: arXiv:2407.15838v2 Announce Type: replace  Abstract: Despite the effectiveness of vision-language supervised fine-tuning in enhancing the performance of Vision Large Language Models (VLLMs). However, existing visual instruction tuning datasets include the following limitations: (1) Instruction annotation quality: despite existing VLLMs exhibiting strong performance, instructions generated by those advanced VLLMs may still suffer from inaccuracies, such as hallucinations. (2) Instructions and image diversity: the limited range of instruction types and the lack of diversity in image data may impact the model's ability to generate diversified and closer to real-world scenarios outputs. To address these challenges, we construct a high-quality, diverse visual instruction tuning dataset MMInstruct, which consists of 973K instructions from 24 domains. There are four instruction types: Judgement, Multiple-Choice, Long Visual Question Answering and Short Visual Question Answering. To construct ",
    "path": "papers/24/07/2407.15838.json",
    "total_tokens": 361,
    "tldr": "该文章构建了一个高质量、多样化的视觉指令微调数据集MMInstruct，该数据集包含来自24个领域的973万条指令，以四种不同的指令类型存在，旨在提高视觉语言大型模型（VLLMs）在处理多样化真实世界场景输出时的性能。"
}