{
    "title": "Social Learning through Interactions with Other Agents: A Survey",
    "abstract": "arXiv:2407.21713v2 Announce Type: replace-cross  Abstract: Social learning plays an important role in the development of human intelligence. As children, we imitate our parents' speech patterns until we are able to produce sounds; we learn from them praising us and scolding us; and as adults, we learn by working with others. In this work, we survey the degree to which this paradigm -- social learning -- has been mirrored in machine learning. In particular, since learning socially requires interacting with others, we are interested in how embodied agents can and have utilised these techniques. This is especially in light of the degree to which recent advances in natural language processing (NLP) enable us to perform new forms of social learning. We look at how behavioural cloning and next-token prediction mirror human imitation, how learning from human feedback mirrors human education, and how we can go further to enable fully communicative agents that learn from each other. We find tha",
    "link": "https://arxiv.org/abs/2407.21713",
    "context": "Title: Social Learning through Interactions with Other Agents: A Survey\nAbstract: arXiv:2407.21713v2 Announce Type: replace-cross  Abstract: Social learning plays an important role in the development of human intelligence. As children, we imitate our parents' speech patterns until we are able to produce sounds; we learn from them praising us and scolding us; and as adults, we learn by working with others. In this work, we survey the degree to which this paradigm -- social learning -- has been mirrored in machine learning. In particular, since learning socially requires interacting with others, we are interested in how embodied agents can and have utilised these techniques. This is especially in light of the degree to which recent advances in natural language processing (NLP) enable us to perform new forms of social learning. We look at how behavioural cloning and next-token prediction mirror human imitation, how learning from human feedback mirrors human education, and how we can go further to enable fully communicative agents that learn from each other. We find tha",
    "path": "papers/24/07/2407.21713.json",
    "total_tokens": 368,
    "tldr": "该文章对通过与代理互动进行的社会学习进行了调查，探讨了其在机器学习中的应用，并重点介绍了在自然语言处理领域的最新进展如何促进了新形式的社交学习。文章讨论了行为克隆、下一个字预测以及从人类反馈中学习如何模拟人类模仿和教育的概念，并展望了未来能够互相学习和交流的全通信代理的发展前景。"
}