{
    "title": "Multi-times Monte Carlo Rendering for Inter-reflection Reconstruction",
    "abstract": "arXiv:2407.05771v2 Announce Type: replace  Abstract: Inverse rendering methods have achieved remarkable performance in reconstructing high-fidelity 3D objects with disentangled geometries, materials, and environmental light. However, they still face huge challenges in reflective surface reconstruction. Although recent methods model the light trace to learn specularity, the ignorance of indirect illumination makes it hard to handle inter-reflections among multiple smooth objects. In this work, we propose Ref-MC2 that introduces the multi-time Monte Carlo sampling which comprehensively computes the environmental illumination and meanwhile considers the reflective light from object surfaces. To address the computation challenge as the times of Monte Carlo sampling grow, we propose a specularity-adaptive sampling strategy, significantly reducing the computational complexity. Besides the computational resource, higher geometry accuracy is also required because geometric errors accumulate mu",
    "link": "https://arxiv.org/abs/2407.05771",
    "context": "Title: Multi-times Monte Carlo Rendering for Inter-reflection Reconstruction\nAbstract: arXiv:2407.05771v2 Announce Type: replace  Abstract: Inverse rendering methods have achieved remarkable performance in reconstructing high-fidelity 3D objects with disentangled geometries, materials, and environmental light. However, they still face huge challenges in reflective surface reconstruction. Although recent methods model the light trace to learn specularity, the ignorance of indirect illumination makes it hard to handle inter-reflections among multiple smooth objects. In this work, we propose Ref-MC2 that introduces the multi-time Monte Carlo sampling which comprehensively computes the environmental illumination and meanwhile considers the reflective light from object surfaces. To address the computation challenge as the times of Monte Carlo sampling grow, we propose a specularity-adaptive sampling strategy, significantly reducing the computational complexity. Besides the computational resource, higher geometry accuracy is also required because geometric errors accumulate mu",
    "path": "papers/24/07/2407.05771.json",
    "total_tokens": 338,
    "tldr": "该文章提出了一种名为Ref-MC2的方法，通过引入多时间蒙特卡洛采样来全面计算环境照明，同时考虑物体表面的反射光。此外，文章还提出了一种适应性采样策略，以提高采样效率并减少累积的几何误差。这些改进使得反射性重建成为可能，这对于处理多个光滑物体之间的互反射特别有效。"
}