{
    "title": "An indirect search for dark matter with a combined analysis of dwarf spheroidal galaxies from VERITAS",
    "abstract": "arXiv:2407.16518v2 Announce Type: replace-cross  Abstract: Understanding the nature and identity of dark matter is a key goal in the physics community. In the case that TeV-scale dark matter particles decay or annihilate into standard model particles, very-high-energy (VHE) gamma rays (greater than 100 GeV) will be present in the final state. The Very Energetic Radiation Imaging Telescope Array System (VERITAS) is an imaging atmospheric Cherenkov telescope array that can indirectly detect VHE gamma rays in an energy range of 100 GeV to > 30 TeV. Dwarf spheroidal galaxies (dSphs) are ideal candidates in the search for dark matter due to their high dark matter content, high mass-to-light ratios, and their low gamma-ray fluxes from astrophysical processes. This study uses a legacy data set of 638 hours collected on 17 dSphs, built over 11 years with an observing strategy optimized according to the dark matter content of the targets. The study addresses a broad dark matter particle mass ra",
    "link": "https://arxiv.org/abs/2407.16518",
    "context": "Title: An indirect search for dark matter with a combined analysis of dwarf spheroidal galaxies from VERITAS\nAbstract: arXiv:2407.16518v2 Announce Type: replace-cross  Abstract: Understanding the nature and identity of dark matter is a key goal in the physics community. In the case that TeV-scale dark matter particles decay or annihilate into standard model particles, very-high-energy (VHE) gamma rays (greater than 100 GeV) will be present in the final state. The Very Energetic Radiation Imaging Telescope Array System (VERITAS) is an imaging atmospheric Cherenkov telescope array that can indirectly detect VHE gamma rays in an energy range of 100 GeV to > 30 TeV. Dwarf spheroidal galaxies (dSphs) are ideal candidates in the search for dark matter due to their high dark matter content, high mass-to-light ratios, and their low gamma-ray fluxes from astrophysical processes. This study uses a legacy data set of 638 hours collected on 17 dSphs, built over 11 years with an observing strategy optimized according to the dark matter content of the targets. The study addresses a broad dark matter particle mass ra",
    "path": "papers/24/07/2407.16518.json",
    "total_tokens": 440,
    "tldr": "该文章通过结合对矮星系（dSphs）的分析，利用VERITAS成像大气Cherenkov望远镜阵列收集的638小时数据，呈现出对暗物质的一种间接搜寻方法。这包括对17个dSphs的长时间观测，旨在探测潜在的由TeV尺度暗物质粒子衰变或湮灭产生的极高能量（VHE）γ射线，从而为理解暗物质的本质提供了可能的新途径。"
}