{
    "title": "Regularized Multi-Decoder Ensemble for an Error-Aware Scene Representation Network",
    "abstract": "arXiv:2407.19082v2 Announce Type: replace-cross  Abstract: Feature grid Scene Representation Networks (SRNs) have been applied to scientific data as compact functional surrogates for analysis and visualization. As SRNs are black-box lossy data representations, assessing the prediction quality is critical for scientific visualization applications to ensure that scientists can trust the information being visualized. Currently, existing architectures do not support inference time reconstruction quality assessment, as coordinate-level errors cannot be evaluated in the absence of ground truth data. We propose a parameter-efficient multi-decoder SRN (MDSRN) ensemble architecture consisting of a shared feature grid with multiple lightweight multi-layer perceptron decoders. MDSRN can generate a set of plausible predictions for a given input coordinate to compute the mean as the prediction of the multi-decoder ensemble and the variance as a confidence score. The coordinate-level variance can be",
    "link": "https://arxiv.org/abs/2407.19082",
    "context": "Title: Regularized Multi-Decoder Ensemble for an Error-Aware Scene Representation Network\nAbstract: arXiv:2407.19082v2 Announce Type: replace-cross  Abstract: Feature grid Scene Representation Networks (SRNs) have been applied to scientific data as compact functional surrogates for analysis and visualization. As SRNs are black-box lossy data representations, assessing the prediction quality is critical for scientific visualization applications to ensure that scientists can trust the information being visualized. Currently, existing architectures do not support inference time reconstruction quality assessment, as coordinate-level errors cannot be evaluated in the absence of ground truth data. We propose a parameter-efficient multi-decoder SRN (MDSRN) ensemble architecture consisting of a shared feature grid with multiple lightweight multi-layer perceptron decoders. MDSRN can generate a set of plausible predictions for a given input coordinate to compute the mean as the prediction of the multi-decoder ensemble and the variance as a confidence score. The coordinate-level variance can be",
    "path": "papers/24/07/2407.19082.json",
    "total_tokens": 344,
    "tldr": "该文章提出了一种带有多个轻量级解码器的多解码器场景表示网络（MDSRN），能够为输入坐标生成多个可能预测，并计算它们的均值作为多解码器集合的预测，以及它们的方差作为可信度分数，从而支持推理时预测质量评估。"
}