{
    "title": "MMTrail: A Multimodal Trailer Video Dataset with Language and Music Descriptions",
    "abstract": "arXiv:2407.20962v2 Announce Type: replace  Abstract: Massive multi-modality datasets play a significant role in facilitating the success of large video-language models. However, current video-language datasets primarily provide text descriptions for visual frames, considering audio to be weakly related information. They usually overlook exploring the potential of inherent audio-visual correlation, leading to monotonous annotation within each modality instead of comprehensive and precise descriptions. Such ignorance results in the difficulty of multiple cross-modality studies. To fulfill this gap, we present MMTrail, a large-scale multi-modality video-language dataset incorporating more than 20M trailer clips with visual captions, and 2M high-quality clips with multimodal captions. Trailers preview full-length video works and integrate context, visual frames, and background music. In particular, the trailer has two main advantages: (1) the topics are diverse, and the content characters ",
    "link": "https://arxiv.org/abs/2407.20962",
    "context": "Title: MMTrail: A Multimodal Trailer Video Dataset with Language and Music Descriptions\nAbstract: arXiv:2407.20962v2 Announce Type: replace  Abstract: Massive multi-modality datasets play a significant role in facilitating the success of large video-language models. However, current video-language datasets primarily provide text descriptions for visual frames, considering audio to be weakly related information. They usually overlook exploring the potential of inherent audio-visual correlation, leading to monotonous annotation within each modality instead of comprehensive and precise descriptions. Such ignorance results in the difficulty of multiple cross-modality studies. To fulfill this gap, we present MMTrail, a large-scale multi-modality video-language dataset incorporating more than 20M trailer clips with visual captions, and 2M high-quality clips with multimodal captions. Trailers preview full-length video works and integrate context, visual frames, and background music. In particular, the trailer has two main advantages: (1) the topics are diverse, and the content characters ",
    "path": "papers/24/07/2407.20962.json",
    "total_tokens": 364,
    "tldr": "该文章提出的MMTrail是一个含大量预告片视频的大规模多模态视频-语言数据集，其中每个视频都对应有详细的视觉描述和多模态描述。这些描述涵盖了预告片的多种主题和管理，包括情节、视觉帧和背景音乐，这使得数据集在探索跨模态研究方面具有很高的价值。"
}