{
    "title": "Exploiting Scale-Variant Attention for Segmenting Small Medical Objects",
    "abstract": "arXiv:2407.07720v4 Announce Type: replace-cross  Abstract: Early detection and accurate diagnosis can predict the risk of malignant disease transformation, thereby increasing the probability of effective treatment. Identifying mild syndrome with small pathological regions serves as an ominous warning and is fundamental in the early diagnosis of diseases. While deep learning algorithms, particularly convolutional neural networks (CNNs), have shown promise in segmenting medical objects, analyzing small areas in medical images remains challenging. This difficulty arises due to information losses and compression defects from convolution and pooling operations in CNNs, which become more pronounced as the network deepens, especially for small medical objects. To address these challenges, we propose a novel scale-variant attention-based network (SvANet) for accurately segmenting small-scale objects in medical images. The SvANet consists of scale-variant attention, cross-scale guidance, Monte ",
    "link": "https://arxiv.org/abs/2407.07720",
    "context": "Title: Exploiting Scale-Variant Attention for Segmenting Small Medical Objects\nAbstract: arXiv:2407.07720v4 Announce Type: replace-cross  Abstract: Early detection and accurate diagnosis can predict the risk of malignant disease transformation, thereby increasing the probability of effective treatment. Identifying mild syndrome with small pathological regions serves as an ominous warning and is fundamental in the early diagnosis of diseases. While deep learning algorithms, particularly convolutional neural networks (CNNs), have shown promise in segmenting medical objects, analyzing small areas in medical images remains challenging. This difficulty arises due to information losses and compression defects from convolution and pooling operations in CNNs, which become more pronounced as the network deepens, especially for small medical objects. To address these challenges, we propose a novel scale-variant attention-based network (SvANet) for accurately segmenting small-scale objects in medical images. The SvANet consists of scale-variant attention, cross-scale guidance, Monte ",
    "path": "papers/24/07/2407.07720.json",
    "total_tokens": 729,
    "translated_title": "利用可变尺度注意力对小医疗对象进行分割",
    "translated_abstract": "arXiv:2407.07720v4 公告类型：替换交叉 摘要：早期检测和准确诊断可以预测恶性疾病转化风险，从而增加有效治疗的可能性。识别轻微综合征的小病理区域是疾病早期诊断的基础。虽然深度学习算法，特别是卷积神经网络（CNNs），在分割医学对象方面显示出潜力，但对于医学图像中小区域的分析仍然是一个挑战。这种困难源于卷积和池化运算在CNN中丢失的信息和压缩缺陷，尤其是在网络加深时，这对小医疗对象尤为明显。为了解决这些挑战，我们提出了一种新颖的可变尺度注意力网络（SvANet），用于准确分割医学图像中的小尺度对象。SvANet由可变尺度注意力、跨尺度引导和蒙特卡洛优化组成。通过设计可变尺度注意力机制和细化模块，SvANet能够捕捉不同尺度上的对象特徵，并利用深度指导的小尺度特征，提高边缘精度和像素级分割质量。此外，我们还开发了一种实时多尺度网络，该网络可以在不牺牲准确性的情况下，以更快的速度进行实时的图像分割操作。实验结果表明，SvANet在专业诊断中的应用提高了对小肿瘤和小病变的精确检出率，特别是在低对比度和高噪声的医学图像中。我们的方法为目前小规模医学对象分割的研究提供了有效的解决方案，并对数字病理学和医学成像领域有重要的应用价值。",
    "tldr": "本文提出了一种名为SvANet的新网络，旨在利用可变注意力机制提高在小医疗图片中识别小区域的目标效率。此网络能更精确地分割图片，并且能应用于实际医疗诊断中，从而提高疾病的早期识别率和治疗成功率。"
}