{
    "title": "CCVA-FL: Cross-Client Variations Adaptive Federated Learning for Medical Imaging",
    "abstract": "arXiv:2407.11652v4 Announce Type: replace  Abstract: Federated Learning (FL) offers a privacy-preserving approach to train models on decentralized data. Its potential in healthcare is significant, but challenges arise due to cross-client variations in medical image data, exacerbated by limited annotations. This paper introduces Cross-Client Variations Adaptive Federated Learning (CCVA-FL) to address these issues. CCVA-FL aims to minimize cross-client variations by transforming images into a common feature space. It involves expert annotation of a subset of images from each client, followed by the selection of a client with the least data complexity as the target. Synthetic medical images are then generated using Scalable Diffusion Models with Transformers (DiT) based on the target client's annotated images. These synthetic images, capturing diversity and representing the original data, are shared with other clients. Each client then translates its local images into the target image spa",
    "link": "https://arxiv.org/abs/2407.11652",
    "context": "Title: CCVA-FL: Cross-Client Variations Adaptive Federated Learning for Medical Imaging\nAbstract: arXiv:2407.11652v4 Announce Type: replace  Abstract: Federated Learning (FL) offers a privacy-preserving approach to train models on decentralized data. Its potential in healthcare is significant, but challenges arise due to cross-client variations in medical image data, exacerbated by limited annotations. This paper introduces Cross-Client Variations Adaptive Federated Learning (CCVA-FL) to address these issues. CCVA-FL aims to minimize cross-client variations by transforming images into a common feature space. It involves expert annotation of a subset of images from each client, followed by the selection of a client with the least data complexity as the target. Synthetic medical images are then generated using Scalable Diffusion Models with Transformers (DiT) based on the target client's annotated images. These synthetic images, capturing diversity and representing the original data, are shared with other clients. Each client then translates its local images into the target image spa",
    "path": "papers/24/07/2407.11652.json",
    "total_tokens": 391,
    "tldr": "该文章提出了一个名为CCVA-FL的系统，用于在医疗影像领域中通过联邦学习解决来自不同客户端的图像数据之间的差异化问题，并介绍了一种旨在最小化跨客户端差异的方法，涉及使用Scalable Diffusion Models with Transformers（DiT）生成反映目标客户端图像数据的合成图像，这些合成图像被用于共享以帮助其他客户端的图像数据进入目标客户端的图像空间，从而在分布式医疗影像数据中实现更好的模型训练效果。"
}