{
    "title": "ISMRNN: An Implicitly Segmented RNN Method with Mamba for Long-Term Time Series Forecasting",
    "abstract": "arXiv:2407.10768v5 Announce Type: replace-cross  Abstract: Long time series forecasting aims to utilize historical information to forecast future states over extended horizons. Traditional RNN-based series forecasting methods struggle to effectively address long-term dependencies and gradient issues in long time series problems. Recently, SegRNN has emerged as a leading RNN-based model tailored for long-term series forecasting, demonstrating state-of-the-art performance while maintaining a streamlined architecture through innovative segmentation and parallel decoding techniques. Nevertheless, SegRNN has several limitations: its fixed segmentation disrupts data continuity and fails to effectively leverage information across different segments, the segmentation strategy employed by SegRNN does not fundamentally address the issue of information loss within the recurrent structure. To address these issues, we propose the ISMRNN method with three key enhancements: we introduce an implicit s",
    "link": "https://arxiv.org/abs/2407.10768",
    "context": "Title: ISMRNN: An Implicitly Segmented RNN Method with Mamba for Long-Term Time Series Forecasting\nAbstract: arXiv:2407.10768v5 Announce Type: replace-cross  Abstract: Long time series forecasting aims to utilize historical information to forecast future states over extended horizons. Traditional RNN-based series forecasting methods struggle to effectively address long-term dependencies and gradient issues in long time series problems. Recently, SegRNN has emerged as a leading RNN-based model tailored for long-term series forecasting, demonstrating state-of-the-art performance while maintaining a streamlined architecture through innovative segmentation and parallel decoding techniques. Nevertheless, SegRNN has several limitations: its fixed segmentation disrupts data continuity and fails to effectively leverage information across different segments, the segmentation strategy employed by SegRNN does not fundamentally address the issue of information loss within the recurrent structure. To address these issues, we propose the ISMRNN method with three key enhancements: we introduce an implicit s",
    "path": "papers/24/07/2407.10768.json",
    "total_tokens": 400,
    "tldr": "该文章提出了一种名为ISMRNN的方法，这是一种带有Mamba的隐式分割RNN时间序列预测方法。该方法通过引入隐式分割策略，能够更加有效地处理长期依赖性和序列信息的保留问题，从而对长期时间序列数据进行预测。ISMRNN通过改进的隐式分割和流线型结构，解决了传统RNN方法在长期依赖处理和梯度消失问题上的不足，并实现了对数据连续性的保留和信息在整个序列中的有效利用。通过这种方法，ISMRNN在长期时间序列预测上有显著的性能提升，表现出了优越的模型效果。"
}