{
    "title": "A consistent least-squares criterion for calibrating edge lengths in phylogenetic networks",
    "abstract": "arXiv:2407.19343v2 Announce Type: replace  Abstract: In phylogenetic networks, it is desirable to estimate edge lengths in substitutions per site or calendar time. Yet, there is a lack of scalable methods that provide such estimates. Here we consider the problem of obtaining edge length estimates from genetic distances, in the presence of rate variation across genes and lineages, when the network topology is known. We propose a novel criterion based on least-squares that is both consistent and computationally tractable. The crux of our approach is to decompose the genetic distances into two parts, one of which is invariant across displayed trees of the network. The scaled genetic distances are then fitted to the invariant part, while the average scaled genetic distances are fitted to the non-invariant part. We show that this criterion is consistent provided that there exists a tree path between some pair of tips in the network, and that edge lengths in the network are identifiable from",
    "link": "https://arxiv.org/abs/2407.19343",
    "context": "Title: A consistent least-squares criterion for calibrating edge lengths in phylogenetic networks\nAbstract: arXiv:2407.19343v2 Announce Type: replace  Abstract: In phylogenetic networks, it is desirable to estimate edge lengths in substitutions per site or calendar time. Yet, there is a lack of scalable methods that provide such estimates. Here we consider the problem of obtaining edge length estimates from genetic distances, in the presence of rate variation across genes and lineages, when the network topology is known. We propose a novel criterion based on least-squares that is both consistent and computationally tractable. The crux of our approach is to decompose the genetic distances into two parts, one of which is invariant across displayed trees of the network. The scaled genetic distances are then fitted to the invariant part, while the average scaled genetic distances are fitted to the non-invariant part. We show that this criterion is consistent provided that there exists a tree path between some pair of tips in the network, and that edge lengths in the network are identifiable from",
    "path": "papers/24/07/2407.19343.json",
    "total_tokens": 360,
    "tldr": "用户输入内容中的重要创新和贡献可以总结为一句话：我们提出了一种基于 least-squares 方法的一致性边缘长度估计准则，该方法能够有效地应用于已知拓扑的 phylogenetic 网络中，以估计进化过程中不同线粒体基因组成的遗传距离。这种方法的关键优势在于它能够分解遗传距离，提取出网络内部不变的部分，并据此进行边缘长度的精确估计。"
}