{
    "title": "AOTree: Aspect Order Tree-based Model for Explainable Recommendation",
    "abstract": "arXiv:2407.19937v2 Announce Type: replace-cross  Abstract: Recent recommender systems aim to provide not only accurate recommendations but also explanations that help users understand them better. However, most existing explainable recommendations only consider the importance of content in reviews, such as words or aspects, and ignore the ordering relationship among them. This oversight neglects crucial ordering dimensions in the human decision-making process, leading to suboptimal performance. Therefore, in this paper, we propose Aspect Order Tree-based (AOTree) explainable recommendation method, inspired by the Order Effects Theory from cognitive and decision psychology, in order to capture the dependency relationships among decisive factors. We first validate the theory in the recommendation scenario by analyzing the reviews of the users. Then, according to the theory, the proposed AOTree expands the construction of the decision tree to capture aspect orders in users' decision-makin",
    "link": "https://arxiv.org/abs/2407.19937",
    "context": "Title: AOTree: Aspect Order Tree-based Model for Explainable Recommendation\nAbstract: arXiv:2407.19937v2 Announce Type: replace-cross  Abstract: Recent recommender systems aim to provide not only accurate recommendations but also explanations that help users understand them better. However, most existing explainable recommendations only consider the importance of content in reviews, such as words or aspects, and ignore the ordering relationship among them. This oversight neglects crucial ordering dimensions in the human decision-making process, leading to suboptimal performance. Therefore, in this paper, we propose Aspect Order Tree-based (AOTree) explainable recommendation method, inspired by the Order Effects Theory from cognitive and decision psychology, in order to capture the dependency relationships among decisive factors. We first validate the theory in the recommendation scenario by analyzing the reviews of the users. Then, according to the theory, the proposed AOTree expands the construction of the decision tree to capture aspect orders in users' decision-makin",
    "path": "papers/24/07/2407.19937.json",
    "total_tokens": 587,
    "translated_title": "AOTree:基于方面顺序树的模型在可解释推荐中的应用",
    "translated_abstract": "arXiv:2407.19937v2 公告类型：替换交叉 摘要：推荐系统近年来不仅追求推荐的准确性，还希望提供解释，帮助用户更好地理解。然而，大多数现有的可解释推荐系统只考虑评论中的内容重要性，如词语或方面，忽视了它们之间的关系。这种忽视忽视了人类决策过程中的至关重要的顺序维度，导致性能不佳。因此，本文提出基于方面顺序树的AOTree可解释推荐方法，灵感来源于认知和决策心理学的决定因素依赖理论，旨在捕捉用户决策过程中的依赖关系。我们首先通过分析用户的评论来验证该理论在推荐场景中的有效性。然后，根据该理论，提出的AOTree扩展了决策树的构建，以捕捉用户决策过程中的方面顺序。",
    "tldr": "AOTree模型通过捕获用户评论中的方面顺序，为可解释的推荐系统提供了一种新的方法。"
}