{
    "title": "Corki: Enabling Real-time Embodied AI Robots via Algorithm-Architecture Co-Design",
    "abstract": "arXiv:2407.04292v3 Announce Type: replace-cross  Abstract: Embodied AI robots have the potential to fundamentally improve the way human beings live and manufacture. Continued progress in the burgeoning field of using large language models to control robots depends critically on an efficient computing substrate. In particular, today's computing systems for embodied AI robots are designed purely based on the interest of algorithm developers, where robot actions are divided into a discrete frame-basis. Such an execution pipeline creates high latency and energy consumption. This paper proposes Corki, an algorithm-architecture co-design framework for real-time embodied AI robot control. Our idea is to decouple LLM inference, robotic control and data communication in the embodied AI robots compute pipeline. Instead of predicting action for one single frame, Corki predicts the trajectory for the near future to reduce the frequency of LLM inference. The algorithm is coupled with a hardware tha",
    "link": "https://arxiv.org/abs/2407.04292",
    "context": "Title: Corki: Enabling Real-time Embodied AI Robots via Algorithm-Architecture Co-Design\nAbstract: arXiv:2407.04292v3 Announce Type: replace-cross  Abstract: Embodied AI robots have the potential to fundamentally improve the way human beings live and manufacture. Continued progress in the burgeoning field of using large language models to control robots depends critically on an efficient computing substrate. In particular, today's computing systems for embodied AI robots are designed purely based on the interest of algorithm developers, where robot actions are divided into a discrete frame-basis. Such an execution pipeline creates high latency and energy consumption. This paper proposes Corki, an algorithm-architecture co-design framework for real-time embodied AI robot control. Our idea is to decouple LLM inference, robotic control and data communication in the embodied AI robots compute pipeline. Instead of predicting action for one single frame, Corki predicts the trajectory for the near future to reduce the frequency of LLM inference. The algorithm is coupled with a hardware tha",
    "path": "papers/24/07/2407.04292.json",
    "total_tokens": 633,
    "translated_title": "康其：通过算法-架构共设计实现实时化身智能机器人",
    "translated_abstract": "arXiv:2407.04292v3 公告类型：替换交叉 摘要：化身AI机器人有潜力从根本上改善人类生活和制造的方式。在利用大型语言模型控制机器人的新兴领域中，持续进展的关键在于高效计算底座的依赖性。特别是，今天为化身AI机器人设计的计算系统完全基于算法开发者的兴趣，其中机器人动作被分为一个离散的帧基础。这种执行管道产生了高延迟和能量消耗。本文提出康其（Corki），一个实时化身AI机器人控制算法-架构共设计框架。我们的想法是在化身AI机器人的计算管道中分离LLM推断、机器人控制和数据通信。而不是为一个单一的帧预测动作，康其预测未来的轨迹以减少LLM推断的频率。该算法与硬",
    "tldr": "康其框架通过重新设计计算管道预测未来轨迹，减少了大型语言模型推断的频率，从而实现了实时化身AI机器人的高效控制。"
}