{
    "title": "Data Imputation using Large Language Model to Accelerate Recommendation System",
    "abstract": "arXiv:2407.10078v2 Announce Type: replace-cross  Abstract: This paper aims to address the challenge of sparse and missing data in recommendation systems, a significant hurdle in the age of big data. Traditional imputation methods struggle to capture complex relationships within the data. We propose a novel approach that fine-tune Large Language Model (LLM) and use it impute missing data for recommendation systems. LLM which is trained on vast amounts of text, is able to understand complex relationship among data and intelligently fill in missing information. This enriched data is then used by the recommendation system to generate more accurate and personalized suggestions, ultimately enhancing the user experience. We evaluate our LLM-based imputation method across various tasks within the recommendation system domain, including single classification, multi-classification, and regression compared to traditional data imputation methods. By demonstrating the superiority of LLM imputation ",
    "link": "https://arxiv.org/abs/2407.10078",
    "context": "Title: Data Imputation using Large Language Model to Accelerate Recommendation System\nAbstract: arXiv:2407.10078v2 Announce Type: replace-cross  Abstract: This paper aims to address the challenge of sparse and missing data in recommendation systems, a significant hurdle in the age of big data. Traditional imputation methods struggle to capture complex relationships within the data. We propose a novel approach that fine-tune Large Language Model (LLM) and use it impute missing data for recommendation systems. LLM which is trained on vast amounts of text, is able to understand complex relationship among data and intelligently fill in missing information. This enriched data is then used by the recommendation system to generate more accurate and personalized suggestions, ultimately enhancing the user experience. We evaluate our LLM-based imputation method across various tasks within the recommendation system domain, including single classification, multi-classification, and regression compared to traditional data imputation methods. By demonstrating the superiority of LLM imputation ",
    "path": "papers/24/07/2407.10078.json",
    "total_tokens": 313,
    "tldr": "该文章提出使用大型语言模型进行数据填充，以加速推荐系统的性能，通过理解和填充缺失数据，提高推荐系统的准确性和个性化的用户体验。"
}