{
    "title": "Thermal Imaging and Radar for Remote Sleep Monitoring of Breathing and Apnea",
    "abstract": "arXiv:2407.11936v2 Announce Type: replace  Abstract: Polysomnography (PSG), the current gold standard method for monitoring and detecting sleep disorders, is cumbersome and costly. At-home testing solutions, known as home sleep apnea testing (HSAT), exist. However, they are contact-based, a feature which limits the ability of some patient populations to tolerate testing and discourages widespread deployment. Previous work on non-contact sleep monitoring for sleep apnea detection either estimates respiratory effort using radar or nasal airflow using a thermal camera, but has not compared the two or used them together. We conducted a study on 10 participants, ages 34 - 78, with suspected sleep disorders using a hardware setup with a synchronized radar and thermal camera. We show the first comparison of radar and thermal imaging for sleep monitoring, and find that our thermal imaging method outperforms radar significantly. Our thermal imaging method detects apneas with an accuracy of 0.99",
    "link": "https://arxiv.org/abs/2407.11936",
    "context": "Title: Thermal Imaging and Radar for Remote Sleep Monitoring of Breathing and Apnea\nAbstract: arXiv:2407.11936v2 Announce Type: replace  Abstract: Polysomnography (PSG), the current gold standard method for monitoring and detecting sleep disorders, is cumbersome and costly. At-home testing solutions, known as home sleep apnea testing (HSAT), exist. However, they are contact-based, a feature which limits the ability of some patient populations to tolerate testing and discourages widespread deployment. Previous work on non-contact sleep monitoring for sleep apnea detection either estimates respiratory effort using radar or nasal airflow using a thermal camera, but has not compared the two or used them together. We conducted a study on 10 participants, ages 34 - 78, with suspected sleep disorders using a hardware setup with a synchronized radar and thermal camera. We show the first comparison of radar and thermal imaging for sleep monitoring, and find that our thermal imaging method outperforms radar significantly. Our thermal imaging method detects apneas with an accuracy of 0.99",
    "path": "papers/24/07/2407.11936.json",
    "total_tokens": 373,
    "tldr": "该文章通过采用雷达和热成像 camera 结合的方法在十位参与者中进行了一项试验，研究结果表明采用热成像检测呼吸和睡眠呼吸暂停的准确性显著高于雷达检测方法，在检测睡眠中的呼吸暂停事件上准确率达到 0.99，说明该方法在非接触式睡眠监测领域具有较大的应用潜力。"
}