{
    "title": "PP-TIL: Personalized Planning for Autonomous Driving with Instance-based Transfer Imitation Learning",
    "abstract": "arXiv:2407.18569v3 Announce Type: replace  Abstract: Personalized motion planning holds significant importance within urban automated driving, catering to the unique requirements of individual users. Nevertheless, prior endeavors have frequently encountered difficulties in simultaneously addressing two crucial aspects: personalized planning within intricate urban settings and enhancing planning performance through data utilization. The challenge arises from the expensive and limited nature of user data, coupled with the scene state space tending towards infinity. These factors contribute to overfitting and poor generalization problems during model training. Henceforth, we propose an instance-based transfer imitation learning approach. This method facilitates knowledge transfer from extensive expert domain data to the user domain, presenting a fundamental resolution to these issues. We initially train a pre-trained model using large-scale expert data. Subsequently, during the fine-tunin",
    "link": "https://arxiv.org/abs/2407.18569",
    "context": "Title: PP-TIL: Personalized Planning for Autonomous Driving with Instance-based Transfer Imitation Learning\nAbstract: arXiv:2407.18569v3 Announce Type: replace  Abstract: Personalized motion planning holds significant importance within urban automated driving, catering to the unique requirements of individual users. Nevertheless, prior endeavors have frequently encountered difficulties in simultaneously addressing two crucial aspects: personalized planning within intricate urban settings and enhancing planning performance through data utilization. The challenge arises from the expensive and limited nature of user data, coupled with the scene state space tending towards infinity. These factors contribute to overfitting and poor generalization problems during model training. Henceforth, we propose an instance-based transfer imitation learning approach. This method facilitates knowledge transfer from extensive expert domain data to the user domain, presenting a fundamental resolution to these issues. We initially train a pre-trained model using large-scale expert data. Subsequently, during the fine-tunin",
    "path": "papers/24/07/2407.18569.json",
    "total_tokens": 667,
    "translated_title": "PP-TIL：基于实例转移模仿学习的自主驾驶个性化规划",
    "translated_abstract": "arXiv:2407.18569v3 预告类型：替换  摘要：在城市自动化驾驶中，个性化运动规划具有重要意义，它能够满足个体用户的独特需求。然而，以往的努力经常在同时解决两个关键方面时遇到困难：在复杂的都市环境中进行个性化的规划，以及通过数据利用来提高规划性能。问题的根源在于用户数据的昂贵和有限性，以及场景状态空间趋向无穷大的因素，这些因素导致模型训练时出现过拟合和泛化能力差的问题。因此，我们提出了基于实例的转移模仿学习方法。这种方法通过从广泛的专家领域数据向用户领域进行知识转移，从根本上解决了这些问题。我们首先使用大规模的专家数据对预训练模型进行训练。然后，在用户数据上进行精细调整。我们的方法结合了模仿学习和深度强化学习的方法，并且通过实例级匹配和策略追踪来提高性能。在多个市内驾驶仿真环境中进行详细评估后，结果表明，我们的 PP-TIL 方法在提高规划效率和适应性方面取得了显著的改进，同时在大规模多用户数据集上显示出良好的泛化能力。",
    "tldr": "该方法通过结合模仿学习和深度强化学习，提高个性化驾驶规划的性能，尤其是在大量数据支持和泛化能力方面。",
    "en_tdlr": "Our approach enhances personalized driving planning by integrating imitation learning and deep reinforcement learning, especially showing significant improvements in efficiency and adaptability, with strong generalization capabilities on large-scale datasets."
}