{
    "title": "AOTree: Aspect Order Tree-based Model for Explainable Recommendation",
    "abstract": "arXiv:2407.19937v2 Announce Type: replace-cross  Abstract: Recent recommender systems aim to provide not only accurate recommendations but also explanations that help users understand them better. However, most existing explainable recommendations only consider the importance of content in reviews, such as words or aspects, and ignore the ordering relationship among them. This oversight neglects crucial ordering dimensions in the human decision-making process, leading to suboptimal performance. Therefore, in this paper, we propose Aspect Order Tree-based (AOTree) explainable recommendation method, inspired by the Order Effects Theory from cognitive and decision psychology, in order to capture the dependency relationships among decisive factors. We first validate the theory in the recommendation scenario by analyzing the reviews of the users. Then, according to the theory, the proposed AOTree expands the construction of the decision tree to capture aspect orders in users' decision-makin",
    "link": "https://arxiv.org/abs/2407.19937",
    "context": "Title: AOTree: Aspect Order Tree-based Model for Explainable Recommendation\nAbstract: arXiv:2407.19937v2 Announce Type: replace-cross  Abstract: Recent recommender systems aim to provide not only accurate recommendations but also explanations that help users understand them better. However, most existing explainable recommendations only consider the importance of content in reviews, such as words or aspects, and ignore the ordering relationship among them. This oversight neglects crucial ordering dimensions in the human decision-making process, leading to suboptimal performance. Therefore, in this paper, we propose Aspect Order Tree-based (AOTree) explainable recommendation method, inspired by the Order Effects Theory from cognitive and decision psychology, in order to capture the dependency relationships among decisive factors. We first validate the theory in the recommendation scenario by analyzing the reviews of the users. Then, according to the theory, the proposed AOTree expands the construction of the decision tree to capture aspect orders in users' decision-makin",
    "path": "papers/24/07/2407.19937.json",
    "total_tokens": 333,
    "tldr": "该文章提出了一种名为AOTree的模型，旨在通过考虑用户决策过程中的因素顺序，对推荐系统进行解释，解决了现有系统仅关注内容重要性而忽视顺序关系的问题，并通过实证分析验证了这一理论在推荐场景中的有效性。"
}