{
    "title": "\"A Good Bot Always Knows Its Limitations\": Assessing Autonomous System Decision-making Competencies through Factorized Machine Self-confidence",
    "abstract": "arXiv:2407.19631v2 Announce Type: replace-cross  Abstract: How can intelligent machines assess their competencies in completing tasks? This question has come into focus for autonomous systems that algorithmically reason and make decisions under uncertainty. It is argued here that machine self-confidence - a form of meta-reasoning based on self-assessments of an agent's knowledge about the state of the world and itself, as well as its ability to reason about and execute tasks - leads to many eminently computable and useful competency indicators for such agents. This paper presents a culmination of work on this concept in the form of a computational framework called Factorized Machine Self-confidence (FaMSeC), which provides a holistic engineering-focused description of factors driving an algorithmic decision-making process, including: outcome assessment, solver quality, model quality, alignment quality, and past experience. In FaMSeC, self confidence indicators are derived from hierarch",
    "link": "https://arxiv.org/abs/2407.19631",
    "context": "Title: \"A Good Bot Always Knows Its Limitations\": Assessing Autonomous System Decision-making Competencies through Factorized Machine Self-confidence\nAbstract: arXiv:2407.19631v2 Announce Type: replace-cross  Abstract: How can intelligent machines assess their competencies in completing tasks? This question has come into focus for autonomous systems that algorithmically reason and make decisions under uncertainty. It is argued here that machine self-confidence - a form of meta-reasoning based on self-assessments of an agent's knowledge about the state of the world and itself, as well as its ability to reason about and execute tasks - leads to many eminently computable and useful competency indicators for such agents. This paper presents a culmination of work on this concept in the form of a computational framework called Factorized Machine Self-confidence (FaMSeC), which provides a holistic engineering-focused description of factors driving an algorithmic decision-making process, including: outcome assessment, solver quality, model quality, alignment quality, and past experience. In FaMSeC, self confidence indicators are derived from hierarch",
    "path": "papers/24/07/2407.19631.json",
    "total_tokens": 657,
    "translated_title": "\"一个好的机器人总是知道其局限性\": 通过因子化的自我自信量度评估自主系统的决策能力",
    "translated_abstract": "arXiv:2407.19631v2 宣布类型: 替换跨栏摘要: 智能机器如何评估其在完成任务方面的能力？这个问题对于在不确定性下算法性 reasoning 的自主系统来说是焦点。在这里，提出智能机器的自我自信——一种基于对世界的状态、自己的知识和执行任务的能力的自我评估，是一种计算不可行的有用能力指标。本文提出了一种计算框架，称为因子化的自我自信（Factorized Machine Self-confidence, FaMSeC），为算法决策过程提供了一个全面、工程导向的描述，包括：结果评估、求解器质量、模型质量、对齐质量和过去的经验。在FaMSeC中，自我自信指标是从层次构建的，这些指标不仅能够告知系统内部的知识和能力，也能在跨系统之间进行自我沟通，进而提高了系统的决策质量的沟通和教育，并对于设计和构建更加可信和可靠的自主系统具有重要意义。",
    "tldr": "通过创建自评估系统能力的新框架，科学家们寻求提高自主系统的决策透明度和可靠性。",
    "en_tdlr": "Scientists are developing a new framework for autonomous systems to assess their decision-making capabilities, aiming to enhance transparency and reliability."
}