{
    "title": "LiNR: Model Based Neural Retrieval on GPUs at LinkedIn",
    "abstract": "arXiv:2407.13218v3 Announce Type: replace-cross  Abstract: This paper introduces LiNR, LinkedIn's large-scale, GPU-based retrieval system. LiNR supports a billion-sized index on GPU models. We discuss our experiences and challenges in creating scalable, differentiable search indexes using TensorFlow and PyTorch at production scale. In LiNR, both items and model weights are integrated into the model binary. Viewing index construction as a form of model training, we describe scaling our system for large indexes, incorporating full scans and efficient filtering. A key focus is on enabling attribute-based pre-filtering for exhaustive GPU searches, addressing the common challenge of post-filtering in KNN searches that often reduces system quality. We further provide multi-embedding retrieval algorithms and strategies for tackling cold start issues in retrieval. Our advancements in supporting larger indexes through quantization are also discussed. We believe LiNR represents one of the indust",
    "link": "https://arxiv.org/abs/2407.13218",
    "context": "Title: LiNR: Model Based Neural Retrieval on GPUs at LinkedIn\nAbstract: arXiv:2407.13218v3 Announce Type: replace-cross  Abstract: This paper introduces LiNR, LinkedIn's large-scale, GPU-based retrieval system. LiNR supports a billion-sized index on GPU models. We discuss our experiences and challenges in creating scalable, differentiable search indexes using TensorFlow and PyTorch at production scale. In LiNR, both items and model weights are integrated into the model binary. Viewing index construction as a form of model training, we describe scaling our system for large indexes, incorporating full scans and efficient filtering. A key focus is on enabling attribute-based pre-filtering for exhaustive GPU searches, addressing the common challenge of post-filtering in KNN searches that often reduces system quality. We further provide multi-embedding retrieval algorithms and strategies for tackling cold start issues in retrieval. Our advancements in supporting larger indexes through quantization are also discussed. We believe LiNR represents one of the indust",
    "path": "papers/24/07/2407.13218.json",
    "total_tokens": 434,
    "tldr": "该文章主要介绍了LinkedIn公司开发的一种名为LiNR的大规模、基于GPU的检索系统，该系统能够支持数十亿个条目的索引，并在生产环境中使用TensorFlow和PyTorch等工具。该系统将物品和模型权重整合到模型二进制文件中，并将索引构建视为模型训练的一种形式。文章还讨论了如何通过全扫描和高效过滤来扩展系统处理更大索引的能力，以及如何通过预过滤来解决k最近邻搜索中的常见问题。此外，文章还提供了多嵌入检索算法和解决检索中的冷启动问题的方法，并介绍了通过量化提高支持更大索引的能力。总之，LiNR代表了工业界在GPU上大规模检索系统设计和实施方面的重大创新。"
}