{
    "title": "MobileFlow: A Multimodal LLM For Mobile GUI Agent",
    "abstract": "arXiv:2407.04346v2 Announce Type: replace  Abstract: Currently, the integration of mobile Graphical User Interfaces (GUIs) is ubiquitous in most people's daily lives. And the ongoing evolution of multimodal large-scale models, such as GPT-4v, Qwen-VL-Max, has significantly bolstered the capabilities of GUI comprehension and user action analysis, showcasing the potentiality of intelligent GUI assistants. However, current GUI Agents often need to access page layout information through calling system APIs, which may pose privacy risks. Fixing GUI (such as mobile interfaces) to a certain low resolution might result in the loss of fine-grained image details. At the same time, the multimodal large models built for GUI Agents currently have poor understanding and decision-making abilities for Chinese GUI interfaces, making them difficult to apply to a large number of Chinese apps. This paper introduces MobileFlow, a multimodal large language model meticulously crafted for mobile GUI agents. T",
    "link": "https://arxiv.org/abs/2407.04346",
    "context": "Title: MobileFlow: A Multimodal LLM For Mobile GUI Agent\nAbstract: arXiv:2407.04346v2 Announce Type: replace  Abstract: Currently, the integration of mobile Graphical User Interfaces (GUIs) is ubiquitous in most people's daily lives. And the ongoing evolution of multimodal large-scale models, such as GPT-4v, Qwen-VL-Max, has significantly bolstered the capabilities of GUI comprehension and user action analysis, showcasing the potentiality of intelligent GUI assistants. However, current GUI Agents often need to access page layout information through calling system APIs, which may pose privacy risks. Fixing GUI (such as mobile interfaces) to a certain low resolution might result in the loss of fine-grained image details. At the same time, the multimodal large models built for GUI Agents currently have poor understanding and decision-making abilities for Chinese GUI interfaces, making them difficult to apply to a large number of Chinese apps. This paper introduces MobileFlow, a multimodal large language model meticulously crafted for mobile GUI agents. T",
    "path": "papers/24/07/2407.04346.json",
    "total_tokens": 364,
    "tldr": "该文章提出了一种针对移动图形用户界面代理开发的多模态大型语言模型——MobileFlow，该模型能够高效地理解和处理移动应用程序的用户操作，并显著提升了中文图形用户界面的理解和决策能力，同时也解决了访问系统API可能引发的用户隐私问题，并通过保持更高的图像分辨率来确保用户界面的细节不被损失。"
}