{
    "title": "Faux Polyglot: A Study on Information Disparity in Multilingual Large Language Models",
    "abstract": "arXiv:2407.05502v2 Announce Type: replace-cross  Abstract: With Retrieval Augmented Generation (RAG), Large Language Models (LLMs) are playing a pivotal role in information search and are being adopted globally. Although the multilingual capability of LLMs offers new opportunities to bridge the language barrier, do these capabilities translate into real-life scenarios where linguistic divide and knowledge conflicts between multilingual sources are known occurrences? In this paper, we studied LLM's linguistic preference in a RAG-based information search setting. We found that LLMs displayed systemic bias towards information in the same language as the query language in both information retrieval and answer generation. Furthermore, in scenarios where there is little information in the language of the query, LLMs prefer documents in high-resource languages, reinforcing the dominant views. Such bias exists for both factual and opinion-based queries. Our results highlight the linguistic div",
    "link": "https://arxiv.org/abs/2407.05502",
    "context": "Title: Faux Polyglot: A Study on Information Disparity in Multilingual Large Language Models\nAbstract: arXiv:2407.05502v2 Announce Type: replace-cross  Abstract: With Retrieval Augmented Generation (RAG), Large Language Models (LLMs) are playing a pivotal role in information search and are being adopted globally. Although the multilingual capability of LLMs offers new opportunities to bridge the language barrier, do these capabilities translate into real-life scenarios where linguistic divide and knowledge conflicts between multilingual sources are known occurrences? In this paper, we studied LLM's linguistic preference in a RAG-based information search setting. We found that LLMs displayed systemic bias towards information in the same language as the query language in both information retrieval and answer generation. Furthermore, in scenarios where there is little information in the language of the query, LLMs prefer documents in high-resource languages, reinforcing the dominant views. Such bias exists for both factual and opinion-based queries. Our results highlight the linguistic div",
    "path": "papers/24/07/2407.05502.json",
    "total_tokens": 420,
    "tldr": "该文章研究了多语言大型语言模型（LLMs）在使用检索增强生成（RAG）的信息搜索场景中是否存在话语偏见，并发现LLMs在信息检索和回答生成中存在偏好使用与其查询语言相同的语言的信息的系统偏见。此外，当查询语言的信息很少时，LLMs倾向于使用高资源语言的文档，这强化了主导的观点。这种偏见既适用于事实性查询也适用于意见性查询。结果表明，在处理多语言信息时，LLMs可能会无意中放大语言差异和知识冲突，这表明需要采取措施来减轻这种偏见，以便LLMs能够更公平地服务于全球用户。"
}