{
    "title": "Revolutionizing Urban Safety Perception Assessments: Integrating Multimodal Large Language Models with Street View Images",
    "abstract": "arXiv:2407.19719v2 Announce Type: replace  Abstract: Measuring urban safety perception is an important and complex task that traditionally relies heavily on human resources. This process often involves extensive field surveys, manual data collection, and subjective assessments, which can be time-consuming, costly, and sometimes inconsistent. Street View Images (SVIs), along with deep learning methods, provide a way to realize large-scale urban safety detection. However, achieving this goal often requires extensive human annotation to train safety ranking models, and the architectural differences between cities hinder the transferability of these models. Thus, a fully automated method for conducting safety evaluations is essential. Recent advances in multimodal large language models (MLLMs) have demonstrated powerful reasoning and analytical capabilities. Cutting-edge models, e.g., GPT-4 have shown surprising performance in many tasks. We employed these models for urban safety ranking o",
    "link": "https://arxiv.org/abs/2407.19719",
    "context": "Title: Revolutionizing Urban Safety Perception Assessments: Integrating Multimodal Large Language Models with Street View Images\nAbstract: arXiv:2407.19719v2 Announce Type: replace  Abstract: Measuring urban safety perception is an important and complex task that traditionally relies heavily on human resources. This process often involves extensive field surveys, manual data collection, and subjective assessments, which can be time-consuming, costly, and sometimes inconsistent. Street View Images (SVIs), along with deep learning methods, provide a way to realize large-scale urban safety detection. However, achieving this goal often requires extensive human annotation to train safety ranking models, and the architectural differences between cities hinder the transferability of these models. Thus, a fully automated method for conducting safety evaluations is essential. Recent advances in multimodal large language models (MLLMs) have demonstrated powerful reasoning and analytical capabilities. Cutting-edge models, e.g., GPT-4 have shown surprising performance in many tasks. We employed these models for urban safety ranking o",
    "path": "papers/24/07/2407.19719.json",
    "total_tokens": 314,
    "tldr": "该文章创新性地将深度学习和多模态语言模型结合，实现了对城市交通安全的自动化评估，显著提高了效率和准确性。"
}