{
    "title": "On CNF formulas irredundant with respect to unit clause propagation",
    "abstract": "arXiv:2309.01750v4 Announce Type: replace-cross  Abstract: Two CNF formulas are called ucp-equivalent, if they behave in the same way with respect to the unit clause propagation (UCP). A formula is called ucp-irredundant, if removing any clause leads to a formula which is not ucp-equivalent to the original one. As a consequence of known results, the ratio of the size of a ucp-irredundant formula and the size of a smallest ucp-equivalent formula is at most $n^2$, where $n$ is the number of the variables. We demonstrate an example of a ucp-irredundant formula for a symmetric definite Horn function which is larger than a smallest ucp-equivalent formula by a factor $\\Omega(n/\\ln n)$ and, hence, a general upper bound on the above ratio cannot be smaller than this.",
    "link": "https://arxiv.org/abs/2309.01750",
    "context": "Title: On CNF formulas irredundant with respect to unit clause propagation\nAbstract: arXiv:2309.01750v4 Announce Type: replace-cross  Abstract: Two CNF formulas are called ucp-equivalent, if they behave in the same way with respect to the unit clause propagation (UCP). A formula is called ucp-irredundant, if removing any clause leads to a formula which is not ucp-equivalent to the original one. As a consequence of known results, the ratio of the size of a ucp-irredundant formula and the size of a smallest ucp-equivalent formula is at most $n^2$, where $n$ is the number of the variables. We demonstrate an example of a ucp-irredundant formula for a symmetric definite Horn function which is larger than a smallest ucp-equivalent formula by a factor $\\Omega(n/\\ln n)$ and, hence, a general upper bound on the above ratio cannot be smaller than this.",
    "path": "papers/23/09/2309.01750.json",
    "total_tokens": 670,
    "translated_title": "关于相对于单元子公式传播的非冗余CNF公式",
    "translated_abstract": "arXiv:2309.01750v4 公告类型：替换交叉  摘要：两个CNF公式称为ucp等价，如果它们在单元子公式传播（UCP）方面表现出相同的特性。如果从原始公式中移除任何子公式就会导致一个不再与原始公式ucp等价的公式，则该公式称为ucp冗余。已知结果的后果是，非冗余公式的大小与最小ucp等价公式大小的比值不超过$n^2$，其中$n$是变量的数量。我们展示了一个与最小ucp等价公式大小相比大得多、因素为$\\Omega(n/\\ln n)$的非冗余公式，用于对称确定霍恩函数，因此，上述比率的上限不能小于这个值。",
    "tldr": "本文证明了对于某个特定形式的对称确定性霍恩函数，存在一个非冗余CNF公式，它相较于最小的大约$n^2$倍，这表明了在移除变量时可能存在的非冗余性问题。",
    "en_tdlr": "This paper demonstrates that for a particular type of symmetric definite Horn function, there exists a non-redundant CNF formula that is approximately $n^2$ times larger than the minimal one, highlighting potential redundancy issues when variables are removed."
}