{
    "title": "Improved Monte Carlo tree search formulation with multiple root nodes for discrete sizing optimization of truss structures",
    "abstract": "arXiv:2309.06045v4 Announce Type: replace  Abstract: This paper proposes a novel reinforcement learning (RL) algorithm using improved Monte Carlo tree search (IMCTS) formulation for discrete optimum design of truss structures. IMCTS with multiple root nodes includes update process, the best reward, accelerating technique, and terminal condition. Update process means that once a final solution is found, it is used as the initial solution for next search tree. The best reward is used in the backpropagation step. Accelerating technique is introduced by decreasing the width of search tree and reducing maximum number of iterations. The agent is trained to minimize the total structural weight under various constraints until the terminal condition is satisfied. Then, optimal solution is the minimum value of all solutions found by search trees. These numerical examples show that the agent can find optimal solution with low computational cost, stably produces an optimal design, and is suitable ",
    "link": "https://arxiv.org/abs/2309.06045",
    "context": "Title: Improved Monte Carlo tree search formulation with multiple root nodes for discrete sizing optimization of truss structures\nAbstract: arXiv:2309.06045v4 Announce Type: replace  Abstract: This paper proposes a novel reinforcement learning (RL) algorithm using improved Monte Carlo tree search (IMCTS) formulation for discrete optimum design of truss structures. IMCTS with multiple root nodes includes update process, the best reward, accelerating technique, and terminal condition. Update process means that once a final solution is found, it is used as the initial solution for next search tree. The best reward is used in the backpropagation step. Accelerating technique is introduced by decreasing the width of search tree and reducing maximum number of iterations. The agent is trained to minimize the total structural weight under various constraints until the terminal condition is satisfied. Then, optimal solution is the minimum value of all solutions found by search trees. These numerical examples show that the agent can find optimal solution with low computational cost, stably produces an optimal design, and is suitable ",
    "path": "papers/23/09/2309.06045.json",
    "total_tokens": 395,
    "tldr": "该文章提出一种使用多根节点改良蒙特卡罗树搜索（IMCTS）算法的强化学习（RL）方法，用于解决桁架结构离散尺寸优化的难题。这种方法通过优化搜索树的生成过程、利用最佳奖励进行回传更新、采用加速技术减少搜索宽度并控制迭代次数，以及设定终止条件，以训练代理找到满足多种条件的最优结构重量解决方案。实验结果表明，该方法能够在有限计算成本下稳定地找到最优设计，并且适用于广泛的应用场景。"
}