{
    "title": "Learning Semantic Segmentation with Query Points Supervision on Aerial Images",
    "abstract": "arXiv:2309.05490v2 Announce Type: replace  Abstract: Semantic segmentation is crucial in remote sensing, where high-resolution satellite images are segmented into meaningful regions. Recent advancements in deep learning have significantly improved satellite image segmentation. However, most of these methods are typically trained in fully supervised settings that require high-quality pixel-level annotations, which are expensive and time-consuming to obtain. In this work, we present a weakly supervised learning algorithm to train semantic segmentation algorithms that only rely on query point annotations instead of full mask labels. Our proposed approach performs accurate semantic segmentation and improves efficiency by significantly reducing the cost and time required for manual annotation. Specifically, we generate superpixels and extend the query point labels into those superpixels that group similar meaningful semantics. Then, we train semantic segmentation models supervised with imag",
    "link": "https://arxiv.org/abs/2309.05490",
    "context": "Title: Learning Semantic Segmentation with Query Points Supervision on Aerial Images\nAbstract: arXiv:2309.05490v2 Announce Type: replace  Abstract: Semantic segmentation is crucial in remote sensing, where high-resolution satellite images are segmented into meaningful regions. Recent advancements in deep learning have significantly improved satellite image segmentation. However, most of these methods are typically trained in fully supervised settings that require high-quality pixel-level annotations, which are expensive and time-consuming to obtain. In this work, we present a weakly supervised learning algorithm to train semantic segmentation algorithms that only rely on query point annotations instead of full mask labels. Our proposed approach performs accurate semantic segmentation and improves efficiency by significantly reducing the cost and time required for manual annotation. Specifically, we generate superpixels and extend the query point labels into those superpixels that group similar meaningful semantics. Then, we train semantic segmentation models supervised with imag",
    "path": "papers/23/09/2309.05490.json",
    "total_tokens": 306,
    "tldr": "该文章提出一种仅依赖查询点标注的弱 supervision学习算法，用于训练仅需少量的查询点标注即可进行卫星图像语义分割的深度学习模型，有效降低了高精度像素级标注的成本和时间。"
}