{
    "title": "Holistic Dynamic Frequency Transformer for Image Fusion and Exposure Correction",
    "abstract": "arXiv:2309.01183v2 Announce Type: replace  Abstract: The correction of exposure-related issues is a pivotal component in enhancing the quality of images, offering substantial implications for various computer vision tasks. Historically, most methodologies have predominantly utilized spatial domain recovery, offering limited consideration to the potentialities of the frequency domain. Additionally, there has been a lack of a unified perspective towards low-light enhancement, exposure correction, and multi-exposure fusion, complicating and impeding the optimization of image processing. In response to these challenges, this paper proposes a novel methodology that leverages the frequency domain to improve and unify the handling of exposure correction tasks. Our method introduces Holistic Frequency Attention and Dynamic Frequency Feed-Forward Network, which replace conventional correlation computation in the spatial-domain. They form a foundational building block that facilitates a U-shaped",
    "link": "https://arxiv.org/abs/2309.01183",
    "context": "Title: Holistic Dynamic Frequency Transformer for Image Fusion and Exposure Correction\nAbstract: arXiv:2309.01183v2 Announce Type: replace  Abstract: The correction of exposure-related issues is a pivotal component in enhancing the quality of images, offering substantial implications for various computer vision tasks. Historically, most methodologies have predominantly utilized spatial domain recovery, offering limited consideration to the potentialities of the frequency domain. Additionally, there has been a lack of a unified perspective towards low-light enhancement, exposure correction, and multi-exposure fusion, complicating and impeding the optimization of image processing. In response to these challenges, this paper proposes a novel methodology that leverages the frequency domain to improve and unify the handling of exposure correction tasks. Our method introduces Holistic Frequency Attention and Dynamic Frequency Feed-Forward Network, which replace conventional correlation computation in the spatial-domain. They form a foundational building block that facilitates a U-shaped",
    "path": "papers/23/09/2309.01183.json",
    "total_tokens": 619,
    "translated_title": "全局动态频率变压器用于图像融合和曝光校正",
    "translated_abstract": "arXiv:2309.01183v2 宣布类型：替换 摘要：在提高图像质量的过程中，曝光相关问题的校正是非常重要的一个组成部分，这对于各种计算机视觉任务有重大的意义。历史上，大多数方法主要在空间域内进行恢复，对频率域的可能性的考虑有限。此外，在低光照增强、曝光校正和多曝光融合方面，缺乏统一的视角，这使得图像处理优化变得复杂和困难。为了应对这些挑战，本文提出了一个创新的方法，该方法利用频率域来改进和统一曝光校正任务的处理。我们的方法引入了全局频率注意力（Holistic Frequency Attention）和动态频率反馈前向网络（Dynamic Frequency Feed-Forward Network），它们取代了空间域中常用的相关运算。它们构成了一个基础构建块，有助于实现U形结构。",
    "tldr": "本文提出了一种基于频率域的全局动态频率变压器方法，用于统一和改进曝光校正任务，包括低光照增强、曝光校正和多曝光融合。"
}