{
    "title": "Holistic Dynamic Frequency Transformer for Image Fusion and Exposure Correction",
    "abstract": "arXiv:2309.01183v2 Announce Type: replace  Abstract: The correction of exposure-related issues is a pivotal component in enhancing the quality of images, offering substantial implications for various computer vision tasks. Historically, most methodologies have predominantly utilized spatial domain recovery, offering limited consideration to the potentialities of the frequency domain. Additionally, there has been a lack of a unified perspective towards low-light enhancement, exposure correction, and multi-exposure fusion, complicating and impeding the optimization of image processing. In response to these challenges, this paper proposes a novel methodology that leverages the frequency domain to improve and unify the handling of exposure correction tasks. Our method introduces Holistic Frequency Attention and Dynamic Frequency Feed-Forward Network, which replace conventional correlation computation in the spatial-domain. They form a foundational building block that facilitates a U-shaped",
    "link": "https://arxiv.org/abs/2309.01183",
    "context": "Title: Holistic Dynamic Frequency Transformer for Image Fusion and Exposure Correction\nAbstract: arXiv:2309.01183v2 Announce Type: replace  Abstract: The correction of exposure-related issues is a pivotal component in enhancing the quality of images, offering substantial implications for various computer vision tasks. Historically, most methodologies have predominantly utilized spatial domain recovery, offering limited consideration to the potentialities of the frequency domain. Additionally, there has been a lack of a unified perspective towards low-light enhancement, exposure correction, and multi-exposure fusion, complicating and impeding the optimization of image processing. In response to these challenges, this paper proposes a novel methodology that leverages the frequency domain to improve and unify the handling of exposure correction tasks. Our method introduces Holistic Frequency Attention and Dynamic Frequency Feed-Forward Network, which replace conventional correlation computation in the spatial-domain. They form a foundational building block that facilitates a U-shaped",
    "path": "papers/23/09/2309.01183.json",
    "total_tokens": 319,
    "tldr": "该文章提出了一个全新的图像融合和曝光校正方法，该方法利用频率域技术，结合了全面的频率注意力和动态频率前向网络，使得传统的空间域相关计算得到了改善和替代，为图像处理的优化提供了统一的处理框架。"
}