{
    "title": "Empowering Private Tutoring by Chaining Large Language Models",
    "abstract": "arXiv:2309.08112v2 Announce Type: replace-cross  Abstract: Artificial intelligence has been applied in various aspects of online education to facilitate teaching and learning. However, few approaches has been made toward a complete AI-powered tutoring system. In this work, we explore the development of a full-fledged intelligent tutoring system powered by state-of-the-art large language models (LLMs), covering automatic course planning and adjusting, tailored instruction, and flexible quiz evaluation. To make the system robust to prolonged interaction and cater to individualized education, the system is decomposed into three inter-connected core processes-interaction, reflection, and reaction. Each process is implemented by chaining LLM-powered tools along with dynamically updated memory modules. Tools are LLMs prompted to execute one specific task at a time, while memories are data storage that gets updated during education process. Statistical results from learning logs demonstrate t",
    "link": "https://arxiv.org/abs/2309.08112",
    "context": "Title: Empowering Private Tutoring by Chaining Large Language Models\nAbstract: arXiv:2309.08112v2 Announce Type: replace-cross  Abstract: Artificial intelligence has been applied in various aspects of online education to facilitate teaching and learning. However, few approaches has been made toward a complete AI-powered tutoring system. In this work, we explore the development of a full-fledged intelligent tutoring system powered by state-of-the-art large language models (LLMs), covering automatic course planning and adjusting, tailored instruction, and flexible quiz evaluation. To make the system robust to prolonged interaction and cater to individualized education, the system is decomposed into three inter-connected core processes-interaction, reflection, and reaction. Each process is implemented by chaining LLM-powered tools along with dynamically updated memory modules. Tools are LLMs prompted to execute one specific task at a time, while memories are data storage that gets updated during education process. Statistical results from learning logs demonstrate t",
    "path": "papers/23/09/2309.08112.json",
    "total_tokens": 350,
    "tldr": "该文章提出了一种由最新大型语言模型驱动的完全AI智能 tutoring系统，该系统集成了自动课程规划，个性化教学和灵活的测试评估。系统通过链接 LLM 工具和动态更新的内存模块来应对长期的教学互动和个性化教育需求。通过学习日志的统计数据，证明系统能够提供有效和个性化的教育体验。"
}