{
    "title": "Safety-Aware Human-Lead Vehicle Platooning by Proactively Reacting to Uncertain Human Behaving",
    "abstract": "arXiv:2405.07556v2 Announce Type: replace  Abstract: Human-Lead Cooperative Adaptive Cruise Control (HL-CACC) is regarded as a promising vehicle platooning technology in real-world implementation. By utilizing a Human-driven Vehicle (HV) as the platoon leader, HL-CACC reduces the cost and enhances the reliability of perception and decision-making. However, state-of-the-art HL-CACC technology still has a great limitation on driving safety for the lack of considering the leading human driver's uncertain behaving. In this study, a HL-CACC controller is designed based on Stochastic Model Predictive Control (SMPC). It is enabled to predict the driving intention of the leading Connected Human-Driven Vehicle (CHV). The proposed controller has the following features: i) enhanced perceived safety in oscillating traffic; ii) guaranteed safety against hard brakes; iii) computational efficient for real-time implementation. The proposed controller is evaluated on a PreScan&Simulink simulation platf",
    "link": "https://arxiv.org/abs/2405.07556",
    "context": "Title: Safety-Aware Human-Lead Vehicle Platooning by Proactively Reacting to Uncertain Human Behaving\nAbstract: arXiv:2405.07556v2 Announce Type: replace  Abstract: Human-Lead Cooperative Adaptive Cruise Control (HL-CACC) is regarded as a promising vehicle platooning technology in real-world implementation. By utilizing a Human-driven Vehicle (HV) as the platoon leader, HL-CACC reduces the cost and enhances the reliability of perception and decision-making. However, state-of-the-art HL-CACC technology still has a great limitation on driving safety for the lack of considering the leading human driver's uncertain behaving. In this study, a HL-CACC controller is designed based on Stochastic Model Predictive Control (SMPC). It is enabled to predict the driving intention of the leading Connected Human-Driven Vehicle (CHV). The proposed controller has the following features: i) enhanced perceived safety in oscillating traffic; ii) guaranteed safety against hard brakes; iii) computational efficient for real-time implementation. The proposed controller is evaluated on a PreScan&Simulink simulation platf",
    "path": "papers/24/05/2405.07556.json",
    "total_tokens": 377,
    "tldr": "该文章提出了一种基于随机模型预测控制的自动驾驶车辆编队控制策略，该策略可以通过预测前导人类驾驶员的驾驶意图来提高编队行驶的安全性，并确保在面对紧急刹车时仍能保持安全距离，同时满足实时控制的计算效率要求。"
}