{
    "title": "Transmon Qubit Constraints on Dark Matter-Nucleon Scattering",
    "abstract": "arXiv:2405.00112v2 Announce Type: replace-cross  Abstract: We recently pointed out that power measurements of single quasiparticle devices can be used to detect dark matter. These devices have the lowest known energy thresholds, far surpassing standard direct detection experiments, requiring energy deposition above only about an meV. We calculate dark matter induced quasiparticle densities in transmon qubits, and use the latest transmon qubit measurements that provide one of the strongest existing lab-based bounds on dark matter-nucleon scattering below about 100 MeV. We strongly constrain sub-component dark matter, using both a dark matter population thermalized in the Earth as well as the dark matter wind from the Galactic halo. We demonstrate future potential sensitivities using devices with low quasiparticle densities.",
    "link": "https://arxiv.org/abs/2405.00112",
    "context": "Title: Transmon Qubit Constraints on Dark Matter-Nucleon Scattering\nAbstract: arXiv:2405.00112v2 Announce Type: replace-cross  Abstract: We recently pointed out that power measurements of single quasiparticle devices can be used to detect dark matter. These devices have the lowest known energy thresholds, far surpassing standard direct detection experiments, requiring energy deposition above only about an meV. We calculate dark matter induced quasiparticle densities in transmon qubits, and use the latest transmon qubit measurements that provide one of the strongest existing lab-based bounds on dark matter-nucleon scattering below about 100 MeV. We strongly constrain sub-component dark matter, using both a dark matter population thermalized in the Earth as well as the dark matter wind from the Galactic halo. We demonstrate future potential sensitivities using devices with low quasiparticle densities.",
    "path": "papers/24/05/2405.00112.json",
    "total_tokens": 333,
    "tldr": "该文章指出，通过检测单个量子比特设备中的低阈值能量沉积，有可能发现暗物质的存在，这一方法已达到远超过传统直接探测实验的新高。研究人员利用最新的量子比特测量结果，对惰性物质与原子核的相互作用进行了严格限制，从而排除了多种潜在的暗物质类型。未来的研究将进一步利用低量子比特设备的潜在敏感度来探测暗物质。"
}