{
    "title": "LOG-LIO2: A LiDAR-Inertial Odometry with Efficient Uncertainty Analysis",
    "abstract": "arXiv:2405.01316v2 Announce Type: replace  Abstract: Uncertainty in LiDAR measurements, stemming from factors such as range sensing, is crucial for LIO (LiDAR-Inertial Odometry) systems as it affects the accurate weighting in the loss function. While recent LIO systems address uncertainty related to range sensing, the impact of incident angle on uncertainty is often overlooked by the community. Moreover, the existing uncertainty propagation methods suffer from computational inefficiency. This paper proposes a comprehensive point uncertainty model that accounts for both the uncertainties from LiDAR measurements and surface characteristics, along with an efficient local uncertainty analytical method for LiDAR-based state estimation problem. We employ a projection operator that separates the uncertainty into the ray direction and its orthogonal plane. Then, we derive incremental Jacobian matrices of eigenvalues and eigenvectors w.r.t. points, which enables a fast approximation of uncertai",
    "link": "https://arxiv.org/abs/2405.01316",
    "context": "Title: LOG-LIO2: A LiDAR-Inertial Odometry with Efficient Uncertainty Analysis\nAbstract: arXiv:2405.01316v2 Announce Type: replace  Abstract: Uncertainty in LiDAR measurements, stemming from factors such as range sensing, is crucial for LIO (LiDAR-Inertial Odometry) systems as it affects the accurate weighting in the loss function. While recent LIO systems address uncertainty related to range sensing, the impact of incident angle on uncertainty is often overlooked by the community. Moreover, the existing uncertainty propagation methods suffer from computational inefficiency. This paper proposes a comprehensive point uncertainty model that accounts for both the uncertainties from LiDAR measurements and surface characteristics, along with an efficient local uncertainty analytical method for LiDAR-based state estimation problem. We employ a projection operator that separates the uncertainty into the ray direction and its orthogonal plane. Then, we derive incremental Jacobian matrices of eigenvalues and eigenvectors w.r.t. points, which enables a fast approximation of uncertai",
    "path": "papers/24/05/2405.01316.json",
    "total_tokens": 351,
    "tldr": "该文章提出了一种包含LiDAR测量不确定性和表面特性影响的综合点不确定性模型，以及一种高效的不确定性传播分析方法，用于处理基于LiDAR的SLAM系统中的状态估计问题。通过采用分离法线不确定性与射线方向不确定性的投影，并结合快速增量矩阵计算，实现了对不确定性的高效处理。"
}