{
    "title": "Variational Quantum Algorithm Landscape Reconstruction by Low-Rank Tensor Completion",
    "abstract": "arXiv:2405.10941v2 Announce Type: replace-cross  Abstract: Variational quantum algorithms (VQAs) are a broad class of algorithms with many applications in science and industry. Applying a VQA to a problem involves optimizing a parameterized quantum circuit by maximizing or minimizing a cost function. A particular challenge associated with VQAs is understanding the properties of associated cost functions. Having the landscapes of VQA cost functions can greatly assist in developing and testing new variational quantum algorithms, but they are extremely expensive to compute. Reconstructing the landscape of a VQA using existing techniques requires a large number of cost function evaluations, especially when the dimension or the resolution of the landscape is high. To address this challenge, we propose a low-rank tensor-completion-based approach for local landscape reconstruction. By leveraging compact low-rank representations of tensors, our technique can overcome the curse of dimensionalit",
    "link": "https://arxiv.org/abs/2405.10941",
    "context": "Title: Variational Quantum Algorithm Landscape Reconstruction by Low-Rank Tensor Completion\nAbstract: arXiv:2405.10941v2 Announce Type: replace-cross  Abstract: Variational quantum algorithms (VQAs) are a broad class of algorithms with many applications in science and industry. Applying a VQA to a problem involves optimizing a parameterized quantum circuit by maximizing or minimizing a cost function. A particular challenge associated with VQAs is understanding the properties of associated cost functions. Having the landscapes of VQA cost functions can greatly assist in developing and testing new variational quantum algorithms, but they are extremely expensive to compute. Reconstructing the landscape of a VQA using existing techniques requires a large number of cost function evaluations, especially when the dimension or the resolution of the landscape is high. To address this challenge, we propose a low-rank tensor-completion-based approach for local landscape reconstruction. By leveraging compact low-rank representations of tensors, our technique can overcome the curse of dimensionalit",
    "path": "papers/24/05/2405.10941.json",
    "total_tokens": 325,
    "tldr": "该文章提出了一种基于低秩张量完形填缺的方法，该方法能够利用紧凑的低秩张量表示，有效地重建具有高维度或高分辨率的 variational quantum algorithm（VQA）成本函数景观，从而大幅度降低了计算成本。"
}