{
    "title": "Halfway Escape Optimization: A Quantum-Inspired Solution for Complex Optimization Problems",
    "abstract": "arXiv:2405.02850v3 Announce Type: replace-cross  Abstract: This paper first proposes the Halfway Escape Optimization (HEO) algorithm, a novel quantum-inspired metaheuristic designed to address complex optimization problems characterized by rugged landscapes and high-dimensionality with an efficient convergence rate. The study presents a comprehensive comparative evaluation of HEO's performance against established optimization algorithms, including Particle Swarm Optimization (PSO), Genetic Algorithm (GA), Artificial Fish Swarm Algorithm (AFSA), Grey Wolf Optimizer (GWO), and Quantum behaved Particle Swarm Optimization (QPSO). The primary analysis encompasses 14 benchmark functions with dimension 30, demonstrating HEO's effectiveness and adaptability in navigating complex optimization landscapes and providing valuable insights into its performance. The simple test of HEO in Traveling Salesman Problem (TSP), Pressure Vessel Design and Tubular Column Design infers its feasibility and pote",
    "link": "https://arxiv.org/abs/2405.02850",
    "context": "Title: Halfway Escape Optimization: A Quantum-Inspired Solution for Complex Optimization Problems\nAbstract: arXiv:2405.02850v3 Announce Type: replace-cross  Abstract: This paper first proposes the Halfway Escape Optimization (HEO) algorithm, a novel quantum-inspired metaheuristic designed to address complex optimization problems characterized by rugged landscapes and high-dimensionality with an efficient convergence rate. The study presents a comprehensive comparative evaluation of HEO's performance against established optimization algorithms, including Particle Swarm Optimization (PSO), Genetic Algorithm (GA), Artificial Fish Swarm Algorithm (AFSA), Grey Wolf Optimizer (GWO), and Quantum behaved Particle Swarm Optimization (QPSO). The primary analysis encompasses 14 benchmark functions with dimension 30, demonstrating HEO's effectiveness and adaptability in navigating complex optimization landscapes and providing valuable insights into its performance. The simple test of HEO in Traveling Salesman Problem (TSP), Pressure Vessel Design and Tubular Column Design infers its feasibility and pote",
    "path": "papers/24/05/2405.02850.json",
    "total_tokens": 415,
    "tldr": "该文章提出了一种名为“Halfway Escape Optimization”（HEO）的新算法，这是一种受量子启发的设计优化算法，能够在具有崎岖地形和高度维度的复杂优化问题中实现高效收敛。研究通过在14个具有30维度的标准函数上进行的全面比较分析，展示了HEO在导航复杂优化地形方面的有效性和适应性，提供了关于其性能的有价值的见解。此外，文章还通过旅行商问题（TSP）、压力容器设计和圆筒柱设计等简单的测试，验证了HEO的实用性和潜力。"
}