{
    "title": "Improving Intervention Efficacy via Concept Realignment in Concept Bottleneck Models",
    "abstract": "arXiv:2405.01531v2 Announce Type: replace-cross  Abstract: Concept Bottleneck Models (CBMs) ground image classification on human-understandable concepts to allow for interpretable model decisions. Crucially, the CBM design inherently allows for human interventions, in which expert users are given the ability to modify potentially misaligned concept choices to influence the decision behavior of the model in an interpretable fashion. However, existing approaches often require numerous human interventions per image to achieve strong performances, posing practical challenges in scenarios where obtaining human feedback is expensive. In this paper, we find that this is noticeably driven by an independent treatment of concepts during intervention, wherein a change of one concept does not influence the use of other ones in the model's final decision. To address this issue, we introduce a trainable concept intervention realignment module, which leverages concept relations to realign concept ass",
    "link": "https://arxiv.org/abs/2405.01531",
    "context": "Title: Improving Intervention Efficacy via Concept Realignment in Concept Bottleneck Models\nAbstract: arXiv:2405.01531v2 Announce Type: replace-cross  Abstract: Concept Bottleneck Models (CBMs) ground image classification on human-understandable concepts to allow for interpretable model decisions. Crucially, the CBM design inherently allows for human interventions, in which expert users are given the ability to modify potentially misaligned concept choices to influence the decision behavior of the model in an interpretable fashion. However, existing approaches often require numerous human interventions per image to achieve strong performances, posing practical challenges in scenarios where obtaining human feedback is expensive. In this paper, we find that this is noticeably driven by an independent treatment of concepts during intervention, wherein a change of one concept does not influence the use of other ones in the model's final decision. To address this issue, we introduce a trainable concept intervention realignment module, which leverages concept relations to realign concept ass",
    "path": "papers/24/05/2405.01531.json",
    "total_tokens": 337,
    "tldr": "该文章提出了一种通过调整概念瓶颈模型中的概念对齐来改进干预效果的方法。通过训练一个概念干预对齐模块，作者发现可以改善人类专家在模型决策过程中的干预效果，通过最小化对每个图像的干预次数，从而减少了获取人类反馈的成本。"
}