{
    "title": "Compression-Realized Deep Structural Network for Video Quality Enhancement",
    "abstract": "arXiv:2405.06342v2 Announce Type: replace  Abstract: This paper focuses on the task of quality enhancement for compressed videos. Although deep network-based video restorers achieve impressive progress, most of the existing methods lack a structured design to optimally leverage the priors within compression codecs. Since the quality degradation of the video is primarily induced by the compression algorithm, a new paradigm is urgently needed for a more ``conscious'' process of quality enhancement. As a result, we propose the Compression-Realized Deep Structural Network (CRDS), introducing three inductive biases aligned with the three primary processes in the classic compression codec, merging the strengths of classical encoder architecture with deep network capabilities. Inspired by the residual extraction and domain transformation process in the codec, a pre-trained Latent Degradation Residual Auto-Encoder is proposed to transform video frames into a latent feature space, and the mutua",
    "link": "https://arxiv.org/abs/2405.06342",
    "context": "Title: Compression-Realized Deep Structural Network for Video Quality Enhancement\nAbstract: arXiv:2405.06342v2 Announce Type: replace  Abstract: This paper focuses on the task of quality enhancement for compressed videos. Although deep network-based video restorers achieve impressive progress, most of the existing methods lack a structured design to optimally leverage the priors within compression codecs. Since the quality degradation of the video is primarily induced by the compression algorithm, a new paradigm is urgently needed for a more ``conscious'' process of quality enhancement. As a result, we propose the Compression-Realized Deep Structural Network (CRDS), introducing three inductive biases aligned with the three primary processes in the classic compression codec, merging the strengths of classical encoder architecture with deep network capabilities. Inspired by the residual extraction and domain transformation process in the codec, a pre-trained Latent Degradation Residual Auto-Encoder is proposed to transform video frames into a latent feature space, and the mutua",
    "path": "papers/24/05/2405.06342.json",
    "total_tokens": 347,
    "tldr": "该文章提出了一种基于压缩实现的深度结构网络（CRDS），通过引入与经典压缩编码器架构中三个主要过程相匹配的三个经验性偏差，有效增强了压缩视频的质量。这种设计同时融合了经典编码器和深度神经网络的优点，并实现了对视频质量提升任务的有效解析和优化。"
}