{
    "title": "Doubly-Dynamic ISAC Precoding for Vehicular Networks: A Constrained Deep Reinforcement Learning (CDRL) Approach",
    "abstract": "arXiv:2405.14347v2 Announce Type: replace-cross  Abstract: Integrated sensing and communication (ISAC) technology is essential for enabling the vehicular networks. However, the communication channel in this scenario exhibits time-varying characteristics, and the potential targets may move rapidly, creating a doubly-dynamic phenomenon. This nature poses a challenge for real-time precoder design. While optimization-based solutions are widely researched, they are complex and heavily rely on perfect prior information, which is impractical in double dynamics. To address this challenge, we propose using constrained deep reinforcement learning (CDRL) to facilitate dynamic updates to the ISAC precoder design. Additionally, the primal dual-deep deterministic policy gradient (PD-DDPG) and Wolpertinger architecture are tailored to efficiently train the algorithm under complex constraints and variable numbers of users. The proposed scheme not only adapts to the dynamics based on observations but a",
    "link": "https://arxiv.org/abs/2405.14347",
    "context": "Title: Doubly-Dynamic ISAC Precoding for Vehicular Networks: A Constrained Deep Reinforcement Learning (CDRL) Approach\nAbstract: arXiv:2405.14347v2 Announce Type: replace-cross  Abstract: Integrated sensing and communication (ISAC) technology is essential for enabling the vehicular networks. However, the communication channel in this scenario exhibits time-varying characteristics, and the potential targets may move rapidly, creating a doubly-dynamic phenomenon. This nature poses a challenge for real-time precoder design. While optimization-based solutions are widely researched, they are complex and heavily rely on perfect prior information, which is impractical in double dynamics. To address this challenge, we propose using constrained deep reinforcement learning (CDRL) to facilitate dynamic updates to the ISAC precoder design. Additionally, the primal dual-deep deterministic policy gradient (PD-DDPG) and Wolpertinger architecture are tailored to efficiently train the algorithm under complex constraints and variable numbers of users. The proposed scheme not only adapts to the dynamics based on observations but a",
    "path": "papers/24/05/2405.14347.json",
    "total_tokens": 407,
    "tldr": "该文章的核心贡献在于提出了一种结合深度强化学习和双重动态特征的ISAC预编码方法，该方法采用受限深度强化学习框架，以应对车辆网络环境中不断变化的通信条件。文中还特别考虑了目标快速移动所带来的挑战，并通过定制化PD-DDPG和Wolpertinger架构来有效训练算法，以适应复杂的约束条件和不同用户数量的变化。该方法不仅能够实时适应环境变化，还能在无先验知识的情况下优化预编码设计，为ISAC在车辆网络中的应用提供了新的解决方案。"
}