{
    "title": "JOSENet: A Joint Stream Embedding Network for Violence Detection in Surveillance Videos",
    "abstract": "arXiv:2405.02961v2 Announce Type: replace  Abstract: The increasing proliferation of video surveillance cameras and the escalating demand for crime prevention have intensified interest in the task of violence detection within the research community. Compared to other action recognition tasks, violence detection in surveillance videos presents additional issues, such as the wide variety of real fight scenes. Unfortunately, existing datasets for violence detection are relatively small in comparison to those for other action recognition tasks. Moreover, surveillance footage often features different individuals in each video and varying backgrounds for each camera. In addition, fast detection of violent actions in real-life surveillance videos is crucial to prevent adverse outcomes, thus necessitating models that are optimized for reduced memory usage and computational costs. These challenges complicate the application of traditional action recognition methods. To tackle all these issues, ",
    "link": "https://arxiv.org/abs/2405.02961",
    "context": "Title: JOSENet: A Joint Stream Embedding Network for Violence Detection in Surveillance Videos\nAbstract: arXiv:2405.02961v2 Announce Type: replace  Abstract: The increasing proliferation of video surveillance cameras and the escalating demand for crime prevention have intensified interest in the task of violence detection within the research community. Compared to other action recognition tasks, violence detection in surveillance videos presents additional issues, such as the wide variety of real fight scenes. Unfortunately, existing datasets for violence detection are relatively small in comparison to those for other action recognition tasks. Moreover, surveillance footage often features different individuals in each video and varying backgrounds for each camera. In addition, fast detection of violent actions in real-life surveillance videos is crucial to prevent adverse outcomes, thus necessitating models that are optimized for reduced memory usage and computational costs. These challenges complicate the application of traditional action recognition methods. To tackle all these issues, ",
    "path": "papers/24/05/2405.02961.json",
    "total_tokens": 301,
    "tldr": "该文章提出了一种结合流嵌入网络的JOSENet，它利用联合流嵌入技术提高了在监控视频中检测暴力的准确性，同时加快了检测速度并降低了计算复杂性。"
}