{
    "title": "LLM Discussion: Enhancing the Creativity of Large Language Models via Discussion Framework and Role-Play",
    "abstract": "arXiv:2405.06373v4 Announce Type: replace-cross  Abstract: Large language models (LLMs) have shown exceptional proficiency in natural language processing but often fall short of generating creative and original responses to open-ended questions. To enhance LLM creativity, our key insight is to emulate the human process of inducing collective creativity through engaging discussions with participants from diverse backgrounds and perspectives. To this end, we propose LLM Discussion, a three-phase discussion framework that facilitates vigorous and diverging idea exchanges and ensures convergence to creative answers. Moreover, we adopt a role-playing technique by assigning distinct roles to LLMs to combat the homogeneity of LLMs. We evaluate the efficacy of the proposed framework with the Alternative Uses Test, Similarities Test, Instances Test, and Scientific Creativity Test through both LLM evaluation and human study. The results show that our proposed framework outperforms single-LLM app",
    "link": "https://arxiv.org/abs/2405.06373",
    "context": "Title: LLM Discussion: Enhancing the Creativity of Large Language Models via Discussion Framework and Role-Play\nAbstract: arXiv:2405.06373v4 Announce Type: replace-cross  Abstract: Large language models (LLMs) have shown exceptional proficiency in natural language processing but often fall short of generating creative and original responses to open-ended questions. To enhance LLM creativity, our key insight is to emulate the human process of inducing collective creativity through engaging discussions with participants from diverse backgrounds and perspectives. To this end, we propose LLM Discussion, a three-phase discussion framework that facilitates vigorous and diverging idea exchanges and ensures convergence to creative answers. Moreover, we adopt a role-playing technique by assigning distinct roles to LLMs to combat the homogeneity of LLMs. We evaluate the efficacy of the proposed framework with the Alternative Uses Test, Similarities Test, Instances Test, and Scientific Creativity Test through both LLM evaluation and human study. The results show that our proposed framework outperforms single-LLM app",
    "path": "papers/24/05/2405.06373.json",
    "total_tokens": 382,
    "tldr": "该文章提出了一种名为LLM Discussion的三阶段讨论框架，旨在通过模拟人类在集体讨论中激发创意的方式，增强大型语言模型（LLMs）的创造性回应。通过参与者在不同背景和视角下的交流以及角色扮演技术，该框架确保了LLMs更为发散和集中的思维过程。通过替代用途测试、相似性测试、实例测试和科学创造力测试，研究表明该框架在提升LLMs的创造力和新颖性方面取得了显著的成效。"
}