{
    "title": "The MovieLens Beliefs Dataset: Collecting Pre-Choice Data for Online Recommender Systems",
    "abstract": "arXiv:2405.11053v3 Announce Type: replace-cross  Abstract: An increasingly important aspect of designing recommender systems involves considering how recommendations will influence consumer choices. This paper addresses this issue by introducing a method for collecting user beliefs about un-experienced items - a critical predictor of choice behavior. We implemented this method on the MovieLens platform, resulting in a rich dataset that combines user ratings, beliefs, and observed recommendations. We document challenges to such data collection, including selection bias in response and limited coverage of the product space. This unique resource empowers researchers to delve deeper into user behavior and analyze user choices absent recommendations, measure the effectiveness of recommendations, and prototype algorithms that leverage user belief data, ultimately leading to more impactful recommender systems. The dataset can be found at https://grouplens.org/datasets/movielens/ml_belief_2024",
    "link": "https://arxiv.org/abs/2405.11053",
    "context": "Title: The MovieLens Beliefs Dataset: Collecting Pre-Choice Data for Online Recommender Systems\nAbstract: arXiv:2405.11053v3 Announce Type: replace-cross  Abstract: An increasingly important aspect of designing recommender systems involves considering how recommendations will influence consumer choices. This paper addresses this issue by introducing a method for collecting user beliefs about un-experienced items - a critical predictor of choice behavior. We implemented this method on the MovieLens platform, resulting in a rich dataset that combines user ratings, beliefs, and observed recommendations. We document challenges to such data collection, including selection bias in response and limited coverage of the product space. This unique resource empowers researchers to delve deeper into user behavior and analyze user choices absent recommendations, measure the effectiveness of recommendations, and prototype algorithms that leverage user belief data, ultimately leading to more impactful recommender systems. The dataset can be found at https://grouplens.org/datasets/movielens/ml_belief_2024",
    "path": "papers/24/05/2405.11053.json",
    "total_tokens": 637,
    "translated_title": "电影推荐系统前的用户信念数据集：收集在线推荐系统的前选择数据",
    "translated_abstract": "arXiv:2405.11053v3 公告类型：替换-交叉",
    "tldr": "本文介绍了一种收集用户对未经历电影的信念的方法，并实现了一个结合用户评分、信念和推荐的丰富数据集。",
    "en_tdlr": "This paper introduces a method for collecting user beliefs about un-experienced movies and implements it on the MovieLens platform to create a rich dataset combining user ratings, beliefs, and observed recommendations."
}