{
    "title": "Reassessing Evaluation Functions in Algorithmic Recourse: An Empirical Study from a Human-Centered Perspective",
    "abstract": "arXiv:2405.14264v2 Announce Type: replace-cross  Abstract: In this study, we critically examine the foundational premise of algorithmic recourse - a process of generating counterfactual action plans (i.e., recourses) assisting individuals to reverse adverse decisions made by AI systems. The assumption underlying algorithmic recourse is that individuals accept and act on recourses that minimize the gap between their current and desired states. This assumption, however, remains empirically unverified. To address this issue, we conducted a user study with 362 participants and assessed whether minimizing the distance function, a metric of the gap between the current and desired states, indeed prompts them to accept and act upon suggested recourses. Our findings reveal a nuanced landscape: participants' acceptance of recourses did not correlate with the recourse distance. Moreover, participants' willingness to act upon recourses peaked at the minimal recourse distance but was otherwise cons",
    "link": "https://arxiv.org/abs/2405.14264",
    "context": "Title: Reassessing Evaluation Functions in Algorithmic Recourse: An Empirical Study from a Human-Centered Perspective\nAbstract: arXiv:2405.14264v2 Announce Type: replace-cross  Abstract: In this study, we critically examine the foundational premise of algorithmic recourse - a process of generating counterfactual action plans (i.e., recourses) assisting individuals to reverse adverse decisions made by AI systems. The assumption underlying algorithmic recourse is that individuals accept and act on recourses that minimize the gap between their current and desired states. This assumption, however, remains empirically unverified. To address this issue, we conducted a user study with 362 participants and assessed whether minimizing the distance function, a metric of the gap between the current and desired states, indeed prompts them to accept and act upon suggested recourses. Our findings reveal a nuanced landscape: participants' acceptance of recourses did not correlate with the recourse distance. Moreover, participants' willingness to act upon recourses peaked at the minimal recourse distance but was otherwise cons",
    "path": "papers/24/05/2405.14264.json",
    "total_tokens": 338,
    "tldr": "该文章通过对算法补救过程的重新评估，揭示了用户在接受和采取补救措施方面的接受度与补救措施的距离不完全相关，提出了一种新的探索算法补救措施的有效性视角。"
}