{
    "title": "Twin Deformable Point Convolutions for Point Cloud Semantic Segmentation in Remote Sensing Scenes",
    "abstract": "arXiv:2405.19735v2 Announce Type: replace  Abstract: Thanks to the application of deep learning technology in point cloud processing of the remote sensing field, point cloud segmentation has become a research hotspot in recent years, which can be applied to real-world 3D, smart cities, and other fields. Although existing solutions have made unprecedented progress, they ignore the inherent characteristics of point clouds in remote sensing fields that are strictly arranged according to latitude, longitude, and altitude, which brings great convenience to the segmentation of point clouds in remote sensing fields. To consider this property cleverly, we propose novel convolution operators, termed Twin Deformable point Convolutions (TDConvs), which aim to achieve adaptive feature learning by learning deformable sampling points in the latitude-longitude plane and altitude direction, respectively. First, to model the characteristics of the latitude-longitude plane, we propose a Cylinder-wise De",
    "link": "https://arxiv.org/abs/2405.19735",
    "context": "Title: Twin Deformable Point Convolutions for Point Cloud Semantic Segmentation in Remote Sensing Scenes\nAbstract: arXiv:2405.19735v2 Announce Type: replace  Abstract: Thanks to the application of deep learning technology in point cloud processing of the remote sensing field, point cloud segmentation has become a research hotspot in recent years, which can be applied to real-world 3D, smart cities, and other fields. Although existing solutions have made unprecedented progress, they ignore the inherent characteristics of point clouds in remote sensing fields that are strictly arranged according to latitude, longitude, and altitude, which brings great convenience to the segmentation of point clouds in remote sensing fields. To consider this property cleverly, we propose novel convolution operators, termed Twin Deformable point Convolutions (TDConvs), which aim to achieve adaptive feature learning by learning deformable sampling points in the latitude-longitude plane and altitude direction, respectively. First, to model the characteristics of the latitude-longitude plane, we propose a Cylinder-wise De",
    "path": "papers/24/05/2405.19735.json",
    "total_tokens": 360,
    "tldr": "该文章提出了一种名为“Twin Deformable Point Convolutions (TDConvs)”的新型卷积操作，旨在通过在纬度和经度平面以及海拔方向上学习可适应的采样点，来达到对遥感点云特征的灵活学习，从而显著提高了点云在遥感场景中的分割性能。"
}