{
    "title": "SimEndoGS: Efficient Data-driven Scene Simulation using Robotic Surgery Videos via Physics-embedded 3D Gaussians",
    "abstract": "arXiv:2405.00956v3 Announce Type: replace  Abstract: Surgical scene simulation plays a crucial role in surgical education and simulator-based robot learning. Traditional approaches for creating these environments with surgical scene involve a labor-intensive process where designers hand-craft tissues models with textures and geometries for soft body simulations. This manual approach is not only time-consuming but also limited in the scalability and realism. In contrast, data-driven simulation offers a compelling alternative. It has the potential to automatically reconstruct 3D surgical scenes from real-world surgical video data, followed by the application of soft body physics. This area, however, is relatively uncharted. In our research, we introduce 3D Gaussian as a learnable representation for surgical scene, which is learned from stereo endoscopic video. To prevent over-fitting and ensure the geometrical correctness of these scenes, we incorporate depth supervision and anisotropy r",
    "link": "https://arxiv.org/abs/2405.00956",
    "context": "Title: SimEndoGS: Efficient Data-driven Scene Simulation using Robotic Surgery Videos via Physics-embedded 3D Gaussians\nAbstract: arXiv:2405.00956v3 Announce Type: replace  Abstract: Surgical scene simulation plays a crucial role in surgical education and simulator-based robot learning. Traditional approaches for creating these environments with surgical scene involve a labor-intensive process where designers hand-craft tissues models with textures and geometries for soft body simulations. This manual approach is not only time-consuming but also limited in the scalability and realism. In contrast, data-driven simulation offers a compelling alternative. It has the potential to automatically reconstruct 3D surgical scenes from real-world surgical video data, followed by the application of soft body physics. This area, however, is relatively uncharted. In our research, we introduce 3D Gaussian as a learnable representation for surgical scene, which is learned from stereo endoscopic video. To prevent over-fitting and ensure the geometrical correctness of these scenes, we incorporate depth supervision and anisotropy r",
    "path": "papers/24/05/2405.00956.json",
    "total_tokens": 377,
    "tldr": "该文章提出了一种名为SimEndoGS的新型高效数据驱动的手术场景模拟方法，该方法使用机器人手术视频中的物理嵌入式3D高斯分布来模拟场景。这种方法能够从三维立体内窥镜视频中自动学习手术场景的三维结构，并在保证场景几何正确性的同时，利用深度监督和各向异性约束来防止过拟合，从而提供更真实和可扩大的模拟体验。"
}