{
    "title": "Dynamic In-context Learning with Conversational Models for Data Extraction and Materials Property Prediction",
    "abstract": "arXiv:2405.10448v2 Announce Type: replace-cross  Abstract: The advent of natural language processing and large language models (LLMs) has revolutionized the extraction of data from unstructured scholarly papers. However, ensuring data trustworthiness remains a significant challenge. In this paper, we introduce PropertyExtractor, an open-source tool that leverages advanced conversational LLMs like Google gemini-pro and OpenAI gpt-4, blends zero-shot with few-shot in-context learning, and employs engineered prompts for the dynamic refinement of structured information hierarchies - enabling autonomous, efficient, scalable, and accurate identification, extraction, and verification of material property data. Our tests on material data demonstrate precision and recall that exceed 95\\% with an error rate of approximately 9%, highlighting the effectiveness and versatility of the toolkit. Finally, databases for 2D material thicknesses, a critical parameter for device integration, and energy ban",
    "link": "https://arxiv.org/abs/2405.10448",
    "context": "Title: Dynamic In-context Learning with Conversational Models for Data Extraction and Materials Property Prediction\nAbstract: arXiv:2405.10448v2 Announce Type: replace-cross  Abstract: The advent of natural language processing and large language models (LLMs) has revolutionized the extraction of data from unstructured scholarly papers. However, ensuring data trustworthiness remains a significant challenge. In this paper, we introduce PropertyExtractor, an open-source tool that leverages advanced conversational LLMs like Google gemini-pro and OpenAI gpt-4, blends zero-shot with few-shot in-context learning, and employs engineered prompts for the dynamic refinement of structured information hierarchies - enabling autonomous, efficient, scalable, and accurate identification, extraction, and verification of material property data. Our tests on material data demonstrate precision and recall that exceed 95\\% with an error rate of approximately 9%, highlighting the effectiveness and versatility of the toolkit. Finally, databases for 2D material thicknesses, a critical parameter for device integration, and energy ban",
    "path": "papers/24/05/2405.10448.json",
    "total_tokens": 393,
    "tldr": "该文章创新性地构建了一个名为PropertyExtractor的开放源代码工具，该工具利用先进的对话式大型语言模型，结合零样本与少样本的内在工作方式，以及经过精心设计的提示，实现了对材料属性数据的动态自学习（in-context learning）。该工具能够准确、高效地识别、提取并验证大量结构化信息，尤其是在2D材料厚度的数据库中表现出色，显示出其作为材料数据分析和预测的高效工具的潜力。"
}