{
    "title": "FA-Depth: Toward Fast and Accurate Self-supervised Monocular Depth Estimation",
    "abstract": "arXiv:2405.10885v2 Announce Type: replace  Abstract: Most existing methods often rely on complex models to predict scene depth with high accuracy, resulting in slow inference that is not conducive to deployment. To better balance precision and speed, we first designed SmallDepth based on sparsity. Second, to enhance the feature representation ability of SmallDepth during training under the condition of equal complexity during inference, we propose an equivalent transformation module(ETM). Third, to improve the ability of each layer in the case of a fixed SmallDepth to perceive different context information and improve the robustness of SmallDepth to the left-right direction and illumination changes, we propose pyramid loss. Fourth, to further improve the accuracy of SmallDepth, we utilized the proposed function approximation loss (APX) to transfer knowledge in the pretrained HQDecv2, obtained by optimizing the previous HQDec to address grid artifacts in some regions, to SmallDepth. Ext",
    "link": "https://arxiv.org/abs/2405.10885",
    "context": "Title: FA-Depth: Toward Fast and Accurate Self-supervised Monocular Depth Estimation\nAbstract: arXiv:2405.10885v2 Announce Type: replace  Abstract: Most existing methods often rely on complex models to predict scene depth with high accuracy, resulting in slow inference that is not conducive to deployment. To better balance precision and speed, we first designed SmallDepth based on sparsity. Second, to enhance the feature representation ability of SmallDepth during training under the condition of equal complexity during inference, we propose an equivalent transformation module(ETM). Third, to improve the ability of each layer in the case of a fixed SmallDepth to perceive different context information and improve the robustness of SmallDepth to the left-right direction and illumination changes, we propose pyramid loss. Fourth, to further improve the accuracy of SmallDepth, we utilized the proposed function approximation loss (APX) to transfer knowledge in the pretrained HQDecv2, obtained by optimizing the previous HQDec to address grid artifacts in some regions, to SmallDepth. Ext",
    "path": "papers/24/05/2405.10885.json",
    "total_tokens": 442,
    "tldr": "该文章提出了一种名为\"FA-Depth\"的自监督单目深度估计方法，旨在提高速度和精度。文章首先提出了一种名为SmallDepth的轻量级模型，并通过引入等价变换模块（ETM）增强其模型训练时的特征表示能力。同时，文章还提出了一种金字塔损失函数来提高模型对不同层次上下文信息的感知能力，以增强模型对左/右方向和光照变化的不变性。此外，文章利用功能逼近损失（APX）将高精度预训练模型HQDecv2的知识转移给SmallDepth，以克服一些区域中的网格失真问题。实验结果表明，FA-Depth方法在提高速度的同时，深度估计的准确性得到了显著提升。"
}