{
    "title": "FloorSet -- a VLSI Floorplanning Dataset with Design Constraints of Real-World SoCs",
    "abstract": "arXiv:2405.05480v4 Announce Type: replace-cross  Abstract: Floorplanning for systems-on-a-chip (SoCs) and its sub-systems is a crucial and non-trivial step of the physical design flow. It represents a difficult combinatorial optimization problem. A typical large scale SoC with 120 partitions generates a search-space of nearly 10E250. As novel machine learning (ML) approaches emerge to tackle such problems, there is a growing need for a modern benchmark that comprises a large training dataset and performance metrics that better reflect real-world constraints and objectives compared to existing benchmarks. To address this need, we present FloorSet -- two comprehensive datasets of synthetic fixed-outline floorplan layouts that reflect the distribution of real SoCs. Each dataset has 1M training samples and 100 test samples where each sample is a synthetic floor-plan. FloorSet-Prime comprises fully-abutted rectilinear partitions and near-optimal wire-length. A simplified dataset that reflec",
    "link": "https://arxiv.org/abs/2405.05480",
    "context": "Title: FloorSet -- a VLSI Floorplanning Dataset with Design Constraints of Real-World SoCs\nAbstract: arXiv:2405.05480v4 Announce Type: replace-cross  Abstract: Floorplanning for systems-on-a-chip (SoCs) and its sub-systems is a crucial and non-trivial step of the physical design flow. It represents a difficult combinatorial optimization problem. A typical large scale SoC with 120 partitions generates a search-space of nearly 10E250. As novel machine learning (ML) approaches emerge to tackle such problems, there is a growing need for a modern benchmark that comprises a large training dataset and performance metrics that better reflect real-world constraints and objectives compared to existing benchmarks. To address this need, we present FloorSet -- two comprehensive datasets of synthetic fixed-outline floorplan layouts that reflect the distribution of real SoCs. Each dataset has 1M training samples and 100 test samples where each sample is a synthetic floor-plan. FloorSet-Prime comprises fully-abutted rectilinear partitions and near-optimal wire-length. A simplified dataset that reflec",
    "path": "papers/24/05/2405.05480.json",
    "total_tokens": 774,
    "translated_title": "FloorSet --- 一个带有真实世界SoC设计约束的VLSI布局规划数据集",
    "translated_abstract": "arXiv:2405.05480v4 宣布类型：替换交叉  摘要：对于系统级芯片（SoCs）及其子系统，布局规划是一个重要的和非同小可的物理设计流程步骤。它代表了一个困难的组合优化问题。一个典型的带有120个分区的大型SoC产生了大约10E250的搜索空间。随着新的机器学习（ML）方法出现以解决这些问题，对于一个能够涵盖大量训练数据并且更好地反映真实世界约束和目标的现代基准的需求正在增长。为了满足这一需求，我们推出了FloorSet ——两个全面的合成固定轮廓布局设计数据集，它们反映了真实SoC的分布。每个数据集都有100万训练样本和100个测试样本，其中每个样本都是一种合成布局。FloorSet-Prime包含了全边接矩形分区的布局和接近最优的走线长度。一个简化版的数据集通过去除空闲区域和简化斜向连接来减少内存消耗，同时保持高性能。FloorSet-Duo则进一步丰富了对真实世界SoC中常见复杂度的模拟，包括不对称分区、孤立分区和不规则形状。FloorSet的发布标志着布局规划领域的新基准开始，为学习算法提供了一个真实世界的挑战，同时也是理论研究和工业实际的双重机遇。",
    "tldr": "FloorSet是一个包含带有真实世界SoC设计约束的VLSI布局规划数据的合成数据集，旨在为机器学习方法提供一个更接近真实世界情况的挑战。",
    "en_tdlr": "FloorSet is a synthetic VLSI floorplanning dataset with design constraints of real-world SoCs, offering a new benchmark that provides a real-world challenge for machine learning methods in layout planning."
}