{
    "title": "Dual-Task Vision Transformer for Rapid and Accurate Intracerebral Hemorrhage CT Image Classification",
    "abstract": "arXiv:2405.06814v3 Announce Type: replace  Abstract: Intracerebral hemorrhage (ICH) is a severe and sudden medical condition caused by the rupture of blood vessels in the brain, leading to permanent damage to brain tissue and often resulting in functional disabilities or death in patients. Diagnosis and analysis of ICH typically rely on brain CT imaging. Given the urgency of ICH conditions, early treatment is crucial, necessitating rapid analysis of CT images to formulate tailored treatment plans. However, the complexity of ICH CT images and the frequent scarcity of specialist radiologists pose significant challenges. Therefore, we collect a dataset from the real world for ICH and normal classification and three types of ICH image classification based on the hemorrhage location, i.e., Deep, Subcortical, and Lobar. In addition, we propose a neural network structure, dual-task vision transformer (DTViT), for the automated classification and diagnosis of ICH images. The DTViT deploys the ",
    "link": "https://arxiv.org/abs/2405.06814",
    "context": "Title: Dual-Task Vision Transformer for Rapid and Accurate Intracerebral Hemorrhage CT Image Classification\nAbstract: arXiv:2405.06814v3 Announce Type: replace  Abstract: Intracerebral hemorrhage (ICH) is a severe and sudden medical condition caused by the rupture of blood vessels in the brain, leading to permanent damage to brain tissue and often resulting in functional disabilities or death in patients. Diagnosis and analysis of ICH typically rely on brain CT imaging. Given the urgency of ICH conditions, early treatment is crucial, necessitating rapid analysis of CT images to formulate tailored treatment plans. However, the complexity of ICH CT images and the frequent scarcity of specialist radiologists pose significant challenges. Therefore, we collect a dataset from the real world for ICH and normal classification and three types of ICH image classification based on the hemorrhage location, i.e., Deep, Subcortical, and Lobar. In addition, we propose a neural network structure, dual-task vision transformer (DTViT), for the automated classification and diagnosis of ICH images. The DTViT deploys the ",
    "path": "papers/24/05/2405.06814.json",
    "total_tokens": 388,
    "tldr": "该文章提出了一种名为Dual-Task Vision Transformer（DTViT）的神经网络结构，旨在自动快速准确地分类脑CT图像中的出血性中风类型，并能根据出血部位的不同（如深部、脑叶下和脑叶出血）提供精确诊断，以支持及早制定个性化的治疗方案。"
}