{
    "title": "A Novel Method for News Article Event-Based Embedding",
    "abstract": "arXiv:2405.13071v2 Announce Type: replace-cross  Abstract: Embedding news articles is a crucial tool for multiple fields, such as media bias detection, identifying fake news, and making news recommendations. However, existing news embedding methods are not optimized to capture the latent context of news events. Most embedding methods rely on full-text information and neglect time-relevant embedding generation. In this paper, we propose a novel lightweight method that optimizes news embedding generation by focusing on entities and themes mentioned in articles and their historical connections to specific events. We suggest a method composed of three stages. First, we process and extract events, entities, and themes from the given news articles. Second, we generate periodic time embeddings for themes and entities by training time-separated GloVe models on current and historical data. Lastly, we concatenate the news embeddings generated by two distinct approaches: Smooth Inverse Frequency ",
    "link": "https://arxiv.org/abs/2405.13071",
    "context": "Title: A Novel Method for News Article Event-Based Embedding\nAbstract: arXiv:2405.13071v2 Announce Type: replace-cross  Abstract: Embedding news articles is a crucial tool for multiple fields, such as media bias detection, identifying fake news, and making news recommendations. However, existing news embedding methods are not optimized to capture the latent context of news events. Most embedding methods rely on full-text information and neglect time-relevant embedding generation. In this paper, we propose a novel lightweight method that optimizes news embedding generation by focusing on entities and themes mentioned in articles and their historical connections to specific events. We suggest a method composed of three stages. First, we process and extract events, entities, and themes from the given news articles. Second, we generate periodic time embeddings for themes and entities by training time-separated GloVe models on current and historical data. Lastly, we concatenate the news embeddings generated by two distinct approaches: Smooth Inverse Frequency ",
    "path": "papers/24/05/2405.13071.json",
    "total_tokens": 693,
    "translated_title": "新的基于事件嵌入新闻文章的方法",
    "translated_abstract": "arXiv:2405.13071v2 公告类型：替换交叉  翻译摘要：新闻文章的嵌入是多个领域的重要工具，例如媒体偏见检测、识别虚假新闻和制作新闻推荐。然而，现有的新闻嵌入方法并未优化以捕捉新闻事件的隐性上下文。大多数嵌入方法依赖于全文本信息，忽视了时间相关的嵌入生成。在本文中，我们提出了一种新的轻量级方法，该方法通过专注于文章中提到的实体和主题以及它们与特定事件的历史联系来优化新闻嵌入的生成。我们建议的方法由三个阶段组成。首先，我们从给定的新闻文章中处理和提取事件、实体和主题。其次，我们通过在当前和历史数据上训练分时段的GloVe模型来为主题和实体生成周期性的时间嵌入。最后，我们结合两种不同的方法来拼接生成的新新闻嵌入：平滑倒数频率，以及主题和实体的基于时间的关键词嵌入。我们展示了这种方法在提高新闻主题识别和相似新闻文章搜索方面的有效性，并通过实验验证了其在多媒体环境下减少媒体偏见的潜力。",
    "tldr": "本文提出了一种新方法，优化了新闻文章的嵌入生成，该方法专注于文章中提到的实体和主题，并对它们与特定事件的历史联系进行优化，提高了主题识别的准确性，并有助于减少媒体偏见。"
}