{
    "title": "Doubly-Dynamic ISAC Precoding for Vehicular Networks: A Constrained Deep Reinforcement Learning (CDRL) Approach",
    "abstract": "arXiv:2405.14347v2 Announce Type: replace-cross  Abstract: Integrated sensing and communication (ISAC) technology is essential for enabling the vehicular networks. However, the communication channel in this scenario exhibits time-varying characteristics, and the potential targets may move rapidly, creating a doubly-dynamic phenomenon. This nature poses a challenge for real-time precoder design. While optimization-based solutions are widely researched, they are complex and heavily rely on perfect prior information, which is impractical in double dynamics. To address this challenge, we propose using constrained deep reinforcement learning (CDRL) to facilitate dynamic updates to the ISAC precoder design. Additionally, the primal dual-deep deterministic policy gradient (PD-DDPG) and Wolpertinger architecture are tailored to efficiently train the algorithm under complex constraints and variable numbers of users. The proposed scheme not only adapts to the dynamics based on observations but a",
    "link": "https://arxiv.org/abs/2405.14347",
    "context": "Title: Doubly-Dynamic ISAC Precoding for Vehicular Networks: A Constrained Deep Reinforcement Learning (CDRL) Approach\nAbstract: arXiv:2405.14347v2 Announce Type: replace-cross  Abstract: Integrated sensing and communication (ISAC) technology is essential for enabling the vehicular networks. However, the communication channel in this scenario exhibits time-varying characteristics, and the potential targets may move rapidly, creating a doubly-dynamic phenomenon. This nature poses a challenge for real-time precoder design. While optimization-based solutions are widely researched, they are complex and heavily rely on perfect prior information, which is impractical in double dynamics. To address this challenge, we propose using constrained deep reinforcement learning (CDRL) to facilitate dynamic updates to the ISAC precoder design. Additionally, the primal dual-deep deterministic policy gradient (PD-DDPG) and Wolpertinger architecture are tailored to efficiently train the algorithm under complex constraints and variable numbers of users. The proposed scheme not only adapts to the dynamics based on observations but a",
    "path": "papers/24/05/2405.14347.json",
    "total_tokens": 666,
    "translated_title": "双重动态ISAC预编码方法在车载网络中的应用：一种约束下的深度强化学习（CDRL）策略",
    "translated_abstract": "arXiv:2405.14347v2 宣布类型：替换交叉 摘要：集成感知与通信（ISAC）技术对于实现车载网络至关重要。然而，在这种场景中，通信信道表现出动态变化的特点，潜在的目标可能会迅速移动，产生一种双重动态现象。这种特性为实时预编码器设计和实施带来了挑战。尽管基于优化的解决方案得到了广泛的研究，但这些方法复杂且严重依赖于不切实际的完全预先信息。为了解决这一挑战，我们提出使用约束下的深度强化学习（CDRL）策略，以实现在ISAC预编码器设计中的动态更新。此外，我们还将为PD-DDPG双深度确定性策略梯度和Wolpertinger架构作出特别设计，以便在复杂约束和用户数量可变的情况下有效训练该算法。我们提出的方案不仅可以基于观察到的现象进行适应，还能够提升车载网络的性能，并在不确定性和动态变化的环境中保持较高的传输速率。",
    "tldr": "本文提出了一种基于约束深度强化学习的双重动态ISAC预编码策略，旨在提高车载网络中的通信效率，尤其是在动态变化的环境中。",
    "en_tdlr": "This paper proposes a constrained deep reinforcement learning (CDRL) approach to enhance ISAC precoding in vehicular networks, especially under dynamic changes."
}