{
    "title": "Expanding the Horizon: Enabling Hybrid Quantum Transfer Learning for Long-Tailed Chest X-Ray Classification",
    "abstract": "arXiv:2405.00156v2 Announce Type: replace-cross  Abstract: Quantum machine learning (QML) has the potential for improving the multi-label classification of rare, albeit critical, diseases in large-scale chest x-ray (CXR) datasets due to theoretical quantum advantages over classical machine learning (CML) in sample efficiency and generalizability. While prior literature has explored QML with CXRs, it has focused on binary classification tasks with small datasets due to limited access to quantum hardware and computationally expensive simulations. To that end, we implemented a Jax-based framework that enables the simulation of medium-sized qubit architectures with significant improvements in wall-clock time over current software offerings. We evaluated the performance of our Jax-based framework in terms of efficiency and performance for hybrid quantum transfer learning for long-tailed classification across 8, 14, and 19 disease labels using large-scale CXR datasets. The Jax-based framewor",
    "link": "https://arxiv.org/abs/2405.00156",
    "context": "Title: Expanding the Horizon: Enabling Hybrid Quantum Transfer Learning for Long-Tailed Chest X-Ray Classification\nAbstract: arXiv:2405.00156v2 Announce Type: replace-cross  Abstract: Quantum machine learning (QML) has the potential for improving the multi-label classification of rare, albeit critical, diseases in large-scale chest x-ray (CXR) datasets due to theoretical quantum advantages over classical machine learning (CML) in sample efficiency and generalizability. While prior literature has explored QML with CXRs, it has focused on binary classification tasks with small datasets due to limited access to quantum hardware and computationally expensive simulations. To that end, we implemented a Jax-based framework that enables the simulation of medium-sized qubit architectures with significant improvements in wall-clock time over current software offerings. We evaluated the performance of our Jax-based framework in terms of efficiency and performance for hybrid quantum transfer learning for long-tailed classification across 8, 14, and 19 disease labels using large-scale CXR datasets. The Jax-based framewor",
    "path": "papers/24/05/2405.00156.json",
    "total_tokens": 687,
    "translated_title": "扩展视野：为长尾胸部X线分类启用混合量子迁移学习",
    "translated_abstract": "arXiv:2405.00156v2 公告类型：替换交叉  翻译：量子机器学习（QML）在大型胸部X线（CXR）数据集中提高罕见但关键疾病的多标签分类能力方面具有理论上的优势，这得益于它相对于经典机器学习（CML）在样本效率和泛化能力方面的量子优势。虽然先前文献已经在小数据集上探索了QML在二分类任务中的应用，但由于对量子硬件的访问限制和计算上的昂贵模拟，它主要集中在有限的CXRs上。为此，我们实现了基于Jax的框架，该框架能够以对当前软件提供者有显著改进的方式在具有较大量子比特架构的模拟上进行模拟。我们评估了基于Jax的框架在效率和对于长尾分类的混合量子迁移学习方面的性能，该框架在具有8、14和19种疾病标签的大型CXR数据集上得到了测试。基于Jax的框架：性能更好，能够加速量子模拟，有利于长尾胸部X线分类的多标签学习。",
    "tldr": "利用Jax框架加速量子模拟，适用于长尾胸部X线多标签分类的高效混合量子迁移学习。"
}