{
    "title": "SemiCD-VL: Visual-Language Model Guidance Makes Better Semi-supervised Change Detector",
    "abstract": "arXiv:2405.04788v3 Announce Type: replace  Abstract: Change Detection (CD) aims to identify pixels with semantic changes between images. However, annotating massive numbers of pixel-level images is labor-intensive and costly, especially for multi-temporal images, which require pixel-wise comparisons by human experts. Considering the excellent performance of visual language models (VLMs) for zero-shot, open-vocabulary, etc. with prompt-based reasoning, it is promising to utilize VLMs to make better CD under limited labeled data. In this paper, we propose a VLM guidance-based semi-supervised CD method, namely SemiCD-VL. The insight of SemiCD-VL is to synthesize free change labels using VLMs to provide additional supervision signals for unlabeled data. However, almost all current VLMs are designed for single-temporal images and cannot be directly applied to bi- or multi-temporal images. Motivated by this, we first propose a VLM-based mixed change event generation (CEG) strategy to yield p",
    "link": "https://arxiv.org/abs/2405.04788",
    "context": "Title: SemiCD-VL: Visual-Language Model Guidance Makes Better Semi-supervised Change Detector\nAbstract: arXiv:2405.04788v3 Announce Type: replace  Abstract: Change Detection (CD) aims to identify pixels with semantic changes between images. However, annotating massive numbers of pixel-level images is labor-intensive and costly, especially for multi-temporal images, which require pixel-wise comparisons by human experts. Considering the excellent performance of visual language models (VLMs) for zero-shot, open-vocabulary, etc. with prompt-based reasoning, it is promising to utilize VLMs to make better CD under limited labeled data. In this paper, we propose a VLM guidance-based semi-supervised CD method, namely SemiCD-VL. The insight of SemiCD-VL is to synthesize free change labels using VLMs to provide additional supervision signals for unlabeled data. However, almost all current VLMs are designed for single-temporal images and cannot be directly applied to bi- or multi-temporal images. Motivated by this, we first propose a VLM-based mixed change event generation (CEG) strategy to yield p",
    "path": "papers/24/05/2405.04788.json",
    "total_tokens": 897,
    "translated_title": "半监督CD-VL: 视觉-语言模型指导使更好半监督变化检测器",
    "translated_abstract": "arXiv:2405.04788v3 公告类型：替换 摘要：变化检测（CD）旨在识别图像间的 semantics 变化像素。然而，标注大量像素级图像对于人类专家来说既耗时又昂贵，尤其是在多时态图像中，这种图像的人力像素级比较尤其如此。鉴于视觉语言模型（VLMs）在零样本、开放词汇等方面的优秀表现，以及基于提示的推理能力，利用VLMs在有限标注数据的帮助下做出更好的CD前景广阔。在本文中，我们提出了一种基于半监督CD-VL方法的VLM指导，即SemiCD-VL。SemiCD-VL的见解是使用VLMs合成自由的变化标签，为未标注数据提供额外的监督信号。然而，几乎所有现有的VLMs都是为单时态图像设计的，不能直接用于双时态或多时态图像。受此启发，我们首先提出了一种基于VLM的混合变化事件生成（CEG）策略，以产生pixel-wise 变化标签。由于当前流行的图像变化检测方法普遍依赖大量标注数据，而有限的标注数据和大量未标注数据之间的不平衡常常导致模型性能受限。为了解决这个问题，我们提出了两种自监督机制，即自监督变化检测预训练（Self-SSL-CD）和自监督变化特征指引（SSL-CF），来利用额外的时间序列信息，使模型能够自适应地嵌入对未来变化的强渐进可分性假设。我们认为，使用合成变化的VLM指导来结合自监督预训练模式，可以在无需额外增加大量标注数据的情况下，有效地提高阶段变化的检测性能。通过在VisionCVPR2022等市况数据集上的广泛实验，我们展示了SemiCD-VL在提高未标注数据的性能和增强模型对变化的稳健性方面的显著优势。",
    "tldr": "本文提出了一种基于视觉-语言模型的半监督变化检测方法SemiCD-VL，通过合成自由变化标签和自监督机制来利用额外的时序信息，以提高未标注数据的性能。",
    "en_tdlr": "We propose a semi-supervised change detection method, SemiCD-VL, guided by visual-language models, which synthesizes free change labels and utilizes extra temporal information through self-supervised mechanisms to enhance performance on unannotated data."
}