{
    "title": "Dynamic In-context Learning with Conversational Models for Data Extraction and Materials Property Prediction",
    "abstract": "arXiv:2405.10448v2 Announce Type: replace-cross  Abstract: The advent of natural language processing and large language models (LLMs) has revolutionized the extraction of data from unstructured scholarly papers. However, ensuring data trustworthiness remains a significant challenge. In this paper, we introduce PropertyExtractor, an open-source tool that leverages advanced conversational LLMs like Google gemini-pro and OpenAI gpt-4, blends zero-shot with few-shot in-context learning, and employs engineered prompts for the dynamic refinement of structured information hierarchies - enabling autonomous, efficient, scalable, and accurate identification, extraction, and verification of material property data. Our tests on material data demonstrate precision and recall that exceed 95\\% with an error rate of approximately 9%, highlighting the effectiveness and versatility of the toolkit. Finally, databases for 2D material thicknesses, a critical parameter for device integration, and energy ban",
    "link": "https://arxiv.org/abs/2405.10448",
    "context": "Title: Dynamic In-context Learning with Conversational Models for Data Extraction and Materials Property Prediction\nAbstract: arXiv:2405.10448v2 Announce Type: replace-cross  Abstract: The advent of natural language processing and large language models (LLMs) has revolutionized the extraction of data from unstructured scholarly papers. However, ensuring data trustworthiness remains a significant challenge. In this paper, we introduce PropertyExtractor, an open-source tool that leverages advanced conversational LLMs like Google gemini-pro and OpenAI gpt-4, blends zero-shot with few-shot in-context learning, and employs engineered prompts for the dynamic refinement of structured information hierarchies - enabling autonomous, efficient, scalable, and accurate identification, extraction, and verification of material property data. Our tests on material data demonstrate precision and recall that exceed 95\\% with an error rate of approximately 9%, highlighting the effectiveness and versatility of the toolkit. Finally, databases for 2D material thicknesses, a critical parameter for device integration, and energy ban",
    "path": "papers/24/05/2405.10448.json",
    "total_tokens": 635,
    "translated_title": "基于对话模型的新型同情境学习方法，用于数据提取和材料属性预测",
    "translated_abstract": "为了解决科学文献中结构化信息提取的准确性问题，我们提出了一种名为PropertyExtractor的开源工具。该工具利用高级对话型大型语言模型（如Google的gemini-pro和OpenAI的gpt-4），结合零样本和少样本同情境学习，以及旨在动态细化信息层次结构的工程化提示信息，实现材料属性数据的自动、高效、可扩展和准确的识别、提取和验证。对材料数据进行的测试显示，该工具的精确率和召回率超过95%，误差率约为9%，验证了工具的有效性和灵活性。该工具的数据库包括二维材料厚度的关键参数，用于设备集成，以及能量电池材料的电位数据。",
    "tldr": "此工具是一种结合了对话型大型语言模型的开源提取工具，能够高效、准确地从科学文献中提取材料属性数据，已经在二维材料的厚度等关键参数上取得了超过95%的性能。"
}