{
    "title": "DREAM: Combating Concept Drift with Explanatory Detection and Adaptation in Malware Classification",
    "abstract": "arXiv:2405.04095v2 Announce Type: replace-cross  Abstract: Deep learning-based malware classifiers face significant challenges due to concept drift. The rapid evolution of malware, especially with new families, can depress classification accuracy to near-random levels. Previous research has primarily focused on detecting drift samples, relying on expert-led analysis and labeling for model retraining. However, these methods often lack a comprehensive understanding of malware concepts and provide limited guidance for effective drift adaptation, leading to unstable detection performance and high human labeling costs. To address these limitations, we introduce DREAM, a novel system designed to surpass the capabilities of existing drift detectors and to establish an explanatory drift adaptation process. DREAM enhances drift detection through model sensitivity and data autonomy. The detector, trained in a semi-supervised approach, proactively captures malware behavior concepts through classi",
    "link": "https://arxiv.org/abs/2405.04095",
    "context": "Title: DREAM: Combating Concept Drift with Explanatory Detection and Adaptation in Malware Classification\nAbstract: arXiv:2405.04095v2 Announce Type: replace-cross  Abstract: Deep learning-based malware classifiers face significant challenges due to concept drift. The rapid evolution of malware, especially with new families, can depress classification accuracy to near-random levels. Previous research has primarily focused on detecting drift samples, relying on expert-led analysis and labeling for model retraining. However, these methods often lack a comprehensive understanding of malware concepts and provide limited guidance for effective drift adaptation, leading to unstable detection performance and high human labeling costs. To address these limitations, we introduce DREAM, a novel system designed to surpass the capabilities of existing drift detectors and to establish an explanatory drift adaptation process. DREAM enhances drift detection through model sensitivity and data autonomy. The detector, trained in a semi-supervised approach, proactively captures malware behavior concepts through classi",
    "path": "papers/24/05/2405.04095.json",
    "total_tokens": 351,
    "tldr": "该文章介绍了DREAM系统，一个能够超越现有概念漂移检测器并且提供解释性适应过程的新系统。DREAM通过模型敏感性和数据自主性增强漂移检测，通过半监督学习方法训练的检测器能够主动捕捉恶意软件行为概念，并通过类别层次化和概念漂移解释来优化适应过程，从而提高检测性能并降低人类标注成本。"
}