{
    "title": "Particle identification capability of a homogeneous calorimeter composed of oriented crystals",
    "abstract": "arXiv:2405.11302v2 Announce Type: replace  Abstract: Recent studies have shown that the electromagnetic shower induced by a high-energy electron, positron or photon incident along the axis of an oriented crystal develops in a space more compact than the ordinary. On the other hand, the properties of the hadronic interactions are not affected by the lattice structure. This means that, inside an oriented crystal, the natural difference between the hadronic and the electromagnetic shower profile is strongly accentuated. Thus, a calorimeter composed of oriented crystals could be intrinsically capable of identifying more accurately the nature of the incident particles, with respect to a detector composed only of non-aligned crystals. Since no oriented calorimeter has ever been developed, this possibility remains largely unexplored and can be investigated only by mean of numerical simulations. In this work, we report the first quantitative evaluation of the particle identification capability",
    "link": "https://arxiv.org/abs/2405.11302",
    "context": "Title: Particle identification capability of a homogeneous calorimeter composed of oriented crystals\nAbstract: arXiv:2405.11302v2 Announce Type: replace  Abstract: Recent studies have shown that the electromagnetic shower induced by a high-energy electron, positron or photon incident along the axis of an oriented crystal develops in a space more compact than the ordinary. On the other hand, the properties of the hadronic interactions are not affected by the lattice structure. This means that, inside an oriented crystal, the natural difference between the hadronic and the electromagnetic shower profile is strongly accentuated. Thus, a calorimeter composed of oriented crystals could be intrinsically capable of identifying more accurately the nature of the incident particles, with respect to a detector composed only of non-aligned crystals. Since no oriented calorimeter has ever been developed, this possibility remains largely unexplored and can be investigated only by mean of numerical simulations. In this work, we report the first quantitative evaluation of the particle identification capability",
    "path": "papers/24/05/2405.11302.json",
    "total_tokens": 314,
    "tldr": "该文章提出了一种由定向晶体组成的同质计数器，其能够通过电磁相变过程中的差异来更精确地识别粒子的性质，从而定义了高能粒子识别的新边界。"
}