{
    "title": "Deep Reinforcement Learning with Enhanced PPO for Safe Mobile Robot Navigation",
    "abstract": "arXiv:2405.16266v2 Announce Type: replace  Abstract: Collision-free motion is essential for mobile robots. Most approaches to collision-free and efficient navigation with wheeled robots require parameter tuning by experts to obtain good navigation behavior. This study investigates the application of deep reinforcement learning to train a mobile robot for autonomous navigation in a complex environment. The robot utilizes LiDAR sensor data and a deep neural network to generate control signals guiding it toward a specified target while avoiding obstacles. We employ two reinforcement learning algorithms in the Gazebo simulation environment: Deep Deterministic Policy Gradient and proximal policy optimization. The study introduces an enhanced neural network structure in the Proximal Policy Optimization algorithm to boost performance, accompanied by a well-designed reward function to improve algorithm efficacy. Experimental results conducted in both obstacle and obstacle-free environments und",
    "link": "https://arxiv.org/abs/2405.16266",
    "context": "Title: Deep Reinforcement Learning with Enhanced PPO for Safe Mobile Robot Navigation\nAbstract: arXiv:2405.16266v2 Announce Type: replace  Abstract: Collision-free motion is essential for mobile robots. Most approaches to collision-free and efficient navigation with wheeled robots require parameter tuning by experts to obtain good navigation behavior. This study investigates the application of deep reinforcement learning to train a mobile robot for autonomous navigation in a complex environment. The robot utilizes LiDAR sensor data and a deep neural network to generate control signals guiding it toward a specified target while avoiding obstacles. We employ two reinforcement learning algorithms in the Gazebo simulation environment: Deep Deterministic Policy Gradient and proximal policy optimization. The study introduces an enhanced neural network structure in the Proximal Policy Optimization algorithm to boost performance, accompanied by a well-designed reward function to improve algorithm efficacy. Experimental results conducted in both obstacle and obstacle-free environments und",
    "path": "papers/24/05/2405.16266.json",
    "total_tokens": 320,
    "tldr": "该文章利用深度强化学习算法增强的Proximal Policy Optimization方法在模拟环境中训练轮式机器人进行安全导航，通过引入改进的神经网络结构和有效的奖励函数，提升了导航性能，使得机器人能在复杂环境中避开障碍物并高效地到达目标点。"
}