{
    "title": "Uncertainty Quantification of Set-Membership Estimation in Control and Perception: Revisiting the Minimum Enclosing Ellipsoid",
    "abstract": "arXiv:2311.15962v4 Announce Type: replace-cross  Abstract: Set-membership estimation (SME) outputs a set estimator that guarantees to cover the groundtruth. Such sets are, however, defined by (many) abstract (and potentially nonconvex) constraints and therefore difficult to manipulate. We present tractable algorithms to compute simple and tight overapproximations of SME in the form of minimum enclosing ellipsoids (MEE). We first introduce the hierarchy of enclosing ellipsoids proposed by Nie and Demmel (2005), based on sums-of-squares relaxations, that asymptotically converge to the MEE of a basic semialgebraic set. This framework, however, struggles in modern control and perception problems due to computational challenges. We contribute three computational enhancements to make this framework practical, namely constraints pruning, generalized relaxed Chebyshev center, and handling non-Euclidean geometry. We showcase numerical examples on system identification and object pose estimation",
    "link": "https://arxiv.org/abs/2311.15962",
    "context": "Title: Uncertainty Quantification of Set-Membership Estimation in Control and Perception: Revisiting the Minimum Enclosing Ellipsoid\nAbstract: arXiv:2311.15962v4 Announce Type: replace-cross  Abstract: Set-membership estimation (SME) outputs a set estimator that guarantees to cover the groundtruth. Such sets are, however, defined by (many) abstract (and potentially nonconvex) constraints and therefore difficult to manipulate. We present tractable algorithms to compute simple and tight overapproximations of SME in the form of minimum enclosing ellipsoids (MEE). We first introduce the hierarchy of enclosing ellipsoids proposed by Nie and Demmel (2005), based on sums-of-squares relaxations, that asymptotically converge to the MEE of a basic semialgebraic set. This framework, however, struggles in modern control and perception problems due to computational challenges. We contribute three computational enhancements to make this framework practical, namely constraints pruning, generalized relaxed Chebyshev center, and handling non-Euclidean geometry. We showcase numerical examples on system identification and object pose estimation",
    "path": "papers/23/11/2311.15962.json",
    "total_tokens": 711,
    "translated_title": "论文标题：基于凸理论的控制和感知中集合隶属度估计的不确定性量化：重温最小包含椭球",
    "translated_abstract": "",
    "tldr": "本文提出了计算简单且紧致的集合隶属度估计的最小包含椭球近似方法，为现代控制和感知问题的理论研究提供了新的视角。",
    "en_tdlr": "This paper presents algorithms for computing simple, tight overapproximations of set-membership estimation in the form of minimum enclosing ellipsoids, contributing enhancements that make the framework practical for modern control and perception problems through constraint pruning, generalized relaxed Chebyshev center, and handling non-Euclidean geometry."
}