{
    "title": "Collision Avoidance using Iterative Dynamic and Nonlinear Programming with Adaptive Grid Refinements",
    "abstract": "arXiv:2311.03148v3 Announce Type: replace-cross  Abstract: Nonlinear optimal control problems for trajectory planning with obstacle avoidance present several challenges. While general-purpose optimizers and dynamic programming methods struggle when adopted separately, their combination enabled by a penalty approach is capable of handling highly nonlinear systems while overcoming the curse of dimensionality. Nevertheless, using dynamic programming with a fixed state space discretization limits the set of reachable solutions, hindering convergence or requiring enormous memory resources for uniformly spaced grids. In this work we solve this issue by incorporating an adaptive refinement of the state space grid, splitting cells where needed to better capture the problem structure while requiring less discretization points overall. Numerical results on a space manipulator demonstrate the improved robustness and efficiency of the combined method with respect to the single components.",
    "link": "https://arxiv.org/abs/2311.03148",
    "context": "Title: Collision Avoidance using Iterative Dynamic and Nonlinear Programming with Adaptive Grid Refinements\nAbstract: arXiv:2311.03148v3 Announce Type: replace-cross  Abstract: Nonlinear optimal control problems for trajectory planning with obstacle avoidance present several challenges. While general-purpose optimizers and dynamic programming methods struggle when adopted separately, their combination enabled by a penalty approach is capable of handling highly nonlinear systems while overcoming the curse of dimensionality. Nevertheless, using dynamic programming with a fixed state space discretization limits the set of reachable solutions, hindering convergence or requiring enormous memory resources for uniformly spaced grids. In this work we solve this issue by incorporating an adaptive refinement of the state space grid, splitting cells where needed to better capture the problem structure while requiring less discretization points overall. Numerical results on a space manipulator demonstrate the improved robustness and efficiency of the combined method with respect to the single components.",
    "path": "papers/23/11/2311.03148.json",
    "total_tokens": 323,
    "tldr": "该文章创新性地结合了迭代动态规划和自适应网格细化技术，解决了传统优化和动态编程方法的局限性，提出了一个能够在复杂系统中稳定收敛的 obstacle avoidance 方案，特别是通过自适应网格细化优化了状态空间的分布，显著提高了空间操纵器任务规划的效率和鲁棒性。"
}