{
    "title": "Applications of Spiking Neural Networks in Visual Place Recognition",
    "abstract": "arXiv:2311.13186v2 Announce Type: replace-cross  Abstract: In robotics, Spiking Neural Networks (SNNs) are increasingly recognized for their largely-unrealized potential energy efficiency and low latency particularly when implemented on neuromorphic hardware. Our paper highlights three advancements for SNNs in Visual Place Recognition (VPR). Firstly, we propose Modular SNNs, where each SNN represents a set of non-overlapping geographically distinct places, enabling scalable networks for large environments. Secondly, we present Ensembles of Modular SNNs, where multiple networks represent the same place, significantly enhancing accuracy compared to single-network models. Each of our Modular SNN modules is compact, comprising only 1500 neurons and 474k synapses, making them ideally suited for ensembling due to their small size. Lastly, we investigate the role of sequence matching in SNN-based VPR, a technique where consecutive images are used to refine place recognition. We analyze the re",
    "link": "https://arxiv.org/abs/2311.13186",
    "context": "Title: Applications of Spiking Neural Networks in Visual Place Recognition\nAbstract: arXiv:2311.13186v2 Announce Type: replace-cross  Abstract: In robotics, Spiking Neural Networks (SNNs) are increasingly recognized for their largely-unrealized potential energy efficiency and low latency particularly when implemented on neuromorphic hardware. Our paper highlights three advancements for SNNs in Visual Place Recognition (VPR). Firstly, we propose Modular SNNs, where each SNN represents a set of non-overlapping geographically distinct places, enabling scalable networks for large environments. Secondly, we present Ensembles of Modular SNNs, where multiple networks represent the same place, significantly enhancing accuracy compared to single-network models. Each of our Modular SNN modules is compact, comprising only 1500 neurons and 474k synapses, making them ideally suited for ensembling due to their small size. Lastly, we investigate the role of sequence matching in SNN-based VPR, a technique where consecutive images are used to refine place recognition. We analyze the re",
    "path": "papers/23/11/2311.13186.json",
    "total_tokens": 783,
    "translated_title": "《脉冲神经网络在视觉位置识别中的应用》",
    "translated_abstract": "arXiv:2311.13186v2 公告类型：替换交叉 摘要：在机器人学中，脉冲神经网络（SNNs）因其在大大未实现的潜力能源效率和低延迟，特别是在用于神经形态硬件时，获得了越来越多的认可。我们的论文强调了SNNs在视觉位置识别（VPR）方面的三项先进技术。首先，我们提出了《模块化脉冲神经网络》，其中每个SNN代表一组不重叠的地理不同地点，使网络在大型环境中可扩展。其次，我们提出了《模块化脉冲神经网络的集合》，其中多个网络代表同一地点，与单一网络模型的精度相比，准确性显著提高。我们的模块化SNN模块非常紧凑，仅包含1500个神经元和474k个突触，使其因为它们的体积小而非常适合组群。最后，我们研究了SNN基础VPR中序列匹配的作用，一种技术，使用连续图像来细化位置识别。我们分析了重复使用同一个SNN模块的能力，并设计了一种高效的权重更新策略，从而显著提高了输出的位置识别精度。通过这项研究，我们提出了一种新的框架，基于模块化SNN的集合和序列匹配，它可以在机器人视觉系统中实现高精度和低功率的视觉位置识别。",
    "tldr": "我们的研究提出了模块化脉冲神经网络在视觉位置识别中的应用，包括紧凑的SNN模块、多个代表相同地点的SNN组合，以及对连续图像序列匹配技术的研究，这些技术为机器人视觉系统的精确和低功率视觉位置识别提供了新的框架。"
}