{
    "title": "Infusion: internal diffusion for inpainting of dynamic textures and complex motion",
    "abstract": "arXiv:2311.01090v2 Announce Type: replace  Abstract: Video inpainting is the task of filling a region in a video in a visually convincing manner. It is very challenging due to the high dimensionality of the data and the temporal consistency required for obtaining convincing results. Recently, diffusion models have shown impressive results in modeling complex data distributions, including images and videos. Such models remain nonetheless very expensive to train and to perform inference with, which strongly reduce their applicability to videos, and yields unreasonable computational loads. We show that in the case of video inpainting, thanks to the highly auto-similar nature of videos, the training data of a diffusion model can be restricted to the input video and still produce very satisfying results. This leads us to adopt an internal learning approach, which also allows us to greatly reduce the neural network size by about three orders of magnitude less than current diffusion models us",
    "link": "https://arxiv.org/abs/2311.01090",
    "context": "Title: Infusion: internal diffusion for inpainting of dynamic textures and complex motion\nAbstract: arXiv:2311.01090v2 Announce Type: replace  Abstract: Video inpainting is the task of filling a region in a video in a visually convincing manner. It is very challenging due to the high dimensionality of the data and the temporal consistency required for obtaining convincing results. Recently, diffusion models have shown impressive results in modeling complex data distributions, including images and videos. Such models remain nonetheless very expensive to train and to perform inference with, which strongly reduce their applicability to videos, and yields unreasonable computational loads. We show that in the case of video inpainting, thanks to the highly auto-similar nature of videos, the training data of a diffusion model can be restricted to the input video and still produce very satisfying results. This leads us to adopt an internal learning approach, which also allows us to greatly reduce the neural network size by about three orders of magnitude less than current diffusion models us",
    "path": "papers/23/11/2311.01090.json",
    "total_tokens": 332,
    "tldr": "该文章提出了一种新的视频内容填充方法\"Infusion\"，该方法使用内部扩散技术来处理动态纹理和复杂运动，通过限制扩散模型的训练数据仅使用输入视频，显著减少了模型的训练和推理成本，从而提高了视频内容填充的效率和质量。"
}