{
    "title": "A Cross Attention Approach to Diagnostic Explainability using Clinical Practice Guidelines for Depression",
    "abstract": "arXiv:2311.13852v3 Announce Type: replace  Abstract: The lack of explainability using relevant clinical knowledge hinders the adoption of Artificial Intelligence-powered analysis of unstructured clinical dialogue. A wealth of relevant, untapped Mental Health (MH) data is available in online communities, providing the opportunity to address the explainability problem with substantial potential impact as a screening tool for both online and offline applications. We develop a method to enhance attention in popular transformer models and generate clinician-understandable explanations for classification by incorporating external clinical knowledge. Inspired by how clinicians rely on their expertise when interacting with patients, we leverage relevant clinical knowledge to model patient inputs, providing meaningful explanations for classification. This will save manual review time and engender trust. We develop such a system in the context of MH using clinical practice guidelines (CPG) for d",
    "link": "https://arxiv.org/abs/2311.13852",
    "context": "Title: A Cross Attention Approach to Diagnostic Explainability using Clinical Practice Guidelines for Depression\nAbstract: arXiv:2311.13852v3 Announce Type: replace  Abstract: The lack of explainability using relevant clinical knowledge hinders the adoption of Artificial Intelligence-powered analysis of unstructured clinical dialogue. A wealth of relevant, untapped Mental Health (MH) data is available in online communities, providing the opportunity to address the explainability problem with substantial potential impact as a screening tool for both online and offline applications. We develop a method to enhance attention in popular transformer models and generate clinician-understandable explanations for classification by incorporating external clinical knowledge. Inspired by how clinicians rely on their expertise when interacting with patients, we leverage relevant clinical knowledge to model patient inputs, providing meaningful explanations for classification. This will save manual review time and engender trust. We develop such a system in the context of MH using clinical practice guidelines (CPG) for d",
    "path": "papers/23/11/2311.13852.json",
    "total_tokens": 305,
    "tldr": "该文章提出了一种基于交叉注意力机制的跨领域文本生成方法，能够利用临床实践指南提高抑郁症诊断的解释能力，为抑郁症患者的临床对话提供了更具解释性的分析结果。"
}