{
    "title": "The Importance of Downstream Networks in Digital Pathology Foundation Models",
    "abstract": "arXiv:2311.17804v3 Announce Type: replace  Abstract: Digital pathology has significantly advanced disease detection and pathologist efficiency through the analysis of gigapixel whole-slide images (WSI). In this process, WSIs are first divided into patches, for which a feature extractor model is applied to obtain feature vectors, which are subsequently processed by an aggregation model to predict the respective WSI label. With the rapid evolution of representation learning, numerous new feature extractor models, often termed foundational models, have emerged. Traditional evaluation methods rely on a static downstream aggregation model setup, encompassing a fixed architecture and hyperparameters, a practice we identify as potentially biasing the results. Our study uncovers a sensitivity of feature extractor models towards aggregation model configurations, indicating that performance comparability can be skewed based on the chosen configurations. By accounting for this sensitivity, we fin",
    "link": "https://arxiv.org/abs/2311.17804",
    "context": "Title: The Importance of Downstream Networks in Digital Pathology Foundation Models\nAbstract: arXiv:2311.17804v3 Announce Type: replace  Abstract: Digital pathology has significantly advanced disease detection and pathologist efficiency through the analysis of gigapixel whole-slide images (WSI). In this process, WSIs are first divided into patches, for which a feature extractor model is applied to obtain feature vectors, which are subsequently processed by an aggregation model to predict the respective WSI label. With the rapid evolution of representation learning, numerous new feature extractor models, often termed foundational models, have emerged. Traditional evaluation methods rely on a static downstream aggregation model setup, encompassing a fixed architecture and hyperparameters, a practice we identify as potentially biasing the results. Our study uncovers a sensitivity of feature extractor models towards aggregation model configurations, indicating that performance comparability can be skewed based on the chosen configurations. By accounting for this sensitivity, we fin",
    "path": "papers/23/11/2311.17804.json",
    "total_tokens": 644,
    "translated_title": "下游网络在数字病理学基础模型中的重要性",
    "translated_abstract": "arXiv:2311.17804v3 宣布类型：替换摘要：数字病理学通过分析 gigapixel 整个切片图像（WSI）显著提高了疾病检测和病理医生的效率。在这个过程中，WSI首先被分成若干小块，应用一个特征提取器模型来获得特征向量，然后将这些向量传递给一个聚合模型，用于预测相应的 WSI 标签。随着表示学习技术的快速发展，出现了许多新的特征提取器模型，这些模型通常被称为基础模型。我们的研究揭示了特征提取器对聚合模型配置的敏感性，表明基于选择的配置可能会偏颇性能的可比性。通过考虑这种敏感性，我们可以结束对特征提取器模型选择的无视，并加深对聚合模型配置对模型性能影响的感受，最终达成对数字病理学基础模型更全面的理解。",
    "tldr": "本文研究揭示了特征提取器对下游网络聚合模型配置的敏感性，指出传统的特征提取器模型评估可能无法准确反映其性能，并强调了在选择基础模型时需对聚合模型的影响予以考虑。"
}