{
    "title": "De-fine: Decomposing and Refining Visual Programs with Auto-Feedback",
    "abstract": "arXiv:2311.12890v3 Announce Type: replace  Abstract: Visual programming, a modular and generalizable paradigm, integrates different modules and Python operators to solve various vision-language tasks. Unlike end-to-end models that need task-specific data, it advances in performing visual processing and reasoning in an unsupervised manner. Current visual programming methods generate programs in a single pass for each task where the ability to evaluate and optimize based on feedback, unfortunately, is lacking, which consequentially limits their effectiveness for complex, multi-step problems. Drawing inspiration from benders decomposition, we introduce De-fine, a training-free framework that automatically decomposes complex tasks into simpler subtasks and refines programs through auto-feedback. This model-agnostic approach can improve logical reasoning performance by integrating the strengths of multiple models. Our experiments across various visual tasks show that De-fine creates more ro",
    "link": "https://arxiv.org/abs/2311.12890",
    "context": "Title: De-fine: Decomposing and Refining Visual Programs with Auto-Feedback\nAbstract: arXiv:2311.12890v3 Announce Type: replace  Abstract: Visual programming, a modular and generalizable paradigm, integrates different modules and Python operators to solve various vision-language tasks. Unlike end-to-end models that need task-specific data, it advances in performing visual processing and reasoning in an unsupervised manner. Current visual programming methods generate programs in a single pass for each task where the ability to evaluate and optimize based on feedback, unfortunately, is lacking, which consequentially limits their effectiveness for complex, multi-step problems. Drawing inspiration from benders decomposition, we introduce De-fine, a training-free framework that automatically decomposes complex tasks into simpler subtasks and refines programs through auto-feedback. This model-agnostic approach can improve logical reasoning performance by integrating the strengths of multiple models. Our experiments across various visual tasks show that De-fine creates more ro",
    "path": "papers/23/11/2311.12890.json",
    "total_tokens": 829,
    "translated_title": "分解与细化视觉程序的自动反馈",
    "translated_abstract": "arXiv:2311.12890v3 公告类型：替换 摘要：视觉程序设计是一种模块化和可泛化的设计范式，它将不同的模块和Python运算符集成在一起，以解决各种视觉-语言任务。与需要特定任务数据的端到端模型不同，它在无监督的情况下取得了进步，能够进行视觉处理和推理。目前，视觉程序设计的方法为每个任务生成程序，一次性通过，遗憾的是，缺乏根据反馈评估和优化程序的能力，这最终限制了它们在处理复杂、多步问题时的有效性。受到Benders解聚灵感的启发，我们提出了一种名为“Define”的训练免费框架，它可以通过自动解聚复杂任务为简单的子任务，并通过自动反馈来细化程序。这个模型无关的方法可以通过整合多个模型的优势来改进逻辑推理性能。我们在各种视觉任务上的实验表明，Define创建了更多具有逻辑推理性能的程序片段，从而实现了更好的错误恢复和决策过程。原文：Visual programming, a modular and generalizable paradigm, integrates different modules and Python operators to solve various vision-language tasks. Unlike end-to-end models that need task-specific data, it advances in performing visual processing and reasoning in an unsupervised manner. Current visual programming methods generate programs in a single pass for each task where the ability to evaluate and optimize based on feedback, unfortunately, is lacking, which consequentially limits their effectiveness for complex, multi-step problems. Drawing inspiration from benders decomposition, we introduce De-fine, a training-free framework that automatically decomposes complex tasks into simpler subtasks and refines programs through auto-feedback. This model-agnostic approach can improve logical reasoning performance by integrating the strengths of multiple models. Our experiments across various visual tasks show that De-fine creates more robust program fragments with better error recovery and decision-making processes.",
    "tldr": "本研究提出了一种无需训练的框架“De-fine”，它能够自动分解复杂任务为简单子任务，并通过自动反馈来改进程序，显著提高了逻辑推理性能。en_tdlr:Our study introduces a training-free framework \"De-fine\" that automatically decomposes complex tasks into simpler subtasks and refines programs with auto-feedback, significantly improving logical reasoning performance."
}