{
    "title": "From Concept to Manufacturing: Evaluating Vision-Language Models for Engineering Design",
    "abstract": "arXiv:2311.12668v2 Announce Type: replace  Abstract: Engineering design is undergoing a transformative shift with the advent of AI, marking a new era in how we approach product, system, and service planning. Large language models have demonstrated impressive capabilities in enabling this shift. Yet, with text as their only input modality, they cannot leverage the large body of visual artifacts that engineers have used for centuries and are accustomed to. This gap is addressed with the release of multimodal vision-language models (VLMs), such as GPT-4V, enabling AI to impact many more types of tasks. Our work presents a comprehensive evaluation of VLMs across a spectrum of engineering design tasks, categorized into four main areas: Conceptual Design, System-Level and Detailed Design, Manufacturing and Inspection, and Engineering Education Tasks. Specifically in this paper, we assess the capabilities of two VLMs, GPT-4V and LLaVA 1.6 34B, in design tasks such as sketch similarity analysi",
    "link": "https://arxiv.org/abs/2311.12668",
    "context": "Title: From Concept to Manufacturing: Evaluating Vision-Language Models for Engineering Design\nAbstract: arXiv:2311.12668v2 Announce Type: replace  Abstract: Engineering design is undergoing a transformative shift with the advent of AI, marking a new era in how we approach product, system, and service planning. Large language models have demonstrated impressive capabilities in enabling this shift. Yet, with text as their only input modality, they cannot leverage the large body of visual artifacts that engineers have used for centuries and are accustomed to. This gap is addressed with the release of multimodal vision-language models (VLMs), such as GPT-4V, enabling AI to impact many more types of tasks. Our work presents a comprehensive evaluation of VLMs across a spectrum of engineering design tasks, categorized into four main areas: Conceptual Design, System-Level and Detailed Design, Manufacturing and Inspection, and Engineering Education Tasks. Specifically in this paper, we assess the capabilities of two VLMs, GPT-4V and LLaVA 1.6 34B, in design tasks such as sketch similarity analysi",
    "path": "papers/23/11/2311.12668.json",
    "total_tokens": 364,
    "tldr": "该文章评估了两款标志性的大型语言模型（LLaMAs）在工程设计领域中的应用，它们能够处理文本和视觉数据，为设计任务提供了新的解决方案，尤其是在概念设计、系统级和详细设计、生产制造以及工程教育任务方面取得了显著成果。"
}