{
    "title": "APARATE: Adaptive Adversarial Patch for CNN-based Monocular Depth Estimation for Autonomous Navigation",
    "abstract": "arXiv:2303.01351v3 Announce Type: replace-cross  Abstract: In recent times, monocular depth estimation (MDE) has experienced significant advancements in performance, largely attributed to the integration of innovative architectures, i.e., convolutional neural networks (CNNs) and Transformers. Nevertheless, the susceptibility of these models to adversarial attacks has emerged as a noteworthy concern, especially in domains where safety and security are paramount. This concern holds particular weight for MDE due to its critical role in applications like autonomous driving and robotic navigation, where accurate scene understanding is pivotal. To assess the vulnerability of CNN-based depth prediction methods, recent work tries to design adversarial patches against MDE. However, the existing approaches fall short of inducing a comprehensive and substantially disruptive impact on the vision system. Instead, their influence is partial and confined to specific local areas. These methods lead to",
    "link": "https://arxiv.org/abs/2303.01351",
    "context": "Title: APARATE: Adaptive Adversarial Patch for CNN-based Monocular Depth Estimation for Autonomous Navigation\nAbstract: arXiv:2303.01351v3 Announce Type: replace-cross  Abstract: In recent times, monocular depth estimation (MDE) has experienced significant advancements in performance, largely attributed to the integration of innovative architectures, i.e., convolutional neural networks (CNNs) and Transformers. Nevertheless, the susceptibility of these models to adversarial attacks has emerged as a noteworthy concern, especially in domains where safety and security are paramount. This concern holds particular weight for MDE due to its critical role in applications like autonomous driving and robotic navigation, where accurate scene understanding is pivotal. To assess the vulnerability of CNN-based depth prediction methods, recent work tries to design adversarial patches against MDE. However, the existing approaches fall short of inducing a comprehensive and substantially disruptive impact on the vision system. Instead, their influence is partial and confined to specific local areas. These methods lead to",
    "path": "papers/23/03/2303.01351.json",
    "total_tokens": 356,
    "tldr": "该文章提出了一种名为APARATE的鲁棒性增强策略，通过设计一个自适应对抗性补丁来改进CNN（卷积神经网络）在单目深度估计（MDE）中的缺陷，尤其在自动驾驶和机器人导航等安全敏感领域。这种方法能够显著提高深度估计模型的鲁棒性，使得其在面临对抗性攻击时能够保持较高的准确性。"
}