{
    "title": "Synthetic-to-Real Domain Adaptation for Action Recognition: A Dataset and Baseline Performances",
    "abstract": "arXiv:2303.10280v2 Announce Type: replace  Abstract: Human action recognition is a challenging problem, particularly when there is high variability in factors such as subject appearance, backgrounds and viewpoint. While deep neural networks (DNNs) have been shown to perform well on action recognition tasks, they typically require large amounts of high-quality labeled data to achieve robust performance across a variety of conditions. Synthetic data has shown promise as a way to avoid the substantial costs and potential ethical concerns associated with collecting and labeling enormous amounts of data in the real-world. However, synthetic data may differ from real data in important ways. This phenomenon, known as \\textit{domain shift}, can limit the utility of synthetic data in robotics applications. To mitigate the effects of domain shift, substantial effort is being dedicated to the development of domain adaptation (DA) techniques. Yet, much remains to be understood about how best to de",
    "link": "https://arxiv.org/abs/2303.10280",
    "context": "Title: Synthetic-to-Real Domain Adaptation for Action Recognition: A Dataset and Baseline Performances\nAbstract: arXiv:2303.10280v2 Announce Type: replace  Abstract: Human action recognition is a challenging problem, particularly when there is high variability in factors such as subject appearance, backgrounds and viewpoint. While deep neural networks (DNNs) have been shown to perform well on action recognition tasks, they typically require large amounts of high-quality labeled data to achieve robust performance across a variety of conditions. Synthetic data has shown promise as a way to avoid the substantial costs and potential ethical concerns associated with collecting and labeling enormous amounts of data in the real-world. However, synthetic data may differ from real data in important ways. This phenomenon, known as \\textit{domain shift}, can limit the utility of synthetic data in robotics applications. To mitigate the effects of domain shift, substantial effort is being dedicated to the development of domain adaptation (DA) techniques. Yet, much remains to be understood about how best to de",
    "path": "papers/23/03/2303.10280.json",
    "total_tokens": 720,
    "translated_title": "真实世界与合成数据域适应对动作识别的影响：数据集和基线表现",
    "translated_abstract": "arXiv:2303.10280v2 公告类型：替换 摘要：人类动作识别是一个具有挑战性的问题，特别是由于诸如外观、背景和视角这类因素所带来的高度可变性。虽然深度神经网络（DNNs）已经被证明在动作识别任务中表现良好，但它们通常需要大量的高质量标签数据，以便在不同条件下实现稳健性能。合成数据显示出作为避免在现实世界中收集和大量标签数据巨大成本和潜在伦理问题的潜在解决方案。然而，合成数据在重要方面可能与现实数据存在差异。这种现象，被称为“领域偏移”，可能限制在机器人应用中使用合成数据的效用。为了减轻领域偏移的影响，大量努力正在致力于开发域适应（DA）技术。然而，在如何最佳地适应领域方面还有很多未解决的问题。如何充分利用合成数据来改善大型实脸动作数据库的表现，是研究的一个重要方向之一。在这个背景下，该研究介绍了第一个专门用于合成数据与真实数据域适应的公开数据集，提出了适用于不同数据域的基线模型，并评估了这些模型在不同数据合成和任务上的表现。通过实验验证了域适应方法和技术的潜力，展示了合成数据能够提高动作识别系统的表现，并促进更稳健的动作识别算法的发展。",
    "tldr": "该研究介绍了一个用于合成数据与真实数据域适应的公开数据集，并评估了各种模型在不同任务上的表现。",
    "en_tdlr": "This study presents an open dataset for domain adaptation between synthetic and real data, evaluates various models across different tasks, and explores the potential of domain adaptation methods to improve action recognition systems."
}