{
    "title": "Fast and Accurate Object Detection on Asymmetrical Receptive Field",
    "abstract": "arXiv:2303.08995v2 Announce Type: replace  Abstract: Object detection has been used in a wide range of industries. For example, in autonomous driving, the task of object detection is to accurately and efficiently identify and locate a large number of predefined classes of object instances (vehicles, pedestrians, traffic signs, etc.) from videos of roads. In robotics, the industry robot needs to recognize specific machine elements. In the security field, the camera should accurately recognize each face of people. With the wide application of deep learning, the accuracy and efficiency of object detection have been greatly improved, but object detection based on deep learning still faces challenges. Different applications of object detection have different requirements, including highly accurate detection, multi-category object detection, real-time detection, robustness to occlusions, etc. To address the above challenges, based on extensive literature research, this paper analyzes methods",
    "link": "https://arxiv.org/abs/2303.08995",
    "context": "Title: Fast and Accurate Object Detection on Asymmetrical Receptive Field\nAbstract: arXiv:2303.08995v2 Announce Type: replace  Abstract: Object detection has been used in a wide range of industries. For example, in autonomous driving, the task of object detection is to accurately and efficiently identify and locate a large number of predefined classes of object instances (vehicles, pedestrians, traffic signs, etc.) from videos of roads. In robotics, the industry robot needs to recognize specific machine elements. In the security field, the camera should accurately recognize each face of people. With the wide application of deep learning, the accuracy and efficiency of object detection have been greatly improved, but object detection based on deep learning still faces challenges. Different applications of object detection have different requirements, including highly accurate detection, multi-category object detection, real-time detection, robustness to occlusions, etc. To address the above challenges, based on extensive literature research, this paper analyzes methods",
    "path": "papers/23/03/2303.08995.json",
    "total_tokens": 318,
    "tldr": "该文章分析了基于深度学习的对象检测技术，并探讨了如何通过采用不对称感受野来提高对象检测的速度和准确性，还考虑了不同应用场景下的具体要求，提供了对现有技术的优化方案。"
}