{
    "title": "RCA: Region Conditioned Adaptation for Visual Abductive Reasoning",
    "abstract": "arXiv:2303.10428v5 Announce Type: replace  Abstract: Visual abductive reasoning aims to make likely explanations for visual observations. We propose a simple yet effective Region Conditioned Adaptation, a hybrid parameter-efficient fine-tuning method that equips the frozen CLIP with the ability to infer explanations from local visual cues. We encode ``local hints'' and ``global contexts'' into visual prompts of the CLIP model separately at fine and coarse-grained levels. Adapters are used for fine-tuning CLIP models for downstream tasks and we design a new attention adapter, that directly steers the focus of the attention map with trainable query and key projections of a frozen CLIP model. Finally, we train our new model with a modified contrastive loss to regress the visual feature simultaneously toward features of literal description and plausible explanations. The loss enables CLIP to maintain both perception and reasoning abilities. Experiments on the Sherlock visual abductive reas",
    "link": "https://arxiv.org/abs/2303.10428",
    "context": "Title: RCA: Region Conditioned Adaptation for Visual Abductive Reasoning\nAbstract: arXiv:2303.10428v5 Announce Type: replace  Abstract: Visual abductive reasoning aims to make likely explanations for visual observations. We propose a simple yet effective Region Conditioned Adaptation, a hybrid parameter-efficient fine-tuning method that equips the frozen CLIP with the ability to infer explanations from local visual cues. We encode ``local hints'' and ``global contexts'' into visual prompts of the CLIP model separately at fine and coarse-grained levels. Adapters are used for fine-tuning CLIP models for downstream tasks and we design a new attention adapter, that directly steers the focus of the attention map with trainable query and key projections of a frozen CLIP model. Finally, we train our new model with a modified contrastive loss to regress the visual feature simultaneously toward features of literal description and plausible explanations. The loss enables CLIP to maintain both perception and reasoning abilities. Experiments on the Sherlock visual abductive reas",
    "path": "papers/23/03/2303.10428.json",
    "total_tokens": 456,
    "tldr": "该文章提出了一种名为RCA（Region Conditioned Adaptation）的方法，该方法对视觉观察进行推理以做出可能性的解释。RCA是一种简单的、有效的区域条件适应方法，它为冻结的CLIP模型提供了解码器，使得模型能够根据局部视觉提示进行推理。通过在精细和粗粒度级别上分别编码“局部提示”和“全局上下文”，该模型训练了一个新的注意力适配器，该适配器直接通过训练可调用的查询和键投影来引导注意力图的焦点。最后，通过修改的对比损失，该模型同时将视觉特征回归到描述符和可信解释的特征上，从而保持了CLIP的感知和推理能力。实验在Sherlock视觉关联推理任务上验证了该方法的有效性。"
}