{
    "title": "Color Mismatches in Stereoscopic Video: Real-World Dataset and Deep Correction Method",
    "abstract": "arXiv:2303.06657v3 Announce Type: replace  Abstract: Stereoscopic videos can contain color mismatches between the left and right views due to minor variations in camera settings, lenses, and even object reflections captured from different positions. The presence of color mismatches can lead to viewer discomfort and headaches. This problem can be solved by transferring color between stereoscopic views, but traditional methods often lack quality, while neural-network-based methods can easily overfit on artificial data. The scarcity of stereoscopic videos with real-world color mismatches hinders the evaluation of different methods' performance. Therefore, we filmed a video dataset, which includes both distorted frames with color mismatches and ground-truth data, using a beam-splitter. Our second contribution is a deep multiscale neural network that solves the color-mismatch-correction task by leveraging stereo correspondences. The experimental results demonstrate the effectiveness of the ",
    "link": "https://arxiv.org/abs/2303.06657",
    "context": "Title: Color Mismatches in Stereoscopic Video: Real-World Dataset and Deep Correction Method\nAbstract: arXiv:2303.06657v3 Announce Type: replace  Abstract: Stereoscopic videos can contain color mismatches between the left and right views due to minor variations in camera settings, lenses, and even object reflections captured from different positions. The presence of color mismatches can lead to viewer discomfort and headaches. This problem can be solved by transferring color between stereoscopic views, but traditional methods often lack quality, while neural-network-based methods can easily overfit on artificial data. The scarcity of stereoscopic videos with real-world color mismatches hinders the evaluation of different methods' performance. Therefore, we filmed a video dataset, which includes both distorted frames with color mismatches and ground-truth data, using a beam-splitter. Our second contribution is a deep multiscale neural network that solves the color-mismatch-correction task by leveraging stereo correspondences. The experimental results demonstrate the effectiveness of the ",
    "path": "papers/23/03/2303.06657.json",
    "total_tokens": 328,
    "tldr": "该文章构建了一个含有真实色彩失真数据的立体视频数据库，并提出了一种基于深度学习的算法，能够高质量地纠正立体视视频中的色彩失真问题，提升了用户观看体验。"
}