{
    "title": "A study on general visual categorization of objects into animal and plant groups using global shape descriptors with a focus on category-specific deficits",
    "abstract": "arXiv:1901.11398v3 Announce Type: replace  Abstract: How do humans distinguish between general categories of objects? In a number of semantic category deficits, patients are good at making broad categorization but are unable to remember fine and specific details. It has been well accepted that general information about concepts is more robust to damages related to semantic memory. Results from patients with semantic memory disorders demonstrate the loss of ability in subcategory recognition. In this paper, we review the behavioral evidence for category specific disorder and show that general categories of animal and plant are visually distinguishable without processing textural information. To this aim, we utilize shape descriptors with an additional phase of feature learning. The results are evaluated with both supervised and unsupervised learning mechanisms and confirm that the proposed method can effectively discriminates between animal and plant object categories in visual domain.",
    "link": "https://arxiv.org/abs/1901.11398",
    "context": "Title: A study on general visual categorization of objects into animal and plant groups using global shape descriptors with a focus on category-specific deficits\nAbstract: arXiv:1901.11398v3 Announce Type: replace  Abstract: How do humans distinguish between general categories of objects? In a number of semantic category deficits, patients are good at making broad categorization but are unable to remember fine and specific details. It has been well accepted that general information about concepts is more robust to damages related to semantic memory. Results from patients with semantic memory disorders demonstrate the loss of ability in subcategory recognition. In this paper, we review the behavioral evidence for category specific disorder and show that general categories of animal and plant are visually distinguishable without processing textural information. To this aim, we utilize shape descriptors with an additional phase of feature learning. The results are evaluated with both supervised and unsupervised learning mechanisms and confirm that the proposed method can effectively discriminates between animal and plant object categories in visual domain.",
    "path": "papers/19/01/1901.11398.json",
    "total_tokens": 408,
    "tldr": "该文章研究了使用全局形状描述符对物体进行视觉分类，区分动物和植物两类的一般方法，并重点讨论了特定类别缺陷的问题。通过行为证据，文章展示了在语义类别缺陷中，患者在做出广泛的分类时是有效的，但在记住详细信息方面存在困难。文章表明，对于概念的一般信息存储是更不易受到语义记忆损害影响的。文章还展示了患者在子类别识别方面的能力丧失。为了探索这个问题，文章利用了形状描述符和特征学习的一个额外阶段。通过监督学习和无监督学习机制的评价结果表明，所提出的方法能够在视觉领域有效地区分动物和植物对象类别。"
}