{
    "title": "Offline Imitation of Badminton Player Behavior via Experiential Contexts and Brownian Motion",
    "abstract": "arXiv:2403.12406v2 Announce Type: replace  Abstract: In the dynamic and rapid tactic involvements of turn-based sports, badminton stands out as an intrinsic paradigm that requires alter-dependent decision-making of players. While the advancement of learning from offline expert data in sequential decision-making has been witnessed in various domains, how to rally-wise imitate the behaviors of human players from offline badminton matches has remained underexplored. Replicating opponents' behavior benefits players by allowing them to undergo strategic development with direction before matches. However, directly applying existing methods suffers from the inherent hierarchy of the match and the compounding effect due to the turn-based nature of players alternatively taking actions. In this paper, we propose RallyNet, a novel hierarchical offline imitation learning model for badminton player behaviors: (i) RallyNet captures players' decision dependencies by modeling decision-making processes",
    "link": "https://arxiv.org/abs/2403.12406",
    "context": "Title: Offline Imitation of Badminton Player Behavior via Experiential Contexts and Brownian Motion\nAbstract: arXiv:2403.12406v2 Announce Type: replace  Abstract: In the dynamic and rapid tactic involvements of turn-based sports, badminton stands out as an intrinsic paradigm that requires alter-dependent decision-making of players. While the advancement of learning from offline expert data in sequential decision-making has been witnessed in various domains, how to rally-wise imitate the behaviors of human players from offline badminton matches has remained underexplored. Replicating opponents' behavior benefits players by allowing them to undergo strategic development with direction before matches. However, directly applying existing methods suffers from the inherent hierarchy of the match and the compounding effect due to the turn-based nature of players alternatively taking actions. In this paper, we propose RallyNet, a novel hierarchical offline imitation learning model for badminton player behaviors: (i) RallyNet captures players' decision dependencies by modeling decision-making processes",
    "path": "papers/24/03/2403.12406.json",
    "total_tokens": 355,
    "tldr": "该文章提出了一种名为RallyNet的模型，用于从离线视频中模仿人类球员的行为，特别是针对羽毛球这种交替行动的体育比赛。该模型通过考虑决策的层次结构和比赛的对称性，能够在不直接交互的情况下，通过分析球员的实际行为来提升策略，从而为训练提供宝贵的实践机会。"
}