{
    "title": "A Picture Is Worth a Graph: A Blueprint Debate Paradigm for Multimodal Reasoning",
    "abstract": "arXiv:2403.14972v2 Announce Type: replace  Abstract: This paper presents a pilot study aimed at introducing multi-agent debate into multimodal reasoning. The study addresses two key challenges: the trivialization of opinions resulting from excessive summarization and the diversion of focus caused by distractor concepts introduced from images. These challenges stem from the inductive (bottom-up) nature of existing debating schemes. To address the issue, we propose a deductive (top-down) debating approach called Blueprint Debate on Graphs (BDoG). In BDoG, debates are confined to a blueprint graph to prevent opinion trivialization through world-level summarization. Moreover, by storing evidence in branches within the graph, BDoG mitigates distractions caused by frequent but irrelevant concepts. Extensive experiments validate that BDoG is able to achieve state-of-the-art results in ScienceQA and MMBench with significant improvements over previous methods. The source code can be accessed at",
    "link": "https://arxiv.org/abs/2403.14972",
    "context": "Title: A Picture Is Worth a Graph: A Blueprint Debate Paradigm for Multimodal Reasoning\nAbstract: arXiv:2403.14972v2 Announce Type: replace  Abstract: This paper presents a pilot study aimed at introducing multi-agent debate into multimodal reasoning. The study addresses two key challenges: the trivialization of opinions resulting from excessive summarization and the diversion of focus caused by distractor concepts introduced from images. These challenges stem from the inductive (bottom-up) nature of existing debating schemes. To address the issue, we propose a deductive (top-down) debating approach called Blueprint Debate on Graphs (BDoG). In BDoG, debates are confined to a blueprint graph to prevent opinion trivialization through world-level summarization. Moreover, by storing evidence in branches within the graph, BDoG mitigates distractions caused by frequent but irrelevant concepts. Extensive experiments validate that BDoG is able to achieve state-of-the-art results in ScienceQA and MMBench with significant improvements over previous methods. The source code can be accessed at",
    "path": "papers/24/03/2403.14972.json",
    "total_tokens": 407,
    "tldr": "该文章提出了一种基于蓝图图的辩论范式（BDoG），旨在解决多模态推理中的意见简化问题和图像引入的注意力分散问题。BDoG通过将辩论限制在蓝图图中来防止通过世界级总结导致的观点简化，并通过在图分支中存储证据来减少频繁但无关概念的干扰。实验结果表明，与其他方法相比，BDoG在ScienceQA和MMBench上取得了显著的改进，验证了其在多模态推理中的有效性。"
}