{
    "title": "A multi-criteria approach for selecting an explanation from the set of counterfactuals produced by an ensemble of explainers",
    "abstract": "arXiv:2403.13940v2 Announce Type: replace-cross  Abstract: Counterfactuals are widely used to explain ML model predictions by providing alternative scenarios for obtaining the more desired predictions. They can be generated by a variety of methods that optimize different, sometimes conflicting, quality measures and produce quite different solutions. However, choosing the most appropriate explanation method and one of the generated counterfactuals is not an easy task. Instead of forcing the user to test many different explanation methods and analysing conflicting solutions, in this paper, we propose to use a multi-stage ensemble approach that will select single counterfactual based on the multiple-criteria analysis. It offers a compromise solution that scores well on several popular quality measures. This approach exploits the dominance relation and the ideal point decision aid method, which selects one counterfactual from the Pareto front. The conducted experiments demonstrated that th",
    "link": "https://arxiv.org/abs/2403.13940",
    "context": "Title: A multi-criteria approach for selecting an explanation from the set of counterfactuals produced by an ensemble of explainers\nAbstract: arXiv:2403.13940v2 Announce Type: replace-cross  Abstract: Counterfactuals are widely used to explain ML model predictions by providing alternative scenarios for obtaining the more desired predictions. They can be generated by a variety of methods that optimize different, sometimes conflicting, quality measures and produce quite different solutions. However, choosing the most appropriate explanation method and one of the generated counterfactuals is not an easy task. Instead of forcing the user to test many different explanation methods and analysing conflicting solutions, in this paper, we propose to use a multi-stage ensemble approach that will select single counterfactual based on the multiple-criteria analysis. It offers a compromise solution that scores well on several popular quality measures. This approach exploits the dominance relation and the ideal point decision aid method, which selects one counterfactual from the Pareto front. The conducted experiments demonstrated that th",
    "path": "papers/24/03/2403.13940.json",
    "total_tokens": 672,
    "translated_title": "基于多标准方法从解释集合中选择集成的解释方法中的解释",
    "translated_abstract": "arXiv:2403.13940v2 公告类型: 替换交叉摘要: 反事实广泛用于通过提供获得更受欢迎预测的替代方案来解释机器学习模型的预测。它们可以通过各种方法生成，这些方法优化不同的甚至是冲突的质量标准，并产生截然不同的解决方案。然而，选择最合适的解释方法和生成反事实中的一个并非易事。而不是迫使用户测试多种不同的解释方法和分析冲突的解决方案，本文我们提出了一种多阶段集成方法，该方法基于多标准分析选择单个体化反事实。它提供了一个在多个流行质量标准上得分很好的妥协解决方案。这种方法利用了支配关系和理想点决策支持方法，该方法从帕累托前沿中选择一个反事实。进行的研究表明，该方法可以更全面地考虑反事实的解释质量，尤其是当考虑多个标准时，它能够减少多准则问题中的冲突，并提供用户易于理解的信息，从而在他们进行解释选择时提供指导。",
    "tldr": "在一组反事实解释中，由多种集成解释方法生成，本文提出了一种多标准方法，通过考虑多个质量标准，减少冲突，并为用户提供易于理解的指导，从而选择最合适的一个。",
    "en_tdlr": "The paper presents a multi-criteria approach for selecting an individual counterfactual explanation from a set generated by an ensemble of explainers, aiming to reduce conflict and provide user-friendly guidance for interpretation choice."
}