{
    "title": "Meta-Prompting for Automating Zero-shot Visual Recognition with LLMs",
    "abstract": "arXiv:2403.11755v3 Announce Type: replace  Abstract: Prompt ensembling of Large Language Model (LLM) generated category-specific prompts has emerged as an effective method to enhance zero-shot recognition ability of Vision-Language Models (VLMs). To obtain these category-specific prompts, the present methods rely on hand-crafting the prompts to the LLMs for generating VLM prompts for the downstream tasks. However, this requires manually composing these task-specific prompts and still, they might not cover the diverse set of visual concepts and task-specific styles associated with the categories of interest. To effectively take humans out of the loop and completely automate the prompt generation process for zero-shot recognition, we propose Meta-Prompting for Visual Recognition (MPVR). Taking as input only minimal information about the target task, in the form of its short natural language description, and a list of associated class labels, MPVR automatically produces a diverse set of c",
    "link": "https://arxiv.org/abs/2403.11755",
    "context": "Title: Meta-Prompting for Automating Zero-shot Visual Recognition with LLMs\nAbstract: arXiv:2403.11755v3 Announce Type: replace  Abstract: Prompt ensembling of Large Language Model (LLM) generated category-specific prompts has emerged as an effective method to enhance zero-shot recognition ability of Vision-Language Models (VLMs). To obtain these category-specific prompts, the present methods rely on hand-crafting the prompts to the LLMs for generating VLM prompts for the downstream tasks. However, this requires manually composing these task-specific prompts and still, they might not cover the diverse set of visual concepts and task-specific styles associated with the categories of interest. To effectively take humans out of the loop and completely automate the prompt generation process for zero-shot recognition, we propose Meta-Prompting for Visual Recognition (MPVR). Taking as input only minimal information about the target task, in the form of its short natural language description, and a list of associated class labels, MPVR automatically produces a diverse set of c",
    "path": "papers/24/03/2403.11755.json",
    "total_tokens": 460,
    "tldr": "该文章通过提出Meta-Prompting for Visual Recognition (MPVR)方法，实现了自动化生成针对特定任务的零射识别任务视觉提示。这种方法只需输入任务的简短描述和类标签列表，就可以自动创建出覆盖广泛视觉概念和任务相关风格的多样化的提示集，从而显著提高了VLM在零射识别任务中的表现。该创新通过简化人工干预，成功将人从提示生成过程中解放出来，实现了提示自动化的目标。此外，这种方法使用大型语言模型（LLM）产生的特定类别提示，这种方法虽然可靠，但仍然存在局限性，即手动编写提示不能覆盖所有相关的视觉概念和任务特有风格。通过引入Meta-Prompting，文章作者成功自动化了生成任务特异性视觉提示的过程，这是当前技术中的重大突破。"
}