{
    "title": "Dreaming of Many Worlds: Learning Contextual World Models Aids Zero-Shot Generalization",
    "abstract": "arXiv:2403.10967v2 Announce Type: replace-cross  Abstract: Zero-shot generalization (ZSG) to unseen dynamics is a major challenge for creating generally capable embodied agents. To address the broader challenge, we start with the simpler setting of contextual reinforcement learning (cRL), assuming observability of the context values that parameterize the variation in the system's dynamics, such as the mass or dimensions of a robot, without making further simplifying assumptions about the observability of the Markovian state. Toward the goal of ZSG to unseen variation in context, we propose the contextual recurrent state-space model (cRSSM), which introduces changes to the world model of Dreamer (v3) (Hafner et al., 2023). This allows the world model to incorporate context for inferring latent Markovian states from the observations and modeling the latent dynamics. Our approach is evaluated on two tasks from the CARL benchmark suite, which is tailored to study contextual RL. Our experim",
    "link": "https://arxiv.org/abs/2403.10967",
    "context": "Title: Dreaming of Many Worlds: Learning Contextual World Models Aids Zero-Shot Generalization\nAbstract: arXiv:2403.10967v2 Announce Type: replace-cross  Abstract: Zero-shot generalization (ZSG) to unseen dynamics is a major challenge for creating generally capable embodied agents. To address the broader challenge, we start with the simpler setting of contextual reinforcement learning (cRL), assuming observability of the context values that parameterize the variation in the system's dynamics, such as the mass or dimensions of a robot, without making further simplifying assumptions about the observability of the Markovian state. Toward the goal of ZSG to unseen variation in context, we propose the contextual recurrent state-space model (cRSSM), which introduces changes to the world model of Dreamer (v3) (Hafner et al., 2023). This allows the world model to incorporate context for inferring latent Markovian states from the observations and modeling the latent dynamics. Our approach is evaluated on two tasks from the CARL benchmark suite, which is tailored to study contextual RL. Our experim",
    "path": "papers/24/03/2403.10967.json",
    "total_tokens": 883,
    "translated_title": "梦想许多世界：学习情境世界模型有助于零样本泛化",
    "translated_abstract": "arXiv:2403.10967v2 公告类型：替换交叉  翻译过的摘要：零样本泛化（ZSG）到未见动态是创建通用能力的身体化代理的主要挑战。为了解决更广泛的问题，我们从情境强化学习（cRL）的简单设置开始，假定对参数化系统动态变化的环境值的可观测性，例如机器人的质量或尺寸，而不做关于马尔可夫状态可观测性的进一步简化假设。为了实现对未见环境变化的自适应，我们提出了情境重复状态空间模型（cRSSM），该方法是对Dreamer（v3）(Hafner等，2023)的一种情境世界模型的改进。这允许世界模型通过观察来推测潜在的马尔可夫状态，并建模潜在动态，从而对情境强化学习任务进行评估。我们在CARL基准套件中选择了两个任务，这些任务专门用来研究情境RL。我們的方法在两个CARL基准套件中的任务上进行了评价。我们的实验表明，在两个不同的任务上，与 baselines 相比，我们的方法在 zero-shot 泛化方面取得了更好的结果。我们的方法采用了 steps，其中通过将 world model 的输出用作即将到来的观测的预测，来实在地融合情境信息，进而提高了泛化能力。我们还在两个不同数据集上进行了额外的验证实验，证明了通过简单地将 context 与 observation 结合，就可以提高泛化性能。这些结果均展现了结合 context 和 world model 能够大幅提高 EUD 和最终性能，展示出这种方法在推断 latent dynamic 方面的潜力。",
    "tldr": "该研究通过改进Dreamer V3的世界模型，提出了一种新的情境重复状态空间模型（cRSSM），这种模型能够通过包含情境信息来实现更好的零样本泛化能力。该方法在两个不同的CARL基准任务上取得了更好的结果，并且在两个额外的数据集上也验证了其泛化性能的提升。"
}