{
    "title": "LC-LLM: Explainable Lane-Change Intention and Trajectory Predictions with Large Language Models",
    "abstract": "arXiv:2403.18344v2 Announce Type: replace  Abstract: To ensure safe driving in dynamic environments, autonomous vehicles should possess the capability to accurately predict lane change intentions of surrounding vehicles in advance and forecast their future trajectories. Existing motion prediction approaches have ample room for improvement, particularly in terms of long-term prediction accuracy and interpretability. In this paper, we address these challenges by proposing LC-LLM, an explainable lane change prediction model that leverages the strong reasoning capabilities and self-explanation abilities of Large Language Models (LLMs). Essentially, we reformulate the lane change prediction task as a language modeling problem, processing heterogeneous driving scenario information as natural language prompts for LLMs and employing supervised fine-tuning to tailor LLMs specifically for lane change prediction task. Additionally, we finetune the Chain-of-Thought (CoT) reasoning to improve predi",
    "link": "https://arxiv.org/abs/2403.18344",
    "context": "Title: LC-LLM: Explainable Lane-Change Intention and Trajectory Predictions with Large Language Models\nAbstract: arXiv:2403.18344v2 Announce Type: replace  Abstract: To ensure safe driving in dynamic environments, autonomous vehicles should possess the capability to accurately predict lane change intentions of surrounding vehicles in advance and forecast their future trajectories. Existing motion prediction approaches have ample room for improvement, particularly in terms of long-term prediction accuracy and interpretability. In this paper, we address these challenges by proposing LC-LLM, an explainable lane change prediction model that leverages the strong reasoning capabilities and self-explanation abilities of Large Language Models (LLMs). Essentially, we reformulate the lane change prediction task as a language modeling problem, processing heterogeneous driving scenario information as natural language prompts for LLMs and employing supervised fine-tuning to tailor LLMs specifically for lane change prediction task. Additionally, we finetune the Chain-of-Thought (CoT) reasoning to improve predi",
    "path": "papers/24/03/2403.18344.json",
    "total_tokens": 358,
    "tldr": "该文章提出了一种名为LC-LLM的模型，借助大型语言模型（LLMs）强大的推理能力和自解释能力，将车道变换预测任务转化为语言建模问题。通过持续监督训练和CoT推理的微调，LC-LLM模型不仅在预测准确性方面取得了显著改进，而且在更广泛的驾驶场景下实现了更高的可解释性。"
}