{
    "title": "FOOL: Addressing the Downlink Bottleneck in Satellite Computing with Neural Feature Compression",
    "abstract": "arXiv:2403.16677v2 Announce Type: replace-cross  Abstract: Nanosatellite constellations equipped with sensors capturing large geographic regions provide unprecedented opportunities for Earth observation. As constellation sizes increase, network contention poses a downlink bottleneck. Orbital Edge Computing (OEC) leverages limited onboard compute resources to reduce transfer costs by processing the raw captures at the source. However, current solutions have limited practicability due to reliance on crude filtering methods or over-prioritizing particular downstream tasks.   This work presents FOOL, an OEC-native and task-agnostic feature compression method that preserves prediction performance. FOOL partitions high-resolution satellite imagery to maximize throughput. Further, it embeds context and leverages inter-tile dependencies to lower transfer costs with negligible overhead. While FOOL is a feature compressor, it can recover images with competitive scores on quality measures at lowe",
    "link": "https://arxiv.org/abs/2403.16677",
    "context": "Title: FOOL: Addressing the Downlink Bottleneck in Satellite Computing with Neural Feature Compression\nAbstract: arXiv:2403.16677v2 Announce Type: replace-cross  Abstract: Nanosatellite constellations equipped with sensors capturing large geographic regions provide unprecedented opportunities for Earth observation. As constellation sizes increase, network contention poses a downlink bottleneck. Orbital Edge Computing (OEC) leverages limited onboard compute resources to reduce transfer costs by processing the raw captures at the source. However, current solutions have limited practicability due to reliance on crude filtering methods or over-prioritizing particular downstream tasks.   This work presents FOOL, an OEC-native and task-agnostic feature compression method that preserves prediction performance. FOOL partitions high-resolution satellite imagery to maximize throughput. Further, it embeds context and leverages inter-tile dependencies to lower transfer costs with negligible overhead. While FOOL is a feature compressor, it can recover images with competitive scores on quality measures at lowe",
    "path": "papers/24/03/2403.16677.json",
    "total_tokens": 337,
    "tldr": "该文章提出FOOL技术，通过在卫星边缘计算场景中进行特征压缩，有效缓解了因大量传感器数据导致的下行链路瓶颈问题。FOOL通过最大化传输效率和利用上下文信息，降低了数据传输成本，同时保持了预测性能。"
}