{
    "title": "UniTraj: A Unified Framework for Scalable Vehicle Trajectory Prediction",
    "abstract": "arXiv:2403.15098v3 Announce Type: replace  Abstract: Vehicle trajectory prediction has increasingly relied on data-driven solutions, but their ability to scale to different data domains and the impact of larger dataset sizes on their generalization remain under-explored. While these questions can be studied by employing multiple datasets, it is challenging due to several discrepancies, e.g., in data formats, map resolution, and semantic annotation types. To address these challenges, we introduce UniTraj, a comprehensive framework that unifies various datasets, models, and evaluation criteria, presenting new opportunities for the vehicle trajectory prediction field. In particular, using UniTraj, we conduct extensive experiments and find that model performance significantly drops when transferred to other datasets. However, enlarging data size and diversity can substantially improve performance, leading to a new state-of-the-art result for the nuScenes dataset. We provide insights into d",
    "link": "https://arxiv.org/abs/2403.15098",
    "context": "Title: UniTraj: A Unified Framework for Scalable Vehicle Trajectory Prediction\nAbstract: arXiv:2403.15098v3 Announce Type: replace  Abstract: Vehicle trajectory prediction has increasingly relied on data-driven solutions, but their ability to scale to different data domains and the impact of larger dataset sizes on their generalization remain under-explored. While these questions can be studied by employing multiple datasets, it is challenging due to several discrepancies, e.g., in data formats, map resolution, and semantic annotation types. To address these challenges, we introduce UniTraj, a comprehensive framework that unifies various datasets, models, and evaluation criteria, presenting new opportunities for the vehicle trajectory prediction field. In particular, using UniTraj, we conduct extensive experiments and find that model performance significantly drops when transferred to other datasets. However, enlarging data size and diversity can substantially improve performance, leading to a new state-of-the-art result for the nuScenes dataset. We provide insights into d",
    "path": "papers/24/03/2403.15098.json",
    "total_tokens": 381,
    "tldr": "该文章提出了一个名为UniTraj的统一框架，用于车辆轨迹预测，并在分布式数据格式、地图分辨率和语义标注类型等方面进行了统一，为该领域的研究提供了新的机会。通过在多个数据集上的广泛实验，文章发现模型在转移到其他数据集时性能会显著下降，但通过增加数据量和多样性可以显著提高性能，并在nuScenes数据集上达到了最新技术水平。文章还提供了关于数据多样性对模型性能影响的见解。"
}