{
    "title": "HAIFIT: Fashion Image Translation for Human-to-AI Style Learning and Generation",
    "abstract": "arXiv:2403.08651v4 Announce Type: replace  Abstract: In the realm of fashion design, sketches serve as the canvas for expressing an artist's distinctive drawing style and creative vision, capturing intricate details like stroke variations and texture nuances. The advent of sketch-to-image cross-modal translation technology has notably aided designers. However, existing methods often compromise these sketch details during image generation, resulting in images that deviate from the designer's intended concept. This limitation hampers the ability to offer designers a precise preview of the final output. To overcome this challenge, we introduce HAIFIT, a novel approach that transforms sketches into high-fidelity, lifelike clothing images by integrating multi-scale features and capturing extensive feature map dependencies from diverse perspectives. Through extensive qualitative and quantitative evaluations conducted on our self-collected dataset, our method demonstrates superior performance",
    "link": "https://arxiv.org/abs/2403.08651",
    "context": "Title: HAIFIT: Fashion Image Translation for Human-to-AI Style Learning and Generation\nAbstract: arXiv:2403.08651v4 Announce Type: replace  Abstract: In the realm of fashion design, sketches serve as the canvas for expressing an artist's distinctive drawing style and creative vision, capturing intricate details like stroke variations and texture nuances. The advent of sketch-to-image cross-modal translation technology has notably aided designers. However, existing methods often compromise these sketch details during image generation, resulting in images that deviate from the designer's intended concept. This limitation hampers the ability to offer designers a precise preview of the final output. To overcome this challenge, we introduce HAIFIT, a novel approach that transforms sketches into high-fidelity, lifelike clothing images by integrating multi-scale features and capturing extensive feature map dependencies from diverse perspectives. Through extensive qualitative and quantitative evaluations conducted on our self-collected dataset, our method demonstrates superior performance",
    "path": "papers/24/03/2403.08651.json",
    "total_tokens": 332,
    "tldr": "该文章创新性地提出了HAIFIT方法，通过整合多尺度特征并捕捉广泛的特征图依赖关系，成功地将时尚草图转化为高保真度和逼真的服装图像，显著提升了现有方法在保留设计师意图方面的问题，并为设计师提供了更加精确的成品预览。"
}