{
    "title": "DrPlanner: Diagnosis and Repair of Motion Planners for Automated Vehicles Using Large Language Models",
    "abstract": "arXiv:2403.07470v2 Announce Type: replace  Abstract: Motion planners are essential for the safe operation of automated vehicles across various scenarios. However, no motion planning algorithm has achieved perfection in the literature, and improving its performance is often time-consuming and labor-intensive. To tackle the aforementioned issues, we present DrPlanner, the first framework designed to automatically diagnose and repair motion planners using large language models. Initially, we generate a structured description of the planner and its planned trajectories from both natural and programming languages. Leveraging the profound capabilities of large language models, our framework returns repaired planners with detailed diagnostic descriptions. Furthermore, our framework advances iteratively with continuous feedback from the evaluation of the repaired outcomes. Our approach is validated using both search- and sampling-based motion planners for automated vehicles; experimental resul",
    "link": "https://arxiv.org/abs/2403.07470",
    "context": "Title: DrPlanner: Diagnosis and Repair of Motion Planners for Automated Vehicles Using Large Language Models\nAbstract: arXiv:2403.07470v2 Announce Type: replace  Abstract: Motion planners are essential for the safe operation of automated vehicles across various scenarios. However, no motion planning algorithm has achieved perfection in the literature, and improving its performance is often time-consuming and labor-intensive. To tackle the aforementioned issues, we present DrPlanner, the first framework designed to automatically diagnose and repair motion planners using large language models. Initially, we generate a structured description of the planner and its planned trajectories from both natural and programming languages. Leveraging the profound capabilities of large language models, our framework returns repaired planners with detailed diagnostic descriptions. Furthermore, our framework advances iteratively with continuous feedback from the evaluation of the repaired outcomes. Our approach is validated using both search- and sampling-based motion planners for automated vehicles; experimental resul",
    "path": "papers/24/03/2403.07470.json",
    "total_tokens": 340,
    "tldr": "该文章提出了DrPlanner，一种利用大型语言模型自动诊断和修复自动化车辆运动规划器的框架。通过从自然语言和编程语言生成规划器及其路径的详细描述，DrPlanner能够返回经过修复的规划器，并提供详细的诊断说明。这种方法通过迭代反馈不断提升性能，已在多种运动规划器上得到验证。"
}