{
    "title": "MAC: Graph Sparsification by Maximizing Algebraic Connectivity",
    "abstract": "arXiv:2403.19879v2 Announce Type: replace  Abstract: Simultaneous localization and mapping (SLAM) is a critical capability in autonomous navigation, but memory and computational limits make long-term application of common SLAM techniques impractical; a robot must be able to determine what information should be retained and what can safely be forgotten. In graph-based SLAM, the number of edges (measurements) in a pose graph determines both the memory requirements of storing a robot's observations and the computational expense of algorithms deployed for performing state estimation using those observations, both of which can grow unbounded during long-term navigation. Motivated by these challenges, we propose a new general purpose approach to sparsify graphs in a manner that maximizes algebraic connectivity, a key spectral property of graphs which has been shown to control the estimation error of pose graph SLAM solutions. Our algorithm, MAC (for maximizing algebraic connectivity), is sim",
    "link": "https://arxiv.org/abs/2403.19879",
    "context": "Title: MAC: Graph Sparsification by Maximizing Algebraic Connectivity\nAbstract: arXiv:2403.19879v2 Announce Type: replace  Abstract: Simultaneous localization and mapping (SLAM) is a critical capability in autonomous navigation, but memory and computational limits make long-term application of common SLAM techniques impractical; a robot must be able to determine what information should be retained and what can safely be forgotten. In graph-based SLAM, the number of edges (measurements) in a pose graph determines both the memory requirements of storing a robot's observations and the computational expense of algorithms deployed for performing state estimation using those observations, both of which can grow unbounded during long-term navigation. Motivated by these challenges, we propose a new general purpose approach to sparsify graphs in a manner that maximizes algebraic connectivity, a key spectral property of graphs which has been shown to control the estimation error of pose graph SLAM solutions. Our algorithm, MAC (for maximizing algebraic connectivity), is sim",
    "path": "papers/24/03/2403.19879.json",
    "total_tokens": 672,
    "translated_title": "MAC：通过最大化代数连通性进行图形稀疏化",
    "translated_abstract": "arXiv:2403.19879v2 公告类型：替换  翻译摘要：自主导航的关键能力是同步定位和制图（SLAM），但是内存和计算限制使得常见SLAM技术的长期应用不切实际；机器人必须能够确定哪些信息应该保留，哪些信息可以安全地忘记。在基于图的SLAM中， pose图中的边（测量）的数量决定了存储机器人观察信息的记忆需求，以及使用这些观察进行状态估计的算法的计算成本，这些信息在长期导航中可能会无限制地增长。受到这些挑战的激励，我们提出了一种新的通用方法，用于以最大化图的代数连通性（algebraic connectivity）的方式进行稀疏化。我们的算法，MAC（最大代数连通性），是模拟的，可以应用于尺度上，可以有效地减小图的大小，同时保持优化的SLAM解决方案的准确性。试验验证了我们算法的有效性，它能够在不牺牲置信度估算精度的情况下显着减少图的大小。",
    "tldr": "这篇论文提出了一个名为MAC的算法，该算法通过最大化图的代数连通性来稀疏化图，以有效地减小图的大小并保持优化的SLAM解决方案的准确性。"
}