{
    "title": "Motion Mamba: Efficient and Long Sequence Motion Generation",
    "abstract": "arXiv:2403.07487v4 Announce Type: replace  Abstract: Human motion generation stands as a significant pursuit in generative computer vision, while achieving long-sequence and efficient motion generation remains challenging. Recent advancements in state space models (SSMs), notably Mamba, have showcased considerable promise in long sequence modeling with an efficient hardware-aware design, which appears to be a promising direction to build motion generation model upon it. Nevertheless, adapting SSMs to motion generation faces hurdles since the lack of a specialized design architecture to model motion sequence. To address these challenges, we propose Motion Mamba, a simple and efficient approach that presents the pioneering motion generation model utilized SSMs. Specifically, we design a Hierarchical Temporal Mamba (HTM) block to process temporal data by ensemble varying numbers of isolated SSM modules across a symmetric U-Net architecture aimed at preserving motion consistency between fr",
    "link": "https://arxiv.org/abs/2403.07487",
    "context": "Title: Motion Mamba: Efficient and Long Sequence Motion Generation\nAbstract: arXiv:2403.07487v4 Announce Type: replace  Abstract: Human motion generation stands as a significant pursuit in generative computer vision, while achieving long-sequence and efficient motion generation remains challenging. Recent advancements in state space models (SSMs), notably Mamba, have showcased considerable promise in long sequence modeling with an efficient hardware-aware design, which appears to be a promising direction to build motion generation model upon it. Nevertheless, adapting SSMs to motion generation faces hurdles since the lack of a specialized design architecture to model motion sequence. To address these challenges, we propose Motion Mamba, a simple and efficient approach that presents the pioneering motion generation model utilized SSMs. Specifically, we design a Hierarchical Temporal Mamba (HTM) block to process temporal data by ensemble varying numbers of isolated SSM modules across a symmetric U-Net architecture aimed at preserving motion consistency between fr",
    "path": "papers/24/03/2403.07487.json",
    "total_tokens": 724,
    "translated_title": "Motion Mamba：高效且长序列的运动生成",
    "translated_abstract": "arXiv:2403.07487v4 宣布类型：替换 摘要：在生成计算机视觉中，人类运动生成是一个重要的追求，而实现长期序列和高效的运动生成仍然是一个挑战。最近状态空间模型（SSM）在长期序列建模中的进步，特别是Mamba，已经在硬件友好的设计上展示了相当的潜力，这似乎是建立在运动生成模型之上的一个有希望的方向。然而，将SSM应用于运动生成面临障碍，因为缺乏一种专门的设计架构来建模运动序列。为了解决这些挑战，我们提出了Motion Mamba，这是一个简单且高效的方法，它展现了一个开创性的运动生成模型，使用了SSM。具体来说，我们设计了一个层次时序Mamba（HTM）块，用于通过U-Net架构中集成的各种隔离SSM模块来处理时间数据，这些模块的大小在统计对称性上有所不同，旨在保留帧之间的运动一致性。此外，为了维护运动一致性，我们实施了移动平均预测以减少长时间间隔中的运动变化，并且在生成运动时使用了代理编码器来提高性能。我们在多种运动数据集上验证了我们方法的有效性，表明Motion Mamba在长期运动预测中的表现优于现有的运动生成模型。",
    "tldr": "论文提出了一种名为Motion Mamba的简单且高效的运动生成模型，它在U-Net架构中使用了层次时序Mamba（HTM）块，同时在预测过程中采用移动平均预测以保持运动的一致性。"
}