{
    "title": "Driving Animatronic Robot Facial Expression From Speech",
    "abstract": "arXiv:2403.12670v3 Announce Type: replace  Abstract: Animatronic robots hold the promise of enabling natural human-robot interaction through lifelike facial expressions. However, generating realistic, speech-synchronized robot expressions poses significant challenges due to the complexities of facial biomechanics and the need for responsive motion synthesis. This paper introduces a novel, skinning-centric approach to drive animatronic robot facial expressions from speech input. At its core, the proposed approach employs linear blend skinning (LBS) as a unifying representation, guiding innovations in both embodiment design and motion synthesis. LBS informs the actuation topology, facilitates human expression retargeting, and enables efficient speech-driven facial motion generation. This approach demonstrates the capability to produce highly realistic facial expressions on an animatronic face in real-time at over 4000 fps on a single Nvidia RTX 4090, significantly advancing robots' abili",
    "link": "https://arxiv.org/abs/2403.12670",
    "context": "Title: Driving Animatronic Robot Facial Expression From Speech\nAbstract: arXiv:2403.12670v3 Announce Type: replace  Abstract: Animatronic robots hold the promise of enabling natural human-robot interaction through lifelike facial expressions. However, generating realistic, speech-synchronized robot expressions poses significant challenges due to the complexities of facial biomechanics and the need for responsive motion synthesis. This paper introduces a novel, skinning-centric approach to drive animatronic robot facial expressions from speech input. At its core, the proposed approach employs linear blend skinning (LBS) as a unifying representation, guiding innovations in both embodiment design and motion synthesis. LBS informs the actuation topology, facilitates human expression retargeting, and enables efficient speech-driven facial motion generation. This approach demonstrates the capability to produce highly realistic facial expressions on an animatronic face in real-time at over 4000 fps on a single Nvidia RTX 4090, significantly advancing robots' abili",
    "path": "papers/24/03/2403.12670.json",
    "total_tokens": 358,
    "tldr": "该文章提出了一种基于线性混合皮肤（LBS）的全新方法，用于通过声音输入驱动具有仿生面部表情的机械机器人。这种方法不仅优化了机器人的外观设计，而且使得表情动作的生成更加准确和同步。通过这种方式，实现了实时、高质量的面部表情，对于推动机器人与人类的自然互动具有重要意义。"
}