{
    "title": "Automated System-level Testing of Unmanned Aerial Systems",
    "abstract": "arXiv:2403.15857v2 Announce Type: replace-cross  Abstract: Unmanned aerial systems (UAS) rely on various avionics systems that are safety-critical and mission-critical. A major requirement of international safety standards is to perform rigorous system-level testing of avionics software systems. The current industrial practice is to manually create test scenarios, manually/automatically execute these scenarios using simulators, and manually evaluate outcomes. The test scenarios typically consist of setting certain flight or environment conditions and testing the system under test in these settings. The state-of-the-art approaches for this purpose also require manual test scenario development and evaluation. In this paper, we propose a novel approach to automate the system-level testing of the UAS. The proposed approach (AITester) utilizes model-based testing and artificial intelligence (AI) techniques to automatically generate, execute, and evaluate various test scenarios. The test sce",
    "link": "https://arxiv.org/abs/2403.15857",
    "context": "Title: Automated System-level Testing of Unmanned Aerial Systems\nAbstract: arXiv:2403.15857v2 Announce Type: replace-cross  Abstract: Unmanned aerial systems (UAS) rely on various avionics systems that are safety-critical and mission-critical. A major requirement of international safety standards is to perform rigorous system-level testing of avionics software systems. The current industrial practice is to manually create test scenarios, manually/automatically execute these scenarios using simulators, and manually evaluate outcomes. The test scenarios typically consist of setting certain flight or environment conditions and testing the system under test in these settings. The state-of-the-art approaches for this purpose also require manual test scenario development and evaluation. In this paper, we propose a novel approach to automate the system-level testing of the UAS. The proposed approach (AITester) utilizes model-based testing and artificial intelligence (AI) techniques to automatically generate, execute, and evaluate various test scenarios. The test sce",
    "path": "papers/24/03/2403.15857.json",
    "total_tokens": 696,
    "translated_title": "无人航空系统系统级自动测试系统",
    "translated_abstract": "arXiv:2403.15857v2 公告类型：替换交叉摘要：无人航空系统（UAS）依赖于各种航空电子系统，这些系统对于安全性和任务执行至关重要。国际安全标准的重大要求是对航空电子软件系统进行严格的系统级测试。当前工业做法是手动创建测试场景，使用模拟器手动/自动执行这些场景，并手动评估结果。测试场景通常包括设置特定飞行或环境条件，并在这些条件下对受测系统进行测试。为此目的的现有技术方法也要求手动创建测试场景并进行评估。在本论文中，我们提出了一种自动化无人航空系统系统级测试的新方法。提出的AITester方法利用基于模型的测试和人工智能（AI）技术来自动生成、执行和评估各种测试场景。测试场景通过AI技术可以动态生成，并模拟和评估系统中不同组件的性能，从而提高了测试的覆盖率和可靠度。此外，AITester还利用机器学习算法来分析和优化测试案例，从而在短时间内发现并隔离系统潜在的错误和问题。AITester能够显著降低测试成本并提高UAS系统测试的效率和准确性。",
    "tldr": "该论文提出了一种基于模型的测试和人工智能技术的自动化系统级测试方法，为无人航空系统的有效测试提供了可行的解决方案，提高了测试效率和准确性。",
    "en_tdlr": "The paper presents an automated system-level testing approach for UAS, using model-based testing and AI techniques, providing a viable solution to effectively test the avionics systems, and enhancing the efficiency and accuracy of system testing."
}