{
    "title": "An Optimization Framework to Enforce Multi-View Consistency for Texturing 3D Meshes",
    "abstract": "arXiv:2403.15559v2 Announce Type: replace-cross  Abstract: A fundamental problem in the texturing of 3D meshes using pre-trained text-to-image models is to ensure multi-view consistency. State-of-the-art approaches typically use diffusion models to aggregate multi-view inputs, where common issues are the blurriness caused by the averaging operation in the aggregation step or inconsistencies in local features. This paper introduces an optimization framework that proceeds in four stages to achieve multi-view consistency. Specifically, the first stage generates an over-complete set of 2D textures from a predefined set of viewpoints using an MV-consistent diffusion process. The second stage selects a subset of views that are mutually consistent while covering the underlying 3D model. We show how to achieve this goal by solving semi-definite programs. The third stage performs non-rigid alignment to align the selected views across overlapping regions. The fourth stage solves an MRF problem t",
    "link": "https://arxiv.org/abs/2403.15559",
    "context": "Title: An Optimization Framework to Enforce Multi-View Consistency for Texturing 3D Meshes\nAbstract: arXiv:2403.15559v2 Announce Type: replace-cross  Abstract: A fundamental problem in the texturing of 3D meshes using pre-trained text-to-image models is to ensure multi-view consistency. State-of-the-art approaches typically use diffusion models to aggregate multi-view inputs, where common issues are the blurriness caused by the averaging operation in the aggregation step or inconsistencies in local features. This paper introduces an optimization framework that proceeds in four stages to achieve multi-view consistency. Specifically, the first stage generates an over-complete set of 2D textures from a predefined set of viewpoints using an MV-consistent diffusion process. The second stage selects a subset of views that are mutually consistent while covering the underlying 3D model. We show how to achieve this goal by solving semi-definite programs. The third stage performs non-rigid alignment to align the selected views across overlapping regions. The fourth stage solves an MRF problem t",
    "path": "papers/24/03/2403.15559.json",
    "total_tokens": 776,
    "translated_title": "一种优化框架，用于确保将多视角一致性应用到3D网格的纹理化",
    "translated_abstract": "arXiv:2403.15559v2 公告类型：替换交叉  翻译摘要：在预训练的文本到图像模型的基础上，对3D网格进行纹理化时，一个基本的问题是如何确保多视角的一致性。现有技术方法通常使用扩散模型来聚合多视角输入，其中常见的问题是在聚合步骤中由于平均操作引起的模糊性，或者局部特征的不一致性。本文介绍了一种优化框架，该框架分为四个阶段来实现多视角的一致性。特别是，第一阶段使用MV一致的扩散过程从预定义的多视角集生成一个2D纹理的过完备集合。第二阶段选择一个子集的视图，这些视图在覆盖下的3D模型中是相互一致的，我们展示了如何通过解决半正定规划来达到这个目标。第三阶段执行非刚性对齐，以在重叠区域对选定的视图进行对齐。第四阶段解决一个MRF问题，它用于一致一致性评估的重建问题，并且通过采分选采样来细化视角选择。整体框架进行迭代优化，直到达到满意的性能，实现了高效的3D网格多视角纹理化处理",
    "tldr": "本文提出了一种四阶段的优化框架，用于通过非刚性对齐和MRF问题解决，确保多视角纹理化处理，以达到高效的3D网格多视角纹理化处理",
    "en_tdlr": "This paper presents an optimization framework divided into four stages that aims to ensure multi-view consistency in texturizing 3D meshes. The framework involves generating an over-complete set of 2D textures, selecting a subset of consistent views, performing non-rigid alignment, and solving a Markov Random Field (MRF) problem to achieve efficient multi-view texture handling of 3D meshes."
}