{
    "title": "SSAP: A Shape-Sensitive Adversarial Patch for Comprehensive Disruption of Monocular Depth Estimation in Autonomous Navigation Applications",
    "abstract": "arXiv:2403.11515v2 Announce Type: replace-cross  Abstract: Monocular depth estimation (MDE) has advanced significantly, primarily through the integration of convolutional neural networks (CNNs) and more recently, Transformers. However, concerns about their susceptibility to adversarial attacks have emerged, especially in safety-critical domains like autonomous driving and robotic navigation. Existing approaches for assessing CNN-based depth prediction methods have fallen short in inducing comprehensive disruptions to the vision system, often limited to specific local areas. In this paper, we introduce SSAP (Shape-Sensitive Adversarial Patch), a novel approach designed to comprehensively disrupt monocular depth estimation (MDE) in autonomous navigation applications. Our patch is crafted to selectively undermine MDE in two distinct ways: by distorting estimated distances or by creating the illusion of an object disappearing from the system's perspective. Notably, our patch is shape-sensi",
    "link": "https://arxiv.org/abs/2403.11515",
    "context": "Title: SSAP: A Shape-Sensitive Adversarial Patch for Comprehensive Disruption of Monocular Depth Estimation in Autonomous Navigation Applications\nAbstract: arXiv:2403.11515v2 Announce Type: replace-cross  Abstract: Monocular depth estimation (MDE) has advanced significantly, primarily through the integration of convolutional neural networks (CNNs) and more recently, Transformers. However, concerns about their susceptibility to adversarial attacks have emerged, especially in safety-critical domains like autonomous driving and robotic navigation. Existing approaches for assessing CNN-based depth prediction methods have fallen short in inducing comprehensive disruptions to the vision system, often limited to specific local areas. In this paper, we introduce SSAP (Shape-Sensitive Adversarial Patch), a novel approach designed to comprehensively disrupt monocular depth estimation (MDE) in autonomous navigation applications. Our patch is crafted to selectively undermine MDE in two distinct ways: by distorting estimated distances or by creating the illusion of an object disappearing from the system's perspective. Notably, our patch is shape-sensi",
    "path": "papers/24/03/2403.11515.json",
    "total_tokens": 820,
    "translated_title": "SSAP：面向自主导航应用的形状敏感对抗性补丁全面破坏单目 Depth 估计",
    "translated_abstract": "arXiv:2403.11515v2 公告类型：替换交叉 摘要：单目深度估计（MDE）已经通过卷积神经网络（CNNs）的整合以及最近，Transformer 的使用取得了显著的进展。但是，对于它们在包括自动驾驶和机器人导航等安全关键领域对对抗性攻击的易感性的担忧已经出现。评估基于 CNN 的深度预测方法的现有方法在诱导对视觉系统的全面破坏方面已经不足，往往限于特定区域。在本文中，我们介绍了一种名为 SSAP（Shape-Sensitive Adversarial Patch）的新型方法，旨在在自主导航应用程序中全面破坏单目深度估计（MDE）。我们的补丁被精心设计成以两种不同的方式来破坏 MDE：通过扭曲估计的距离或通过在系统视角中创建物体消失的错觉。值得注意的是，我们的补丁具有形状感知特异性，意味着它可以选择性地影响 MDE，即使在深度估计中的噪声和不确定性中也保持有效。实验结果表明，SSAP 能够有效地在多个模型和场景中诱导深度估计的错误和行为决策的偏差。我们的研究结果为理解深度估计系统的鲁棒性提供深刻的洞见，并为设计和开发更强大的防御策略提供基础。",
    "tldr": "本文提出了一种名为 SSAP（Shape-Sensitive Adversarial Patch）的新方法，旨在在自主导航应用程序中全面破坏单目Depth估计（MDE）。该方法通过设计具有形状感知特性的对抗性补丁，故意误导 MDE 系统，使其在噪声和不确定性中仍然有效。实验表明 SSAP 能够诱导深度估计错误和行为决策偏差。"
}