{
    "title": "Reinforcement Learning Aided Sequential Optimization for Unsignalized Intersection Management of Robot Traffic",
    "abstract": "arXiv:2302.05082v3 Announce Type: replace  Abstract: We consider the problem of optimal unsignalized intersection management, wherein we seek to obtain safe and optimal trajectories, for a set of robots that arrive randomly and continually. This problem involves repeatedly solving a mixed integer program (with robot acceleration trajectories as decision variables) with different parameters, for which the computation time using a naive optimization algorithm scales exponentially with the number of robots and lanes. Hence, such an approach is not suitable for real-time implementation. In this paper, we propose a solution framework that combines learning and sequential optimization. In particular, we propose an algorithm for learning a shared policy that given the traffic state information, determines the crossing order of the robots. Then, we optimize the trajectories of the robots sequentially according to that crossing order. This approach inherently guarantees safety at all times. We ",
    "link": "https://arxiv.org/abs/2302.05082",
    "context": "Title: Reinforcement Learning Aided Sequential Optimization for Unsignalized Intersection Management of Robot Traffic\nAbstract: arXiv:2302.05082v3 Announce Type: replace  Abstract: We consider the problem of optimal unsignalized intersection management, wherein we seek to obtain safe and optimal trajectories, for a set of robots that arrive randomly and continually. This problem involves repeatedly solving a mixed integer program (with robot acceleration trajectories as decision variables) with different parameters, for which the computation time using a naive optimization algorithm scales exponentially with the number of robots and lanes. Hence, such an approach is not suitable for real-time implementation. In this paper, we propose a solution framework that combines learning and sequential optimization. In particular, we propose an algorithm for learning a shared policy that given the traffic state information, determines the crossing order of the robots. Then, we optimize the trajectories of the robots sequentially according to that crossing order. This approach inherently guarantees safety at all times. We ",
    "path": "papers/23/02/2302.05082.json",
    "total_tokens": 331,
    "tldr": "该文章提出了一种结合学习和序列优化的方法，用于解决无信号控制交叉口的机器人交通管理问题。该方法通过学习一个共享策略来确定机器人根据实时交通状态信息的通行顺序，并在此基础上对机器人进行序列化的轨迹优化，以保证在任何时刻的行驶安全。"
}