{
    "title": "Curriculum Learning for ab initio Deep Learned Refractive Optics",
    "abstract": "arXiv:2302.01089v4 Announce Type: replace  Abstract: Deep optical optimization has recently emerged as a new paradigm for designing computational imaging systems using only the output image as the objective. However, it has been limited to either simple optical systems consisting of a single element such as a diffractive optical element (DOE) or metalens, or the fine-tuning of compound lenses from good initial designs. Here we present a DeepLens design method based on curriculum learning, which is able to learn optical designs of compound lenses ab initio from randomly initialized surfaces without human intervention, therefore overcoming the need for a good initial design. We demonstrate the effectiveness of our approach by fully automatically designing both classical imaging lenses and a large field-of-view extended depth-of-field computational lens in a cellphone-style form factor, with highly aspheric surfaces and a short back focal length.",
    "link": "https://arxiv.org/abs/2302.01089",
    "context": "Title: Curriculum Learning for ab initio Deep Learned Refractive Optics\nAbstract: arXiv:2302.01089v4 Announce Type: replace  Abstract: Deep optical optimization has recently emerged as a new paradigm for designing computational imaging systems using only the output image as the objective. However, it has been limited to either simple optical systems consisting of a single element such as a diffractive optical element (DOE) or metalens, or the fine-tuning of compound lenses from good initial designs. Here we present a DeepLens design method based on curriculum learning, which is able to learn optical designs of compound lenses ab initio from randomly initialized surfaces without human intervention, therefore overcoming the need for a good initial design. We demonstrate the effectiveness of our approach by fully automatically designing both classical imaging lenses and a large field-of-view extended depth-of-field computational lens in a cellphone-style form factor, with highly aspheric surfaces and a short back focal length.",
    "path": "papers/23/02/2302.01089.json",
    "total_tokens": 343,
    "tldr": "该文章提出了一种基于课程学习方法的DeepLens设计方法，能够在没有任何人工干预的情况下，从随机初始化的表面学习复杂光学元件的补偿性设计和优化，从而无需好的初始设计。通过这种方式，实现了在全自动设计下，为智能手机型风格的光学元件设计出能够大幅提高透视感和图像质量的折射光学系统。"
}