{
    "title": "Dissenting Explanations: Leveraging Disagreement to Reduce Model Overreliance",
    "abstract": "arXiv:2307.07636v3 Announce Type: replace  Abstract: While explainability is a desirable characteristic of increasingly complex black-box models, modern explanation methods have been shown to be inconsistent and contradictory. The semantics of explanations is not always fully understood - to what extent do explanations \"explain\" a decision and to what extent do they merely advocate for a decision? Can we help humans gain insights from explanations accompanying correct predictions and not over-rely on incorrect predictions advocated for by explanations? With this perspective in mind, we introduce the notion of dissenting explanations: conflicting predictions with accompanying explanations. We first explore the advantage of dissenting explanations in the setting of model multiplicity, where multiple models with similar performance may have different predictions. In such cases, providing dissenting explanations could be done by invoking the explanations of disagreeing models. Through a pi",
    "link": "https://arxiv.org/abs/2307.07636",
    "context": "Title: Dissenting Explanations: Leveraging Disagreement to Reduce Model Overreliance\nAbstract: arXiv:2307.07636v3 Announce Type: replace  Abstract: While explainability is a desirable characteristic of increasingly complex black-box models, modern explanation methods have been shown to be inconsistent and contradictory. The semantics of explanations is not always fully understood - to what extent do explanations \"explain\" a decision and to what extent do they merely advocate for a decision? Can we help humans gain insights from explanations accompanying correct predictions and not over-rely on incorrect predictions advocated for by explanations? With this perspective in mind, we introduce the notion of dissenting explanations: conflicting predictions with accompanying explanations. We first explore the advantage of dissenting explanations in the setting of model multiplicity, where multiple models with similar performance may have different predictions. In such cases, providing dissenting explanations could be done by invoking the explanations of disagreeing models. Through a pi",
    "path": "papers/23/07/2307.07636.json",
    "total_tokens": 318,
    "tldr": "该文章提出使用争议性解释来减少对模型依赖的创新性概念。争议性解释通过结合不同的预测结果和解释，增强了模型的多样性理解，从而在模型之间存在分歧时为决策者提供了多重视角。"
}