{
    "title": "FreeDrag: Feature Dragging for Reliable Point-based Image Editing",
    "abstract": "arXiv:2307.04684v4 Announce Type: replace  Abstract: To serve the intricate and varied demands of image editing, precise and flexible manipulation in image content is indispensable. Recently, Drag-based editing methods have gained impressive performance. However, these methods predominantly center on point dragging, resulting in two noteworthy drawbacks, namely \"miss tracking\", where difficulties arise in accurately tracking the predetermined handle points, and \"ambiguous tracking\", where tracked points are potentially positioned in wrong regions that closely resemble the handle points. To address the above issues, we propose FreeDrag, a feature dragging methodology designed to free the burden on point tracking. The FreeDrag incorporates two key designs, i.e., template feature via adaptive updating and line search with backtracking, the former improves the stability against drastic content change by elaborately controls feature updating scale after each dragging, while the latter allev",
    "link": "https://arxiv.org/abs/2307.04684",
    "context": "Title: FreeDrag: Feature Dragging for Reliable Point-based Image Editing\nAbstract: arXiv:2307.04684v4 Announce Type: replace  Abstract: To serve the intricate and varied demands of image editing, precise and flexible manipulation in image content is indispensable. Recently, Drag-based editing methods have gained impressive performance. However, these methods predominantly center on point dragging, resulting in two noteworthy drawbacks, namely \"miss tracking\", where difficulties arise in accurately tracking the predetermined handle points, and \"ambiguous tracking\", where tracked points are potentially positioned in wrong regions that closely resemble the handle points. To address the above issues, we propose FreeDrag, a feature dragging methodology designed to free the burden on point tracking. The FreeDrag incorporates two key designs, i.e., template feature via adaptive updating and line search with backtracking, the former improves the stability against drastic content change by elaborately controls feature updating scale after each dragging, while the latter allev",
    "path": "papers/23/07/2307.04684.json",
    "total_tokens": 678,
    "translated_title": "FreeDrag：基于特征拖拽的可靠点式图像编辑",
    "translated_abstract": "arXiv:2307.04684v4 公告类型：替换 摘要：为了满足图像编辑的复杂和多样化的需求，在图像内容上进行精确和灵活的编辑是不可或缺的。最近，基于拖拽的编辑方法取得了令人印象深刻的性能。然而，这些方法主要集中在点拖拽上，导致两个值得注意的缺点，即“错过追踪”，在对预先确定的手柄点进行精确追踪时遇到困难；以及“模糊追踪”，追踪到的点有可能被错误地定位在类似于手柄点的区域中。为了解决上述问题，我们提出了FreeDrag，一种基于特征拖拽的方法，旨在免除点追踪的负担。FreeDrag包含了两个关键设计，即通过自适应更新实现的模板特征和带有回头搜索的线搜索，前者通过精心控制每次拖拽后特征更新的大小，从而改善了对内容剧烈变化时的稳定性；而后者则减轻了对鼠标和手柄点之间对准精度的高要求。FreeDrag提供了一种动态的特征更新机制，可以在不牺牲稳定性的同时，显著提高拖拽编辑操作的速度。通过大量的实验，我们证明了FreeDrag在提高拖拽编辑精度和减少用户操作上的优越性。",
    "tldr": "FreeDrag是一种创新的图像编辑方法，通过动态特征更新和回头搜索技术改善了点式拖拽编辑的稳定性和速度。"
}