{
    "title": "Inductive Meta-path Learning for Schema-complex Heterogeneous Information Networks",
    "abstract": "arXiv:2307.03937v2 Announce Type: replace  Abstract: Heterogeneous Information Networks (HINs) are information networks with multiple types of nodes and edges. The concept of meta-path, i.e., a sequence of entity types and relation types connecting two entities, is proposed to provide the meta-level explainable semantics for various HIN tasks. Traditionally, meta-paths are primarily used for schema-simple HINs, e.g., bibliographic networks with only a few entity types, where meta-paths are often enumerated with domain knowledge. However, the adoption of meta-paths for schema-complex HINs, such as knowledge bases (KBs) with hundreds of entity and relation types, has been limited due to the computational complexity associated with meta-path enumeration. Additionally, effectively assessing meta-paths requires enumerating relevant path instances, which adds further complexity to the meta-path learning process. To address these challenges, we propose SchemaWalk, an inductive meta-path learn",
    "link": "https://arxiv.org/abs/2307.03937",
    "context": "Title: Inductive Meta-path Learning for Schema-complex Heterogeneous Information Networks\nAbstract: arXiv:2307.03937v2 Announce Type: replace  Abstract: Heterogeneous Information Networks (HINs) are information networks with multiple types of nodes and edges. The concept of meta-path, i.e., a sequence of entity types and relation types connecting two entities, is proposed to provide the meta-level explainable semantics for various HIN tasks. Traditionally, meta-paths are primarily used for schema-simple HINs, e.g., bibliographic networks with only a few entity types, where meta-paths are often enumerated with domain knowledge. However, the adoption of meta-paths for schema-complex HINs, such as knowledge bases (KBs) with hundreds of entity and relation types, has been limited due to the computational complexity associated with meta-path enumeration. Additionally, effectively assessing meta-paths requires enumerating relevant path instances, which adds further complexity to the meta-path learning process. To address these challenges, we propose SchemaWalk, an inductive meta-path learn",
    "path": "papers/23/07/2307.03937.json",
    "total_tokens": 388,
    "tldr": "该文章提出了一种名为“SchemaWalk”的方案，用于针对复杂 schema 网络（例如包含数百种实体和关系类型的知识库）的隐式元路径学习。该方案通过一种替代方法，能够从未标记数据中学习元路径，无需预先手动枚举，从而减轻了传统方法中因元路径枚举和评估而产生的计算复杂性。"
}