{
    "title": "Robust Qubit Mapping Algorithm via Double-Source Optimal Routing on Large Quantum Circuits",
    "abstract": "arXiv:2210.01306v5 Announce Type: replace-cross  Abstract: Qubit Mapping is a critical aspect of implementing quantum circuits on real hardware devices. Currently, the existing algorithms for qubit mapping encounter difficulties when dealing with larger circuit sizes involving hundreds of qubits. In this paper, we introduce an innovative qubit mapping algorithm, Duostra, tailored to address the challenge of implementing large-scale quantum circuits on real hardware devices with limited connectivity. Duostra operates by efficiently determining optimal paths for double-qubit gates and inserting SWAP gates accordingly to implement the double-qubit operations on real devices. Together with two heuristic scheduling algorithms, the Limitedly-Exhausitive (LE) Search and the Shortest-Path (SP) Estimation, it yields results of good quality within a reasonable runtime, thereby striving toward achieving quantum advantage. Experimental results showcase our algorithm's superiority, especially for l",
    "link": "https://arxiv.org/abs/2210.01306",
    "context": "Title: Robust Qubit Mapping Algorithm via Double-Source Optimal Routing on Large Quantum Circuits\nAbstract: arXiv:2210.01306v5 Announce Type: replace-cross  Abstract: Qubit Mapping is a critical aspect of implementing quantum circuits on real hardware devices. Currently, the existing algorithms for qubit mapping encounter difficulties when dealing with larger circuit sizes involving hundreds of qubits. In this paper, we introduce an innovative qubit mapping algorithm, Duostra, tailored to address the challenge of implementing large-scale quantum circuits on real hardware devices with limited connectivity. Duostra operates by efficiently determining optimal paths for double-qubit gates and inserting SWAP gates accordingly to implement the double-qubit operations on real devices. Together with two heuristic scheduling algorithms, the Limitedly-Exhausitive (LE) Search and the Shortest-Path (SP) Estimation, it yields results of good quality within a reasonable runtime, thereby striving toward achieving quantum advantage. Experimental results showcase our algorithm's superiority, especially for l",
    "path": "papers/22/10/2210.01306.json",
    "total_tokens": 380,
    "tldr": "该文章提出了一种针对大型量子电路的鲁棒量子比特映射算法，该算法通过双源最优路由方法有效地解决了量子算符实施中的双量子比特门问题，并在真实硬件设备有限连通的背景下引入了SWAP门以适应这些操作。该算法结合了有限探索搜索和最短路径估计等启发式调度算法，能够在保证效率的同时保持高质量的性能，朝着实现量子优势的目标迈进，尤其对于大规模量子电路表现出明显优势。"
}