{
    "title": "Accurate and Efficient Event-based Semantic Segmentation Using Adaptive Spiking Encoder-Decoder Network",
    "abstract": "arXiv:2304.11857v3 Announce Type: replace  Abstract: Spiking neural networks (SNNs), known for their low-power, event-driven computation and intrinsic temporal dynamics, are emerging as promising solutions for processing dynamic, asynchronous signals from event-based sensors. Despite their potential, SNNs face challenges in training and architectural design, resulting in limited performance in challenging event-based dense prediction tasks compared to artificial neural networks (ANNs). In this work, we develop an efficient spiking encoder-decoder network (SpikingEDN) for large-scale event-based semantic segmentation tasks. To enhance the learning efficiency from dynamic event streams, we harness the adaptive threshold which improves network accuracy, sparsity and robustness in streaming inference. Moreover, we develop a dual-path Spiking Spatially-Adaptive Modulation module, which is specifically tailored to enhance the representation of sparse events and multi-modal inputs, thereby co",
    "link": "https://arxiv.org/abs/2304.11857",
    "context": "Title: Accurate and Efficient Event-based Semantic Segmentation Using Adaptive Spiking Encoder-Decoder Network\nAbstract: arXiv:2304.11857v3 Announce Type: replace  Abstract: Spiking neural networks (SNNs), known for their low-power, event-driven computation and intrinsic temporal dynamics, are emerging as promising solutions for processing dynamic, asynchronous signals from event-based sensors. Despite their potential, SNNs face challenges in training and architectural design, resulting in limited performance in challenging event-based dense prediction tasks compared to artificial neural networks (ANNs). In this work, we develop an efficient spiking encoder-decoder network (SpikingEDN) for large-scale event-based semantic segmentation tasks. To enhance the learning efficiency from dynamic event streams, we harness the adaptive threshold which improves network accuracy, sparsity and robustness in streaming inference. Moreover, we develop a dual-path Spiking Spatially-Adaptive Modulation module, which is specifically tailored to enhance the representation of sparse events and multi-modal inputs, thereby co",
    "path": "papers/23/04/2304.11857.json",
    "total_tokens": 679,
    "translated_title": "自适应脉冲编码解码网络：准确且高效的基于事件的语义分割",
    "translated_abstract": "arXiv:2304.11857v3 公告类型：替换 摘要：脉冲神经网络（SNNs）因其低功耗的、事件驱动的计算和固有的时间动态特性而逐渐被认为是动态、异步信号处理的解决方案，特别是从基于事件的传感器的输入信号。尽管它们的潜力，SNNs在训练和架构设计上面临挑战，导致在基于事件的密集预测任务上的表现与人工神经网络（ANNs）相比有限。在本文中，我们为大规模基于事件的语义分割任务开发了一个高效的脉冲编码解码网络（SpikingEDN）。为了从动态事件流中提高学习效率，我们利用自适应阈值来提高网络精度、稀疏度和在流式推理中的鲁棒性。此外，我们还开发了一个双路径脉冲空间自适应调制模块，该模块专门针对增强稀疏事件和非模式输入的表示能力而设计，从而在少量事件下实现了高效的分割效果。",
    "tldr": "本文提出了一种高效的自适应脉冲编码解码网络，能够在基于事件的语义分割任务中利用自适应阈值提高稀疏事件的表示能力，从而在动态事件流中实现准确的分割效果。",
    "en_tdlr": "This paper introduces an efficient adaptive spiking encoder-decoder network that utilizes adaptive thresholds to enhance the representation of sparse events in dynamic event streams, leading to accurate semantic segmentation in large-scale event-based tasks."
}