{
    "title": "Transformer-Based Visual Segmentation: A Survey",
    "abstract": "arXiv:2304.09854v4 Announce Type: replace  Abstract: Visual segmentation seeks to partition images, video frames, or point clouds into multiple segments or groups. This technique has numerous real-world applications, such as autonomous driving, image editing, robot sensing, and medical analysis. Over the past decade, deep learning-based methods have made remarkable strides in this area. Recently, transformers, a type of neural network based on self-attention originally designed for natural language processing, have considerably surpassed previous convolutional or recurrent approaches in various vision processing tasks. Specifically, vision transformers offer robust, unified, and even simpler solutions for various segmentation tasks. This survey provides a thorough overview of transformer-based visual segmentation, summarizing recent advancements. We first review the background, encompassing problem definitions, datasets, and prior convolutional methods. Next, we summarize a meta-archit",
    "link": "https://arxiv.org/abs/2304.09854",
    "context": "Title: Transformer-Based Visual Segmentation: A Survey\nAbstract: arXiv:2304.09854v4 Announce Type: replace  Abstract: Visual segmentation seeks to partition images, video frames, or point clouds into multiple segments or groups. This technique has numerous real-world applications, such as autonomous driving, image editing, robot sensing, and medical analysis. Over the past decade, deep learning-based methods have made remarkable strides in this area. Recently, transformers, a type of neural network based on self-attention originally designed for natural language processing, have considerably surpassed previous convolutional or recurrent approaches in various vision processing tasks. Specifically, vision transformers offer robust, unified, and even simpler solutions for various segmentation tasks. This survey provides a thorough overview of transformer-based visual segmentation, summarizing recent advancements. We first review the background, encompassing problem definitions, datasets, and prior convolutional methods. Next, we summarize a meta-archit",
    "path": "papers/23/04/2304.09854.json",
    "total_tokens": 714,
    "translated_title": "基于Transformer的视觉分割综述",
    "translated_abstract": "arXiv:2304.09854v4 公告类型：替换 摘要：视觉分割旨在将图像、视频帧或点云分割成多个区段或组。这项技术在自动驾驶、图像编辑、机器视觉和医疗分析等众多实际应用中都有着重要作用。在过去的十年里，基于深度学习的方法在这一点上取得了显著的进步。最近，在自然语言处理中被设计为 self-attention 机制的Transformer类型神经网络在各种视觉处理任务中超越了先前的卷积或循环方法。特别是，视觉Transformer为各种分割任务提供了解决方案，即使在复杂场景下也保持了鲁棒性、统一性和简洁性。本文综述了基于Transformer的视觉分割的最新进展。首先回顾了背景，包括问题定义、数据集和先前的卷积方法。接下来，我们总结了Transformer在视觉分割方面的一些核心技术的发展。我们详细介绍了视觉Transformer的基本网络结构和自注意力机制，以及在分割任务中如何有效应用该机制。此外，我们还回顾了Transformer的变体，如自生成Transformer（AutoFormer）、Scaled Dot-Product Attention（官网加粗）和Multi-Head attention modules，以及在分割任务中它们的实现和优势。最后，本文讨论了迁移学习和预训练模型的应用，以及如何优化网络结构和训练过程以提高性能。此外，我们还介绍了目前存在的问题和未来的研究方向，为该领域的发展提供了新的视角。",
    "tldr": "本文综述了基于Transformer的视觉分割技术，重点关注了其在分割任务中的有效应用和性能优势。",
    "en_tdlr": "This article provides an overview of transformer-based visual segmentation, focusing on its effective application and performance advantages in various segmentation tasks."
}