{
    "title": "The Face of Populism: Examining Differences in Facial Emotional Expressions of Political Leaders Using Machine Learning",
    "abstract": "arXiv:2304.09914v4 Announce Type: replace-cross  Abstract: Populist rhetoric employed on online media is characterized as deeply impassioned and often imbued with strong emotions. The aim of this paper is to empirically investigate the differences in affective nonverbal communication of political leaders. We use a deep-learning approach to process a sample of 220 YouTube videos of political leaders from 15 different countries, analyze their facial expressions of emotion and then examine differences in average emotion scores representing the relative presence of 6 emotional states (anger, disgust, fear, happiness, sadness, and surprise) and a neutral expression for each frame of the YouTube video. Based on a sample of manually coded images, we find that this deep-learning approach has 53-60\\% agreement with human labels. We observe statistically significant differences in the average score of negative emotions between groups of leaders with varying degrees of populist rhetoric.",
    "link": "https://arxiv.org/abs/2304.09914",
    "context": "Title: The Face of Populism: Examining Differences in Facial Emotional Expressions of Political Leaders Using Machine Learning\nAbstract: arXiv:2304.09914v4 Announce Type: replace-cross  Abstract: Populist rhetoric employed on online media is characterized as deeply impassioned and often imbued with strong emotions. The aim of this paper is to empirically investigate the differences in affective nonverbal communication of political leaders. We use a deep-learning approach to process a sample of 220 YouTube videos of political leaders from 15 different countries, analyze their facial expressions of emotion and then examine differences in average emotion scores representing the relative presence of 6 emotional states (anger, disgust, fear, happiness, sadness, and surprise) and a neutral expression for each frame of the YouTube video. Based on a sample of manually coded images, we find that this deep-learning approach has 53-60\\% agreement with human labels. We observe statistically significant differences in the average score of negative emotions between groups of leaders with varying degrees of populist rhetoric.",
    "path": "papers/23/04/2304.09914.json",
    "total_tokens": 335,
    "tldr": "该文章利用机器学习方法分析了政治领导人面部表情的差异，并发现不同程度使用民粹主义修辞的领导人在负面情绪平均得分上存在统计显著差异。"
}