{
    "title": "Progressive Visual Prompt Learning with Contrastive Feature Re-formation",
    "abstract": "arXiv:2304.08386v3 Announce Type: replace  Abstract: Prompt learning has been designed as an alternative to fine-tuning for adapting Vision-language (V-L) models to the downstream tasks. Previous works mainly focus on text prompt while visual prompt works are limited for V-L models. The existing visual prompt methods endure either mediocre performance or unstable training process, indicating the difficulty of visual prompt learning. In this paper, we propose a new Progressive Visual Prompt (ProVP) structure to strengthen the interactions among prompts of different layers. More importantly, our ProVP could effectively propagate the image embeddings to deep layers and behave partially similar to an instance adaptive prompt method. To alleviate generalization deterioration, we further propose a new contrastive feature re-formation, which prevents the serious deviation of the prompted visual feature from the fixed CLIP visual feature distribution. Combining both, our method (ProVP-Ref) is ",
    "link": "https://arxiv.org/abs/2304.08386",
    "context": "Title: Progressive Visual Prompt Learning with Contrastive Feature Re-formation\nAbstract: arXiv:2304.08386v3 Announce Type: replace  Abstract: Prompt learning has been designed as an alternative to fine-tuning for adapting Vision-language (V-L) models to the downstream tasks. Previous works mainly focus on text prompt while visual prompt works are limited for V-L models. The existing visual prompt methods endure either mediocre performance or unstable training process, indicating the difficulty of visual prompt learning. In this paper, we propose a new Progressive Visual Prompt (ProVP) structure to strengthen the interactions among prompts of different layers. More importantly, our ProVP could effectively propagate the image embeddings to deep layers and behave partially similar to an instance adaptive prompt method. To alleviate generalization deterioration, we further propose a new contrastive feature re-formation, which prevents the serious deviation of the prompted visual feature from the fixed CLIP visual feature distribution. Combining both, our method (ProVP-Ref) is ",
    "path": "papers/23/04/2304.08386.json",
    "total_tokens": 346,
    "tldr": "该文章提出了一种新的渐进式视觉提示学习结构，通过在不同的层之间加强提示的相互作用来增强视觉提示学习。此外，文章还提出了一个新的对比性特征重构方法，旨在防止视觉提示特征与固定CLIP视觉特征分布的严重偏离，从而提升了模型的性能和泛化能力。"
}