{
    "title": "Conditions for a quadratic quantum speedup in nonlinear transforms with applications to energy contract pricing",
    "abstract": "arXiv:2304.10385v3 Announce Type: replace-cross  Abstract: Computing nonlinear functions over multilinear forms is a general problem with applications in risk analysis. For instance in the domain of energy economics, accurate and timely risk management demands for efficient simulation of millions of scenarios, largely benefiting from computational speedups. We develop a novel hybrid quantum-classical algorithm based on polynomial approximation of nonlinear functions, computed through Quantum Hadamard Products, and we rigorously assess the conditions for its end-to-end speedup for different implementation variants against classical algorithms. In our setting, a quadratic quantum speedup, up to polylogarithmic factors, can be proven only when forms are bilinear and approximating polynomials have second degree, if efficient loading unitaries are available for the input data sets. We also enhance the bidirectional encoding, that allows tuning the balance between circuit depth and width, pr",
    "link": "https://arxiv.org/abs/2304.10385",
    "context": "Title: Conditions for a quadratic quantum speedup in nonlinear transforms with applications to energy contract pricing\nAbstract: arXiv:2304.10385v3 Announce Type: replace-cross  Abstract: Computing nonlinear functions over multilinear forms is a general problem with applications in risk analysis. For instance in the domain of energy economics, accurate and timely risk management demands for efficient simulation of millions of scenarios, largely benefiting from computational speedups. We develop a novel hybrid quantum-classical algorithm based on polynomial approximation of nonlinear functions, computed through Quantum Hadamard Products, and we rigorously assess the conditions for its end-to-end speedup for different implementation variants against classical algorithms. In our setting, a quadratic quantum speedup, up to polylogarithmic factors, can be proven only when forms are bilinear and approximating polynomials have second degree, if efficient loading unitaries are available for the input data sets. We also enhance the bidirectional encoding, that allows tuning the balance between circuit depth and width, pr",
    "path": "papers/23/04/2304.10385.json",
    "total_tokens": 385,
    "tldr": "该文章提出了一个基于多项式逼近的非线性函数计算的量子-经典混合算法，该算法适用于能源风险管理中的大规模场景模拟。研究证明了在特定条件下，即当非线性函数逼近多项式为二次多项式且输入数据集具有可有效加载的单位阵时，算法在面对经典算法时能够实现平方级别的量子加速，尽管加速效果受到多项式对数因子的影响。此外，文章还探讨了双向编码技术以优化电路深度的宽度的平衡，实现了更高效的量子计算。"
}