{
    "title": "The Art of Camouflage: Few-Shot Learning for Animal Detection and Segmentation",
    "abstract": "arXiv:2304.07444v4 Announce Type: replace  Abstract: Camouflaged object detection and segmentation is a new and challenging research topic in computer vision. There is a serious issue of lacking data on concealed objects such as camouflaged animals in natural scenes. In this paper, we address the problem of few-shot learning for camouflaged object detection and segmentation. To this end, we first collect a new dataset, CAMO-FS, for the benchmark. As camouflaged instances are challenging to recognize due to their similarity compared to the surroundings, we guide our models to obtain camouflaged features that highly distinguish the instances from the background. In this work, we propose FS-CDIS, a framework to efficiently detect and segment camouflaged instances via two loss functions contributing to the training process. Firstly, the instance triplet loss with the characteristic of differentiating the anchor, which is the mean of all camouflaged foreground points, and the background poi",
    "link": "https://arxiv.org/abs/2304.07444",
    "context": "Title: The Art of Camouflage: Few-Shot Learning for Animal Detection and Segmentation\nAbstract: arXiv:2304.07444v4 Announce Type: replace  Abstract: Camouflaged object detection and segmentation is a new and challenging research topic in computer vision. There is a serious issue of lacking data on concealed objects such as camouflaged animals in natural scenes. In this paper, we address the problem of few-shot learning for camouflaged object detection and segmentation. To this end, we first collect a new dataset, CAMO-FS, for the benchmark. As camouflaged instances are challenging to recognize due to their similarity compared to the surroundings, we guide our models to obtain camouflaged features that highly distinguish the instances from the background. In this work, we propose FS-CDIS, a framework to efficiently detect and segment camouflaged instances via two loss functions contributing to the training process. Firstly, the instance triplet loss with the characteristic of differentiating the anchor, which is the mean of all camouflaged foreground points, and the background poi",
    "path": "papers/23/04/2304.07444.json",
    "total_tokens": 347,
    "tldr": "该文章提出了一种名为FS-CDIS的框架，通过两个专门的损失函数对少样本学习方法进行了优化，有效提高了对于具有高度相似背景的隐身对象（如野生动物）的检测和分割能力。"
}