{
    "title": "Progressive Visual Prompt Learning with Contrastive Feature Re-formation",
    "abstract": "arXiv:2304.08386v3 Announce Type: replace  Abstract: Prompt learning has been designed as an alternative to fine-tuning for adapting Vision-language (V-L) models to the downstream tasks. Previous works mainly focus on text prompt while visual prompt works are limited for V-L models. The existing visual prompt methods endure either mediocre performance or unstable training process, indicating the difficulty of visual prompt learning. In this paper, we propose a new Progressive Visual Prompt (ProVP) structure to strengthen the interactions among prompts of different layers. More importantly, our ProVP could effectively propagate the image embeddings to deep layers and behave partially similar to an instance adaptive prompt method. To alleviate generalization deterioration, we further propose a new contrastive feature re-formation, which prevents the serious deviation of the prompted visual feature from the fixed CLIP visual feature distribution. Combining both, our method (ProVP-Ref) is ",
    "link": "https://arxiv.org/abs/2304.08386",
    "context": "Title: Progressive Visual Prompt Learning with Contrastive Feature Re-formation\nAbstract: arXiv:2304.08386v3 Announce Type: replace  Abstract: Prompt learning has been designed as an alternative to fine-tuning for adapting Vision-language (V-L) models to the downstream tasks. Previous works mainly focus on text prompt while visual prompt works are limited for V-L models. The existing visual prompt methods endure either mediocre performance or unstable training process, indicating the difficulty of visual prompt learning. In this paper, we propose a new Progressive Visual Prompt (ProVP) structure to strengthen the interactions among prompts of different layers. More importantly, our ProVP could effectively propagate the image embeddings to deep layers and behave partially similar to an instance adaptive prompt method. To alleviate generalization deterioration, we further propose a new contrastive feature re-formation, which prevents the serious deviation of the prompted visual feature from the fixed CLIP visual feature distribution. Combining both, our method (ProVP-Ref) is ",
    "path": "papers/23/04/2304.08386.json",
    "total_tokens": 632,
    "translated_title": "渐进式视觉提示学习与对比性特征重构",
    "translated_abstract": "arXiv:2304.08386v3 公告类型：替换  摘要：提示学习被设计为适应视觉语言（V-L）模型到下游任务的一种替代方法。前人工作主要集中在文本提示上，而视觉提示的工作对于V-L模型来说是非常缺乏的。现有的视觉提示方法要么性能平平，要么训练过程不稳定，这表明视觉提示学习具有难度。在本文中，我们提出了一个新的渐进式视觉提示（ProVP）结构来加强不同层级提示之间的相互作用。更重要的是，我们的ProVP能够有效地将图像嵌入传播到深层层中，并在一定程度上表现出与实例适应性提示方法的类似行为。为了缓解泛化恶化，我们还提出了新的对比性特征重构方法，该方法能够防止经过提示的视觉特征严重偏离固定的CLIP视觉特征分布。结合两者，我们的方法（ProVP-Ref）能够在多种视觉语言任务上取得更好的泛化性能。",
    "tldr": "本文提出了渐进式视觉提示学习方法，结合了对比性特征重构技术，提高了视觉语言模型的泛化能力。"
}