{
    "title": "Beyond Recommendations: From Backward to Forward AI Support of Pilots' Decision-Making Process",
    "abstract": "arXiv:2406.08959v2 Announce Type: replace-cross  Abstract: AI is anticipated to enhance human decision-making in high-stakes domains like aviation, but adoption is often hindered by challenges such as inappropriate reliance and poor alignment with users' decision-making. Recent research suggests that a core underlying issue is the recommendation-centric design of many AI systems, i.e., they give end-to-end recommendations and ignore the rest of the decision-making process. Alternative support paradigms are rare, and it remains unclear how the few that do exist compare to recommendation-centric support. In this work, we aimed to empirically compare recommendation-centric support to an alternative paradigm, continuous support, in the context of diversions in aviation. We conducted a mixed-methods study with 32 professional pilots in a realistic setting. To ensure the quality of our study scenarios, we conducted a focus group with four additional pilots prior to the study. We found that c",
    "link": "https://arxiv.org/abs/2406.08959",
    "context": "Title: Beyond Recommendations: From Backward to Forward AI Support of Pilots' Decision-Making Process\nAbstract: arXiv:2406.08959v2 Announce Type: replace-cross  Abstract: AI is anticipated to enhance human decision-making in high-stakes domains like aviation, but adoption is often hindered by challenges such as inappropriate reliance and poor alignment with users' decision-making. Recent research suggests that a core underlying issue is the recommendation-centric design of many AI systems, i.e., they give end-to-end recommendations and ignore the rest of the decision-making process. Alternative support paradigms are rare, and it remains unclear how the few that do exist compare to recommendation-centric support. In this work, we aimed to empirically compare recommendation-centric support to an alternative paradigm, continuous support, in the context of diversions in aviation. We conducted a mixed-methods study with 32 professional pilots in a realistic setting. To ensure the quality of our study scenarios, we conducted a focus group with four additional pilots prior to the study. We found that c",
    "path": "papers/24/06/2406.08959.json",
    "total_tokens": 360,
    "tldr": "该文章探讨了一种替代传统的基于推荐的决策支持系统，它能够理解和参与人类决策过程的所有阶段，而不是仅仅提供最终建议。通过对比实验，研究人员发现，这种新的决策支持系统能够更加有效地辅助飞行员应对多样的飞行情况，并且在实际操作中显示出更高的适用性和用户满意度。"
}