{
    "title": "Enabling Regional Explainability by Automatic and Model-agnostic Rule Extraction",
    "abstract": "arXiv:2406.17885v2 Announce Type: replace-cross  Abstract: In Explainable AI, rule extraction translates model knowledge into logical rules, such as IF-THEN statements, crucial for understanding patterns learned by black-box models. This could significantly aid in fields like disease diagnosis, disease progression estimation, or drug discovery. However, such application domains often contain imbalanced data, with the class of interest underrepresented. Existing methods inevitably compromise the performance of rules for the minor class to maximise the overall performance. As the first attempt in this field, we propose a model-agnostic approach for extracting rules from specific subgroups of data, featuring automatic rule generation for numerical features. This method enhances the regional explainability of machine learning models and offers wider applicability compared to existing methods. We additionally introduce a new method for selecting features to compose rules, reducing computati",
    "link": "https://arxiv.org/abs/2406.17885",
    "context": "Title: Enabling Regional Explainability by Automatic and Model-agnostic Rule Extraction\nAbstract: arXiv:2406.17885v2 Announce Type: replace-cross  Abstract: In Explainable AI, rule extraction translates model knowledge into logical rules, such as IF-THEN statements, crucial for understanding patterns learned by black-box models. This could significantly aid in fields like disease diagnosis, disease progression estimation, or drug discovery. However, such application domains often contain imbalanced data, with the class of interest underrepresented. Existing methods inevitably compromise the performance of rules for the minor class to maximise the overall performance. As the first attempt in this field, we propose a model-agnostic approach for extracting rules from specific subgroups of data, featuring automatic rule generation for numerical features. This method enhances the regional explainability of machine learning models and offers wider applicability compared to existing methods. We additionally introduce a new method for selecting features to compose rules, reducing computati",
    "path": "papers/24/06/2406.17885.json",
    "total_tokens": 351,
    "tldr": "该文章提出了一种模型无关的方法，用于从数据特定子群中自动提取逻辑规则，尤其是在不牺牲主要类性能的情况下，极大地提高了对稀有类别的理解能力。这种方法标志着在可解释人工智能领域的一个新的研究方向，它通过自动提取规则来自定义特征，提高了机器学习模型对特定区域数据的解释性，相比于现有方法，该方法具有更广泛的适用性。"
}