{
    "title": "Improving Geo-diversity of Generated Images with Contextualized Vendi Score Guidance",
    "abstract": "arXiv:2406.04551v2 Announce Type: replace  Abstract: With the growing popularity of text-to-image generative models, there has been increasing focus on understanding their risks and biases. Recent work has found that state-of-the-art models struggle to depict everyday objects with the true diversity of the real world and have notable gaps between geographic regions. In this work, we aim to increase the diversity of generated images of common objects such that per-region variations are representative of the real world. We introduce an inference time intervention, contextualized Vendi Score Guidance (c-VSG), that guides the backwards steps of latent diffusion models to increase the diversity of a sample as compared to a \"memory bank\" of previously generated images while constraining the amount of variation within that of an exemplar set of real-world contextualizing images. We evaluate c-VSG with two geographically representative datasets and find that it substantially increases the dive",
    "link": "https://arxiv.org/abs/2406.04551",
    "context": "Title: Improving Geo-diversity of Generated Images with Contextualized Vendi Score Guidance\nAbstract: arXiv:2406.04551v2 Announce Type: replace  Abstract: With the growing popularity of text-to-image generative models, there has been increasing focus on understanding their risks and biases. Recent work has found that state-of-the-art models struggle to depict everyday objects with the true diversity of the real world and have notable gaps between geographic regions. In this work, we aim to increase the diversity of generated images of common objects such that per-region variations are representative of the real world. We introduce an inference time intervention, contextualized Vendi Score Guidance (c-VSG), that guides the backwards steps of latent diffusion models to increase the diversity of a sample as compared to a \"memory bank\" of previously generated images while constraining the amount of variation within that of an exemplar set of real-world contextualizing images. We evaluate c-VSG with two geographically representative datasets and find that it substantially increases the dive",
    "path": "papers/24/06/2406.04551.json",
    "total_tokens": 682,
    "translated_title": "使用上下文化Vendi分数指引改进生成的图像的地理多样性",
    "translated_abstract": "arXiv:2406.04551v2 公告类型：替换",
    "tldr": "该研究提出了一种称为上下文化Vendi分数指引的方法，旨在提高生成图像的地理多样性，使特定地区的图像表现与现实世界相符。",
    "en_tdlr": "This study introduces an approach called Contextualized Vendi Score Guidance (c-VSG), which aims to enhance the geographical diversity of generated images by increasing the sample diversity as compared to previously generated images while constraining the amount of variation within the context of a set of real-world context-related images."
}