{
    "title": "Imperative Learning: A Self-supervised Neural-Symbolic Learning Framework for Robot Autonomy",
    "abstract": "arXiv:2406.16087v4 Announce Type: replace  Abstract: Data-driven methods such as reinforcement and imitation learning have achieved remarkable success in robot autonomy. However, their data-centric nature still hinders them from generalizing well to ever-changing environments. Moreover, collecting large datasets for robotic tasks is often impractical and expensive. To overcome these challenges, we introduce a new self-supervised neural-symbolic (NeSy) computational framework, imperative learning (IL), for robot autonomy, leveraging the generalization abilities of symbolic reasoning. The framework of IL consists of three primary components: a neural module, a reasoning engine, and a memory system. We formulate IL as a special bilevel optimization (BLO), which enables reciprocal learning over the three modules. This overcomes the label-intensive obstacles associated with data-driven approaches and takes advantage of symbolic reasoning concerning logical reasoning, physical principles, ge",
    "link": "https://arxiv.org/abs/2406.16087",
    "context": "Title: Imperative Learning: A Self-supervised Neural-Symbolic Learning Framework for Robot Autonomy\nAbstract: arXiv:2406.16087v4 Announce Type: replace  Abstract: Data-driven methods such as reinforcement and imitation learning have achieved remarkable success in robot autonomy. However, their data-centric nature still hinders them from generalizing well to ever-changing environments. Moreover, collecting large datasets for robotic tasks is often impractical and expensive. To overcome these challenges, we introduce a new self-supervised neural-symbolic (NeSy) computational framework, imperative learning (IL), for robot autonomy, leveraging the generalization abilities of symbolic reasoning. The framework of IL consists of three primary components: a neural module, a reasoning engine, and a memory system. We formulate IL as a special bilevel optimization (BLO), which enables reciprocal learning over the three modules. This overcomes the label-intensive obstacles associated with data-driven approaches and takes advantage of symbolic reasoning concerning logical reasoning, physical principles, ge",
    "path": "papers/24/06/2406.16087.json",
    "total_tokens": 362,
    "tldr": "该文章提出了一种名为“命令学习”（Imperative Learning）的自监督神经符号学习框架，用于提高机器人的自主能力。该框架通过三部分组成——神经模块、推理引擎和记忆系统，实现了神经和符号推理的结合，不需要大量标记数据，通过形式化的双层优化问题，解决了数据驱动方法的标签依赖问题和基于符号推理的长处。"
}