{
    "title": "Annotation Cost-Efficient Active Learning for Deep Metric Learning Driven Remote Sensing Image Retrieval",
    "abstract": "arXiv:2406.10107v2 Announce Type: replace  Abstract: Deep metric learning (DML) has shown to be effective for content-based image retrieval (CBIR) in remote sensing (RS). Most of DML methods for CBIR rely on a high number of annotated images to accurately learn model parameters of deep neural networks (DNNs). However, gathering such data is time-consuming and costly. To address this, we propose an annotation cost-efficient active learning (ANNEAL) method tailored to DML-driven CBIR in RS. ANNEAL aims to create a small but informative training set made up of similar and dissimilar image pairs to be utilized for accurately learning a metric space. The informativeness of image pairs is evaluated by combining uncertainty and diversity criteria. To assess the uncertainty of image pairs, we introduce two algorithms: 1) metric-guided uncertainty estimation (MGUE); and 2) binary classifier guided uncertainty estimation (BCGUE). MGUE algorithm automatically estimates a threshold value that acts",
    "link": "https://arxiv.org/abs/2406.10107",
    "context": "Title: Annotation Cost-Efficient Active Learning for Deep Metric Learning Driven Remote Sensing Image Retrieval\nAbstract: arXiv:2406.10107v2 Announce Type: replace  Abstract: Deep metric learning (DML) has shown to be effective for content-based image retrieval (CBIR) in remote sensing (RS). Most of DML methods for CBIR rely on a high number of annotated images to accurately learn model parameters of deep neural networks (DNNs). However, gathering such data is time-consuming and costly. To address this, we propose an annotation cost-efficient active learning (ANNEAL) method tailored to DML-driven CBIR in RS. ANNEAL aims to create a small but informative training set made up of similar and dissimilar image pairs to be utilized for accurately learning a metric space. The informativeness of image pairs is evaluated by combining uncertainty and diversity criteria. To assess the uncertainty of image pairs, we introduce two algorithms: 1) metric-guided uncertainty estimation (MGUE); and 2) binary classifier guided uncertainty estimation (BCGUE). MGUE algorithm automatically estimates a threshold value that acts",
    "path": "papers/24/06/2406.10107.json",
    "total_tokens": 847,
    "translated_title": "用于遥感图像检索的深度度量学习高效主动学习Annotation Cost-Efficient Active Learning for Deep Metric Learning Driven Remote Sensing Image Retrieval",
    "translated_abstract": "arXiv替换公告类型：replace，摘要：深度度量学习（DML）在遥感（RS）图像检索（CBIR）中显示出其有效性。大多数CBIR的DML方法依赖于大量标注图的数以准确学习深度神经网络（DNNs）的模型参数。然而，获取这样的数据既耗时又昂贵。为了解决这个问题，我们提出了一个专门用于RS中DML驱动的CBIR的标注成本高效的主动学习方法（ANNEAL）。ANNEAL旨在创建一个由类似和不同图像对组成的较小但信息丰富的训练集，以便准确地学习一个度量空间。图像对的信息量通过结合不确定性和多样性标准来评估。为了评估图像对的不确定性，我们引入了两项算法：1）基于度量的不确定性估计（MGUE）；和2）基于二元分类器的不确定性估计（BCGUE）。MGUE算法自动估计一个阈值，该阈值在估计不确定性时起到关键作用。BCGUE算法利用二元分类器精确指定需要额外标注的图像对。通过一个遥感数据集进行的实验结果表明，与传统的对数损失和IoU准则相比，ANNEAL在准确性和召回率上实现了更高的性能。为了进一步提高检索性能，我们还探讨了ANNEAL与其他主动学习策略和度量标准的潜力，并提出了一个基于分数的回溯策略。这些实验验证了ANNEAL的有效性和在遥感CBIR中的潜在应用。",
    "tldr": "本研究提出了一种名为ANNEAL的主动学习方法，用于在遥感图像检索中高效地学习深度度量学习模型。该方法通过结合不确定性与多样性的评价标准，创造了一个小但信息丰富的训练集，显著提升了检索性能。",
    "en_tdlr": "This study proposes an active learning method, named ANNEAL, to efficiently learn deep metric learning models for remote sensing image retrieval. By combining uncertainty and diversity criteria, ANNEAL creates a compact but informative training set, significantly enhancing retrieval performance."
}