{
    "title": "VIP: Versatile Image Outpainting Empowered by Multimodal Large Language Model",
    "abstract": "arXiv:2406.01059v2 Announce Type: replace  Abstract: In this paper, we focus on resolving the problem of image outpainting, which aims to extrapolate the surrounding parts given the center contents of an image. Although recent works have achieved promising performance, the lack of versatility and customization hinders their practical applications in broader scenarios. Therefore, this work presents a novel image outpainting framework that is capable of customizing the results according to the requirement of users. First of all, we take advantage of a Multimodal Large Language Model (MLLM) that automatically extracts and organizes the corresponding textual descriptions of the masked and unmasked part of a given image. Accordingly, the obtained text prompts are introduced to endow our model with the capacity to customize the outpainting results. In addition, a special Cross-Attention module, namely Center-Total-Surrounding (CTS), is elaborately designed to enhance further the the interact",
    "link": "https://arxiv.org/abs/2406.01059",
    "context": "Title: VIP: Versatile Image Outpainting Empowered by Multimodal Large Language Model\nAbstract: arXiv:2406.01059v2 Announce Type: replace  Abstract: In this paper, we focus on resolving the problem of image outpainting, which aims to extrapolate the surrounding parts given the center contents of an image. Although recent works have achieved promising performance, the lack of versatility and customization hinders their practical applications in broader scenarios. Therefore, this work presents a novel image outpainting framework that is capable of customizing the results according to the requirement of users. First of all, we take advantage of a Multimodal Large Language Model (MLLM) that automatically extracts and organizes the corresponding textual descriptions of the masked and unmasked part of a given image. Accordingly, the obtained text prompts are introduced to endow our model with the capacity to customize the outpainting results. In addition, a special Cross-Attention module, namely Center-Total-Surrounding (CTS), is elaborately designed to enhance further the the interact",
    "path": "papers/24/06/2406.01059.json",
    "total_tokens": 384,
    "tldr": "该文章提出了一种名为VIP的新型图像外展框架，它利用一种多模态大型语言模型来提取和组织图像的遮罩和非遮罩部分的文本描述。通过引入这些文本提示，框架能够定制外展结果。此外，文章还设计了一个特殊的跨注意力模块——中心-整体-周围（CTS）模块，以增强模型对外展细节的处理能力，从而提高了图像外展的实用性。"
}