{
    "title": "Classifying Dry Eye Disease Patients from Healthy Controls Using Machine Learning and Metabolomics Data",
    "abstract": "arXiv:2406.14068v2 Announce Type: replace  Abstract: Dry eye disease is a common disorder of the ocular surface, leading patients to seek eye care. Clinical signs and symptoms are currently used to diagnose dry eye disease. Metabolomics, a method for analyzing biological systems, has been found helpful in identifying distinct metabolites in patients and in detecting metabolic profiles that may indicate dry eye disease at early stages. In this study, we explored using machine learning and metabolomics information to identify which cataract patients suffered from dry eye disease. As there is no one-size-fits-all machine learning model for metabolomics data, choosing the most suitable model can significantly affect the quality of predictions and subsequent metabolomics analyses. To address this challenge, we conducted a comparative analysis of nine machine learning models on three metabolomics data sets from cataract patients with and without dry eye disease. The models were evaluated and",
    "link": "https://arxiv.org/abs/2406.14068",
    "context": "Title: Classifying Dry Eye Disease Patients from Healthy Controls Using Machine Learning and Metabolomics Data\nAbstract: arXiv:2406.14068v2 Announce Type: replace  Abstract: Dry eye disease is a common disorder of the ocular surface, leading patients to seek eye care. Clinical signs and symptoms are currently used to diagnose dry eye disease. Metabolomics, a method for analyzing biological systems, has been found helpful in identifying distinct metabolites in patients and in detecting metabolic profiles that may indicate dry eye disease at early stages. In this study, we explored using machine learning and metabolomics information to identify which cataract patients suffered from dry eye disease. As there is no one-size-fits-all machine learning model for metabolomics data, choosing the most suitable model can significantly affect the quality of predictions and subsequent metabolomics analyses. To address this challenge, we conducted a comparative analysis of nine machine learning models on three metabolomics data sets from cataract patients with and without dry eye disease. The models were evaluated and",
    "path": "papers/24/06/2406.14068.json",
    "total_tokens": 369,
    "tldr": "该文章揭示了一种使用机器学习和代谢组学数据对干眼病患者与健康对照进行分类的创新方法。通过对三种不同代谢物数据集的九种不同机器学习模型的比较分析，研究提出通过选择最佳模型能够显著提升预测质量和后续代谢组学分析的准确性。文章强调了代谢组学在早期诊断干眼病中的潜力，并强调了机器学习在处理复杂生物数据时的关键作用。"
}