{
    "title": "Hybrid Spatial-spectral Neural Network for Hyperspectral Image Denoising",
    "abstract": "arXiv:2406.08782v2 Announce Type: replace-cross  Abstract: Hyperspectral image (HSI) denoising is an essential procedure for HSI applications. Unfortunately, the existing Transformer-based methods mainly focus on non-local modeling, neglecting the importance of locality in image denoising. Moreover, deep learning methods employ complex spectral learning mechanisms, thus introducing large computation costs.   To address these problems, we propose a hybrid spatial-spectral denoising network (HSSD), in which we design a novel hybrid dual-path network inspired by CNN and Transformer characteristics, leading to capturing both local and non-local spatial details while suppressing noise efficiently. Furthermore, to reduce computational complexity, we adopt a simple but effective decoupling strategy that disentangles the learning of space and spectral channels, where multilayer perception with few parameters is utilized to learn the global correlations among spectra. The synthetic and real exp",
    "link": "https://arxiv.org/abs/2406.08782",
    "context": "Title: Hybrid Spatial-spectral Neural Network for Hyperspectral Image Denoising\nAbstract: arXiv:2406.08782v2 Announce Type: replace-cross  Abstract: Hyperspectral image (HSI) denoising is an essential procedure for HSI applications. Unfortunately, the existing Transformer-based methods mainly focus on non-local modeling, neglecting the importance of locality in image denoising. Moreover, deep learning methods employ complex spectral learning mechanisms, thus introducing large computation costs.   To address these problems, we propose a hybrid spatial-spectral denoising network (HSSD), in which we design a novel hybrid dual-path network inspired by CNN and Transformer characteristics, leading to capturing both local and non-local spatial details while suppressing noise efficiently. Furthermore, to reduce computational complexity, we adopt a simple but effective decoupling strategy that disentangles the learning of space and spectral channels, where multilayer perception with few parameters is utilized to learn the global correlations among spectra. The synthetic and real exp",
    "path": "papers/24/06/2406.08782.json",
    "total_tokens": 693,
    "translated_title": "混合空间-谱神经网络用于超光谱图像去噪",
    "translated_abstract": "arXiv:2406.08782v2 公告类型: 替换交叉  简介: 超光谱图像(HSI)去噪是HSI应用中的重要步骤。不幸的是，现有的基于Transformer的方法主要集中在非局部建模上，忽视了图像去噪中局部的 importance。此外，深度学习方法使用复杂的谱学习机制，这引入了巨大的计算成本。   为了解决这些问题，我们提出了一种混合空间-谱去噪网络(HSSD)，其中我们设计了一种新的混合双路径网络，灵感来自CNN和Transformer的特征，引导着捕捉局部和非局部空间细节的同时有效地抑制噪声。此外，为了减少计算复杂性，我们采用了简单的但有效的解耦策略，该策略将空间和谱通道的学习分开，其中参数很少的多层感知机被用来学习谱之间的全球关联。合成和现实派生张量去噪实验证明了我们方法的优越性，实现了比现有方法更高的峰值信噪比(PSNR)和更低的结构相似性指数(SSIM)。",
    "tldr": "该论文提出了一种混合空间-谱去噪网络，利用CNN和Transformer的特征设计了一种新的双路径网络，有效捕捉局部和非局部空间细节，同时减少了计算复杂性。"
}