{
    "title": "Enhancing Commentary Strategies for Imperfect Information Card Games: A Study of Large Language Models in Guandan Commentary",
    "abstract": "arXiv:2406.17807v3 Announce Type: replace-cross  Abstract: Recent advancements in large language models (LLMs) have unlocked the potential for generating high-quality game commentary. However, producing insightful and engaging commentary for complex games with incomplete information remains a significant challenge. In this paper, we introduce a novel commentary method that combine Reinforcement Learning (RL) and LLMs, tailored specifically for the Chinese card game \\textit{Guandan}. Our system leverages RL to generate intricate card-playing scenarios and employs LLMs to generate corresponding commentary text, effectively emulating the strategic analysis and narrative prowess of professional commentators. The framework comprises a state commentary guide, a Theory of Mind (ToM)-based strategy analyzer, and a style retrieval module, which seamlessly collaborate to deliver detailed and context-relevant game commentary in the Chinese language environment. We empower LLMs with ToM capabiliti",
    "link": "https://arxiv.org/abs/2406.17807",
    "context": "Title: Enhancing Commentary Strategies for Imperfect Information Card Games: A Study of Large Language Models in Guandan Commentary\nAbstract: arXiv:2406.17807v3 Announce Type: replace-cross  Abstract: Recent advancements in large language models (LLMs) have unlocked the potential for generating high-quality game commentary. However, producing insightful and engaging commentary for complex games with incomplete information remains a significant challenge. In this paper, we introduce a novel commentary method that combine Reinforcement Learning (RL) and LLMs, tailored specifically for the Chinese card game \\textit{Guandan}. Our system leverages RL to generate intricate card-playing scenarios and employs LLMs to generate corresponding commentary text, effectively emulating the strategic analysis and narrative prowess of professional commentators. The framework comprises a state commentary guide, a Theory of Mind (ToM)-based strategy analyzer, and a style retrieval module, which seamlessly collaborate to deliver detailed and context-relevant game commentary in the Chinese language environment. We empower LLMs with ToM capabiliti",
    "path": "papers/24/06/2406.17807.json",
    "total_tokens": 380,
    "tldr": "该文章提出了一个结合强化学习和大型语言模型的新型评论策略，旨在为带有不完全信息的卡牌游戏如\"广东麻将\"提供高质量的评论。该系统通过强化学习生成复杂的牌局场景，并通过大型语言模型生成相应的评论文本，模仿专业评论员的战略分析和叙事能力。系统包括状态评论指南、基于理论心智的策略分析器和风格检索模块，协同工作以在中文环境中提供详细且相关的游戏评论。"
}