{
    "title": "Research Trends for the Interplay between Large Language Models and Knowledge Graphs",
    "abstract": "arXiv:2406.08223v2 Announce Type: replace  Abstract: This survey investigates the synergistic relationship between Large Language Models (LLMs) and Knowledge Graphs (KGs), which is crucial for advancing AI's capabilities in understanding, reasoning, and language processing. It aims to address gaps in current research by exploring areas such as KG Question Answering, ontology generation, KG validation, and the enhancement of KG accuracy and consistency through LLMs. The paper further examines the roles of LLMs in generating descriptive texts and natural language queries for KGs. Through a structured analysis that includes categorizing LLM-KG interactions, examining methodologies, and investigating collaborative uses and potential biases, this study seeks to provide new insights into the combined potential of LLMs and KGs. It highlights the importance of their interaction for improving AI applications and outlines future research directions.",
    "link": "https://arxiv.org/abs/2406.08223",
    "context": "Title: Research Trends for the Interplay between Large Language Models and Knowledge Graphs\nAbstract: arXiv:2406.08223v2 Announce Type: replace  Abstract: This survey investigates the synergistic relationship between Large Language Models (LLMs) and Knowledge Graphs (KGs), which is crucial for advancing AI's capabilities in understanding, reasoning, and language processing. It aims to address gaps in current research by exploring areas such as KG Question Answering, ontology generation, KG validation, and the enhancement of KG accuracy and consistency through LLMs. The paper further examines the roles of LLMs in generating descriptive texts and natural language queries for KGs. Through a structured analysis that includes categorizing LLM-KG interactions, examining methodologies, and investigating collaborative uses and potential biases, this study seeks to provide new insights into the combined potential of LLMs and KGs. It highlights the importance of their interaction for improving AI applications and outlines future research directions.",
    "path": "papers/24/06/2406.08223.json",
    "total_tokens": 420,
    "tldr": "该文章阐述了大型语言模型与知识图谱之间的相互作用研究趋势，强调了这一关系对于提升人工智能在理解、推理和语言处理方面的能力的重要性。文章探讨了包括问答、知识图谱的生成、验证以及通过大型语言模型来提高知识图谱准确性和一致性在内的多个领域。此外，文章还研究了大型语言模型在生成描述性文本和自然语言查询方面的作用。通过系统的分析，包括对大型语言模型与知识图谱交互的分类、研究方法的评估以及合作使用和潜在偏见的调查，文章旨在揭示大型语言模型与知识图谱组合的潜在价值，并为改进AI应用提供新见解，并概述了未来研究的方向。"
}