{
    "title": "Underactuated Control of Multiple Soft Pneumatic Actuators via Stable Inversion",
    "abstract": "arXiv:2406.04666v2 Announce Type: replace  Abstract: Soft grippers, with their inherent compliance and adaptability, show advantages for delicate and versatile manipulation tasks in robotics. This paper presents a novel approach to underactuated control of multiple soft actuators, explicitly focusing on the coordination of soft fingers within a soft gripper. Utilizing a single syringe pump as the actuation mechanism, we address the challenge of coordinating multiple degrees of freedom of a compliant system. The theoretical framework applies concepts from stable inversion theory, adapting them to the unique dynamics of the underactuated soft gripper. Through meticulous mechatronic system design and controller synthesis, we demonstrate the efficacy and applicability of our approach in achieving precise and coordinated manipulation tasks in simulation and experimentation. Our findings not only contribute to the advancement of soft robot control but also offer practical insights into the d",
    "link": "https://arxiv.org/abs/2406.04666",
    "context": "Title: Underactuated Control of Multiple Soft Pneumatic Actuators via Stable Inversion\nAbstract: arXiv:2406.04666v2 Announce Type: replace  Abstract: Soft grippers, with their inherent compliance and adaptability, show advantages for delicate and versatile manipulation tasks in robotics. This paper presents a novel approach to underactuated control of multiple soft actuators, explicitly focusing on the coordination of soft fingers within a soft gripper. Utilizing a single syringe pump as the actuation mechanism, we address the challenge of coordinating multiple degrees of freedom of a compliant system. The theoretical framework applies concepts from stable inversion theory, adapting them to the unique dynamics of the underactuated soft gripper. Through meticulous mechatronic system design and controller synthesis, we demonstrate the efficacy and applicability of our approach in achieving precise and coordinated manipulation tasks in simulation and experimentation. Our findings not only contribute to the advancement of soft robot control but also offer practical insights into the d",
    "path": "papers/24/06/2406.04666.json",
    "total_tokens": 344,
    "tldr": "该文章提出了一种使用稳定逆向理论的 novel 方法来控制多个软气动执行器，尤其是针对软夹爪中软手指的协调动作。通过仅使用一个注射泵作为驱动机制，文章解决了协调多个自由度下软机械系统运动控制的技术难题，并在模拟和实验中展示了该方法的有效性和实用性。"
}