{
    "title": "Retrieval Augmented Thought Process for Private Data Handling in Healthcare",
    "abstract": "arXiv:2402.07812v2 Announce Type: replace-cross  Abstract: Large Language Models (LLMs) have demonstrated the strong potential to assist both clinicians and the general public with their extensive medical knowledge. However, their application in healthcare is constrained due to concerns about the privacy of data used in training, which prevents the integration of private and personal information because of security and ethical issues. Moreover, if their capabilities can be enhanced with information retrieval to access up-to-date knowledge, the current integration of LLMs with Information retrieval lacks robustness to imperfect retrieval, which can hinder their effectiveness and even reduce overall performance. In this work, we address this challenge by introducing the Retrieval-Augmented Thought Process (RATP). Given access to external knowledge, RATP formulates the thought generation of LLMs as a multiple-step decision process. To optimise such a thought process, RATP leverages Monte-",
    "link": "https://arxiv.org/abs/2402.07812",
    "context": "Title: Retrieval Augmented Thought Process for Private Data Handling in Healthcare\nAbstract: arXiv:2402.07812v2 Announce Type: replace-cross  Abstract: Large Language Models (LLMs) have demonstrated the strong potential to assist both clinicians and the general public with their extensive medical knowledge. However, their application in healthcare is constrained due to concerns about the privacy of data used in training, which prevents the integration of private and personal information because of security and ethical issues. Moreover, if their capabilities can be enhanced with information retrieval to access up-to-date knowledge, the current integration of LLMs with Information retrieval lacks robustness to imperfect retrieval, which can hinder their effectiveness and even reduce overall performance. In this work, we address this challenge by introducing the Retrieval-Augmented Thought Process (RATP). Given access to external knowledge, RATP formulates the thought generation of LLMs as a multiple-step decision process. To optimise such a thought process, RATP leverages Monte-",
    "path": "papers/24/02/2402.07812.json",
    "total_tokens": 371,
    "tldr": "该文章提出了一种新的方法Retrieval Augmented Thought Process（RATP），旨在通过结合信息检索和语言模型的能力，以多步骤决策方式优化语言模型的思维过程，特别是在医疗健康领域的信息隐私问题上。这种方法通过访问外部知识，能够更有效地处理私密数据，同时提升语言模型对当前知识检索的适应性，以解决现有信息检索集成中存在的鲁棒性问题。"
}