{
    "title": "Dynamic instabilities and turbulence of merged rotating Bose-Einstein condensates",
    "abstract": "arXiv:2402.18474v2 Announce Type: replace-cross  Abstract: We present the simulation results of merging harmonically confined rotating Bose-Einstein condensates in two dimensions. Merging of the condensate is triggered by positioning the rotation axis at the trap minima and moving both condensates towards each other while slowly ramping their rotation frequency. We analyze the dynamics of the merged condensate by letting them evolve under a single harmonic trap. We systematically investigate the formation of solitonic and vortex structures in the final, unified condensate, considering both non-rotating and rotating initial states. In both cases, merging leads to the formation of solitons that decay into vortex pairs through snake instability, and subsequently, these pairs annihilate. Soliton formation and decay-induced phase excitations generate sound waves, more pronounced when the merging time is short. We witness no sound wave generation at sufficiently longer merging times that fin",
    "link": "https://arxiv.org/abs/2402.18474",
    "context": "Title: Dynamic instabilities and turbulence of merged rotating Bose-Einstein condensates\nAbstract: arXiv:2402.18474v2 Announce Type: replace-cross  Abstract: We present the simulation results of merging harmonically confined rotating Bose-Einstein condensates in two dimensions. Merging of the condensate is triggered by positioning the rotation axis at the trap minima and moving both condensates towards each other while slowly ramping their rotation frequency. We analyze the dynamics of the merged condensate by letting them evolve under a single harmonic trap. We systematically investigate the formation of solitonic and vortex structures in the final, unified condensate, considering both non-rotating and rotating initial states. In both cases, merging leads to the formation of solitons that decay into vortex pairs through snake instability, and subsequently, these pairs annihilate. Soliton formation and decay-induced phase excitations generate sound waves, more pronounced when the merging time is short. We witness no sound wave generation at sufficiently longer merging times that fin",
    "path": "papers/24/02/2402.18474.json",
    "total_tokens": 525,
    "tldr": "Title: 旋转 Bose-埃格斯特定凝聚物动态不稳定性和湍流研究\n摘要：arXiv:2402.18474v2 公告类型：替换交叉链接\n摘要：本文报告了两维中相互靠近的旋转 Bose-埃格斯特定凝聚体的模拟结果。通过将旋转轴定位在陷阱的极小点，并同时让两个凝聚体向彼此移动，并在缓慢增加旋转频率的同时移动，来触发凝聚体的合并。我们通过让它们在单个谐振 trap 中演化来分析合并后凝聚体的动态。我们系统地研究了在最终统一的凝聚体中形成的 soliton 和涡旋结构，考虑了无旋转和旋转初始态两种情况。在两种情况下，合并都导致形成了 solitons，它们通过蛇形不稳定性衰变成涡旋对，这些对随后相互抵消。soliton 的形成和衰变引起的相位激发产生声波，当合并时间较短时，声波更为显著。当合并时间较长且足以导致凝聚体镜面对齐时，我们观察到稳定的多涡旋模式。我们的研究揭示了凝聚体内动态不稳定性和湍流现象的变化过程，以及合并过程中的能量和动力学特征。"
}