{
    "title": "PCR-99: A Practical Method for Point Cloud Registration with 99 Percent Outliers",
    "abstract": "arXiv:2402.16598v5 Announce Type: replace-cross  Abstract: We propose a robust method for point cloud registration that can handle both unknown scales and extreme outlier ratios. Our method, dubbed PCR-99, uses a deterministic 3-point sampling approach with two novel mechanisms that significantly boost the speed: (1) an improved ordering of the samples based on pairwise scale consistency, prioritizing the point correspondences that are more likely to be inliers, and (2) an efficient outlier rejection scheme based on triplet scale consistency, prescreening bad samples and reducing the number of hypotheses to be tested. Our evaluation shows that, up to 98% outlier ratio, the proposed method achieves comparable performance to the state of the art. At 99% outlier ratio, however, it outperforms the state of the art for both known-scale and unknown-scale problems. Especially for the latter, we observe a clear superiority in terms of robustness and speed.",
    "link": "https://arxiv.org/abs/2402.16598",
    "context": "Title: PCR-99: A Practical Method for Point Cloud Registration with 99 Percent Outliers\nAbstract: arXiv:2402.16598v5 Announce Type: replace-cross  Abstract: We propose a robust method for point cloud registration that can handle both unknown scales and extreme outlier ratios. Our method, dubbed PCR-99, uses a deterministic 3-point sampling approach with two novel mechanisms that significantly boost the speed: (1) an improved ordering of the samples based on pairwise scale consistency, prioritizing the point correspondences that are more likely to be inliers, and (2) an efficient outlier rejection scheme based on triplet scale consistency, prescreening bad samples and reducing the number of hypotheses to be tested. Our evaluation shows that, up to 98% outlier ratio, the proposed method achieves comparable performance to the state of the art. At 99% outlier ratio, however, it outperforms the state of the art for both known-scale and unknown-scale problems. Especially for the latter, we observe a clear superiority in terms of robustness and speed.",
    "path": "papers/24/02/2402.16598.json",
    "total_tokens": 637,
    "translated_title": "PCR-99: 一种适用于99%异常值点云注册的实用方法",
    "translated_abstract": "我们提出了一种有效的方法来处理点云注册问题，能够处理未知比例尺和极高的异常值比例。我们提出的方法，称为PCR-99，使用一种基于三点采样方法的确定性方法，该方法是两者的创新机制：（1）基于成对比例尺一致性的样本排序，优先考虑更有可能成为内点的点对应关系；以及（2）基于三元组比例尺一致性的高效异常值拒绝方案，预先筛选不良样本，减少需要被测试的假设数量。我们的评估显示，在98%异常值比例时，所提出的方法与现有技术相当。然而，在99%异常值比例时，它在已知比例尺和未知比例尺问题方面都显著优于现有技术。尤其是在后者方面，我们在鲁棒性和速度上观察到明显的优势。",
    "tldr": "该方法通过改进的三点采样和排序机制在99%的异常值比例下实现了点云注册的高效性和准确性。"
}