{
    "title": "Class-incremental Learning for Time Series: Benchmark and Evaluation",
    "abstract": "arXiv:2402.12035v2 Announce Type: replace-cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and co",
    "link": "https://arxiv.org/abs/2402.12035",
    "context": "Title: Class-incremental Learning for Time Series: Benchmark and Evaluation\nAbstract: arXiv:2402.12035v2 Announce Type: replace-cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and co",
    "path": "papers/24/02/2402.12035.json",
    "total_tokens": 358,
    "tldr": "该文章首次对时间序列分类中的类增量学习（CIL）问题进行了全面回顾，并指出了其在处理动态数据集合中的实际意义和所面临的独特挑战。文章还提出了一个综合性的实验设计，对各种时间序列CIL方法在不同数据集上的性能进行了全面评估和基准测试，从而为未来的研究提供了重要的指导和参考。"
}