{
    "title": "Enhancing Tracking Robustness with Auxiliary Adversarial Defense Networks",
    "abstract": "arXiv:2402.17976v3 Announce Type: replace  Abstract: Adversarial attacks in visual object tracking have significantly degraded the performance of advanced trackers by introducing imperceptible perturbations into images. However, there is still a lack of research on designing adversarial defense methods for object tracking. To address these issues, we propose an effective auxiliary pre-processing defense network, AADN, which performs defensive transformations on the input images before feeding them into the tracker. Moreover, it can be seamlessly integrated with other visual trackers as a plug-and-play module without parameter adjustments. We train AADN using adversarial training, specifically employing Dua-Loss to generate adversarial samples that simultaneously attack the classification and regression branches of the tracker. Extensive experiments conducted on the OTB100, LaSOT, and VOT2018 benchmarks demonstrate that AADN maintains excellent defense robustness against adversarial att",
    "link": "https://arxiv.org/abs/2402.17976",
    "context": "Title: Enhancing Tracking Robustness with Auxiliary Adversarial Defense Networks\nAbstract: arXiv:2402.17976v3 Announce Type: replace  Abstract: Adversarial attacks in visual object tracking have significantly degraded the performance of advanced trackers by introducing imperceptible perturbations into images. However, there is still a lack of research on designing adversarial defense methods for object tracking. To address these issues, we propose an effective auxiliary pre-processing defense network, AADN, which performs defensive transformations on the input images before feeding them into the tracker. Moreover, it can be seamlessly integrated with other visual trackers as a plug-and-play module without parameter adjustments. We train AADN using adversarial training, specifically employing Dua-Loss to generate adversarial samples that simultaneously attack the classification and regression branches of the tracker. Extensive experiments conducted on the OTB100, LaSOT, and VOT2018 benchmarks demonstrate that AADN maintains excellent defense robustness against adversarial att",
    "path": "papers/24/02/2402.17976.json",
    "total_tokens": 637,
    "translated_title": "使用辅助对抗防御网络增强跟踪鲁棒性",
    "translated_abstract": "arXiv:2402.17976v3 宣布类型：替换 摘要：视觉目标跟踪中的对抗攻击通过在图像中引入肉眼难以察觉的扰动，已经严重降低了高级跟踪器的性能。然而，针对目标跟踪的对抗防御方法的研究仍然不足。为了解决这些问题，我们提出了一个有效的辅助预处理防御网络AADN，它在对输入图像进行防御性转换，并将它们馈送至跟踪器之前。此外，它还可以无缝地集成到其他视觉跟踪器中作为即插即用模块，而不需要参数调整。我们使用对抗训练训练AADN，特别是使用DuAL-Loss生成同时攻击跟踪器分类和回归分支的对抗样本。在OTB100、LaSOT和VOT2018基准上进行的广泛实验表明，AADN在对抗攻击方面的防御鲁棒性维持得很好，同时保持了跟踪精度和准确性。",
    "tldr": "本文提出了一个辅助预处理防御网络AADN，通过在输入图像上进行防御性转换，增强了视觉目标跟踪的对抗鲁棒性。",
    "en_tdlr": "This paper introduces an auxiliary preprocessing defense network, AADN, which enhances the adversarial robustness of visual object tracking by performing defensive transformations on the input images."
}