{
    "title": "Anatomy of a Robotaxi Crash: Lessons from the Cruise Pedestrian Dragging Mishap",
    "abstract": "arXiv:2402.06046v3 Announce Type: replace  Abstract: An October 2023 crash between a GM Cruise robotaxi and a pedestrian in San Francisco resulted not only in a severe injury, but also dramatic upheaval at that company that will likely have lasting effects throughout the industry. Is-sues stem not just from the loss events themselves, but also from how Cruise mishandled dealing with their robotaxi dragging a pedestrian under the vehicle after the initial post-crash stop. External investigation reports provide raw material describing the incident and critique the company's response from a regulatory point of view, but exclude safety engineering recommendations from scope. We highlight specific facts and relationships among events by tying together different pieces of the external report material. We then explore safety lessons that might be learned related to: recognizing and responding to nearby mishaps, building an accurate world model of a post-collision scenario, the in-adequacy of ",
    "link": "https://arxiv.org/abs/2402.06046",
    "context": "Title: Anatomy of a Robotaxi Crash: Lessons from the Cruise Pedestrian Dragging Mishap\nAbstract: arXiv:2402.06046v3 Announce Type: replace  Abstract: An October 2023 crash between a GM Cruise robotaxi and a pedestrian in San Francisco resulted not only in a severe injury, but also dramatic upheaval at that company that will likely have lasting effects throughout the industry. Is-sues stem not just from the loss events themselves, but also from how Cruise mishandled dealing with their robotaxi dragging a pedestrian under the vehicle after the initial post-crash stop. External investigation reports provide raw material describing the incident and critique the company's response from a regulatory point of view, but exclude safety engineering recommendations from scope. We highlight specific facts and relationships among events by tying together different pieces of the external report material. We then explore safety lessons that might be learned related to: recognizing and responding to nearby mishaps, building an accurate world model of a post-collision scenario, the in-adequacy of ",
    "path": "papers/24/02/2402.06046.json",
    "total_tokens": 371,
    "tldr": "该文章描述了GM Cruise自动驾驶出租车在2023年10月与一名行人发生碰撞的案例，分析了公司在应对行人被拖行事故上的不当处理，并从中提炼出对自动驾驶汽车安全工程有重要启示的教训，包括对周边发生事件的认识与反应、准确构建碰撞后场景模型以及改善事故响应机制等。"
}