{
    "title": "Class-incremental Learning for Time Series: Benchmark and Evaluation",
    "abstract": "arXiv:2402.12035v2 Announce Type: replace-cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and co",
    "link": "https://arxiv.org/abs/2402.12035",
    "context": "Title: Class-incremental Learning for Time Series: Benchmark and Evaluation\nAbstract: arXiv:2402.12035v2 Announce Type: replace-cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and co",
    "path": "papers/24/02/2402.12035.json",
    "total_tokens": 678,
    "translated_title": "时间序列增量学习：基准和评估",
    "translated_abstract": "arXiv:2402.12035v2 公告类型：替换 - 交叉  摘要：现实世界的环境本质上是非平稳的，经常随着时间的推移引入新的类别。这在时间序列分类方面尤其常见，就像医疗保健中出现新的疾病分类或人类活动识别中添加新的活动一样。在这种情况下，学习系统需要有效地吸收新的类别，同时避免对旧类别的灾难性遗忘，这导致了类增量学习（CIL）问题。然而，尽管在图像和语言领域取得了令人鼓舞的进展，但时间序列数据领域的CIL研究仍然相对不发达。现有的研究在实验设计上不一致，需要在一个广泛的数据集上对方法进行全面的评估和基准测试。因此，我们首先概述了时间序列类增量学习（TSCIL）问题，强调了它独特的挑战，并收集了一个广泛的基准数据集，用于深入分析和比较现有的CIL算法。我们严格定义了CIL的三个关键挑战：类不匹配性的处理、在线学习性能的评估、以及对不同类别增量的适应。在四次ETS和三个人动作数据集的实验中，我们为CIL方法提供了详细的比较，显示了当前方法的局限性，并指出了未来研究的方向。",
    "tldr": "这项研究为时间序列增量学习问题提供了一个全面的评估框架，并指出了当前算法的局限性。"
}