{
    "title": "Bimanual Manipulation of Steady Hand Eye Robots with Adaptive Sclera Force Control: Cooperative vs. Teleoperation Strategies",
    "abstract": "arXiv:2402.18088v2 Announce Type: replace  Abstract: Performing retinal vein cannulation (RVC) as a potential treatment for retinal vein occlusion (RVO) without the assistance of a surgical robotic system is very challenging to do safely. The main limitation is the physiological hand tremor of surgeons. Robot-assisted eye surgery technology may resolve the problems of hand tremors and fatigue and improve the safety and precision of RVC. The Steady-Hand Eye Robot (SHER) is an admittance-based robotic system that can filter out hand tremors and enables ophthalmologists to manipulate a surgical instrument inside the eye cooperatively. However, the admittance-based cooperative control mode does not safely minimize the contact force between the surgical instrument and the sclera to prevent tissue damage. Additionally, features like haptic feedback or hand motion scaling, which can improve the safety and precision of surgery, require a teleoperation control framework. This work presents a bi",
    "link": "https://arxiv.org/abs/2402.18088",
    "context": "Title: Bimanual Manipulation of Steady Hand Eye Robots with Adaptive Sclera Force Control: Cooperative vs. Teleoperation Strategies\nAbstract: arXiv:2402.18088v2 Announce Type: replace  Abstract: Performing retinal vein cannulation (RVC) as a potential treatment for retinal vein occlusion (RVO) without the assistance of a surgical robotic system is very challenging to do safely. The main limitation is the physiological hand tremor of surgeons. Robot-assisted eye surgery technology may resolve the problems of hand tremors and fatigue and improve the safety and precision of RVC. The Steady-Hand Eye Robot (SHER) is an admittance-based robotic system that can filter out hand tremors and enables ophthalmologists to manipulate a surgical instrument inside the eye cooperatively. However, the admittance-based cooperative control mode does not safely minimize the contact force between the surgical instrument and the sclera to prevent tissue damage. Additionally, features like haptic feedback or hand motion scaling, which can improve the safety and precision of surgery, require a teleoperation control framework. This work presents a bi",
    "path": "papers/24/02/2402.18088.json",
    "total_tokens": 365,
    "tldr": "该文章提出了一种适用于眼外科手术的机器人系统，它能够通过自适应眼睑力控制实现双手操作。该系统主要探讨了合作式操作和遥控操作两种策略，旨在解决传统眼外科手术中存在的操作精确性和安全性问题。"
}