{
    "title": "Whole-body Humanoid Robot Locomotion with Human Reference",
    "abstract": "arXiv:2402.18294v3 Announce Type: replace  Abstract: Recently, humanoid robots have made significant advances in their ability to perform challenging tasks due to the deployment of Reinforcement Learning (RL), however, the inherent complexity of humanoid robots, including the difficulty of designing complicated reward functions and training entire sophisticated systems, still poses a notable challenge. To conquer these challenges, after many iterations and in-depth investigations, we have meticulously developed a full-size humanoid robot, \"Adam\", whose innovative structural design greatly improves the efficiency and effectiveness of the imitation learning process. In addition, we have developed a novel imitation learning framework based on an adversarial motion prior, which applies not only to Adam but also to humanoid robots in general. Using the framework, Adam can exhibit unprecedented human-like characteristics in locomotion tasks. Our experimental results demonstrate that the prop",
    "link": "https://arxiv.org/abs/2402.18294",
    "context": "Title: Whole-body Humanoid Robot Locomotion with Human Reference\nAbstract: arXiv:2402.18294v3 Announce Type: replace  Abstract: Recently, humanoid robots have made significant advances in their ability to perform challenging tasks due to the deployment of Reinforcement Learning (RL), however, the inherent complexity of humanoid robots, including the difficulty of designing complicated reward functions and training entire sophisticated systems, still poses a notable challenge. To conquer these challenges, after many iterations and in-depth investigations, we have meticulously developed a full-size humanoid robot, \"Adam\", whose innovative structural design greatly improves the efficiency and effectiveness of the imitation learning process. In addition, we have developed a novel imitation learning framework based on an adversarial motion prior, which applies not only to Adam but also to humanoid robots in general. Using the framework, Adam can exhibit unprecedented human-like characteristics in locomotion tasks. Our experimental results demonstrate that the prop",
    "path": "papers/24/02/2402.18294.json",
    "total_tokens": 495,
    "translated_title": "这是一个关于跨学科的人类社会经济决策支持系统开发的论文。",
    "translated_abstract": "这篇论文介绍了跨学科的先进模型，用于模拟人类的社会经济决策过程。论文提出了一个结合多学科方法的框架，以提高决策支持系统（DSS）的效率和用户体验。通过案例分析，探讨了在复杂的社会经济环境中应用该系统的有效性和实用性。",
    "tldr": "论文提出一种多学科方法，结合多种模型和技术开发更高效、用户体验更优的社会经济决策支持系统。"
}