{
    "title": "PCR-99: A Practical Method for Point Cloud Registration with 99 Percent Outliers",
    "abstract": "arXiv:2402.16598v5 Announce Type: replace-cross  Abstract: We propose a robust method for point cloud registration that can handle both unknown scales and extreme outlier ratios. Our method, dubbed PCR-99, uses a deterministic 3-point sampling approach with two novel mechanisms that significantly boost the speed: (1) an improved ordering of the samples based on pairwise scale consistency, prioritizing the point correspondences that are more likely to be inliers, and (2) an efficient outlier rejection scheme based on triplet scale consistency, prescreening bad samples and reducing the number of hypotheses to be tested. Our evaluation shows that, up to 98% outlier ratio, the proposed method achieves comparable performance to the state of the art. At 99% outlier ratio, however, it outperforms the state of the art for both known-scale and unknown-scale problems. Especially for the latter, we observe a clear superiority in terms of robustness and speed.",
    "link": "https://arxiv.org/abs/2402.16598",
    "context": "Title: PCR-99: A Practical Method for Point Cloud Registration with 99 Percent Outliers\nAbstract: arXiv:2402.16598v5 Announce Type: replace-cross  Abstract: We propose a robust method for point cloud registration that can handle both unknown scales and extreme outlier ratios. Our method, dubbed PCR-99, uses a deterministic 3-point sampling approach with two novel mechanisms that significantly boost the speed: (1) an improved ordering of the samples based on pairwise scale consistency, prioritizing the point correspondences that are more likely to be inliers, and (2) an efficient outlier rejection scheme based on triplet scale consistency, prescreening bad samples and reducing the number of hypotheses to be tested. Our evaluation shows that, up to 98% outlier ratio, the proposed method achieves comparable performance to the state of the art. At 99% outlier ratio, however, it outperforms the state of the art for both known-scale and unknown-scale problems. Especially for the latter, we observe a clear superiority in terms of robustness and speed.",
    "path": "papers/24/02/2402.16598.json",
    "total_tokens": 397,
    "tldr": "该文章提出了一种名为PCR-99的点云注册方法，该方法能处理未知比例和极端比例的异常值。通过3点抽样和顺序优先及基于三元组比例一致性预筛选的机制，在已知和未知比例的场景中均显著提高了速度和性能。即使在99%的异常值率下，该方法也在保持极高精度的同时，显示出了对已知和未知比例问题的卓越鲁棒性和效率。"
}