{
    "title": "Bimanual Manipulation of Steady Hand Eye Robots with Adaptive Sclera Force Control: Cooperative vs. Teleoperation Strategies",
    "abstract": "arXiv:2402.18088v2 Announce Type: replace  Abstract: Performing retinal vein cannulation (RVC) as a potential treatment for retinal vein occlusion (RVO) without the assistance of a surgical robotic system is very challenging to do safely. The main limitation is the physiological hand tremor of surgeons. Robot-assisted eye surgery technology may resolve the problems of hand tremors and fatigue and improve the safety and precision of RVC. The Steady-Hand Eye Robot (SHER) is an admittance-based robotic system that can filter out hand tremors and enables ophthalmologists to manipulate a surgical instrument inside the eye cooperatively. However, the admittance-based cooperative control mode does not safely minimize the contact force between the surgical instrument and the sclera to prevent tissue damage. Additionally, features like haptic feedback or hand motion scaling, which can improve the safety and precision of surgery, require a teleoperation control framework. This work presents a bi",
    "link": "https://arxiv.org/abs/2402.18088",
    "context": "Title: Bimanual Manipulation of Steady Hand Eye Robots with Adaptive Sclera Force Control: Cooperative vs. Teleoperation Strategies\nAbstract: arXiv:2402.18088v2 Announce Type: replace  Abstract: Performing retinal vein cannulation (RVC) as a potential treatment for retinal vein occlusion (RVO) without the assistance of a surgical robotic system is very challenging to do safely. The main limitation is the physiological hand tremor of surgeons. Robot-assisted eye surgery technology may resolve the problems of hand tremors and fatigue and improve the safety and precision of RVC. The Steady-Hand Eye Robot (SHER) is an admittance-based robotic system that can filter out hand tremors and enables ophthalmologists to manipulate a surgical instrument inside the eye cooperatively. However, the admittance-based cooperative control mode does not safely minimize the contact force between the surgical instrument and the sclera to prevent tissue damage. Additionally, features like haptic feedback or hand motion scaling, which can improve the safety and precision of surgery, require a teleoperation control framework. This work presents a bi",
    "path": "papers/24/02/2402.18088.json",
    "total_tokens": 704,
    "translated_title": "双臂稳定眼外科机器人稳态眼内机器人与自适应巩膜力控制：合作vs. 遥控策略",
    "translated_abstract": "arXiv:2402.18088v2 Announce Type: 替代抽象：在没有手术机器人系统辅助的情况下进行视网膜静脉穿刺（RVC）治疗视网膜静脉闭塞（RVO）非常具有挑战性，其主要限制是外科医生生理上的手颤抖。使用手术机器人技术可能会解决手颤抖和疲劳的问题，并提高RVC的安全性和精度。稳态眼内机器人（SHER）是一种基于接纳的机器人系统，可以滤除手颤抖，并允许眼科医生在采取合作模式下操纵手术器械进入眼睛。然而，基于接纳的合作控制模式并不能安全地减少手术器械和巩膜之间的接触力，以确保不会造成组织损伤。此外，如触觉反馈或手部运动缩放等特性，这些特性可以提高手术的安全性和精度，它们需要一个遥控控制架构。本工作提出了一个基于自适应巩膜力控制的生物遥控策略，该策略可以将巩膜的接触力降到最低，确保手术过程中的安全性。",
    "tldr": "工作介绍了一种生物遥控策略，使用自适应巩膜力控制，旨在最小化巩膜接触力，确保视网膜静脉穿刺手术的安全性。"
}