{
    "title": "Exploiting Regional Information Transformer for Single Image Deraining",
    "abstract": "arXiv:2402.16033v2 Announce Type: replace  Abstract: Transformer-based Single Image Deraining (SID) methods have achieved remarkable success, primarily attributed to their robust capability in capturing long-range interactions. However, we've noticed that current methods handle rain-affected and unaffected regions concurrently, overlooking the disparities between these areas, resulting in confusion between rain streaks and background parts, and inabilities to obtain effective interactions, ultimately resulting in suboptimal deraining outcomes. To address the above issue, we introduce the Region Transformer (Regformer), a novel SID method that underlines the importance of independently processing rain-affected and unaffected regions while considering their combined impact for high-quality image reconstruction. The crux of our method is the innovative Region Transformer Block (RTB), which integrates a Region Masked Attention (RMA) mechanism and a Mixed Gate Forward Block (MGFB). Our RTB ",
    "link": "https://arxiv.org/abs/2402.16033",
    "context": "Title: Exploiting Regional Information Transformer for Single Image Deraining\nAbstract: arXiv:2402.16033v2 Announce Type: replace  Abstract: Transformer-based Single Image Deraining (SID) methods have achieved remarkable success, primarily attributed to their robust capability in capturing long-range interactions. However, we've noticed that current methods handle rain-affected and unaffected regions concurrently, overlooking the disparities between these areas, resulting in confusion between rain streaks and background parts, and inabilities to obtain effective interactions, ultimately resulting in suboptimal deraining outcomes. To address the above issue, we introduce the Region Transformer (Regformer), a novel SID method that underlines the importance of independently processing rain-affected and unaffected regions while considering their combined impact for high-quality image reconstruction. The crux of our method is the innovative Region Transformer Block (RTB), which integrates a Region Masked Attention (RMA) mechanism and a Mixed Gate Forward Block (MGFB). Our RTB ",
    "path": "papers/24/02/2402.16033.json",
    "total_tokens": 392,
    "tldr": "该文章提出了一种名为区域变换器（Regformer）的基于Transformer的单图像降雨方法，通过独立处理雨影响的和不受影响的部分，并考虑它们之间的相互作用，从而获得更高质量的图像重建。文章的关键创新在于引入了区域变换器块（RTB），该块结合了区域遮挡注意力（RMA）机制和一个混合门正向块（MGFB），解决了现有方法未能区分雨点与背景、无法有效地处理不同区域相互作用的问题，从而提高单图像降雨的性能。"
}