{
    "title": "Anatomy of a Robotaxi Crash: Lessons from the Cruise Pedestrian Dragging Mishap",
    "abstract": "arXiv:2402.06046v3 Announce Type: replace-cross  Abstract: An October 2023 crash between a GM Cruise robotaxi and a pedestrian in San Francisco resulted not only in a severe injury, but also dramatic upheaval at that company that will likely have lasting effects throughout the industry. Is-sues stem not just from the loss events themselves, but also from how Cruise mishandled dealing with their robotaxi dragging a pedestrian under the vehicle after the initial post-crash stop. External investigation reports provide raw material describing the incident and critique the company's response from a regulatory point of view, but exclude safety engineering recommendations from scope. We highlight specific facts and relationships among events by tying together different pieces of the external report material. We then explore safety lessons that might be learned related to: recognizing and responding to nearby mishaps, building an accurate world model of a post-collision scenario, the in-adequa",
    "link": "https://arxiv.org/abs/2402.06046",
    "context": "Title: Anatomy of a Robotaxi Crash: Lessons from the Cruise Pedestrian Dragging Mishap\nAbstract: arXiv:2402.06046v3 Announce Type: replace-cross  Abstract: An October 2023 crash between a GM Cruise robotaxi and a pedestrian in San Francisco resulted not only in a severe injury, but also dramatic upheaval at that company that will likely have lasting effects throughout the industry. Is-sues stem not just from the loss events themselves, but also from how Cruise mishandled dealing with their robotaxi dragging a pedestrian under the vehicle after the initial post-crash stop. External investigation reports provide raw material describing the incident and critique the company's response from a regulatory point of view, but exclude safety engineering recommendations from scope. We highlight specific facts and relationships among events by tying together different pieces of the external report material. We then explore safety lessons that might be learned related to: recognizing and responding to nearby mishaps, building an accurate world model of a post-collision scenario, the in-adequa",
    "path": "papers/24/02/2402.06046.json",
    "total_tokens": 715,
    "translated_title": "《自动驾驶出租车事故剖析：通用汽车Cruise公司与一名行人碰撞事件的教训》",
    "translated_abstract": "arXiv:2402.06046v3 公告类型: 替换-跨越 摘要: 2023年10月，在美国加利福尼亚州旧金山的通勤高峰时段，一辆通用汽车Cruise品牌的自动驾驶出租车在一处学校附近与一名行人相撞。这起事故发生后，通用汽车Cruise公司处理的紧急响应过程受到了严厉的批评，原因是该自动驾驶出租车在撞击行人后未能及时停车，导致行人被拖行了一段距离。这不仅仅是一起伤亡事件，它还显示出自动驾驶汽车在现实世界的道路上进行部署时的潜在安全问题。这起事故也引起了公众和监管机构对自动驾驶技术安全性的关注，并且突出了当前交通安全法规与自动驾驶汽车技术之间的差距。这一研究旨在从监管角度分析事故处理过程并从中汲取教训，研究不仅要关注事故本身，还要关注事故发生后的事故响应方式，以及自动驾驶汽车如何有效识别和应对交通事故。此外，研究的另一个重点是自动驾驶系统如何准确地构建事故发生后的环境模型，以及公司在面对此类紧急情况时应该采取哪些相应的安全措施。通过对不同报告材料的信息进行整合和分析，本研究还旨在探究自动驾驶系统可能面临的安全挑战，并提出潜在改进措施，以确保未来自动驾驶汽车在实际道路环境中的安全运行。",
    "tldr": "事故表明自动驾驶汽车在实际交通中存在风险，尤其是对紧急情况的识别和响应存在不足。"
}