{
    "title": "Robustness Assessment of a Runway Object Classifier for Safe Aircraft Taxiing",
    "abstract": "arXiv:2402.00035v4 Announce Type: replace  Abstract: As deep neural networks (DNNs) are becoming the prominent solution for many computational problems, the aviation industry seeks to explore their potential in alleviating pilot workload and in improving operational safety. However, the use of DNNs in this type of safety-critical applications requires a thorough certification process. This need can be addressed through formal verification, which provides rigorous assurances -- e.g.,~by proving the absence of certain mispredictions. In this case-study paper, we demonstrate this process using an image-classifier DNN currently under development at Airbus and intended for use during the aircraft taxiing phase. We use formal methods to assess this DNN's robustness to three common image perturbation types: noise, brightness and contrast, and some of their combinations. This process entails multiple invocations of the underlying verifier, which might be computationally expensive; and we there",
    "link": "https://arxiv.org/abs/2402.00035",
    "context": "Title: Robustness Assessment of a Runway Object Classifier for Safe Aircraft Taxiing\nAbstract: arXiv:2402.00035v4 Announce Type: replace  Abstract: As deep neural networks (DNNs) are becoming the prominent solution for many computational problems, the aviation industry seeks to explore their potential in alleviating pilot workload and in improving operational safety. However, the use of DNNs in this type of safety-critical applications requires a thorough certification process. This need can be addressed through formal verification, which provides rigorous assurances -- e.g.,~by proving the absence of certain mispredictions. In this case-study paper, we demonstrate this process using an image-classifier DNN currently under development at Airbus and intended for use during the aircraft taxiing phase. We use formal methods to assess this DNN's robustness to three common image perturbation types: noise, brightness and contrast, and some of their combinations. This process entails multiple invocations of the underlying verifier, which might be computationally expensive; and we there",
    "path": "papers/24/02/2402.00035.json",
    "total_tokens": 356,
    "tldr": "该文章提出了一种使用形式化方法验证深度神经网络在飞机滑行阶段视觉分类器时应对图像扰动情况的鲁棒性，其创新和贡献在于为航空行业中深度学习模型的安全性认证提供了新的技术路径，旨在确保在具有高安全要求的环境中使用的神经网络不会出现重大误判。"
}