{
    "title": "Think Fast, Think Slow, Think Critical: Designing an Automated Propaganda Detection Tool",
    "abstract": "arXiv:2402.19135v2 Announce Type: replace-cross  Abstract: In today's digital age, characterized by rapid news consumption and increasing vulnerability to propaganda, fostering citizens' critical thinking is crucial for stable democracies. This paper introduces the design of ClarifAI, a novel automated propaganda detection tool designed to nudge readers towards more critical news consumption by activating the analytical mode of thinking, following Kahneman's dual-system theory of cognition. Using Large Language Models, ClarifAI detects propaganda in news articles and provides context-rich explanations, enhancing users' understanding and critical thinking. Our contribution is threefold: first, we propose the design of ClarifAI; second, in an online experiment, we demonstrate that this design effectively encourages news readers to engage in more critical reading; and third, we emphasize the value of explanations for fostering critical thinking. The study thus offers both a practical tool",
    "link": "https://arxiv.org/abs/2402.19135",
    "context": "Title: Think Fast, Think Slow, Think Critical: Designing an Automated Propaganda Detection Tool\nAbstract: arXiv:2402.19135v2 Announce Type: replace-cross  Abstract: In today's digital age, characterized by rapid news consumption and increasing vulnerability to propaganda, fostering citizens' critical thinking is crucial for stable democracies. This paper introduces the design of ClarifAI, a novel automated propaganda detection tool designed to nudge readers towards more critical news consumption by activating the analytical mode of thinking, following Kahneman's dual-system theory of cognition. Using Large Language Models, ClarifAI detects propaganda in news articles and provides context-rich explanations, enhancing users' understanding and critical thinking. Our contribution is threefold: first, we propose the design of ClarifAI; second, in an online experiment, we demonstrate that this design effectively encourages news readers to engage in more critical reading; and third, we emphasize the value of explanations for fostering critical thinking. The study thus offers both a practical tool",
    "path": "papers/24/02/2402.19135.json",
    "total_tokens": 386,
    "tldr": "该文章提出设计了一款名为ClarifAI的自动化 propaganda检测工具，旨在通过激活“双思考系统”理论，促使读者对新闻内容进行更深入的分析和批判性思考。通过这项创新，ClarifAI使用大型语言模型识别文章中的 propaganda，并为读者提供详细的解释，从而提高他们在阅读时的批判性思维能力。通过在线实验，该研究还证明了工具的有效性，并强调了解释性内容在提升批判性思维中的重要性。"
}